{"authors": ["The Pioneer", "Staff Reporter"], "date_download": "2019-03-27 14:00:01", "date_modify": "2019-03-27 14:00:01", "date_publish": "2019-03-05 00:00:00", "description": "With the arrest of four people, the Delhi Police on Monday solved murder mystery of a 25-year-old girl, whose body was found in a sack last week on Wednesday in Sarita Vihar of Delhi’s South-East area. The accused were also known to the girl and killed her due to their personal enmity with a", "filename": "2019_state-editions_sarita-vihar-girl-murder-mystery-solved-in-5-days_1553695201.html", "image_url": "https://www.dailypioneer.com/images/logo.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/dailypioneer.com/2019_state-editions_sarita-vihar-girl-murder-mystery-solved-in-5-days_1553695201.html", "title": "Sarita Vihar girl murder mystery solved in 5 days", "title_page": "Sarita Vihar girl murder mystery solved in 5 days", "title_rss": "NULL", "source_domain": "dailypioneer.com", "text": "With the arrest of four people, the Delhi Police on Monday solved murder mystery of a 25-year-old girl, whose body was found in a sack last week on Wednesday in Sarita Vihar of Delhi’s South-East area. The accused were also known to the girl and killed her due to their personal enmity with a prisoner lodged in Tihar jail.\nThe accused have been identified as Dinesh (25), Saurabh Bhardwaj (19), Chanderkesh (30) and Rahimuudin (25) all residents of Delhi’s Sangam Vihar area.\nAccording to Chinmoy Biswal, the Deputy Commissioner of Police (DCP), South-east district, on February 27, at about 3.40 pm, Sarita Vihar police station was informed about a gunny bag found in suspicious condition near Sarita Vihar U-turn near railway line and on reaching the spot, police found body of a woman with apparent injury marks over the neck, police said.\n“A mobile phone and a hand-written note were also recovered from the spot. The woman was a resident of Dakshin Puri whose missing report was filed at Ambedkar Nagar police station on February 26. Police collected the hand writing samples from the house of the deceased to match the handwriting of the hand-note which was recovered from the jeans of the woman,” said the DCP.\n“In the note, the woman alleged three persons were responsible for her death. All of them were apprehended and interrogated and they confessed of their crime,” he said.", "url": "https://www.dailypioneer.com/2019/state-editions/sarita-vihar-girl-murder-mystery-solved-in-5-days.html", "label": 2}