{"authors": ["The Leading Daily Of Jammu", "Kashmir"], "date_download": "2019-03-27 14:00:08", "date_modify": "2019-03-27 14:00:08", "date_publish": "2018-01-27 08:29:21", "description": "NEW DELHI: In a first, a research team is working on a system which aims to automatically match digital face images with unidentified human skulls. The", "filename": "__1553695208.html", "image_url": "http://www.dailyexcelsior.com/wp-content/uploads/2018/08/dailyexcelsior.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/dailyexcelsior.com/__1553695208.html", "title": "Research explores matching digital face images with unidentified skulls", "title_page": "Research explores matching digital face images with unidentified skulls", "title_rss": "NULL", "source_domain": "dailyexcelsior.com", "text": "NEW DELHI: In a first, a research team is working on a system which aims to automatically match digital face images with unidentified human skulls.\nThe project by the Indraprastha Institute of Information Technology, Delhi began February last year.\nThe novel concept is expected to help law enforcement agencies and forensic experts across the world to solve scores of cases of missing persons as well as in identifying human skulls.\nProf Richa Singh, one of the team members, said under the project, a skull or its reconstructed composite face will be matched with a dataset of missing individuals.\nA ‘reconstructed composite’ is a model of human face which is either manually or automatically constructed by forensic experts using the skull.\n“IdentifyMe database, created by us, will be the first publicly available dataset in this regard. We have already presented an algorithm and are working on designing the identification algorithm to match composites with digital face images,” Singh said, adding that the team was also working on expanding the dataset.\nShe said, in the present stage i.E. Without a matching algorithm in existence, the entire process requires more efforts by forensic experts.\n“For instance, if a Delhi native is murdered in Bengaluru, then the Karnataka Police will have a skull or its composite model, but figuring out the nativity of the skull will consume a lot of time,” Singh said as she emphasised that automating the process was imperative.\n“There are very few experts in this area in India and the world. Reconstruction of a skull requires a week’s time if done manually. The workload is quite heavy. Even if there is an automatic tool to make the composite, the process does not end there,” she noted.\nThe project has been taken up in collaboration with the West Virginia University. PhD students Shruti Nagpal and Maneet Singh of the university, alumnus Arushi Jain, Head of Infosys Centre for Artificial Intelligence at IIIT-Delhi Mayank Vatsa, and Professor and Associate Chair at CSEE Department, West Virginia University Afzel Noore are also associated with the initiative. (AGENCIES)", "url": "http://www.dailyexcelsior.com/research-explores-matching-digital-face-images-with-unidentified-skulls/", "label": 2}