{"authors": ["Indo Asian News Service"], "date_download": "2019-03-27 14:00:15", "date_modify": "2019-03-27 14:00:15", "date_publish": "2016-04-25 11:50:05", "description": "New Delhi, April 25 (IANS) The Sikh Gurdwara (Amendment) Bill, 2016, on Monday secured parliamentary approval with the Lok Sabha unanimously adopting the measure -- but only after a heated debate involving members of the Shiromani Akali Dal, the Congress and the AAP. Introduced in the Rajya Sabha by", "filename": "_sikh-gurdwara-amendment-bill-secures-parliamentary-approval-115005588_1553695215.html", "image_url": "https://s.yimg.com/os/mit/media/p/common/images/favicon_new-7483e38.svg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/in.news.yahoo.com/_sikh-gurdwara-amendment-bill-secures-parliamentary-approval-115005588_1553695215.html", "title": "Sikh gurdwara amendment bill secures parliamentary approval", "title_page": "Sikh gurdwara amendment bill secures parliamentary approval", "title_rss": "NULL", "source_domain": "in.news.yahoo.com", "text": "New Delhi, April 25 (IANS) The Sikh Gurdwara (Amendment) Bill, 2016, on Monday secured parliamentary approval with the Lok Sabha unanimously adopting the measure -- but only after a heated debate involving members of the Shiromani Akali Dal, the Congress and the AAP.\nIntroduced in the Rajya Sabha by Home Affairs Minister Rajnath Singh on March 15, the bill was passed by the upper house on the next day.\nAccording to the amending bill, every Sikh above the age of 21 years and registered as a voter will be entitled to vote in Sikh Gurdwara Parbandhak Committee (SGPC) and various gurdwara management committee elections.\nHowever, no person who trims or shaves his beard or hair will be entitled to vote in these elections.\nThe bill, in this manner, seeks to amend the Sikh Gurdwaras Act, 1925, which regulates the administration of gurdwaras in Punjab, Chandigarh, Haryana and Himachal Pradesh.\nThe Sikh Gurdwaras Act, 1925 creates an exception for Sehajdhari Sikhs who trim or shave their beard or hair, and allows them to vote. The amending Bill removes this exception, disentitling Sehajdhari Sikhs from voting if they carry out these activities.\nDuring the discussion in the Lok Sabha on the legislation, acrimonious scenes were repeatedly witnessed as Akali Dal members, led by union minister Harsimrat Kaur Badal, exchanged heated words with Congress and AAP members.\n\"This is a bill about the Sikhs... I don't understand why non-Sikhs should take part in it and pass judgement on who is a Sikh or not,\" she said.\nThe minister was repeatedly countered by Congress MPs who said the Akali leadership in Punjab had maintained a \"monopolistic\" control over the SGPC, also known as the mini-parliament of the Sikhs.\nCongress member Santokh Singh Chaudhary alleged that the bill will deprive over 70 lakh people, who also believe in Sikhism, from participating in the management of the influential SGPC.\nHe was supported by Aam Aadmi Party parliamentarian Bhagwant Mann, who entered into an argument with the union food processing minister more than once.\nMann said he vehemently opposed the bill as it will only tighten Akali Dal's as also the Badal family's control over the Sikh body.\nHe was also seen arguing with another Akali Dal member Prem Singh Chandumajra.\nAt one point of time, Biju Janata Dal member Tathagatha Satpathy stood up in support of the bill but hastened to add that any attempt being made to create exclusivity and divisions among communities was unwarranted.\nMinister of State for Parliamentary Affairs Rajiv Pratap Rudy tried to use his persuasive skills more than once to cool the tempers in the house.\nAs BJD member Satpathy described Harsimrat Kaur Badal as a valiant debater and said \"I am surrendering before her\", the house erupted in laughter.\nResponding to the concerns of the members, Home Minister Rajnath Singh said the bill was necessitated following a Punjab and Haryana High Court directive.\n\"There should not be any doubt about the contribution made by the Sikh community for the country and to add to the richness of Indian culture,\" Rajnath Singh said and requested the members to pass the bill unanimously as it concerned the welfare of a valiant community.\n\"Even in the Rajya Sabha, the bill was passed unanimously,\" the home minister said.\nThe amending measure is in light of a government notification of October 8, 2003 which had sought to disentitle the Sehajdhari Sikhs from voting in the SGPC and management committee elections.\nHowever, the Punjab and Haryana High Court had struck down the notification as invalid in 2011. It had noted that the legislature must amend the law, if Sehajdhari Sikhs are to be disentitled from voting.\nSehajdharis are those who follow Sikhism but without being Amritdharis, or baptised. They do not adopt the baptismal vows of the Khalsa panth initiated by Guru Gobind Singh. They might be born in Hindu, Sikh or other families but follow the Sri Guru Granth Sahib.\n--IANS\nnd/tb/dg", "url": "https://in.news.yahoo.com/sikh-gurdwara-amendment-bill-secures-parliamentary-approval-115005588.html", "label": 2}