{"authors": [], "date_download": "2019-03-27 13:59:53", "date_modify": "2019-03-27 13:59:53", "date_publish": null, "description": "MUMBAI: Nineteen-year-old college student Ishrat Jahan, shot dead in an encounter with police in Gujarat in 2004, was a Lashkar-e-Taiba member, Let operative David Coleman said in his deposition on Thursday.", "filename": "_upa-changed-affidavit-naming-ishrat-jahan-terrorist-20646371_1553695193.html", "image_url": "http://newshub.org/img/article/600/upa-changed-affidavit-naming-ishrat-jahan-terrorist-20646371.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/in.newshub.org/_upa-changed-affidavit-naming-ishrat-jahan-terrorist-20646371_1553695193.html", "title": "UPA changed affidavit naming Ishrat Jahan as terrorist", "title_page": "UPA changed affidavit naming Ishrat Jahan as terrorist - NewsHub", "title_rss": "NULL", "source_domain": "in.newshub.org", "text": "MUMBAI: Nineteen-year-old college student Ishrat Jahan, shot dead in an encounter with police in Gujarat in 2004, was a Lashkar-e-Taiba member, Let operative David Coleman said in his deposition on Thursday.\n\"There was a female member of LeT who was killed in a shootout,\" Headley said. Special public prosecutor Ujjwal Nikam Nikam gave him three names: Noorjehan Begum, Ishrat Jahan and Mumtaz. \"I think it is the second one,\" Headley said, causing a flutter in the court of special judge G A Sanap here where he deposed for the third day over video from the US.\nHeadley's deposition is significant as it tallies with a report in Lashkar-aligned Ghazwa Times shortly after the 2004 encounter claiming Ishrat as a \"martyr\". The report was later removed.\nHeadley had given a similar account to a National Investigation Agency (NIA) team that had met him in 2010. During the trial of his co-defendant Tahawwur Rana in the US, Headley had mentioned that Ishrat was an LeT member. His remarks on Thursday reconfirmed this assertion.\nInterestingly, the UPA government altered an affidavit it had submitted to the Gujarat high court that named her as a terrorist.\nThough trial in the \"fake encounter\" case is still on, whether Ishrat and three others shot in the encounter were part of a terror plot, has been politically contentious ever since the UPA government submitted two affadavits — one that the four were terrorists and the second saying there was no conclusive evidence — within two months in 2009.\nThe UPA decision almost led to the arrest of IB officials. The CBI request to prosecute them was denied last year. Ishrat, a Khalsa College student of Mumbra in Thane, was killed with Javed Shaikh alias Pranesh Pillai from Kerala, and two alleged Pakistanis — Zeeshan Johar and Amjad Ali Rana — on June 15, 2004, on the outskirts of Ahmedabad for allegedly conspiring to kill then Gujarat chief minister Narendra Modi.\nBJP's opponents have repeatedly charged Gujarat Police with staging an encounter and questioned the allegations against Ishrat.\nSource: timesofindia.indiatimes.com", "url": "http://in.newshub.org/upa-changed-affidavit-naming-ishrat-jahan-terrorist-20646371.html", "label": 2}