{"authors": ["Indo Asian News Service"], "date_download": "2019-03-27 13:59:42", "date_modify": "2019-03-27 13:59:42", "date_publish": "2016-06-28 13:28:05", "description": "New Delhi, June 28 (IANS) Isak Chisi Swu, who for decades spearheaded a bloody insurgency in Nagaland before shaking hands with New Delhi, died on Tuesday after months of battling a kidney ailment. Swu, the 85-year-old Chairman of the National Socialist Council of Nagalim-Isak-Muivah (NSCN-IM), passed", "filename": "_veteran-naga-leader-isak-chisi-swu-dies-delhi-132805816_1553695182.html", "image_url": "https://s.yimg.com/os/mit/media/p/common/images/favicon_new-7483e38.svg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/in.news.yahoo.com/_veteran-naga-leader-isak-chisi-swu-dies-delhi-132805816_1553695182.html", "title": "Veteran Naga leader Isak Chisi Swu dies in Delhi", "title_page": "Veteran Naga leader Isak Chisi Swu dies in Delhi", "title_rss": "NULL", "source_domain": "in.news.yahoo.com", "text": "New Delhi, June 28 (IANS) Isak Chisi Swu, who for decades spearheaded a bloody insurgency in Nagaland before shaking hands with New Delhi, died on Tuesday after months of battling a kidney ailment.\nSwu, the 85-year-old Chairman of the National Socialist Council of Nagalim-Isak-Muivah (NSCN-IM), passed away at 12.40 p.m. at the Fortis Hospital here, doctors said.\nHe was admitted to the hospital on July 5 last year for a series of surgeries including for urinary tract infection that confined him to bed for months.\nHis son Pasheto told IANS here: \"Yes, it is true that dad (Isak Swu) passed away today. His body will be flown back to his ancestral village in Nagaland soon.\"\nHis illness prevented Isak Swu from attending the signing of a historic Naga Peace Accord on August 3, 2015 between the NSCN-IM and the Indian government at Prime Minister Narendra Modi's residence.\nA colourful personality, Isak Swu was a co-founder of the NSCN -- often dubbed the mother of all insurgent groups in the country -- in 1980 along with long-time Naga comrades Thuingaleng Muivah and S.S. Khaplang.\nThe NSCN was formed to protest the Shillong Accord signed between the Indian government and the Naga National Council (NNC).\nBut differences cropped up within the NSCN after some time, leading to the departure of Khaplang, who formed his own group, the NSCN-K. This group is still at war with India.\nMuivah and Isak Swu remained together, mostly resident in Thailand and the Netherlands, even after deciding to go for talks with New Delhi.\nAnd while Muivah was considered the group's dominant hardline leader, Isak Swu represented its softer side maintaining close ties with the Church.\nA former member of the NNC, Isak Swu was born in 1929 in Chishilimi Naga village in Zunheboto district of Nagaland.\nHe took early education at the American Mission School at Chishilimi and the Government High School at Kohima. He graduated in political science from St Anthony's College in Shillong.\nHe joined the underground in the late 1950s. He was the Foreign Secretary of the NNC before being elevated as its Vice President.\nMarried to Khulu, the couple have five sons and one daughter.\nIsak Swu's death comes at a time when the NSCN-IM and the Indian government are still negotiating for a final conclusion of the Naga Peace Accord.\nThe Naga insurgency is India's oldest and is known to have received at various times financial and other support from Pakistan, China and the US.\nFrom demanding independence from India, the NSCN-IM now seeks a \"Greater Nagalim\" or Greater Nagaland comprising Nagaland as well as Naga populated areas of neighbouring states.\n--IANS\nrup/mr/py/vd", "url": "https://in.news.yahoo.com/veteran-naga-leader-isak-chisi-swu-dies-delhi-132805816.html", "label": 2}