{"authors": ["Press Trust Of India"], "date_download": "2019-03-27 14:00:16", "date_modify": "2019-03-27 14:00:16", "date_publish": "2015-05-31 22:22:08", "description": "Read more about One killed, another injured in police encounter in Haryana on Business Standard. An alleged robber was shot dead and another was injured in an encounter with Haryana police team at Banipur Chowk here on Delhi-Jaipur highway, a senior official said today.\tKarar of Dhulawat village of Mewat district was killed in the incident", "filename": "article_pti-stories_one-killed-another-injured-in-police-encounter-in-haryana-115053100711_1_1553695216.html", "image_url": "https://bsmedia.business-standard.com/_media/bs/img/article/default/1150531/full-115053100711.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/business-standard.com/article_pti-stories_one-killed-another-injured-in-police-encounter-in-haryana-115053100711_1_1553695216.html", "title": "One killed, another injured in police encounter in Haryana", "title_page": "One killed, another injured in police encounter in Haryana | Business Standard News", "title_rss": "NULL", "source_domain": "business-standard.com", "text": "An alleged robber was shot dead and another was injured in an encounter with police team at Banipur Chowk here on Delhi- highway, a senior official said today.\nKarar of Dhulawat village of Mewat district was killed in the incident while Shaheen of Fakarpur Khori village of Mewat district was injured in the yesterday night's encounter, Police Superintendent Manbir Singh said.\nThe third miscreant, identified as Irfan of Dhulawat village of Mewat district, was arrested by police whereas some other miscreants managed to escape under cover of darkness, he said.\nThe SP said police had got a tip off that the miscreants were planning to commit a dacoity in the area.\nShaheen has been referred to the PGIMS, Rohtak by doctors of the Community Health Centre, Bawal, he said.\nA police constable, Anil Kumar, was also injured when the miscreants attempted to topple the police vehicle, and was hospitalised at Bawal, said the SP.\nPolice have seized from the miscreants a rifle, a country -made pistol, a live cartridge, an empty capsule and a pick-up vehicle, he said.\nA case of attempt to murder, obstruction and the Arms Act has been registered against the miscreants, the SP said.", "url": "https://www.business-standard.com/article/pti-stories/one-killed-another-injured-in-police-encounter-in-haryana-115053100711_1.html", "label": 2}