{"authors": ["Rashmi Rajput"], "date_download": "2019-03-27 14:00:25", "date_modify": "2019-03-27 14:00:25", "date_publish": "2017-07-07 03:05:04", "description": "In February 2016, Gadoli, who had over 30 cases registered against him, was allegedly shot dead by a team headed by Gurgaon police sub-inspector Pradhuman Yadav inside Hotel Airport Metro in the western suburbs of Mumbai.", "filename": "article_india__1553695225.html", "image_url": "https://images.indianexpress.com/2017/07/gadoli-encounter-759.jpg?w=759", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/indianexpress.com/article_india__1553695225.html", "title": "Gadoli encounter: Haryana gives sanction to prosecute four cops", "title_page": "\n\t\t\t\tGadoli encounter: Haryana gives sanction to prosecute four cops | India News, The Indian Express\t\t\t", "title_rss": "NULL", "source_domain": "indianexpress.com", "text": "IN WHAT may help expedite the trial in the Sandeep Gadoli encounter case, the Haryana government has given sanction to prosecute four of its policemen accused of staging the encounter and killing Gadoli in “cold blood”. Sources in the Mumbai Police Crime Branch told The Indian Express that they recently received a correspondence from the Haryana government granting permission to prosecute its men. In September 2016, a Special Investigation Team (SIT) of the Mumbai Police had filed a chargesheet against six accused, including four policemen — sub-inspector Pradhuman Yadav, constables Vikram Singh, Jitendra Yadav and Deepak Kakaran — and a mother-daughter duo, Sonia and Divya Pahuja. Divya was with Gadoli when he was killed.\nAdvertising\nHowever, the trial in the case couldn’t commence for the want of prosecution sanction. As per provisions of the Criminal Procedure Code (CrPC), in cases where public servants are to be tried, sanction from a competent authority is required before the court can commence trial.\nIn February 2016, Gadoli, who had over 30 cases registered against him, was allegedly shot dead by a team headed by Gurgaon police sub-inspector Pradhuman Yadav inside Hotel Airport Metro in the western suburbs of Mumbai. While the Haryana Police claimed that they were trying to arrest Gadoli and that he was killed in self-defence, the SIT concluded that he was murdered. In its chargesheet, the SIT had claimed that Gadoli was murdered at the behest of a rival gangster, Brijendar Gujjar, lodged in Bhondsi jail in Gurgaon. “Yadav had planted a 7.65 mm pistol on Gadoli after the encounter, and then run inside the hotel room and fired three rounds in the air to show that he had fired at the cops,” says the chargesheet.\nIn October 2016, the Mumbai Police had written to the Haryana government seeking sanction to prosecute the four arrested policemen. It had sent a detailed file mentioning the evidence they had against the four.", "url": "https://indianexpress.com/article/india/gadoli-encounter-haryana-gives-sanction-to-prosecute-four-cops-4739441/", "label": 2}