{"authors": ["Rohit Alok"], "date_download": "2019-03-27 13:59:58", "date_modify": "2019-03-27 13:59:58", "date_publish": "2015-09-21 01:00:42", "description": "His lawyer opposes move; jail officials say Khanna not in solitary confinement, kept with other prisoners facing similar threat.", "filename": "article_cities_mumbai__1553695198.html", "image_url": "https://images.indianexpress.com/2015/08/sheena11.jpg?w=480", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/indianexpress.com/article_cities_mumbai__1553695198.html", "title": "Sheena Bora murder case: Sanjeev Khanna faces ‘security threat’, moved to Anda Cell", "title_page": "\n\t\t\t\tSheena Bora murder case: Sanjeev Khanna faces ‘security threat’, moved to Anda Cell | Cities News, The Indian Express\t\t\t", "title_rss": "NULL", "source_domain": "indianexpress.com", "text": "Sanjeev Khanna, an accused in the Sheena Bora murder case, has been moved to the Anda Cell of the Arthur Road Jail in view of ‘security threats’.\nAdvertising\nThe Anda Cell, called so because of its oval shape, is normally inhabited by inmates who face a security threat. Some of the recent inmates include Pune-based stud farm owner Hasan Ali Khan, accused in money laundering cases. Khanna’s lawyer, however, said it was a cell where terrorists and hardened criminals were kept and objected to him being slotted with such criminals.\n“I met my client on September 18 and he told me that two days after he was remanded in judicial custody two weeks ago, the Arthur Road jail authorities had moved him to the Anda Cell,” said advocate Shreyansh Mithare, Khanna’s lawyer.\n[related-post]\nMithare said the high-security Anda Cell was where terrorist Ajmal Kasab was kept but his client was not accused of any “terror crimes”.\nAdvertising\nInspector General (Prisons) Bipin Kumar Singh, however, clarified that while Khanna had been kept in the Anda Cell, it was not the same high-security cell where Kasab, and later alleged 26/11 plotter Abu Jundal, were kept.\n“The Anda Cell where Khanna is kept is inhabited by nearly 60-70 prisoners who all face security threats,” Singh said.\nAnother jail official, who did not wish to be named, said since the case had created such a furore and with inmates having access to news outlets, they wanted to ensure Khanna was not attacked by anyone inside the prison.\nWith the judicial custody of prime accused in the case Indrani Mukerjea and her former driver Shyam Rai ending Monday, sources said the Mumbai Police had approached the Byculla jail — where Indrani is kept — to make video-conferencing arrangements for her to appear before the Bandra metropolitan magistrate for security reasons.\nAccording to sources, there is a courtroom on the second floor of the Bandra court that has video-conferencing facility.\nIndrani’s lawyer Gunjan Mangla said she was not aware if the police had approached the authorities to conduct video-conferencing. “I have not received any intimation regarding this matter but there is always a possibility for such a move as the Ganpati festival is under way,” said Mangla.\nThe Maharashtra government had last week sent a request to the CBI to take over the investigations in the Sheena Bora murder case from the Mumbai Police. The CBI is still waiting for all the case papers from the departments concerned.Meanwhile, as Abu Jundal continues his hungerstrike demanding to be moved out of solitary confinement, sources said the authorities had claimed that they could not even shift him to the Anda Cell because it was believed to have reached full capacity.\nmumbai.newsline@expressindia.com", "url": "https://indianexpress.com/article/cities/mumbai/sheena-bora-murder-case-sanjeev-khanna-faces-security-threat-moved-to-anda-cell/", "label": 2}