{"authors": ["Aditi Raja"], "date_download": "2019-03-27 14:00:03", "date_modify": "2019-03-27 14:00:03", "date_publish": "2016-10-21 17:33:51", "description": "Vadodara's gangster Mukesh Harjani was one of the most wanted criminals in Gujarat.", "filename": "article_india_india-news-india__1553695203.html", "image_url": "https://images.indianexpress.com/2016/10/mukesh_harjani_480.jpg?w=480", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/indianexpress.com/article_india_india-news-india__1553695203.html", "title": "Vadodara: Gangster Mukesh Harjani shot dead by unidentified assailants", "title_page": "\n\t\t\t\tVadodara: Gangster Mukesh Harjani shot dead by unidentified assailants | India News, The Indian Express\t\t\t", "title_rss": "NULL", "source_domain": "indianexpress.com", "text": "Notorious Vadodara gangster Mukesh Harjani was shot dead just before midnight on Thursday in Harni area of Vadodara, after unidentified assailants fired eight rounds from a close distance at him, police said. The open shooting in the heart of the city comes just two days before the arrival of Prime Minister Narendra Modi, who will inaugurate the new Vadodara airport terminal in Harni. The area is currently a high security zone, and the city has already gone through its first round of security sanitisation, given the arrival of the Prime Minister. According to officers attached to the City Police Station, which is investigating the case, Harjani was declared dead on arrival at a private hospital in the vicinity.\nAdvertising\nWATCH VIDEO | Find Out What The RSS Education Wing Recommended to HRD Ministry\nHarjani, who had been lodged in the Vadodara Central Jail after being arrested from Ropar district in Punjab in August 2011 and was later transferred to Rajkot Central Jail, had been granted bail by the Gujarat High Court in 31 FIRs filed against him for murder, kidnapping, extortion in July this year, and finally secured bail in the 32nd FIR related to the 2009 killing of BJP corporator Alpesh Chacko in Anand, earlier this month.\nJust last week, on October 13, Harjani’s former associate and history-sheeter Kalpesh Patel alias Kachiyo –co-accused in Chako’s murder –had released a newspaper advertisement in all vernacular newspapers in Vadodara, begging pardon from the dreaded Harjani, who had recently been released from jail. Through the advertisement, Kachiyo clarified that he had no role in stalling Harjani’s bail plea in Chako’s murder. The state government had used special powers under the CrPC Section 268 to oppose Harjani’s bail, which Harjani believed was Kachiyo’s doing.\nOn Thursday night, Harjani, who was said to have strong connections with the Mumbai underworld was passing through the Harni area on the way to his family home in the Sindhi neighbourhood of Warasiya, when he was shot dead.\nHarjani, one of the most wanted criminals in Gujarat, was said to have turned a bootlegger by allegedly supplying country made liquor in Dahod and Panchmahals district while delivering bread in his mini van. He was also a wanted criminal in Uttar Pradesh, Madhya Pradesh and Maharashtra.", "url": "https://indianexpress.com/article/india/india-news-india/vadodara-gangster-mukesh-harjani-shot-dead-3094360/", "label": 2}