{"authors": ["Jagdeep Singh Deep"], "date_download": "2019-03-27 14:00:09", "date_modify": "2019-03-27 14:00:09", "date_publish": "2015-10-15 04:19:08", "description": "On Tuesday, Sippy’s mother Deepinder Kaur and younger brother ‘Jippy’ Sidhu met the CJ on the matter.", "filename": "article_cities_chandigarh__1553695209.html", "image_url": "https://images.indianexpress.com/2015/10/sippysiddhu480.jpg?w=480", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/indianexpress.com/article_cities_chandigarh__1553695209.html", "title": "‘Sippy’ Sidhu murder case: Woman judge, kin interfering in probe, says relatives", "title_page": "\n\t\t\t\t‘Sippy’ Sidhu murder case: Woman judge, kin interfering in probe, says relatives | Cities News, The Indian Express\t\t\t", "title_rss": "NULL", "source_domain": "indianexpress.com", "text": "In a fresh twist to the Sukhmanpreet Singh ‘Sippy’ Sidhu murder case, the victim’s family Wednesday submitted a representation to the Chief Justice’s office in the High Court, a day after their meeting with the Acting Chief Justice, accusing a judge in the court of “interfering in the investigation.”\nAdvertising\nThe Chandigarh Police had questioned the High Court judge’s daughter recently but 24 days after the corporate lawyer and national-level shooter was shot dead, they are struggling for a breakthrough in the case.\nThe representation moved by Sippy’s mother, Deepinder Kaur contains serious allegations against the judge and her husband and hints at the couple’s daughter in the crime. Seeking the High Court Judge’s transfer out of Punjab and Haryana High Court, Deepinder Kaur in her representation has alleged that the judge was “interfering with the police investigations.”\n“I will also approach the Honourable Chief Justice of India and the Union Law Ministry so that the impeachment proceedings should be initiated against her (the High Court Judge)”, Deepinder Kaur wrote in her representation seeking transfer of the HC Judge “so that the police investigation should not be hampered or influenced by her”.\nAdvertising\nOn Tuesday, Sippy’s mother Deepinder Kaur and younger brother ‘Jippy’ Sidhu met the CJ on the matter.\n“I and my mother met the Honourable Chief Justice of Punjab and Haryana High Court yesterday and submitted a representation in his office today. We are satisfied with the investigations that Chandigarh Police have done so far, but we requested him that the High Court Judge, whose daughter is involved in my brother’s murder should immediately be transferred out of the High Court,” ‘Jippy’ Sidhu told Chandigarh Newsline.\n“We submitted a representation to the Chief Justice, because we do not want anybody to put pressure and influence the police investigation”, Jippy added.\nChandigarh police sources said they had got “vital inputs” after questioning the judge’s daughter. However, they refused to divulge more details.\nDespite repeated attempts to contact them, the judge and her family remained unavailable for comment.", "url": "https://indianexpress.com/article/cities/chandigarh/sippy-sidhu-murder-case-woman-judge-kin-interfering-in-probe-says-relatives/", "label": 2}