{"authors": [], "date_download": "2019-03-27 14:00:24", "date_modify": "2019-03-27 14:00:24", "date_publish": "2018-03-28 16:35:13", "description": "Junaid Khan murder case: Six accused — Naresh Kumar, Ramesh Kumar, Rameshwar Dass, Pardeep Kumar, Chander Parkash and Gaurav Sharma — are facing trial in the case. At least 15 prosecution witnesses have already been examined by the trial court.", "filename": "article_india__1553695224.html", "image_url": "https://images.indianexpress.com/2018/03/junaid-faridabad-lynching1.jpg?w=759", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/indianexpress.com/article_india__1553695224.html", "title": "Junaid Khan murder: Punjab and Haryana HC grants bail to one of six accused", "title_page": "\n\t\t\t\tJunaid Khan murder: Punjab and Haryana HC grants bail to one of six accused | India News, The Indian Express\t\t\t", "title_rss": "NULL", "source_domain": "indianexpress.com", "text": "The Punjab and Haryana High Court on Wednesday granted bail to Rameshwar Dass, who is one of the accused in the Junaid Khan murder case. The Supreme Court recently stayed the trial court proceedings in the case.\nAdvertising\nThe apex court had on March 20 issued notices to the Haryana government and the CBI on a plea by the father of 15-year-old Junaid, who was allegedly lynched by a mob on board a train in June last year. The plea had sought a probe by the central agency into the incident, termed by the family as a “hate crime” because of allegations that the accused mocked the victim’s skull cap. The court had also stayed trial proceedings in the case pending before a Faridabad court. The father, Jalalludin, had challenged the Punjab and Haryana High Court order, which rejected his plea for a CBI probe.\nThe appeal contended that the investigation in the case was botched up. “The true nature of the crime has been subjected to cover up. The conduct of the named accused and others as a lynching mob has been concealed. It has been projected as if the occurrence/events were sudden, without any element of perpetrators having acted as in conspiracy or as an unlawful assembly,” he contended, adding that police avoided charging sections 153A (promoting enmity between different groups on grounds of religion, race, place of birth, residence, language, etc, and doing acts prejudicial to maintenance of harmony) and 505 (statements conducing to public mischief).\nIn June last year, Junaid, his brother and two cousins, were attacked on a Mathura-bound train by a mob, which also hurled communal slurs at them. The teenager was stabbed to death during the attack.\nAdvertising\nOn December 5, 2017, the murder trial was stayed by a division bench of the high court after Junaid’s father filed an appeal against an earlier single bench judgment that had dismissed their plea for a CBI probe.\nSix accused — Naresh Kumar, Ramesh Kumar, Rameshwar Dass, Pardeep Kumar, Chander Parkash and Gaurav Sharma — are facing trial in the case. At least 15 prosecution witnesses have already been examined by the trial court.", "url": "https://indianexpress.com/article/india/junaid-khan-murder-punjab-and-haryana-high-court-rameshwar-das-bail-supreme-court-5114697/", "label": 2}