{"authors": [], "date_download": "2019-03-27 13:59:53", "date_modify": "2019-03-27 13:59:53", "date_publish": "2017-08-25 07:50:18", "description": "Former air hostess and model Sangeeta Chatterjee, facing trial in a red sanders smuggling case, on Thursday attempted suicide in a jail in Andhra Pradesh's Chittoor district. Reportedly upset over not getting bail, she consumed phenyl kept in a toilet in Chittoor sub-jail. She was rushed to Chittoor Government Hospital, where she is stated to be out of danger. Sangeeta,", "filename": "article_former-model-facing-trial-red-sanders-case-attempts-suicide-andhra-jail-67343_1553695193.html", "image_url": "https://www.thenewsminute.com/sites/default/files/Sangeeta%20Chatterjee_youtube.jpg", "language": null, "localpath": "/home/raj/news-please-repo//data/2019/03/27/thenewsminute.com/article_former-model-facing-trial-red-sanders-case-attempts-suicide-andhra-jail-67343_1553695193.html", "title": "Former model facing trial in red sanders case attempts suicide in Andhra jail", "title_page": "Former model facing trial in red sanders case attempts suicide in Andhra jail | The News Minute", "title_rss": "NULL", "source_domain": "thenewsminute.com", "text": "News\nReportedly upset over not getting bail, she consumed phenyl kept in a toilet in Chittoor sub-jail.\nFormer air hostess and model Sangeeta Chatterjee, facing trial in a red sanders smuggling case, on Thursday attempted suicide in a jail in Andhra Pradesh's Chittoor district.\nReportedly upset over not getting bail, she consumed phenyl kept in a toilet in Chittoor sub-jail. She was rushed to Chittoor Government Hospital, where she is stated to be out of danger.\nSangeeta, hailing from Kolkata, was arrested by the Andhra Pradesh Police in March this year. Three cases were booked against her and a court had granted bail in two cases.\nThe 26-year-old is the second wife of red sanders smuggler M. Lakshman, who was arrested in July 2014 from Nepal.\nAccording to police, Sangeeta, who began her career as a model, came in contact with Lakshman in Kolkata, where he frequently stayed as he had established a base there too.\nAfter the arrest of Lakshman, Sangeeta had taken over control of his network's illegal activities.\nShe is alleged to have expanded the red sanders smuggling network to six states in India and also in other countries, including China and Japan.\nAndhra Pradesh Police had in 2016 raided her residence in Kolkata and seized several documents for properties.\nHowever, a local court granted her bail, dealing a blow to Andhra Pradesh Police's efforts to bring her to justice.\nChatterjee failed to appear before the court despite summons being issued on six occasions. In December last year, the court issued a non-bailable warrant against her.\nThe gang is allegedly involved in red sanders smuggling from the forests of Chittoor, Kurnool and Kadapa districts of Andhra Pradesh.\nIANS inputs", "url": "https://www.thenewsminute.com/article/former-model-facing-trial-red-sanders-case-attempts-suicide-andhra-jail-67343", "label": 2}