{"authors": [], "date_download": "2019-03-27 13:59:49", "date_modify": "2019-03-27 13:59:49", "date_publish": "2016-11-02 18:14:03", "description": "She emphasised that the festive season in Bengal had passed off \"very peacefully.\"", "filename": "article_india_india-news-india__1553695189.html", "image_url": "https://images.indianexpress.com/2015/10/mamata-banerjee_pti-t.jpg?w=480", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/indianexpress.com/article_india_india-news-india__1553695189.html", "title": "West Bengal CM Mamata Banerjee refutes ‘communal clashes’ allegation", "title_page": "\n\t\t\t\tWest Bengal CM Mamata Banerjee refutes ‘communal clashes’ allegation | India News, The Indian Express\t\t\t", "title_rss": "NULL", "source_domain": "indianexpress.com", "text": "West Bengal Chief Minister Mamata Banerjee Wednesday alleged that a particular political party was trying to depict the clashes during Durga Puja and Muharram as “communal clashes” and insisted that they were the result of “personal rivalries”.\nAdvertising\nShe emphasised that the festive season in Bengal had passed off “very peacefully”.\n“There were one or two small incidents of clashes, but they were not communal in nature. They were triggered by personal enmities. Only a political party tried to paint them as communal clashes. This is false,” she said addressing a programme.\n“Bengal has been a pilgrimage of communal harmony and it will remain so,” she added.\nAdvertising\nThe BJP and the RSS have accused the ruling Trinamool Congress (TMC) in West Bengal of “provoking and supporting communal riots” in order to “appease a particular community”.\n“India will remain forever united. Rabindranath Tagore, who wrote the national anthem of the country, has clearly depicted how the country stood united from Punjab to Bengal,” the chief minister said.", "url": "https://indianexpress.com/article/india/india-news-india/west-bengal-cm-mamata-banerjee-refutes-communal-clashes-allegation/", "label": 2}