{"authors": [], "date_download": "2019-03-27 14:00:15", "date_modify": "2019-03-27 14:00:15", "date_publish": "2016-04-15 22:07:30", "description": "Read more about Haryana's martyred son Major Deswal cremated on Business Standard. The mortal remains of Major Amit Deswal, killed on Wednesday in a gun battle with Manipur militants, were consigned to flames on Friday with full military and state honours at his village in Haryana.", "filename": "article_news-ians_haryana-s-martyred-son-major-deswal-cremated-116041500944_1_1553695215.html", "image_url": "https://bsmedia.business-standard.com/_media/bs/img/article/default/1160415/full-116041500944.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/business-standard.com/article_news-ians_haryana-s-martyred-son-major-deswal-cremated-116041500944_1_1553695215.html", "title": "Haryana's martyred son Major Deswal cremated", "title_page": "\nHaryana's martyred son Major Deswal cremated\n | Business Standard News", "title_rss": "NULL", "source_domain": "business-standard.com", "text": "The mortal remains of Major Amit Deswal, killed on Wednesday in a gun battle with militants, were consigned to flames on Friday with full military and state honours at his village in\nThe state government announced Rs.50 lakh for the next of the kin of Major Deswal of the 21 Special Force of Rashtriya Rifles. He died fighting Zeliangrong United Front (ZUF) militants in Manipur's Tamenglong district on Wednesday.\nHe is survived by his father, mother, his wife Neeta and four-year-old son Arjun. His wife had recently quit her job. Neeta, along with her son, had accompanied Major Deswal's father retired Subedar-Major Rishi Ram Deswal to visit him in where he was posted for Operation Hifazat-2.\nHis body arrived on Friday at the Palam airport in Delhi where Indian Army chief General Dalbir Singh Suhag paid tributes to him.\nAfter a wreath-laying ceremony in Delhi, mortal remains of Deswal were moved to the Major's village in Jhajjar district.\nFull military honours and a gun salute were given to Major Deswal.\nFormer chief minister Bhupinder Singh Hooda and Leader of Opposition in the Abhay Singh Chautala were among those who paid tributes.\nOn Thursday, Chief Minister Okram Ibobi Singh reached the army unit in Jorhat to pay tributes to the martyred soldier.\nOne of the military officers who came to attend funeral told people that the braveheart breathed his last in the true tradition of a warrior. He said that Major Deswal died for the country, a commando, fighting till the end.\nDeswal was commissioned on June 10, 2006, into the Regiment of Artillery.\nAfter basic service, Deswal recognised that his calling was somewhere more adventurous. He opted for the Special Group at first, but finally opted for the coveted Special Forces.\nAgriculture Minister O.P. Dhankar announced an ex-gratia of Rs.50 lakh to the family of the martyr and a government job to one of the family members.", "url": "https://www.business-standard.com/article/news-ians/haryana-s-martyred-son-major-deswal-cremated-116041500944_1.html", "label": 2}