{"authors": ["Sutanu Guru"], "date_download": "2019-03-27 14:00:09", "date_modify": "2019-03-27 14:00:09", "date_publish": "2019-03-05 00:00:00", "description": "BJP supporters admit that cow vigilantes and culture wars are routinely replacing economic growth, infrastructure development and jobs as the narrative, , magazine 22 August 2016, Dalit Atrocities, modi government, hindutva, anandiben patel", "filename": "article_Are-Cows-Culture-Wa_6a0a81339e699e5a40bdc93f11843b9b__1553695209.html", "image_url": "https://static.businessworld.in/article/article_extra_large_image/1470396286_dWzFVg_Dalit-Mahasammlen.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/businessworld.in/article_Are-Cows-Culture-Wa_6a0a81339e699e5a40bdc93f11843b9b__1553695209.html", "title": "Are Cows Culture Wars And Dalit Atrocities Derailing Modi s Economic Agenda", "title_page": "Are Cows Culture Wars And Dalit Atrocities Derailing Modi s Economic Agenda  - BW Businessworld", "title_rss": "NULL", "source_domain": "businessworld.in", "text": "Many Indian politicians are nursing dreams of dethroning Prime Minister Narendra Modi in the 2019 Lok Sabha elections. But it seems Modi faces a far bigger threat from an unusual and unsuspected quarter: the cow. This is no facile attempt at silly humour. The BJP might have “retired” Anandiben Patel as the chief minister of Gujarat and party strategists might have finally managed the numbers to get the GST Bill passed in the Rajya Sabha, but cow vigilantes across India have yet again hijacked the narrative. GST might well create a huge common market like the EU; but social conflict and uncertainty does affect economics. Till the time of writing this, it was the holy cow that dominated Parliament proceedings and MSM slug fests, apart from the usual theatrics, chest beating, chest thumping and hysteria that passes for debate.\nEven BJP supporters now reluctantly agree that cow vigilantes and culture wars are routinely replacing economic growth, infrastructure development and jobs as the narrative. Of course, there are Modi bhakts who see a conspiracy even in this. If you go by their logic, an implacably hostile opposition that comprises “secular” political parties, assorted activist organisations-cum-NGOs besides intellectuals and journalists of Luytens Delhi are hell bent on defaming Modi and India. Sure, there is implacable opposition to Modi and sure, some of it is below the belt. But surely it was not the Modi baiters who egged on young cow vigilantes in Gujarat to mercilessly assault four Dalits for their “crime” (actually their age old profession) of skinning a dead cow. Worse, they had the brazen audacity to make a video of the brutal assault and share it on social media platforms. Surely it was not blinkered journalists and intellectuals sitting in Luytens Delhi who harangued and instigated a mob of about 100 cow worshippers in Madhya Pradesh to “invade” a railway station and thrash two Muslim women suspected of “smuggling” cow meat. This happened right in front of seemingly hapless cops who had come to the station to “arrest the smugglers”.\nQuite predictably, the BJP was on the defensive both inside and outside the Parliament. Ministers had to issue statements reaffirming the commitment of the government to protect weaker sections of the society. Many sensible and practical leaders in the BJP are alarmed at the damage this kind of cow vigilantism is doing to the party. Some even go to the extent of privately admitting that this has already cost the BJP the coming assembly elections in Uttar Pradesh. Even journalists and analysts who have a favourable view of Modi are appalled. Here is what veteran journalist and commentator Tavleen Singh who openly supports Modi writes recently in her column, Fifth Column for The Indian Express: “ So in one of the ironies of Indian politics, the BJP could have lost the most important cow belt state on account of its inordinate reverence for our holy cows. It is unwise to predict election results in advance, but I am going to stick my neck out and say that whatever chance the BJP had of winning in Uttar Pradesh is now gone...If the PM had paid more attention to the atrocities being committed by cow vigilantes, he may not today be staring at what could be the most significant political defeat of his career”. Remember, these words come from a self-confessed Modi admirer. Less than a year ago, the BJP had made a desperate attempt in the Bihar assembly elections to play cow politics. It had even released full page ads with cows on them. We all know what happened in Bihar.\nPolitics apart, these “random” incidents completely deflect attention away from the heavy lifting the Modi government is doing to revive economic growth and create new job and livelihood opportunities. Even Modi critics will admit that one cannot blame this regime for not trying hard to rebuild the economy that was left in shambles by the previous UPA regime. There is no doubt that at least some of the major policy initiatives have been immensely successful. But perceptions do matter and every incident of culture war does immense damage. And you can’t blame other political parties for criticising the government and the BJP for these culture wars. And you can’t blame critics for wondering where the real priorities of this government lie: cow or economics. Speaking to BW Businessworld, Congress spokesperson Priyanka Chaturvedi says: “What we are seeing is that the seeming focus is on economic development of the nation while ignoring crucial social fault-lines. And we now look like a nation that is at war with its own cultural identity. If this continues, no nation will look at India as an attractive investment destination because of inconsistency in how we handle our internal democratic issues.” All that the BJP can do or say officially is to offer the usual platitudes. Defending the government, BJP spokesperson Shaina NC says: “We have to correlate both issues. We need to understand that Dalits are the trustees and an area of serious concern for BJP. And we don’t want to bypass what’s happening with Dalits. BJP’s development agenda will continue but at the same time it’s required for communities that are being targeted to understand that their concerns will be addressed on a priority basis”.\nIf it weren’t so dangerous, this schizophrenic display of culture wars alternating with bold economic policy measures would be comical. What the Hindutva brigade within the BJP and the larger Sangh Parivaar don’t seem to understand is that the mandate that Indian voters gave to Modi was one of hope and aspiration; the mandate was to fix an economy in a tailspin and restore livelihood opportunities. Throughout the 2014 Lok Sabha election campaign, Modi kept hammering on the theme and promise of economic development. Embedded in his promise of development was the more important promise of being inclusive. No rally went by without Modi chanting “Sabka Saath, Sabka Vikaas”. But events after that famous election victory have belied that hope; at least the promise of being inclusive doesn’t seem to be working. The biggest political victim of this has been PM Modi himself. Each time he and his government seek to take the narrative towards development and economics, Hindutva bigots seem to take perverse pleasure in instigating and fomenting culture wars.\nLook closely at how events have unfolded since the May 2014 election victory, and the “split personality” becomes quite clear. Soon after settling down in office, PM Modi announced two bold policy initiatives: Make in India and Jan Dhan Yojana. Both fulfilled the BJP promise of promoting inclusive development. But go back to media headlines of those weeks and you get an entirely different narrative. Many BJP and Sangh Parivaar acolytes were loudly focusing more on “Love Jihad” and “Ghar Wapasi” targeted at Muslims than inclusive growth. One particular incident of “Love Jihad” in Meerut grabbed national headlines. Hindutva zealots accused a Muslim man of forcibly converting a Hindu girl and even kidnapping her. At the end of day, when facts emerged, it was clear that this was a consensual love affair; it took the couple court and police protection to stay as a married couple. On 2 October, 2014, PM Modi launched the ambitious “Swaach Bharat Abhiyan”. In one of his better speeches that day, Modi actually praised previous Congress-led regimes for their efforts and made a statesman like call to rise above partisan considerations to build toilets and work towards a cleaner India. Not very long after that, a minister in the Modi government, Sadhvi Niranjan Jyoti addressed a public rally in Delhi where she compared “Ramzaadas” with “Haraamzaadas”. A deeply embarrassed Modi had to chide her and virtually apologise in Parliament for this brazen display of communal hatred towards Muslims.\nBy the end of February 2015, sobered and chastened by a humiliating electoral defeat in Delhi, the Modi regime started focusing again on economics and made it clear that GST and other reform-oriented legislation was at the top of its economic agenda. Finance minister Arun Jaitley outlined many of these measures in his 2015 Budget speech. But the narrative changed in no time from economics once again to culture wars. The BJP-led governments in Maharashtra and Haryana passed draconian cattle slaughter laws in the name of protecting the cow. There was endless debate on the issue and many Sangh Parivaar acolytes exposed their bigotry by placing the cow above individual liberty and human lives. This was to lead to disastrous consequences as later events proved.\nBeginning June 2015, the Modi government seemed to get into high gear as far as bold policy moves were concerned. One after the other, Skill India, Digital India and Smart City Missions were launched. ‘Ease of doing business’ became a priority and public commitment for the government. Union power minister Piyush Goyal launched the ambitious program of electrifying 18,000 villages still without power. Surface transport minister Nitin Gadkari announced a massive jump in highways and road construction. Alas, the cow intervened again and completely changed the narrative. A mob lynched Mohammed Akhlaq near Delhi because it suspected he had killed a calf and consumed beef. This one incident created global headlines and embarrassed India to no end.\nIn January 2016, Modi launched the ambitious Start Up India initiative. The biggest beneficiaries of this were supposed to be Dalits. But soon after this, a Dalit student of Hyderabad University Rohit Vemula committed suicide. Once again, culture wars overwhelmed economics. In less than a month, Jaitley presented a Union Budget, his first Budget to get praise from analysts. But within days, the narrative changed again into “nationalism” as some students of JNU, led by Kanhaiya Kumar were arrested on charges of sedition. Kumar was even attacked and assaulted by “patriotic” lawyers in court premises. A good Budget was forgotten in the frenzy over this culture war. And now, soon after the Modi regime made dramatic changes in FDI policy, atrocities on Dalits have become the main issue of contention.\nThe big question is: can Modi afford any more of this?\nWith inputs from Chahat Jain\n[email protected]; @GuruSutanu", "url": "http://www.businessworld.in/article/Are-Cows-Culture-Wars-And-Dalit-Atrocities-Derailing-Modi-s-Economic-Agenda-/05-08-2016-104119/", "label": 2}