{"authors": ["Vivek Deshpande"], "date_download": "2019-03-27 14:00:16", "date_modify": "2019-03-27 14:00:16", "date_publish": "2016-04-12 04:13:35", "description": "The Congress made explicit use of symbolism of Manuwaad, probably for the first time, to declare war on “anti-Dalit and anti-poor” policies of the BJP and RSS here on Monday.", "filename": "article_cities_mumbai__1553695216.html", "image_url": "https://images.indianexpress.com/2016/04/congress-21.jpg?w=480", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/indianexpress.com/article_cities_mumbai__1553695216.html", "title": "At Nagpur rally, Congress says BJP, RSS pushing ‘Manuwaad’", "title_page": "\n\t\t\t\tAt Nagpur rally, Congress says BJP, RSS pushing ‘Manuwaad’ | Cities News, The Indian Express\t\t\t", "title_rss": "NULL", "source_domain": "indianexpress.com", "text": "The Congress made explicit use of symbolism of Manuwaad, probably for the first time, to declare war on “anti-Dalit and anti-poor” policies of the BJP and RSS here on Monday.\nAdvertising\nAt the rally — the party chose Nagpur as Ambedkar had embraced Buddhism along with thousands of his supporters here in 1956 — almost the entire who’s who of the Congress, including party president Sonia Gandhi and vice president Rahul Gandhi were present on the dais.\n[related-post]\nAddressing an impressive gathering at Kasturchand ground here, at the valedictory function of the party’s year-long celebrations of 125th birth anniversary of Babasaheb Ambedkar, Rahul Gandhi said, “I don’t know if there ever was this man called Manu but there are two streams of thought in the country today. One is in favor of Manuwaad and the other against it. It is this Manuwaad that inflicted pain on Ambedkar. Where there is need to empower the poor and backward, the thoughts of Manu are clearly antithetical. The Congress thinks about the poor and backward as is evident from the various programs like MNREGS, right to information, right to food and reservations but the BJP and RSS reflect the thoughts of Manu. We will never allow them to succeed in their designs.”\nReading a quote by Ambedkar speaking about the untouchability he suffered in his school, Rahul said, “Rohit Vemula was tortured much the same way as Ambedkar was when he was studying in school. Vemula raised the same issue but the BJP, RSS and Prime Minister Narendra Modi said we will crush you. Vemula thought he couldn’t live in a country where there was no place for him so he sacrificed his life. That is why I am standing in solidarity with him.”\nAdvertising\nRaising the issue of BJP’s Rajasthan and Haryana governments imposing educational qualification for fighting Panchayat polls, Rahul said, “The poor can’t take up education, so they will not be allowed to stand for elections. Those with money will only be able to do it.”\nRahul alleged that the RSS was running the government by proxy through OSDs to Ministers. “There is not one institution left where the RSS has not appointed its man. This government is being run by one man and one organization.”\n“This government is not bothered if Dalits, laborers, oppressed, women and poor die but they only want to push Manuwaad. They attack me because I oppose this all. Come what may, I will never bow before them.”\nSonia Gandhi lambasted the BJP and RSS saying, “Those who didn’t participate in freedom struggle, and opposed Ambedkar tooth and nail are now singing peans to him. The Congress made Ambedkar chairman of the Constitution drafting committee but the BJP and RSS are insulting the Constitution by dethroning elected Congress government.\nThey are showing insensitivity to students. Ambedkar was dedicated to democracy. But the BJP has robbed Dalits and the poor of right to stand for elections.”\nSonia alleged, “Prime Minister Narendra Modi talks of Ambedkar but his government has cut down on funds for schemes for Dalits and Tribals. On reservations for the backward classes, the RSS and BJP’s hypocrisy has come to fore. They sometimes talk of ending reservations and sometimes say they would be continued. Reservations are clearly in danger. Ambedkar would have resented them if he would have been alive today.”\nSaying that “a Nagpur organization” is trying to end India’s composite culture while Modi is maintaining silence, Sonia said, “We will never allow this to happen and will continue to strengthen the voice of Dalits, tribals, women and poor.”\nAmong those present on the dais were Leader of the Opposition in Lok Sabha Mallikarjun Kharge, Karnataka Chief Minister Siddaramaiah, Ajit Jogi, Mukul Wasnik, Sushil Kumar Shinde, Ashok Chavan, Prithviraj Chavan, Rajiv Shukla, Raj Babbar, Oscar Fernandes, Veerappa Moily, Mohsina Kidwai, Shivraj Patil, Vilas Muttemwar, Mohan Prakash, Ashok Gehlot and a host of other prominent Congress leaders.", "url": "https://indianexpress.com/article/cities/mumbai/bjp-rss-pushing-manuwaad-says-congress/", "label": 2}