{"authors": [], "date_download": "2019-03-27 13:59:46", "date_modify": "2019-03-27 13:59:46", "date_publish": "2017-04-11 19:38:00", "description": "Anil Kumar got the first sign that something was wrong when an explosion split the silence of his quiet neighbourhood in Thiruvananthapuram that also houses the Kerala Chief Minister Pinarayi Vijayan. When he checked to see what’s wrong, he found flames bursting out of his neighbour Dr Jean Padma’s house and quickly alerted the police. At the time, he had no clue that a", "filename": "article_murder-most-foul-did-kerala-man-kill-his-family-and-aunt-occult-ritual-60197_1553695186.html", "image_url": "https://www.thenewsminute.com/sites/default/files/cadell%201.jpg", "language": null, "localpath": "/home/raj/news-please-repo//data/2019/03/27/thenewsminute.com/article_murder-most-foul-did-kerala-man-kill-his-family-and-aunt-occult-ritual-60197_1553695186.html", "title": "Murder most foul: Did Kerala man kill his family and aunt for an occult ritual?", "title_page": "Murder most foul: Did Kerala man kill his family and aunt for an occult ritual? | The News Minute", "title_rss": "NULL", "source_domain": "thenewsminute.com", "text": "Crime\nPolice suspect introvert son killed family as part of Satan worship ritual\nAnil Kumar got the first sign that something was wrong when an explosion split the silence of his quiet neighbourhood in Thiruvananthapuram that also houses the Kerala Chief Minister Pinarayi Vijayan.\nWhen he checked to see what’s wrong, he found flames bursting out of his neighbour Dr Jean Padma’s house and quickly alerted the police. At the time, he had no clue that a blood-curdling crime had been committed next door. “I first thought there was nobody home. It’s only later that I learnt about the horrible murder,” Kumar said.\nAfter the fire was extinguished, the police recovered three charred bodies, and another body was found in the bathroom, cut into pieces and stuffed into a sack. The bodies were identified as that of Dr Jean Padma (58), retired medical superintendent of the General hospital, her husband Professor Raj Thankam (60), daughter Caroline (25) and a 70-year-old relative Lalitha.\n“By the time firefighters entered the house and put out the blaze, the bodies were almost ash and bones. There were no signs of a break-in,” a police source said. If the sight was not disturbing enough, there was another eerie relic of the crime — a half burnt human doll made of metal and clothes. Two knives, a bloodstained axe and a can of petrol and a burnt dummy were also recovered, according to a report.\nWithin hours, the police had a major suspect. The couple’s son Cadell Jeansen Raja was missing from the scene. The last time the neighbours had seen Cadell was on Saturday, when he told them that he was going to Ooty. When relatives were unable to reach Dr Jean Padma on her phone, Cadell had reportedly told them that his family had gone to Kanyakumari for a vacation.\nThis was enough for the police and they launched a massive manhunt for Cadell. They finally caught up with him two days later on April 11. The Railway police nabbed him when he was getting off a train from Chennai at Thampanoor station.\nAccording to the police. Cadell admitted that he had committed all the four murders. Deputy Commissioner of Police Arul R B Krishna said that Cadell killed his mother on Wednesday morning and took the life of his father and sister past noon the same day. Cadell confessed to the police that he killed a relative, a 70-year-old woman, on Saturday morning.\nBut even the hardened policemen were not prepared for his explanation for the murders. He allegedly told the police that he has been practicing Satan worship for the past few years. He had killed his family as part of some occult ritual and he wanted to watch the soul leaving a body or astral projection. Some reports quoted police officials as saying that Cadell had been following a Chinese cult that possibly encouraged human sacrifice.\nThe Police said that based on the state of the bodies, the murder may have taken place a few days before the explosion that woke Anil Kumar. They also believe that the Cadell may have set the house on fire to destroy evidence.\nBut what about the scary, half-burnt doll? “Cadell might have used that dummy to mislead us in investigation that to show he was also dead,” the Museum Circle Inspector JK Dinil said. According to a police source Cadell had asked their domestic help to go to his Uncle Jose’s place nearby.\nRejitha, the family’s help, had last seen the family members on Wednesday and on that evening Cadell told her that the family had left on a tour.\n“One of the neighbours had seen Cadell outside the house just an hour before the fire. Moreover, he had told some of his relatives that the family had gone for a tour, when they enquired about the couple. All this strongly indicates that he was behind this killing,” the Museum Circle Inspector JK Dinil said.\nIt could be some time before the Kerala CM’s neighbours come to terms with the horror that befell a quiet and dignified family. “It was a happy family and there was nothing suspicious about them. We have never heard a noise or anything unnatural from the house till that night. As the house was closed and there were no sound, we thought the family might have gone somewhere. When I saw the fire I never thought there were people inside,” Kumar said.\nKumar said that Cadell rarely went out and was an introvert, who never spoke to him. “I have seen him going out to church with his parents a few times. Besides, he was living abroad so we had no contact with him.” But Raj Thankam and wife were outgoing and we shared a good relationship with them, Kumar said.\nCadell had returned to Kerala in 2009 after studying artificial intelligence engineering in Australia. He was doing work related to video game programming. His sister Caroline was pursuing her MBBS in China and was home on vacation. The police suspect that Cadell is mentally unsound and that they will be carrying on further questioning with the assistance of a psychiatrist.", "url": "https://www.thenewsminute.com/article/murder-most-foul-did-kerala-man-kill-his-family-and-aunt-occult-ritual-60197", "label": 2}