{"authors": [], "date_download": "2019-03-27 14:00:24", "date_modify": "2019-03-27 14:00:24", "date_publish": "2016-10-19 15:10:35", "description": "Senior leaders of the Haryana unit of the Congress presented their side of the story to Sushil Kumar Shinde as he started probe into the clash between supporters of Ashok Tanwar and B S Hooda.", "filename": "article_cities_chandigarh__1553695224.html", "image_url": "https://images.indianexpress.com/2015/09/sindhe-small.jpg?w=480", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/indianexpress.com/article_cities_chandigarh__1553695224.html", "title": "Haryana Congress workers’ clash in Delhi: Shinde begins investigation, questions senior state leaders", "title_page": "\n\t\t\t\tHaryana Congress workers’ clash in Delhi: Shinde begins investigation, questions senior state leaders | Cities News, The Indian Express\t\t\t", "title_rss": "NULL", "source_domain": "indianexpress.com", "text": "Senior leaders of the Haryana unit of the Congress presented their side of the story to Union Home Minister Sushil Kumar Shinde as he started probe into the clash between supporters of Haryana Congress president Ashok Tanwar and former chief minister B S Hooda. Tanwar had received injuries during the clash.\nAdvertising\nShinde met Tanwar, Hooda and Kiran Choudhary separately to know their versions of the clash that took place in Delhi as the members of the Haryana Congress unit were waiting to welcome party vice-president Rahul Gandhi following completion of his kisan yatra.\nWATCH VIDEO: Congress MLA Suspended For Remark Against Rahul Gandhi: Find Out What He Said\nThe party high command recently entrusted Shinde with the inquiry. Tanwar, who has been blaming supporters of Hooda for the attack, named Hooda’s PSO in his complaint.\nAdvertising\nTanwar said he told Shinde how the incident was part of a conspiracy to harm him.\n“All evidence is in public domain and I did not need to give anything to him. It is up to the party high command to take action,” he said.\nHooda and Tanwar have been at loggerheads in the past as well over several issues. They have held parallel rallies in Haryana. Tanwar told Shinde how in the past Hooda’s supporters allegedly hooted at him during a rally.\nAs per sources, Bhupinder Singh Hooda during his meeting termed the incident as unfortunate and said he had sent his PSO to stop the clash.\nShinde would also hold a meeting with all MLAs of the party, office-bearers of the unit as well as members of the SC cell on Tuesday.\nThe MLAs who are considered Hooda’s loyalists would be giving a representation to Shinde outlining the chain of events. The incident has also led to a division among the Dalit leaders in the party unit with the MLAs belonging to the Dalit community asking Tanwar not to make it an issue about caste. AICC has asked Shinde to submit his report at the earliest.", "url": "https://indianexpress.com/article/cities/chandigarh/haryana-congress-workers-clash-in-delhi-shinde-begins-investigation-questions-senior-state-leaders-3088767/", "label": 2}