{"authors": [], "date_download": "2019-03-27 14:00:19", "date_modify": "2019-03-27 14:00:19", "date_publish": "2017-10-28 20:24:04", "description": "Read more about Pradhuman case: Candlelit assembly at India Gate to seek justice on Business Standard. A candlelit assembly will be held at India Gate on Sunday to demand justice for Pradhuman Thakur, who was murdered at Ryan International School in Gurugram in September.", "filename": "article_news-ians_pradhuman-case-candlelit-assembly-at-india-gate-to-seek-justice-117102800795_1_1553695219.html", "image_url": "https://bsmedia.business-standard.com/_media/bs/img/article/default/1171028/full-117102800795.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/business-standard.com/article_news-ians_pradhuman-case-candlelit-assembly-at-india-gate-to-seek-justice-117102800795_1_1553695219.html", "title": "Pradhuman case: Candlelit assembly at India Gate to seek justice", "title_page": "\nPradhuman case: Candlelit assembly at India Gate to seek justice\n | Business Standard News", "title_rss": "NULL", "source_domain": "business-standard.com", "text": "A candlelit assembly will be held at Gate on Sunday to demand justice for Pradhuman Thakur, who was murdered at Ryan International School in Gurugram in September.\nThe assembly, being organised by newly-formed trust Pradhuman Foundation has been called by Barun Chandra Thakur, the father of the deceased child. Pradhuman's mother would also take part in the gathering.\nIn a statement, Barun said that his son's murder was not an isolated incident but that such incidents had become a norm.\nHe said that his trust would be working for the safety and security of the children across the country.\n\"The aim of the trust would be to create a sense of accountability amongst educational institutes and ensure that such horrendous incidence are not allowed to happen,\" he said.\nHe added that the civil society must take up the matter and ensure that enough traction and chorus is created around the issue and the culprits are booked and punished.\n\"It will serve the dual purpose of justice and deterrence.\"\nPradyumn, a class-II student of Ryan International School Gurugram, was murdered by slitting his throat by a sharp-edged weapon on the morning of September 8. The Haryana police said that he was killed by bus conductor Ashok Kumar inside the toilet as the boy resisted a bid to sodomise him.\n--IANS\nvv/ahm/vm\n(This story has not been edited by Business Standard staff and is auto-generated from a syndicated feed.)", "url": "https://www.business-standard.com/article/news-ians/pradhuman-case-candlelit-assembly-at-india-gate-to-seek-justice-117102800795_1.html", "label": 2}