{"authors": [], "date_download": "2019-03-27 13:59:58", "date_modify": "2019-03-27 13:59:58", "date_publish": "2015-12-10 00:00:00", "description": "Read more about Ajmal Kasab was to be traded with Israeli hostages of 26/11: David Headley on Business Standard. Headley said they were to contact Israeli PM and its embassy in a bid to build pressure on the Indian govt for securing Kasab's release", "filename": "article_international_ajmal-kasab-was-to-be-traded-with-israeli-hostages-of-26-11-david-headley-116032500604_1_1553695198.html", "image_url": "http://bsmedia.business-standard.com/_media/bs/img/article/2015-12/10/full/1449756353-8515.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/business-standard.com/article_international_ajmal-kasab-was-to-be-traded-with-israeli-hostages-of-26-11-david-headley-116032500604_1_1553695198.html", "title": "Ajmal Kasab was to be traded with Israeli hostages of 26/11: David Headley", "title_page": "Ajmal Kasab was to be traded with Israeli hostages of 26/11: David Headley | Business Standard News", "title_rss": "NULL", "source_domain": "business-standard.com", "text": "Pakistani-American LeT terrorist-turned-approver David Coleman Headley said in Mumbai Friday that attempts were made to trade Israeli hostages in Mumbai in return for release of Ajmal Kasab, the Pakistani nabbed alive in the strike.\nHeadley said he had also suggested to his handlers in terror troup Lashkar-e-Taiba (LeT) to \"honour\" the nine other terrorists slain during by the Indian security personnel with 'Nishan-e-Haider', Pakistan's highest gallantry award.\nHeadley made the revelations before Special Judge G.A. Sanap in his responses during his cross-examination by Abdul Wahab Khan, lawyer for Sayed Zabiuddin Ansari alias Abu Jundal, one of the prime accused in the Mumbai terror attack.\nAfter Kasab was nabbed alive by the Indian forces early morning of November 27, 2008, at the height of the terror strikes, Headley's main contact in LeT -- Sajid Mir -- had ordered the attackers of Chabad House in Colaba to keep the Israeli hostages taken there at gunpoint.\nThey were to contact the Israeli prime minister and its embassy in a bid to build pressure on the Indian government for securing Kasab's release, Headley said, reiterating what he had mentioned to an American court during his trial there in May 2011.\nHowever, to a question by lawyer Khan, Headley added that he never personally spoke with the Israeli embassy officials since he was in Lahore at the time of 26/11.\nSpecial Public Prosecutor Ujjwal Nikam later informed media persons that Headley had sought honouring the nine terrorists killed in 26/11 with Pakistan's top military gallantry award, the 'Nishan-e-Haider'.\nHeadley had made the demand in a conversation with a Dubai-based operative after the 26/11 Mumbai terror attack that left 166 dead and several hundreds injured in 2008.\nNikam added that Headley had revealed Thane collegian Ishrat Jahan's name when he was interrogated by a National Investigation Agency team in the US after his arrest in 2009.\nJahan, a 19-year-old resident of Mumbra in Thane district studying in a Mumbai college, and three of her friends were gunned down by Gujarat Anti- Squad near Ahmedabad in 2004 for allegedly plotting the killing of then Gujarat chief minister Narendra Modi.\nHeadley denied that he was in any manner pressurised or tutored by the to state that Jahan was a -- which he first revealed during his deposition before Special Judge Sanap on February 11, 2016 -- creating a furore in Indian political circles.\nHe said he did not disclose Jahan's name during the trial of his close associate, Pakistani-Canadian citizen Tahawwur Rana in the US as he was not asked about it.", "url": "https://www.business-standard.com/article/international/ajmal-kasab-was-to-be-traded-with-israeli-hostages-of-26-11-david-headley-116032500604_1.html", "label": 2}