{"authors": ["Saurabh Prashar"], "date_download": "2019-03-27 14:00:13", "date_modify": "2019-03-27 14:00:13", "date_publish": "2018-02-02 03:51:29", "description": "Virk and Chandel had initially filed a petition in the Central Administrative Tribunal (CAT) in January 2017, challenging the rules for promotion.", "filename": "article_cities_chandigarh__1553695213.html", "image_url": "https://images.indianexpress.com/2018/02/collage.jpg?w=759", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/indianexpress.com/article_cities_chandigarh__1553695213.html", "title": "Two inspectors, who fought year-long legal battle against own department and Chandigarh administration for promotion, succeeded", "title_page": "\n\t\t\t\tTwo inspectors, who fought year-long legal battle against own department and Chandigarh administration for promotion, succeeded | Cities News, The Indian Express\t\t\t", "title_rss": "NULL", "source_domain": "indianexpress.com", "text": "TWO INSPECTORS of Chandigarh Police, Charanjit Singh Virk and Dilsher Singh Chandel, who led the year-long legal battle against their own department and the Chandigarh Administration citing anomalies in the promotion of inspectors to the next rank of deputy superintendent of police, succeeded after two of their colleagues, Daleep Rattan and Harjit Kaur, were promoted on Thursday. But, Virk and Chandel themselves failed to get any benefit. Kaur became the first woman DSP of Chandigarh.\nAdvertising\nRather, the police department has come down heavily on both Virk and Chandel. A departmental probe, which closed in May 2017 after giving Virk a clean chit, was reopened on January 22, a day before the Departmental Promotion Committee (DPC) met to consider his promotion. But, due to a pending probe, Virk could not be promoted. On January 30, a departmental probe had been ordered against Chandel, too, for not going out of the country during his ex-India leave that he availed last August.\nGoing by the seniority of Chandigarh Police inspectors, Rattan is the senior most, followed by Virk, Kaur and Chandel.\nWhen contacted by Chandigarh Newsline, both Virk and Chandel, however, refused to say anything about the departmental probes initiated against them. Of the three vacant posts of DSP-rank officers, two have been filled by Rattan and Kaur while one is pending.\nAdvertising\nVirk and Chandel had initially filed a petition in the Central Administrative Tribunal (CAT) in January 2017, challenging the rules for promotion. During the proceedings of their case at CAT, the duo had also objected to the DSP-rank officers coming from other cadres and occupying posts in Chandigarh Police. Their fellow inspector-rank officers, too, joined them in the petition subsequently. CAT ruled in their favour and directed the Chandigarh Administration to send back eight DSP-rank officers, who were from other cadres and holding key posts in Chandigarh Police.\nWhen the administration did not comply with the CAT orders, both Virk and Chandel filed a contempt petition against the Chandigarh Administration in the Punjab and Haryana High Court.\nA senior UT Police officer, refusing to be named, said, “Inspector Charanjit Virk’s case was also discussed at the DPC. His name, too, was forwarded to the UT Administrator in a sealed cover. In the case of Inspector Virk, the sealed cover procedure has been followed, due to pendency of a vigilance probe. His promotion status shall depend on the outcome of the pending probe against him.”\nDIG (UT) Dr OP Mishra said, “The DPC recommended the names of eligible inspectors on the basis of merit. In connection of the sealed cover name of Charanjit Singh Virk, his name will be considered once the pending probe against him is finished.”", "url": "https://indianexpress.com/article/cities/chandigarh/promotion-fiasco-two-inspectors-who-fought-year-long-legal-battle-against-own-department-and-chandigarh-administration-for-promotion-succeeded-5048500/", "label": 2}