{"authors": ["Press Trust Of India"], "date_download": "2019-03-27 14:00:07", "date_modify": "2019-03-27 14:00:07", "date_publish": "2018-11-27 22:05:04", "description": "Read more about Sohrabuddin-Prajapati encounter case: Cop tells court he is innocent on Business Standard. A policeman who the CBI claims was part of the team that allegedly shot Sohrabuddin Shaikh in a \"fake\" encounter in November 2005 told a special court here Tuesday that he was innocent and had been wrongly listed in a charge sheet.Abdul Rehman, an", "filename": "article_pti-stories_sohrabuddin-prajapati-encounter-case-cop-tells-court-he-is-innocent-118112701192_1_1553695207.html", "image_url": "https://bsmedia.business-standard.com/_media/bs/img/article/default/1181127/full-118112701192.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/business-standard.com/article_pti-stories_sohrabuddin-prajapati-encounter-case-cop-tells-court-he-is-innocent-118112701192_1_1553695207.html", "title": "Sohrabuddin-Prajapati encounter case: Cop tells court he is innocent", "title_page": "Sohrabuddin-Prajapati encounter case: Cop tells court he is innocent | Business Standard News", "title_rss": "NULL", "source_domain": "business-standard.com", "text": "A who the CBI claims was part of the team that allegedly shot Sohrabuddin Shaikh in a \"fake\" encounter in November 2005 told a special court here Tuesday that he was innocent and had been wrongly listed in a charge sheet.\nAbdul Rehman, an with Police at that time, recorded his statement under section 313 before special CBI S J Sharma.\nUnder this provision, after examination of witnesses, a final chance is given to an accused to record his statement.\nRehman, according to the CBI charge sheet, was one of the police personnel who had fired at Sohrabuddin during the alleged encounter.\n\"The charge sheet against me was prepared based on false witnesses. I'm innocent. I have not participated in any police encounter,\" he said.\n\"I have not fired from the weapon seized by the probe agency during investigation and I have not visited Ahmedabad during that period,\" he told the court.\nHe said he had nothing to do with the alleged illegal detention of Sohrabuddin or his wife\nRehman also refuted the CBI's charge that he was part of the conspiracy to kill\n\"I had no knowledge of Tulsiram Prajapati's whereabouts. I did not give any information to anyone about it. I was twice part of the escort team that took Prajapati from to Ahmedabad to produce him in court. Other than this, I had no connection with him. I have been falsely implicated in this case,\" he said.\nRehman added he was not part of the escort team when Prajapti escaped from police custody.\nPrajapati, according to police, had escaped from their custody near station when he was returning to Udaipur in a train.\n\"The agency prepared false witness against me and also pressured police officials to make false statements against me,\" Rehman told court.\nThe investigation agency compelled police officials to state that Prajapati was arrested on November 26, 2005, though, Rehman said he was arrested on November 29, 2005.\nRehman also told court that he wanted to examine defence witnesses.\nBesides Rehman, six others police officials of Gujarat and and one private person recorded their statements Tuesday.\nSo far, nine out of 22 accused in Sohrabuddin-Prajapti fake encounter case have recorded their statements in court.\nMost of them submitted before the court that they were innocent and had been falsely implicated, and claimed the case was due to political rivalries and enmity between senior police officials.\nHimanshu Singh Rajawat, a with Police at that time and who was also allegedly part of the team that killed Sohrabuddin, said, \"The case is because of rivalry between senior officers of Gujarat and facts were twisted. It was fuelled further because of prevailing political scenario.\"\nAnother official, Balkrishna Chaubey, then an with Gujarat ATS, said, \"I was never part of any such operation in ATS, more specifically the Sohrabuddin case. I was falsely named in the charge sheet. I never did anything wrong. This is a false case prepared and foisted on me with ulterior political motive because of rivalry of senior officers.\"\nSohrabuddin, a suspected gangster with terror links, was shot dead on November 26, 2005 while he was in the custody of in an alleged fake encounter. His wife was allegedly killed later.\nPrajapati, an of Shaikh who was said to be a witness to the encounter, was allegedly killed by Gujarat and personnel at Chapri in Gujarat's district in December 2006.\nOf the 38 people charged by the CBI for the alleged fake encounters, 16 persons, including (who was in Gujarat then) and all senior police officials, have been discharged.\n(This story has not been edited by Business Standard staff and is auto-generated from a syndicated feed.)", "url": "https://www.business-standard.com/article/pti-stories/sohrabuddin-prajapati-encounter-case-cop-tells-court-he-is-innocent-118112701192_1.html", "label": 2}