{"authors": [], "date_download": "2019-03-27 14:00:18", "date_modify": "2019-03-27 14:00:18", "date_publish": "2017-03-20 08:26:48", "description": "At least 18 Haryana Police personnel, including a Deputy Superintendent of Police DSP and women police officials, were injured on Sunday in Fatehabad district of Haryana when Delhi-bound Jat community protesters clashed with them, police said", "filename": "articles_jats-clash-with-haryana-police-18-policemen-injured_18089168_1553695218.html", "image_url": "https://www.mid-day.com/articles/jats-clash-with-haryana-police-18-policemen-injured/18089168", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/mid-day.com/articles_jats-clash-with-haryana-police-18-policemen-injured_18089168_1553695218.html", "title": "Jats clash with Haryana Police, 18 policemen injured", "title_page": "Jats clash with Haryana Police, 18 policemen injured - news", "title_rss": "NULL", "source_domain": "mid-day.com", "text": "national\nAt least 18 Haryana Police personnel, including a Deputy Superintendent of Police (DSP) and women police officials, were injured on Sunday in Fatehabad district of Haryana when Delhi-bound Jat community protesters clashed with them, police said\nChandigarh: At least 18 Haryana Police personnel, including a Deputy Superintendent of Police (DSP) and women police officials, were injured on Sunday in Fatehabad district of Haryana when Delhi-bound Jat community protesters clashed with them, police said.\nThe police personnel were trying to stop them at a barricade to prevent them from moving towards Delhi. The clash took place on the Sirsa-Hisar-Delhi Highway near Dhani Gopal village in Fatehabad district, around 200 km from here when the protesters, who were on tractor-trolleys, were stopped. Police used force, including cane charge and lobbed teargas shells, as the protesters pelted stones.\nThe injured police personnel were rushed to hospital in Fatehabad. The DSP was reported to be seriously injured. The Jat mob even set two buses on fire and damaged police vehicles. Police officials said that the Jat protesters were carrying sharp-edged weapons on the tractor-trolley when they were stopped.\nAs the protesters argued with the DSP and other police officers, one youth allegedly hit the police officer with a wooden log on the head from behind. Soon other protesters also attacked the police personnel and some media persons present there with stones. The protesters outnumbered the police force present at the barricade.\nAuthorities in Haryana had imposed a ban on the movement of tractor-trolleys in districts bordering Delhi to foil a call given by Jat leaders to lay siege to Delhi and hold a protest outside Parliament, which has now been put off on the assurance of Chief Minister Manohar Lal Khattar.", "url": "https://www.mid-day.com/articles/jats-clash-with-haryana-police-18-policemen-injured/18089168", "label": 2}