{"authors": [], "date_download": "2019-03-27 14:00:19", "date_modify": "2019-03-27 14:00:19", "date_publish": "2017-06-28 20:47:05", "description": "Last week, Junaid Khan was stabbed to death while returning from Delhi along with his two brothers. An argument over train seats escalated and religious slurs were hurled at the brothers.", "filename": "article_india__1553695219.html", "image_url": "https://images.indianexpress.com/2017/06/junaid-759.jpg?w=759", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/indianexpress.com/article_india__1553695219.html", "title": "Junaid Khan lynching: Delhi govt employee among four held in connection with murder", "title_page": "\n\t\t\t\tJunaid Khan lynching: Delhi govt employee among four held in connection with murder | India News, The Indian Express\t\t\t", "title_rss": "NULL", "source_domain": "indianexpress.com", "text": "In a big breakthrough in the lynching of Junaid Khan, Haryana Police arrested four accused in connection with the case, news agency ANI reported on Wednesday. The arrests come a day after Chief Minister Manohar Lal Khattar said that the perpetrators would be brought to justice.\nAdvertising\n“We have arrested four more persons, including three youths, aged between 24 and 30 years and a 50-year-old man,” Kamaldeep Goel, the Superintendent of Police (SP), Government Railway Police (GRP), Faridabad, told PTI over phone.\nThe 50-year-old arrested today is a Delhi government employee while the three others were doing some private jobs, Deputy Superintendent of Police (DSP), GRP, Faridabad, Mohinder Singh said.\nEarlier, Union Minister Venkaiah Naidu condemned the stabbing. “Any incident of such nature is condemnable. It is brutal, atrocious. It will not be acceptable at all. People who are responsible for the same should be identified and dealt very firmly,” Naidu told reporters outside the Parliament.\nAdvertising\nLast week, 15-year-old Junaid was stabbed to death while returning from Delhi along with his two brothers after Eid shopping. An argument over train seats escalated and religious slurs were hurled at the brothers. A day after the incident, police took into custody a 35-year-old man who claimed that he was in a inebriated condition when he stabbed Junaid. The man, identified as Ramesh Kumar, also claimed that he was egged on by the crowd inside the train.\nFaridabad Deputy Superintendent of Police (Government Railway Police) Mohinder Singh had said the police were scanning CCTV footage to identify the killers. “We are trying to procure the CCTV footage from various points which may help us in nabbing the remaining accused,” he had said. The police also announced a cash reward of Rs 1 lakh for those providing credible information related to the case.\nOn Eid, residents of Ballabhgarh wore black armbands in protest against the killing. The murder triggered pan-India protests under the banner ‘Not in my name’.", "url": "https://indianexpress.com/article/india/junaid-khan-lynching-faridabad-haryana-police-arrest-four-4726186/", "label": 2}