{"authors": [], "date_download": "2019-03-27 14:00:16", "date_modify": "2019-03-27 14:00:16", "date_publish": "2017-10-29 16:34:03", "description": "Read more about Candlelight march for dead Ryan student at India Gate disallowed on Business Standard. The authorities on Sunday refused to grant permission for a candlelight march, scheduled to be carried out at the India Gate here, to demand justice for seven-year-old Pradhuman Thakur, who was found dead with his throat slit inside his Gurugram", "filename": "article_news-ians_candlelight-march-for-dead-ryan-student-at-india-gate-disallowed-117102900385_1_1553695216.html", "image_url": "https://bsmedia.business-standard.com/_media/bs/img/article/default/1171029/full-117102900385.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/business-standard.com/article_news-ians_candlelight-march-for-dead-ryan-student-at-india-gate-disallowed-117102900385_1_1553695216.html", "title": "Candlelight march for dead Ryan student at India Gate disallowed", "title_page": "\nCandlelight march for dead Ryan student at India Gate disallowed\n | Business Standard News", "title_rss": "NULL", "source_domain": "business-standard.com", "text": "The authorities on Sunday refused to grant permission for a candlelight march, scheduled to be carried out at the Gate here, to demand justice for seven-year-old Pradhuman Thakur, who was found dead with his throat slit inside his Gurugram school last month.\nIn view of the order passed by the National Green Tribunal court and for security and order reasons, permission for a march at Gate can't be accorded, Deputy Commissioner of Police B.K. Singh said in a letter to the organiser of the newly-formed Pradhuman Foundation.\nFollowing the order, the foundation has shifted the venue of protest to Ramlila Maidan where it will be held at 5 p.m.\nPradhuman's father Barun Chandra Thakur criticised the authorities for prohibiting them from expressing their sentiments at the historic site, accusing them of not being serious about the safety of children.\n\"It is very unfortunate and condemning that the Ministry of Home Affairs and Delhi Police has refused to accord permission to canvass a cause for children and an attempt has been made to suppress the sentiments prevalent across the nation pertaining to the safety and security of the children,\" he said in a statement.\nHe said the government \"wants the vulnerability of the children to remain as they are not the vote bank\" and condemned the order \"in strongest possible words\".\nThakur also accused the government of \"playing into the hands of school mafia\".\nA student of Class 2 at Gurugram's Ryan International School, Pradhuman was killed on the morning of September 8. His body was found in the school bathroom.\nThe Haryana Police said that he was killed by bus conductor Ashok Kumar inside the toilet as the boy resisted a bid to sodomise him.\nWhile Kumar has been arrested, his parents and two other staffers claim he was being made a scapegoat.\nThe case snowballed into a major national issue of safety and security of children in schools, with vociferous protests held by parents and activists outside Ryan schools in several states.\n--IANS\nvn/him/vd\n(This story has not been edited by Business Standard staff and is auto-generated from a syndicated feed.)", "url": "https://www.business-standard.com/article/news-ians/candlelight-march-for-dead-ryan-student-at-india-gate-disallowed-117102900385_1.html", "label": 2}