{"authors": ["Press Trust Of India"], "date_download": "2019-03-27 14:00:27", "date_modify": "2019-03-27 14:00:27", "date_publish": "2018-05-25 17:40:22", "description": "Read more about Two held for double murder in Haryana on Business Standard. Haryana police today said they had cracked a double murder case with the arrest of two men from Punjab's Ludhiana district.The accused, identified as Satte alias Satpal and Sulledin, were absconding after allegedly shooting at Palwal market", "filename": "article_pti-stories_two-held-for-double-murder-in-haryana-118052501172_1_1553695227.html", "image_url": "https://bsmedia.business-standard.com/_media/bs/img/article/default/1180525/full-118052501172.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/business-standard.com/article_pti-stories_two-held-for-double-murder-in-haryana-118052501172_1_1553695227.html", "title": "Two held for double murder in Haryana", "title_page": "Two held for double murder in Haryana | Business Standard News", "title_rss": "NULL", "source_domain": "business-standard.com", "text": "police today said they had cracked a double murder case with the arrest of two men from Punjab's district.\nThe accused, identified as Satte alias Satpal and Sulledin, were absconding after allegedly shooting at Palwal market committee's former and his cousin Birpal, a police said.\nThey were arrested yesterday, he added.\nand were sitting at a shop in Billochpur village on December 5, 2017, when Satte and Sulledin came in a car with an associate and opened fire at the brothers over an old grudge.\nA case was registered under various sections of the Indian Penal Code (IPC) at station, the said, adding that nine others have been arrested in the case.\nCarrying a reward of Rs 50,000 each, Satte and Sulledin are also wanted in several cases of murder, attempt to murder, robbery and loot in different police stations, the said.\n(This story has not been edited by Business Standard staff and is auto-generated from a syndicated feed.)", "url": "https://www.business-standard.com/article/pti-stories/two-held-for-double-murder-in-haryana-118052501172_1.html", "label": 2}