{"authors": [], "date_download": "2019-03-27 13:59:56", "date_modify": "2019-03-27 13:59:56", "date_publish": "2017-02-09 16:28:00", "description": "A Bhopal resident, who was arrested earlier this month for murdering his live-in partner and hiding her body in a marble platform built at his house, has confessed to killing his parents a few years ago because they “were forcing him to study mathematics”.", "filename": "bhopal_bhopal-man-murdered-_08f805ffce2976d4732655b2cecbc68b_story-2gzSmNqMqijM3u5ewV2vUM_1553695196.html", "image_url": "https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2017/02/09/Pictures/_dd65925c-eeb5-11e6-b62a-376882c41036.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/hindustantimes.com/bhopal_bhopal-man-murdered-_08f805ffce2976d4732655b2cecbc68b_story-2gzSmNqMqijM3u5ewV2vUM_1553695196.html", "title": "Bhopal man who killed girlfriend murdered parents for forcing him to study maths", "title_page": "Bhopal man who killed girlfriend murdered parents for forcing him to study maths | bhopal | Hindustan Times", "title_rss": "NULL", "source_domain": "hindustantimes.com", "text": "A Bhopal resident, who was arrested earlier this month for murdering his live-in partner and hiding her body in a marble platform built at his house, has confessed to killing his parents a few years ago because they “were forcing him to study mathematics”.\nThough 32-year-old Udayan Das had confessed to his role in their killing a few days ago, police have disclosed the circumstances surrounding the incident only now. Their bodies were exhumed from a house in Raipur on Monday, following which Das was interrogated for nearly two hours.\nPolice said mathematics, a subject that the youth hated, was one of the main reasons behind his parents’ murder.\n“Udayan told us that his parents, particularly his mother, used to force him to study mathematics. He hated his parents because of this. Though he wanted to pursue a career in social sciences and the arts, his parents wouldn’t let him,” said Raipur additional superintendent of police Vijay Agarwal.\nThe police officer said Das claimed to have a deep interest in photography, painting, poetry, cartoons and writing. “He said he doesn’t feel even a tinge of remorse about murdering his parents because they were ‘Mr and Mrs Hitler’. Murdering them helped pave the way for Udayan to pursue his other interests,” Agarwal added.\nPolice said Das was a “brilliant” student till Class 8, but started failing and went into “a sort of depression” after being forced to study mathematics. The accused speaks flawless English, and also dabbles in information technology and a number of art forms.\nPolice say Udayan Das speaks flawless English, and also dabbles in information technology and a number of art forms. ( HT photo )\n“He wanted to live a lavish life. So he forged his parents’ signatures to release their money from the bank,” another police officer said, adding that the bank officials who allegedly helped Das forge the documents are also under the scanner.\nDas – an only child – used to live with his parents at Raipur. While his father was a foreman with BHEL, his mother worked as a data analyst at Vindhyachal in Bhopal. They had three houses at Raipur, Delhi and Bhopal – the combined rent of which came up to Rs 80,000 per month.\nDas’s mother also received a monthly pension of Rs 30,000.\nSources said the accused became acquainted with his live-in partner – Akanksha Sharma – through Orkut (a defunct social networking site) in 2007. He managed to convince her that he was a software professional based in the United States.\nSharma, a native of Bankura in West Bengal, left her parents’ house and met Das at Delhi in June 2016. The duo then reached Bhopal, where their relationship turned sour. Police said Sharma was murdered 20 days later, on December 27.\nFirst Published: Feb 09, 2017 16:28 IST", "url": "https://www.hindustantimes.com/bhopal/bhopal-man-murdered-parents-for-forcing-him-to-study-maths-say-police/story-2gzSmNqMqijM3u5ewV2vUM.html", "label": 2}