{"authors": [], "date_download": "2019-03-27 14:00:26", "date_modify": "2019-03-27 14:00:26", "date_publish": "2015-08-09 00:00:00", "description": "'Farmers love cows but find it uneconomical to afford fodder expenses' | Now, govt to use MNREGA for rescue of cows", "filename": "business_report_now-govt-to-use-mnrega-for-rescue-of-cows_20150809_1553695226.html", "image_url": "http://im.rediff.com/money/2015/aug/09cow.jpg", "language": null, "localpath": "/home/raj/news-please-repo//data/2019/03/27/rediff.com/business_report_now-govt-to-use-mnrega-for-rescue-of-cows_20150809_1553695226.html", "title": "Now, govt to use MNREGA for rescue of cows", "title_page": "Now, govt to use MNREGA for rescue of cows - Rediff.com Business", "title_rss": "NULL", "source_domain": "rediff.com", "text": "August 09, 2015 11:24 IST\nEnvironment and Forest Minister Prakash Javadekar on Saturday said the Centre was mulling a scheme to provide farmers free fodder to dissuade them from selling cows that have stopped producing milk.\nJavadekar, speaking at a conference on cow slaughter, said farmers love cows but find it uneconomical to afford fodder expenses when it stops producing milk. He said the government was thinking of cultivating grass in forest areas under the Mahatma Gandhi National Rural Employment Guarantee Scheme (MNREGS) and make it available to farmers in neighbouring villages without charging for it.\nThis he said will not only prevent cow owners from selling their cattle to butchers but also save precious forest cover since cattle are taken to graze in forest areas in large parts of India. “The scheme shall be made effective soon,” he said.\nApart from Javadekar, Home Minister Rajnath Singh, former Karnataka Chief Minister BS Yeddyurappa among others, addressed the conference organised by Rashtriya Godhan Mahasangh, in association with the Agriculture Ministry.\nJavadekar said the Centre is likely to increase the grant for setting up goshala (cow-sheds) from current Rs 22 lakh (Rs 2.2 million). Banning cow slaughter was one of the promises of the Bharatiya Janata Party (BJP) manifesto for the 2014 Lok Sabha elections. In the last one year, BJP governments in Maharashtra and Haryana have enacted state specific laws to ban cow slaughter.\nSingh pointed out how even the Mughals appreciated that if they had to rule (India) then an “open support to cow slaughter” would not be feasible while the Britishers failed to understand this.\nHe said the home ministry under his charge has taken steps to rein in cattle smuggling to Bangladesh.\n\"Whatever little information I have about Mughal rulers ...I can say that the Mughal rulers were aware of this fact. They understood that by killing cows and giving an open support to cow slaughter they cannot rule for a longer period. Even Babur, in his will, has written, we can't do two things at one time. Either rule the hearts of people or eat cow's meat. Only one thing can happen... They cannot be done together,\" Singh said.\n\"After the British came to India, the way Indian tradition had to be respected... it was not done. In fact, it became worse. One of the main reasons for the first war of Independence (1857) was cow fat which was used in cartridges. This shows the faith of people towards cow,\" the Home Minister said.\nSingh said that on Friday the Bangladesh High Commissioner and Director General of Border Security Force had come to meet him. “When I discussed the smuggling issue with them, they informed me that since we have stopped cow smuggling, beef prices have gone up by 50 per cent in Bangladesh. This satisfied me to some extent,” he said.\nThe Home Minister said cows should be protected at any cost in the perspective of climate change. \"The United Nation's agricultural department had engaged around 300 scientists from 22 countries to research and define genetic sequence of cow. The researchers concluded that cow has 22,000 genes while human beings have around 20,000-25,000 genes. Cow and human beings have 80 per cent of genes common between them,\" Singh said.", "url": "https://www.rediff.com/business/report/now-govt-to-use-mnrega-for-rescue-of-cows/20150809.htm", "label": 2}