{"authors": [], "date_download": "2019-03-27 14:00:08", "date_modify": "2019-03-27 14:00:08", "date_publish": "2015-09-20 00:00:00", "description": "Bi-Wheelers Association Challenges High Court Order on Helmet", "filename": "cities_kochi_2015_sep_20_Bi-Wheelers-Association-Challenges-High-Court-Order-on-Helmet-817273_1553695208.html", "image_url": "http://images.newindianexpress.com/uploads/user/imagelibrary/logo/nie_logo_600X390.jpg", "language": null, "localpath": "/home/raj/news-please-repo//data/2019/03/27/newindianexpress.com/cities_kochi_2015_sep_20_Bi-Wheelers-Association-Challenges-High-Court-Order-on-Helmet-817273_1553695208.html", "title": "Bi-Wheelers Association Challenges High Court Order on Helmet", "title_page": "Bi-Wheelers Association Challenges High Court Order on Helmet - The New Indian Express", "title_rss": "NULL", "source_domain": "newindianexpress.com", "text": "Express News Service By\nKOCHI: The Bi-wheelers’ Association of South India on Saturday said it would initiate a legal battle against the recent Kerala High Court directive making it mandatory for pillion riders to wear helmet. According to the organisation, the court directive will not curtail causalities related to two-wheeler accidents in the State, which are caused mainly due to poor road conditions.\n“We think that helmet manufacturing companies have played a major role in having such a directive issued. The fact is that helmets approved by the Bureau of Indian Standards are meagre in the market.\nA major chunk of the helmets are of poor standard, and the companies aim at windfall gains through such directives. We demand that the government challenge the interim order, and make sufficient changes to the Motor Vehicle Act. We ourselves will launch a legal battle against the directive,” said Bi-wheelers’ Association of South India president Kuruvilla Mathews.\nAccording to the Association, the officials concerned should check the monetary gains made by helmet manufacturing units in Delhi and Haryana.\nIt also called for a crackdown against companies that push substandard helmets into the market.", "url": "http://www.newindianexpress.com/cities/kochi/2015/sep/20/Bi-Wheelers-Association-Challenges-High-Court-Order-on-Helmet-817273.html", "label": 2}