{"authors": ["Sidharth Bhardwaj"], "date_download": "2019-03-27 14:00:20", "date_modify": "2019-03-27 14:00:20", "date_publish": "2018-03-07 01:22:37", "description": "NEW DELHI: A 45-year-old woman was murdered in front of her husband and son on Monday night at her house by a group of men, while her brother was foun.", "filename": "city_delhi_woman-brother-killed-over-property_articleshow_63193246_1553695220.html", "image_url": "https://static.toiimg.com/thumb/msid-63193595,width-1070,height-580,imgsize-138557,resizemode-6,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "language": null, "localpath": "/home/raj/news-please-repo//data/2019/03/27/timesofindia.indiatimes.com/city_delhi_woman-brother-killed-over-property_articleshow_63193246_1553695220.html", "title": "Delhi: City school principal, brother killed over property", "title_page": "Badsa village: Delhi: City school principal, brother killed over property | Delhi News - Times of India\n\t\t\t", "title_rss": "NULL", "source_domain": "timesofindia.indiatimes.com", "text": "NEW DELHI: A 45-year-old woman was murdered in front of her husband and son on Monday night at her house by a group of men, while her brother was found dead with head injuries in an open plot at Badsa village in Haryana on Tuesday morning.Police suspect the murders to be the result of a dispute regarding a six-bigha plot at Ghuman Hera village near Chhawla in southwest Delhi.The woman, Anita Yadav, was the principal of a primary school that she owned and ran along with her husband. Her brother, Jai Kishan, was a property dealer and ran the transport service at the school. The prime suspect is Jai Kishan’s friend, Naveen Yadav, who is absconding. DCP (Dwarka) Shibesh Singh said several teams have been formed to nab the killers.Anita lived with her family on the third floor of the school building and Jai Kishan stayed at the nearby Dariyapur village. The woman’s husband, Ashok Yadav, said that around 3pm on Monday Jai Kishan allegedly received a call from Naveen threatening to kill his sister and her family if the dispute over the plot was not resolved by the evening.Initially the family ignored the threat, but Ashok pursued Jai Kishan to meet Naveen and convince him to resolve the issue after March since the school students were appearing for examinations.Ashok said that they had bought the plot from Naveen for Rs 1 crore two years ago to expand the school and shift it out of their residential building. “After a year, Naveen started pressuring us to return his plot. He also refused to return the money. We found that the plot belonged to his aunt,” said Ashok.Family members said that while Jai Kishan was on his way to resolve the matter with Naveen, he was abducted in a car and tied up with packing tape. He was dumped in the rear seat of the car, which was later found parked outside their house.After Jai Kishan had left, Ashok accompanied his son for a badminton match. He returned around 9.40pm. Just when he was going to close the gates of their house, two men stepped out of the car and kicked it open. “I could recognise Naveen, but the other one had his face covered. They held me at gunpoint and forced me to call my wife. They kept saying, “hume madam se milna hai”,” said Ashok.When Anita heard them talking and asked who they were, Ashok told her to stay away saying they were relatives. The men forced him to take them to Anita, who was on the terrace. As soon as she stepped out, a heated argument ensued. Naveen aimed the pistol at Ashok’s head and tried to fire. Fortunately, the bullet got stuck in the chamber.Anita’s son, Tushar, tried to disarm the shooter, but he fired from another pistol at him and missed. “Anita tried to save Tushar when they fired another shot and the bullet hit her on the chest,” said Ashok.Their pet dog tried to bite Naveen due to which he panicked and fled. Anita was taken to a private hospital where she was declared brought dead.Around 8.30am on Tuesday, Ashok received a call from Haryana Police informing him about Jai Kishan’s body being found with a head injury inflicted with a sharp object.", "url": "https://timesofindia.indiatimes.com/city/delhi/woman-brother-killed-over-property/articleshow/63193246.cms", "label": 2}