{"authors": ["Nitasha Natu"], "date_download": "2019-03-27 13:59:59", "date_modify": "2019-03-27 13:59:59", "date_publish": "2015-03-09 03:52:11", "description": "A 78-year-old retired principal secretary to a former Chief Justice of the Bombay high court was murdered at his residence at Tata Blocks, Bandra (Wes", "filename": "city_mumbai_Elderly-Parsi-k_56a8b99f09c143befb91a8f89bfce2ad_46497803_1553695199.html", "image_url": "https://static.toiimg.com/thumb/msid-46497809,width-1070,height-580,imgsize-1,resizemode-6,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "language": null, "localpath": "/home/raj/news-please-repo//data/2019/03/27/timesofindia.indiatimes.com/city_mumbai_Elderly-Parsi-k_56a8b99f09c143befb91a8f89bfce2ad_46497803_1553695199.html", "title": "Elderly Parsi killed by ex-help in Bandra", "title_page": "Elderly Parsi killed by ex-help in Bandra | Mumbai News - Times of India\n\t\t\t", "title_rss": "NULL", "source_domain": "timesofindia.indiatimes.com", "text": "MUMBAI: A 78-year-old retired principal secretary to a former Chief Justice of the Bombay high court was murdered at his residence at Tata Blocks, Bandra (West), early on Sunday. His wife was bound, blindfolded and threatened by the killers before they made off with valuables worth Rs 8.09 lakh. The accused, both in their early twenties, were arrested by the Bandra police the same day. One of them used to work at the couple's residence.Darius Kapadia lived with his wife Lily at Bai Jeevanbai Tata Building No 1. Their 50-year-old daughter, who is single, lives separately in Bandra. The police said Lily spent most of her time at her daughter's flat; Darius used to be at home by himself. The couple had seven helps; four autorickshaw drivers would frequent their society to ferry Lily to her daughter's place.Around 12.30am on Sunday, Lily returned home from her daughter's place. An auto driver, who was to ferry her back in the morning, was asleep in his vehicle outside. Lily asked him to help her into the flat with her bags. “When she knocked on the door, there was no response. So, Lily let herself in with a pair of spare keys. She asked the auto driver if he could spot her husband anywhere. The driver peered into Darius's room and said he was lying down,” said a police officer.After the driver left, Lily decided to check on her husband. She was shocked to find him battling for life, his throat slit. “The accused, Jay Navrang (21) and Kamlesh Jadhav (20), had been hiding in the kitchen. They pounced on Lily and tied her to a chair with a dupatta, before blindfolding her. As Navrang was known to the couple—he had worked as their help in the past before being sacked—he did not appear directly in front of Lily,” said the officer. The accused demanded cupboard keys from Lily, who asked them to look under the bed. Not finding them there, the men hit Lily. After she told them the keys were in her bag, the accused made off with Rs 7.5 lakh in cash, two tolas of gold and a cellphone.Lily freed herself and went over to a neighbour's place for help. The police were called. Darius was later pronounced dead by doctors. “We questioned all helps and auto drivers who frequented the couple's house. Navrang's father was one of the drivers and was trusted deeply. Navrang knew Darius was alone at home during the day. He roped in a friend (Jadhav) and they visited Darius with beer on Sunday night. Their plan was to tie him up and flee with valuables. But when Darius resisted, the two slit his throat with a blade. They couldn't find any valuables and stayed back till Lily returned home,” an officer said.Navrang was picked up when the police learnt that he had been to Bandra on Sunday. He and Jadhav are residents of Parel. They have been booked on murder charges.", "url": "https://timesofindia.indiatimes.com/city/mumbai/Elderly-Parsi-killed-by-ex-help-in-Bandra/articleshow/46497803.cms", "label": 2}