{"authors": [], "date_download": "2019-03-27 14:00:18", "date_modify": "2019-03-27 14:00:18", "date_publish": "2018-11-11 23:58:00", "description": "NEW DELHI: Two days after a senior manager of Tata Steel Production and Distribution Limited (TSPDL), a subsidiary of Tata Steel, was shot dead in Far.", "filename": "city_delhi_ex-staffer-held-_0f4fd706be7108d68478b2056066990e_66581993_1553695218.html", "image_url": "https://static.toiimg.com/thumb/msid-66583142,width-1070,height-580,imgsize-1327045,resizemode-6,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "language": null, "localpath": "/home/raj/news-please-repo//data/2019/03/27/timesofindia.indiatimes.com/city_delhi_ex-staffer-held-_0f4fd706be7108d68478b2056066990e_66581993_1553695218.html", "title": "Ex-staffer held for Tata manager’s murder", "title_page": "Ex-staffer held for Tata manager’s murder | Delhi News - Times of India\n\t\t\t", "title_rss": "NULL", "source_domain": "timesofindia.indiatimes.com", "text": "NEW DELHI: Two days after a senior manager of Tata Steel Production and Distribution Limited (TSPDL), a subsidiary of Tata Steel, was shot dead in Faridabad , Haryana Police have arrested the suspect ex-employee, Vishwas Pandey SHO Ashok Kumar said Pandey has been sent to judicial custody. During interrogation, he told police that the victim, Arindam Pal , and two other employees had allegedly plotted his dismissal and sent an adverse feedback about his performance to the seniors. Subsequently, he decided to kill Pal.Pandey was trying to fly to Singapore for a job, but was caught from Sainik Colony of Faridabad. On the day of murder, he had called the manager of the company in Singapore, which had employed him, and asked him to ensure that there were no delays. He claimed to having purchased the pistol used to kill Pal from Allahabad for Rs 90,000. He had also procured 25 cartridges, a few of which were used by him for target practice during Diwali.Tata officials told police that Pandey was sacked after he thrashed a senior during an argument in June. He was asked to explain his behaviour, but he refused to reply.Police said that ever since he was fired, Pandey had been threatening senior managers of the company through emails, calls and on WhatsApp. The victim’s wife had told police that earlier Pandey had gone to the company gates inquiring about Pal, but he fled after some employees spotted him carrying a gun.", "url": "https://timesofindia.indiatimes.com/city/delhi/ex-staffer-held-for-tata-managers-murder/articleshow/66581993.cms", "label": 2}