{"authors": [], "date_download": "2019-03-27 14:00:16", "date_modify": "2019-03-27 14:00:16", "date_publish": "2017-08-18 10:50:33", "description": "The students have claimed that the Haryana Police at Asola near Surajkund refused to file an FIR and forced them instead to write an apology letter. A zero FIR was later lodged at the Vasant Kunj police station.", "filename": "delhi-news_he-pulled-me-int_0bcf55172af475bebdfa06c4a47ed2df_story-o8xpL7lV3gxT8LJMaq57NJ_1553695216.html", "image_url": "https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2017/08/18/Pictures/asola-wildlife-sanctuary_fefb7972-8406-11e7-b63c-9d281adafd5e.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/hindustantimes.com/delhi-news_he-pulled-me-int_0bcf55172af475bebdfa06c4a47ed2df_story-o8xpL7lV3gxT8LJMaq57NJ_1553695216.html", "title": "He pulled me into shed to rape me: JNU girl after attack on students near Delhi", "title_page": "He pulled me into shed to rape me: JNU girl after attack on students near Delhi | delhi news | Hindustan Times", "title_rss": "NULL", "source_domain": "hindustantimes.com", "text": "A group of seven Delhi students were allegedly attacked by some locals during a trip to Bhardwaj Lake in Asola near Delhi.\nStudents, who study at Jawaharlal Nehru University and St Stephen’s college in Delhi University, alleged that some locals roughed them up and allegedly made communal remarks. A woman who was part of the group complained that she was threatened with rape and alleged that when they approached Haryana police officials they refused to file an FIR.\nA zero FIR has now been filed on the basis of her complaint at the Vasant Kunj police station, under the appropriate sections. JNUSU president Mohit Pandey said the woman is in deep trauma after the incident. “Today we are going to meet Commissioner of Police in Faridabad. The girl is in deep trauma. Police is very carelessly saying that they will ask Surajkund Police station to take statements,” Pandey said on Friday.\nIn their complaint, the students have said that the incident took place when they were on their way back on August 15 after an evening at the lake. The woman hitched a ride with two of her friends on a bike till the main road, when they were allegedly intercepted by an elderly man with lathi, who called for others to join him.\n“Four people tried to grab us. The guy who stopped us was drunk and asked we were doing there. The other guy slapped me and abused me,” says the FIR.\nThe woman has alleged that she was groped and questioned about her relationship with the boys in the group. She was then allegedly dragged to a temporary shed by a man.\n“The other people assaulting us supported the move of the guy and advised him to forcefully push me inside the shed to rape me,” the woman has said in her complaint.\nThough the students managed to escape and approached the Surajkund police station, the cops allegedly refused to file their complaint.\n“My character was questioned by the police officials,” the student has stated in the FIR. She said that they were allowed to leave only after they wrote an apology letter that had been dictated to them by the policemen.\nHaryana Police has now begun probe into allegation that cops at Surajkund police station did not register case on the complaint of the students. “We are investigating who was on duty at the police station and why an FIR was not registered,” said Surajkund SHO Pankaj Kumar.\n“I have just come to know about the incident. We are investigating it,” ACP NIT Shakir Hussain said, confirming that the students had visited Surajkund police station.\nFirst Published: Aug 18, 2017 10:50 IST", "url": "https://www.hindustantimes.com/delhi-news/he-pulled-me-into-shed-to-rape-me-jnu-girl-after-attack-on-students-near-delhi/story-o8xpL7lV3gxT8LJMaq57NJ.html", "label": 2}