{"authors": ["Ht Correspondent"], "date_download": "2019-03-27 14:00:04", "date_modify": "2019-03-27 14:00:04", "date_publish": "2016-07-31 12:28:00", "description": "HT Correspondent\nROHTAK/NEW DELHI: In a scene straight out of a Bollywood potboiler, over a dozen unidentified aides of an undertrial prisoner freed him from police custody by...", "filename": "delhi-newspaper_criminals-t_bd5942391e49abe62e1197fc8cb87482_story-lX1tftHwh3YxaORNkMTKjL_1553695204.html", "image_url": "https://www.hindustantimes.com/images/app-images/2019/2/icon-57x57.png", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/hindustantimes.com/delhi-newspaper_criminals-t_bd5942391e49abe62e1197fc8cb87482_story-lX1tftHwh3YxaORNkMTKjL_1553695204.html", "title": "Criminals throw chilli powder at cops, free murder suspect", "title_page": "Criminals throw chilli powder at cops, free murder suspect\n | delhi newspaper | Metro | Hindustan Times", "title_rss": "NULL", "source_domain": "hindustantimes.com", "text": "ROHTAK/NEW DELHI: In a scene straight out of a Bollywood potboiler, over a dozen unidentified aides of an undertrial prisoner freed him from police custody by throwing chilli powder in the eyes of the cops escorting him in Haryana’s Bahadurgarh on Saturday morning.\nFour Delhi Police personnel were escorting murder suspect Jitendra Goga from Tihar to Jind’s Narwana town for a court hearing in a Haryana Roadways bus when his accomplices struck in Bahadurgarh.\nThey also snatched a weapon from a policeman.\n“The incident took place at about 6.15 am at a secluded place between Parley Biscuit factory and Surya Roshini factory in Bahadurgarh,” Ashok Malik, DCP (3rd battalion) said.\nGoga was booked in over 10 cases, including murder, and hailed from Delhi’s Alipur area.\nThe policemen said they were attacked by 10-12 men. “A group of men came in two cars and stopped them in front of the moving bus on the outskirts of the Haryana town near Delhi.\nThey divided themselves into two groups and boarded the bus from the front and rear gates.\n“Before the policemen realised what had happened, the goons threw chilli powder at them. Passengers said four of the suspect’s accomplices were already in the bus and they threw the chilli powder,” Bahadurgarh police investigating officer Telu Ram said.\nRam said they took around 60 passengers in the bus hostage and fired several gunshots in the air to scare them. They took away the keys of the bus.\n“The injured policemen tried to retaliate by opening fire but the miscreants managed to escape with their accomplice and took away an MP5 machine gun of the police,” he said.\nPolice said a case had been registered in Bahadurgarh and hunt was on to nab them.\n“The area where the incident happened is secluded and so there were no CCTV cameras. We are trying to locate their vehicle,” police said.\nThree of the four attacked policemen were admitted to Bahadurgarh hospital after they complained of irritation in the eyes, police said.\nA team from the Delhi Police 3rd battalion had been sent to the crime scene. A parallel probe has been launched by Delhi Police and the role of the four policemen was being verified, said a senior Delhi police officer.\n.\nFirst Published: Jul 31, 2016 12:28 IST", "url": "https://www.hindustantimes.com/delhi-newspaper/criminals-throw-chilli-powder-at-cops-free-murder-suspect/story-lX1tftHwh3YxaORNkMTKjL.html", "label": 2}