{"authors": [], "date_download": "2019-03-27 14:00:22", "date_modify": "2019-03-27 14:00:22", "date_publish": null, "description": null, "filename": "doc__1553695222.html", "image_url": "https://indiankanoon.org/doc/150192160/", "language": null, "localpath": "/home/raj/news-please-repo//data/2019/03/27/indiankanoon.org/doc__1553695222.html", "title": "Master Harshil Anand vs Uoi & Ors. on 26 October, 2016", "title_page": "Master Harshil Anand vs Uoi & Ors. on 26 October, 2016", "title_rss": "NULL", "source_domain": "indiankanoon.org", "text": "Delhi High Court\nMaster Harshil Anand vs Uoi & Ors. on 26 October, 2016\n* IN THE HIGH COURT OF DELHI AT NEW DELHI Date of Decision: October 26, 2016 + LPA 536/2016 & C.M.Nos. 36135/2016 & 36136/2016 MASTER HARSHIL ANAND ..... Appellant Through: Mr.Atul Nanda, Sr. Adv. with Ms. Rameeza Hakim, and Mr. Ashim Shridhar, Advs. Versus UOI & ORS. ..... Respondents Through : Mrs.Bharathi Raju, CGSC with Ms.C. Rubavathi, Adv. for R-1 & R-6. Mr.K. K. Sharma, Sr. Adv. with Ms.Sonia Sharma, Mr.Rajiv Bakshi, Ms.Bhanita Patowary, Mr.Ayush Chourasia and Ms. Bhawana Gera, Advs. for R-3, R-4 & R-5. Mr. Sudhir Nandrajog, Sr. Adv. with Ms.Simran Jeet, Adv. for Mr.Mohinder J.S. Rupal, Adv. for Delhi University. Mr.T. Singhdev, Ms. Biakthansangi and Mr. Tarun Verma, Advs. for R-7/MCI. + LPA 539/2016 & C.M. Nos. 36159/2016 & 36163/2016 AMRIT SAMRA & ORS. ..... Appellants Through: Mr. Himanshu Sharma, Advocate Versus UNIVERSITY OF DELHI & ORS. ..... Respondents Through: Mr.Sudhir Nandrajog, Sr.Adv. with Ms.Simran Jeet, Adv. for Mr.Mohinder J.S. Rupal, Adv. for Delhi University Ms.Anita Sahani, Adv. for R-2 Mr.Harish Kumar Garg, Adv. for R-3 CORAM: HON'BLE THE CHIEF JUSTICE HON'BLE MS. JUSTICE SANGITA DHINGRA SEHGAL LPA Nos.536 & 539 of 2016 Page 1 of 16 JUDGMENT\n: Ms.G.ROHINI, CHIEF JUSTICE\n1. These two appeals are filed assailing the order of the learned Single Judge dated 23.09.2016 in W.P.(C) Nos.7813/2016, 8358/2016 and 8582/2016.\n2. W.P.(C) No.7813/2016 was filed by the respondent Nos.3 to 5 in LPA No.536/2016 challenging the action of the University of Delhi, Faculty of Medical Sciences (for short 'University') in omitting the words „boarded out from service‟ from Priorities II and IV for 5% reservation meant for Children/Widows of the eligible Armed Forces personnel (hereinafter referred to as 'CW Category') for admission to Under-Graduate Degree Courses (MBBS/BDS) for the session 2016-17.\n3. W.P.(C) Nos.8358/2016 and 8582/2016 were filed seeking a mandamus to the University to follow the reservation as provided in the Bulletin of Information for the Academic Session 2016-17 to grant admission to the candidates belonging to CW Category and they were in fact in the nature of cross petitions to W.P.(C) No.7813/2016.\n4. By the order under appeal dated 23.09.2016, the learned Single Judge held that the action of the University in omitting the words „boarded out from service‟ from Priority-II and the words „boarded out from service with disability attributable to Military/Para Military service‟ from Priority-IV of CW Category is unsustainable and accordingly directed the University to LPA Nos.536 & 539 of 2016 Page 2 of 16 apply Priorities-II and IV in accordance with the stipulation of Kendriya Sainik Board, Ministry of Defence. Thus, W.P.(C) No.7813/2016 was allowed and W.P.(C) Nos.8358/2016 and 8582/2016 were dismissed.\n5. The appellant in LPA No.536/2016, which was directed against the order in W.P.(C) No.7813/2016, was not a party to the proceedings before the learned Single Judge. However, it is pleaded that pursuant to the order under appeal, the first list of counselling published by the University in CW Category was revised resulting in deletion of his name which was figured above the names of the writ petitioners in W.P.(C) No.7813/2016 and thus he was denied admission. So far as LPA No.539/2016 is concerned, the appellants are the petitioners in W.P.(C) No.8358/2016 and they are aggrieved by the dismissal of the said writ petition.\n6. We have heard the learned counsel for both the parties.\n7. Clause 3(E) of the Bulletin of Information published by the University of Delhi, Faculty of Medical Sciences for admission to Under-graduate Degree Courses (MBBS/BDS) for the Academic Session 2016-17 provided for reservation of 5% seats under CW Category as under:\n\"(E) Five percent (5%) seats are reserved on horizontal (Compartmental) basis for the candidates belonging to Children/Widows of the eligible Armed Forces Personnel (C.W.) category.\nAs per the guidelines approved by the Academic Council vide circular No.Aca.I/UG-PG Admission/2014/759 dated 22/05/2014 admission of candidates belonging to CW categories have to be made in the following order or priorities:\nI. Widows/Wards of Defence Personnel killed in action; II. Wards of serving Personnel and Ex-Servicemen disabled in action; LPA Nos.536 & 539 of 2016 Page 3 of 16 III. Widows/Wards of Defence Personnel who died in peace time with death attributable to Military Service; IV. Wards of Defence Personnel disabled in peace time\nand V. Wards of Ex-servicemen Personnel and serving personnel including Personnel of Police forces who are in receipt of Gallantry Awards.\"\nwith disability attributable to the Military service;\n8. In the tentative list of candidates for admission published by the University based on the marks of AIPMT/NEET under CW Category, the appellant in LPA No.536/2016 was shown at Serial No.13 under Priority-IV; the appellants in LPA No.539/2016 (petitioners in W.P.(C) No.8358/2016) were shown at Serial No.9 (Priority-IV), Serial No.1 (Priority-II) and Serial No.2 (Priority-II) respectively whereas the petitioners in W.P.(C) No.7813/2016 (respondent Nos.3 to 5 in LPA No.536/2016 were shown at Serial Nos.16, 17 & 18 under Priority-V.\n9. It was notified by the University vide Notification dated 27.08.2016 that the first round of counselling for MBBS Course under CW Category would be held on 06.09.2016 and the second round of counselling, if required, would be held on 25.09.2016.\n10. W.P.(C) No.7183/2016 came to be filed on 02.09.2016 contending that the Priorities-II & IV under CW Category given in the Information Bulletin, 2016-17 were erroneous since the words „boarded out from service‟ were omitted from the said Priorities. Placing reliance upon the communication dated 31.08.2016 from the Government of India to the Faculty of Medical Sciences, University of Delhi stating that as per the guidelines of Ministry of Defence, Priority-IV under CW Category contains LPA Nos.536 & 539 of 2016 Page 4 of 16 the words \"boarded out\", it was contended in the writ petition that the omission of the said words in the Information Bulletin, 2016-17 needed rectification. It was also contended that the erroneous omission of the words \"boarded out\" had resulted in enlarging the reservation under Priorities-II and IV and consequently reducing the opportunity of reservation under Priority-V meant for the wards of ex-servicemen personnel and serving personnel who are in receipt of gallantry awards.\n11. Having prima facie opined that as per the guidelines of Ministry of Defence, Priority-II and IV of CW Category shall include the words „boarded out from service‟, the learned Single Judge had initially passed an order on 02.09.2016 with the following directions:\n\"19. In view of the above circumstances, it is directed that the respondents may proceed with the counselling scheduled for 04.09.2016. However, in case any candidate seeks admission in priority II or IV and is a child of personnel disabled in action but \"not boarded out from service\", the admission of such candidate shall be subject to outcome of this Writ Petition and subject to further order of this Court.\n20. The respondent University will be obliged to inform such candidate(s) about the pendency of the present petition and the fact that the admission is subject to further order of this Court.\n21. It is clarified that, if there is no candidate in priority II and IV or admission is granted to a candidate in priority II and IV but such candidate is a child of a personnel disabled in action and boarded out from service, then such admission shall not be subject to outcome or further orders of this Court.\n22. Renotify on 13.09.2016.\"\nLPA Nos.536 & 539 of 2016 Page 5 of 16\n12. However, the University had chosen to defer the counselling for admission under CW Category and to that effect the following notification was issued on 03.09.2016:\n\"It is notified for the concerned CW category candidates (all categories) that the Medical Courses Admission Committee (MCAC) of the Faculty of Medical Sciences at its meeting held on 03.09.2016 has decided to defer the counselling scheduled to be held on 4th, 5th & 6th September, 2016, due to certain administrative reasons.\nThe MBBS seats reserved for CW candidates (All categories) will be filled up in the 2nd counseling scheduled to be held on 25.09.2016 at 09:00 am in the Conference Centre, Opposite Department of Botany, University of Delhi (North Campus), Delhi-110007.\"\n13. The University had also chosen not to file a counter affidavit in the writ petitions. All the writ petitions were heard together and were disposed of by the order under appeal dated 23.09.2016. As mentioned above, the learned Single Judge directed the University to apply Priorities-II and IV by including the words „boarded out from service‟ in accordance with the stipulation of the Kendriya Sainik Board, Ministry of Defence. In compliance with the order of the learned Single Judge, the University issued the notification dated 24.09.2016 notifying the changes in Priorities-II and Priority IV in CW Category as under:\n\"Priority II - Disabled in action and Boarded out from service with disability attributed to military service.\nPriority IV - Disabled in service and Boarded out with disability attributable to military service.\" (emphasis supplied) LPA Nos.536 & 539 of 2016 Page 6 of 16\n14. It was further notified that the counselling of CW Category would be held on 25.09.2016. As per the revised list of eligible candidates under CW Category notified therein the petitioners in W.P.(C) No.7813/2016/respondent Nos.3 to 5 in LPA No.536/2016 were shown at Serial Nos.4, 5 and 6 under Priority-V. The appellant in LPA No.536/2016 and the appellants in LPA No.539/2016 [petitioners in W.P.(C) No.8358/2016] were not figured in the said list of eligible candidates apparently for the reason that they are the wards of the serving personnel who may be disabled in action or disabled in service, but not boarded out and thus did not fall within Priorities-II/IV notified in terms of the order of the learned Single Judge.\n15. Assailing the order of the learned Single Judge, the present appeals were filed on 28.09.2016 and they were taken up on the same day on a mentioning made by the counsels. While directing to renotify the appeals for hearing, we directed that all admissions under CW Category for the Academic Session 2016-17 would be subject to the outcome of the appeals.\n16. We have heard the learned counsel for both the parties.\n17. As could be seen, the whole controversy is as to whether the Priorities II & IV for reservation under CW Category contain the words „boarded out from service'‟ In the absence of the words „boarded out from service‟, Priorities II & IV would be open to the wards of the serving personnel also. If not, the said priorities would be restricted to the wards of the personnel who are disabled in action and boarded out from service or disabled in service and boarded out with disability attributable to military service.\n18. As could be seen from the material available on record, Delhi University has been providing 5% reservation under CW Category for the LPA Nos.536 & 539 of 2016 Page 7 of 16 past many years. As is evident from the Information Bulletins of the years 2006 to 2013 the words „boarded out from service‟ were included in Priorities II and IV and the University has consistently restricted the said priorities to the wards of the Armed Forces Personnel who are disabled in action/service and boarded out from service. In other words, the said priorities have been applied to the wards of the Armed Forces Personnel who had to leave the service on account of the disability suffered. It is also relevant to note that for the year 2014, though the Bulletin of Information initially published by the University did not contain the words „boarded out from service‟ in Priorities II & IV, the University issued a corrigendum dated 13.06.2014 including the words „boarded out from service‟. Coming to the year 2015 (Session 2015-16) the words „boarded out from service‟ were again omitted for the reasons best known to the University. However, it appears nobody had chosen to challenge the said omission and consequently, the admissions were made accordingly for the academic session 2015-16. So far as the session 2016-17 is concerned, the University repeated the same and Clause 3(E) of the Information Bulletin did not contain the words „boarded out from services‟ in Priorities II & IV for reservation under CW Category. This was questioned by filing W.P.(C) No.7813/2016 and as already mentioned, the learned Single Judge held that the said action of the University was unsustainable and accordingly directed to rectify the Priorities II & IV by including the words „boarded out from service‟.\n19. It may at the outset be mentioned that the University did not file any counter affidavit in W.P.(C) No.7813/2016 contesting the reliefs sought. The University had also not chosen to challenge the order of the learned LPA Nos.536 & 539 of 2016 Page 8 of 16 Single Judge and had complied with the directions by issuing a revised list of eligible candidates under CW Category after inserting the words „boarded out from service‟ in Priorities II and IV. On the basis of the said list, the admissions were also made.\n20. Sh.Sudhir Nandrajog, the learned Senior Counsel who appeared before us on behalf of the Delhi University did not dispute the fact that except for Academic Session 2015-16, the University had applied the Priorities II & IV to the wards of the Army Personnel „boarded out from service‟.\n21. However, it is vehemently contended by Shri Atul Nanda, the learned senior counsel appearing for the appellant in LPA No.536/2016 that the learned Single Judge should not have interfered with the admission process at the instance of the petitioner in W.P.(C) No.7813/2016 since there was a long delay in approaching this Court. It is also contended that the conduct of the writ petitioners in approaching this court after taking part in the admission process has disentitled them for any relief. In support of his submission, the learned Senior Counsel relied upon the decisions of this Court in W.P.(C) No.4594/2013 titled Hridaya Bhushan & Ors. vs. Netaji Subhash Institute of Technology & Anr. decided on 24.07.2013 and W.P.(C) No.6671/2015 titled Ayushi vs. DTU & Ors. decided on 23.07.2015. The further contention is that the writ petition is bad for non- joinder of necessary parties since the appellant who was placed above the writ petitioners in the list of eligible candidates dated 27.08.2016 was not made a party to the writ petition. It is pointed out that Kendriya Sainik Board, Ministry of Defence was also not made a party despite the fact that the reservation for the defence category was provided as per the guidelines LPA Nos.536 & 539 of 2016 Page 9 of 16 of Kendriya Sainik Board. Placing reliance upon Ayushi vs. DTU & Ors. (Supra), it is submitted that no interpretation of any clause of guidelines issued by the Ministry is possible in their absence.\n22. On merits of the case, it is contended by the learned Senior Counsel for the appellant that the University being an autonomous educational body is not bound to provide the reservation as recommended by the Kendriya Sainik Board, Ministry of Defence. Drawing the attention of this Court to the decision of a coordinate Bench in LPA No.786/2010 dated 12.11.2010 titled Delhi Technological University vs. Sukhanshu Singh & Anr., it is submitted that the learned Single Judge should not have held that the recommendations are binding on the University.\n23. Placing much reliance upon the affidavit filed on behalf of Kendriya Sainik Board, Ministry of Defence (which has been made party to LPA No.536/2016 as respondent No.1) stating that the Circular dated 17.02.2015 relied upon by the learned Single Judge has nothing to do with 5% seats reserved under CW Category, it is also contended by Sh.Atul Nanda, the learned Senior Counsel that having regard to the stand taken by Kendriya Sainik Board, the impugned directions of the learned Single Judge are liable to be set aside.\n24. The further contention is that the action of the University in changing the criteria for admission/reservation specified in the Bulletin of Information after commencing the admission process is illegal. In support of the said submission, the learned Senior Counsel relied upon the decision dated 29.10.2014 in LPA No.679/2014 titled Siddharth Singh v. Vice Chancellor, Delhi University & Ors. wherein it was held that such a change cannot be allowed to adversely affect a candidate who applied based on the language LPA Nos.536 & 539 of 2016 Page 10 of 16 of the Prospectus. Reliance has also been placed upon the decision in Mamata Bansal v. State of Punjab; 2002 (1) ILR Punjab and Haryana 558 wherein a Government notification which altered the criteria for the reserved candidates during the counselling process was struck down by a Division Bench of the Punjab & Haryana High Court.\n25. Reiterating the above contentions, it is further contended by Shri Himanshu Sharma, the learned counsel appearing for the appellants in LPA No.539/2016 that the admission against the reservation of 5% seats under Clause 3(E) of the Information Bulletin is not governed by the priorities specified by Kendriya Sainik Board. It is contended that the guidelines of Kendriya Sainik Board are meant for making admission against the Central seats of MBBS/BDS which are released by the Ministry of Health & Family Welfare to Kendriya Sainik Board and the same cannot be made applicable to Delhi University which is a State University.\n26. We have also heard Shri K.K. Sharma, the learned Senior Counsel appearing for the respondents No.3 to 5 in LPA No.536/2016 and the learned standing counsel for Central Government appearing for the Union of India.\n27. In DTU vs. Sukhanshu Singh (supra), the appellant University had made applicable the 5% reservation under CW Category only to the first five priorities out of the seven priorities specified in the circular issued by the Union of India, Ministry of Defence recommending reservations under that category. The Division Bench of this Court held that:\n\"In view of the above preceding analysis, we are of the considered opinion that there is no command or mandate to the present university to fill up 5% quota from all the seven categories. Therefore, no fault can be found with LPA Nos.536 & 539 of 2016 Page 11 of 16 the same. That apart, it is submitted by Mrs.Begum, that the academic council, after due deliberation and taking into consideration the hardship factors, has restricted it to the first five categories. Be that as it may, the learned Single Judge could not have treated the recommendations as a command and issued a writ of mandamus. Thus, we are unable to agree with the view taken by the learned Single Judge.\"\n28. There can be no dispute about the conclusion in the above decision that the recommendations of the Ministry of Defence cannot be treated as binding. However, in the case on hand, we are faced with a different question, i.e., whether the University, having accepted the recommendation for reservation under CW Category and having granted the reservation in terms thereof, can be allowed to amend or alter the categories as stipulated by Kendriya Sainik Board which in turn would result in enlarging/restricting the scope of the categories. In our considered opinion, the learned Single Judge had rightly held that though the classification of personnel in different categories would be within the domain of Kendriya Sainik Board and not the University, once the University decides to grant reservation to a particular category, then it cannot reclassify or alter the category.\n29. The further contention of the appellants that the priorities cannot be permitted to be altered midway by including the words „boarded out from service‟ is also untenable. As noticed above, the University did not contest the plea of the writ petitioner that the omission of the words „boarded out from service‟ from Priorities II & IV was not in tune with the circulars of the Ministry of Defence. It is also an admitted fact that except for the year 2015-16, the admissions under CW Category into MBBS/BDS were made by the University on the basis of Priorities II & IV of CW Category which LPA Nos.536 & 539 of 2016 Page 12 of 16 included the words „boarded out from service‟. Hence, the direction by the learned Single Judge to rectify such an error cannot be termed as changing the admission/reservation criteria. Hence, the contention that the criteria was altered after the commencement of the admission process is untenable.\n30. It is also relevant to note that the W.P.(C) No.7813/2016 was filed even before participating in the counselling. The tentative list of the eligible candidates under 5% reservation for CW Category was notified on 27.08.2016 and the writ petition was filed on 10.09.2016. It may be true that the names of the appellants were figured above the names of the writ petitioners in the tentative list of eligible candidates under CW Category, however the same does not create any legal right in their favour to claim admission under the CW Category. We are, therefore, unable to hold that the order under appeal suffered from any legal infirmity. Hence, the same does not warrant interference by us.\n31. However, a fresh issue, which was neither considered nor decided by the learned Single Judge, is sought to be raised by the learned counsel for the appellants on the basis of the short affidavit filed on behalf of the Government of India, Ministry of Defence (arrayed as respondent No.1 to LPA No.536/2016).\n32. In the said affidavit dated 04.10.2016 deposed by the Secretary, Kendriya Sainik Board, Ministry of Defence it is pleaded that Kendriya Sainik Board is the Apex body of the Government of India to look after rehabilitation and welfare of ex-servicemen and their dependents and that it is the nodal agency for allotting the seats allocated to it by the Ministry of Health and Family Welfare. It is further stated that for admission to the said seats released by the Ministry of Health and Family Welfare to Kendriya LPA Nos.536 & 539 of 2016 Page 13 of 16 Sainik Board, five priorities were stipulated by Kendriya Sainik Board by letter dated 14.05.1992 and subsequently by letter dated 17.02.2015 two more priorities were added for filling up the said seats released by Ministry of Health and Family Welfare. While seeking to draw a distinction between the seats so released by the Ministry of Health and Family Welfare to Kendriya Sainik Board and the 5% seats reserved under Clause 3(E) of the Information Bulletin issued by the Delhi University, it is further pleaded that the priorities mentioned in the letter dated 17.02.2015 are meant for admission against the seats released by the Ministry of Health and Family Welfare only. It is also sought to be contended that the order of priorities for admission of candidates under CW Category have been laid down by the Ministry of Defence vide letter dated 03.06.1994.\n33. On behalf of the Ministry of Health and Family Welfare (arrayed as respondent No.6 to LPA No.536/2016) also a short affidavit has been filed by the concerned Under Secretary stating that three candidates who are covered under CW Category (Priority-V) made a representation dated 31.08.2016 to the Ministry of Health and Family Welfare stating that the University of Delhi in its Information Bulletin for the Academic Session 2016-17 had erroneously omitted the words \"boarded out\" and the said representation was forwarded to the University of Delhi vide letter dated 31.08.2016 requesting them to follow the eligibility criteria laid down by the Ministry of Defence which is as under:\n\"(i) Priority ii - Disabled in action and Boarded out from service with disability attributable to military service.\n(ii) Priority iv - Disabled in service and Boarded out with disability attributable to military service.\"\nLPA Nos.536 & 539 of 2016 Page 14 of 16\n34. On a perusal of the affidavits filed on behalf of the respondent Nos.1 and 6, there appears to be certain ambiguity with regard to the priorities to be followed for reservation under clause 3(D) and clause 3(E) of the Information Bulletin. The University does not appear to have addressed the said issue till date. However, the fact remains that the University has been consistently providing the 5% reservation under CW Category on the basis of the Priorities-II and IV which included the words „boarded out from service‟. Though the said words were not included in Priorities-II and IV for the Academic Session 2014-15, the same were inserted subsequently by issuing a corrigendum. Before the learned Single Judge and also before us, the Delhi University maintained the stand that the said priorities are applicable to the wards of the personnel who left the service. In fact, the admissions have already been made under CW Category on the basis of the Priorities-II and IV containing the words „boarded out from service‟. We have also taken note of the fact that in the meeting held on 09.09.2016, the eligibility of the candidates under CW Category of Delhi University was scrutinized by the nominees of the Ministry of Defence and Kendriya Sainik Board on the basis of the Priorities-II and IV which contained the words „boarded out from service‟. In these circumstances, we decline to express any opinion on the contention of the appellants that different priorities have been fixed by Kendriya Sainik Board for the purpose of reservation provided under Clause 3(D) and Clause 3(E) of the Information Bulletin.\n35. However, we direct that the University shall deliberate on the said issue in consultation with the Kendriya Sainik Board, Ministry of Defence and Ministry of Health and Family Welfare and take an appropriate decision LPA Nos.536 & 539 of 2016 Page 15 of 16 within eight weeks from today so as to avoid similar controversies in future for implementation of the reservations provided under Clause 3(D) and Clause 3(E) of the Information Bulletin.\n36. Appeals are accordingly disposed of. All pending applications shall also stand disposed of.\nCHIEF JUSTICE SANGITA DHINGRA SEHGAL, J OCTOBER 26, 2016 kks LPA Nos.536 & 539 of 2016 Page 16 of 16", "url": "https://indiankanoon.org/doc/150192160/", "label": 2}