{"authors": [], "date_download": "2019-03-27 13:59:45", "date_modify": "2019-03-27 13:59:45", "date_publish": "2017-09-16 19:54:44", "description": "RSS, Bajrang Dal, VHP should not try to disturb peace in WB:", "filename": "fyi_story_rss-bajrang-dal-vhp-should-not-try-to-disturb-peace-in-wb-1046210-2017-09-16_1553695185.html", "image_url": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/201709/647mamata_091617074216.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/indiatoday.in/fyi_story_rss-bajrang-dal-vhp-should-not-try-to-disturb-peace-in-wb-1046210-2017-09-16_1553695185.html", "title": "Do not play with fire: Mamata Banerjee warns RSS, VHP against disturbing peace during Durga Puja", "title_page": "Do not play with fire: Mamata Banerjee warns RSS, VHP against disturbing peace during Durga Puja - FYI News", "title_rss": "NULL", "source_domain": "indiatoday.in", "text": "Chief Minister Mamata Banerjee has warned the RSS, Bajrang Dal and VHP to not disturb peace in West Bengal during Durga Puja, saying that they 'should not play with fire'.\n\"There is misinformation campaign by certain outfits that we are stopping Vijaya Dashami celebrations at puja pandals and households,\" Mamata Banerjee said, stating that the West Bengal government did not put any curb on celebration of Vijaya Dashami rituals.\nShe said that the RSS, VHP and Bajrang Dal 'should not try to disturb peace and play with fire', adding that Durga Puja had been traditionally celebrated with amity in Bengal where lakhs of people hit the streets.\n\"What we had said is on the day of ekadashi on October one there will be no immersions. Muharram, which is an occasion of mourning by the Muslim community, falls on the same date. Immersion will resume as usual from October two to four,\" she told reporters at the state secretariat.\n\"Women will put sindoor on each other and Vijaya Dashami rituals will be observed as usual. Those having no inkling about Durga Puja and Kali Puja celebrations in Bengal are spreading all sorts of rumours,\" she said.\nDO NOT PLAY WITH FIRE, SAYS MAMATA BANERJEE\nMamata Banerjee said that her government was determined to maintain peace and harmony during the coming Durga Puja festival.\n\"If someone tries to disrupt peace, the administration will take stern action,\" she said, adding that \"BJP should not do politics using CBI, ED and foment riots\".\nThe chief minister also said that police had recently arrested two people involved with BJP for trying to create communal problem at a place in West Bengal. She said that her administration would not allow any procession in the state with arms on the day of immersion.\n\"This is illegal and such processions have not been Bengals tradition and we will not allow it to take place. The administration will take strong action if there was any attempt to take out such procession,\" Mamata Banerjee said.\nShe also urged members of the Muslim community to peacefully take out their procession during Muharram.\nThe state government had told the court that it has allowed immersion of Durga idols on Vijaya Dashami day till 10 pm to ensure law and order.\nWith inputs from PTI", "url": "https://www.indiatoday.in/fyi/story/rss-bajrang-dal-vhp-should-not-try-to-disturb-peace-in-wb-1046210-2017-09-16", "label": 2}