{"authors": ["Faizan Mustafa"], "date_download": "2019-03-27 14:00:14", "date_modify": "2019-03-27 14:00:14", "date_publish": "2015-03-04 00:00:00", "description": "The presidential assent to a long-pending Maharashtra Bill on cow slaughter will lead to livelihood loss for thousands of people.", "filename": "ht-view_the-beef-ban-leaves-a-bad-taste-in-the-mouth_story-m4iT057zxXIPYdZaZYRQwO_1553695214.html", "image_url": "https://www.hindustantimes.com/rf/image_size_640x362/HT/p1/2015/03/04/Incoming/Pictures/1323191_Wallpaper2.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/hindustantimes.com/ht-view_the-beef-ban-leaves-a-bad-taste-in-the-mouth_story-m4iT057zxXIPYdZaZYRQwO_1553695214.html", "title": "The beef ban leaves a bad taste in the mouth", "title_page": "\nThe beef ban leaves a bad taste in the mouth\n | ht view | Hindustan Times", "title_rss": "NULL", "source_domain": "hindustantimes.com", "text": "The presidential assent to a long-pending Maharashtra Bill on cow slaughter will lead to livelihood loss for thousands of people.\nThe ruling BJP’s position is quite clear. Its manifesto for the Haryana elections had promised a law to stop cow slaughter in the state.\n“The slaughter of cow would be considered equal to murder of a person,” said Ganeshi Lal, chairman of the manifesto committee. Prime Minister Narendra Modi too talked of a ‘pink revolution’ during the run-up to the Lok Sabha elections.\nIndia today is the world’s top beef exporter, second only to Brazil. This is legal as the buffalo is not a sacred animal. Beef worth $29 million was exported in 2012-13.\nIn BJP-ruled Gujarat, meat export has doubled in the last decade and it is among India’s top 10 states with slaughterhouses. No subsidy is given to meat exporters. The Supreme Court in 2007 had refused to ban cow slaughter on the grounds that it is a policy matter and it is for the government to take a decision.\nA few years ago Justice ML Kaul of the Punjab and Haryana High Court had observed that the penalty for cow slaughter must be enhanced. Expressing concern that cow slaughter entailed an imprisonment of five years, the judge said it should be treated on a par with murder, with 14 years’ rigorous imprisonment.\nIn the Constituent Assembly, some members wanted a ban while others were in favour of partial prohibition.\nRaghu Vira argued that in our civilisation Brahma-Hatya and Go-Hatya were on a par. He went on to say, “(The) cow is the mother of the individual, she is the mother of the nation.”\nIt is interesting to note that Muslim members too made a forceful case for the inclusion of cow slaughter in the fundamental rights chapter of the Constitution.\nA historical fact not often referred to is that most of the Muslim rulers of India did in fact ban cow slaughter even during Bakrid, keeping in mind Hindu sentiments.\nThe British government lifted this ban. During Muslim rule, only 20,000 cows were slaughtered a year but the British were killing approximately 30,000 a day.\nThe British established India’s first slaughterhouse in 1761. The cow protection movement of 1880-94 was basically directed against the British and Muslims actively participated in it. The recent Deoband fatwa banning cow slaughter received little media attention.\nAfter Independence the government of India did send a note to all states, asking them to avoid a ban on cow slaughter because it would lead to great economic loss, particularly to the leather industry.\nHowever, several states have enacted laws imposing restrictions on the slaughter of animals, including a ban on the slaughter of cows. Some of these laws did come under court scrutiny and almost all of them were pronounced constitutional.\nCertain questions regarding these decisions still remain unresolved. One such vital issue is whether these decisions are sound pronouncements of law if examined from the perspective of freedom of religion guaranteed to the Muslims of India by the Constitution.\nConstitutionally speaking, between the directive principle of prohibition on cow slaughter and the fundamental right to religion, it is the latter that is more important and shall prevail.\nIn 1958, it was held by the Supreme Court that cow slaughter was not an essential Islamic practice as Islam did not mandate Muslims to slaughter cows. But then why did no one ever raise the question about the status of cows under Hinduism?\nBeef-eating was common in the Vedic and subsequent times even among Brahmins. It was probably for this reason only that the Vajpayee government’s draft Bill on cow slaughter justified the enactment of the law on grounds of cruelty to animals and not on religion.\nFaizan Mustafa is vice-chancellor, NALSAR University of Law, Hyderabad\nThe views expressed by the author are personal\nFirst Published: Mar 12, 2015 21:24 IST", "url": "https://www.hindustantimes.com/ht-view/the-beef-ban-leaves-a-bad-taste-in-the-mouth/story-m4iT057zxXIPYdZaZYRQwO.html", "label": 2}