{"authors": [], "date_download": "2019-03-27 14:00:19", "date_modify": "2019-03-27 14:00:19", "date_publish": "2016-09-03 17:13:12", "description": "The line between political vendetta and the assertion that law will take its own course is often non-existent. The person at the receiving end will cry vendetta while law takes its own course, with or without a little push from political rivals. So when Prime Minister Narendra Modi mentions both in one breath it calls for critical consideration.", "filename": "india_yes-prime-minister-law-must-take-its-own-course-but-impartiality-is-critical-2989574_1553695219.html", "image_url": "https://images.firstpost.com/wp-content/uploads/2016/06/Narendra_Modi_AFP1.jpg", "language": null, "localpath": "/home/raj/news-please-repo//data/2019/03/27/firstpost.com/india_yes-prime-minister-law-must-take-its-own-course-but-impartiality-is-critical-2989574_1553695219.html", "title": "Yes Prime Minister, law must take its own course, but impartiality is critical", "title_page": "Yes Prime Minister, law must take its own course, but impartiality is critical - Firstpost", "title_rss": "NULL", "source_domain": "firstpost.com", "text": "The line between political vendetta and the assertion that law will take its own course is often non-existent. The person at the receiving end will cry vendetta while law takes its own course, with or without a little push from political rivals. So when Prime Minister Narendra Modi mentions both in one breath it calls for critical consideration.\n“...History is testimony to the fact that I have never opened any file due to political considerations. The government has given no instruction to open any file. The law will take its own course...” said Prime Minister Narendra Modi in an interview with Rahul Joshi, group editor of Network18. Watch the full interview here.\nNow, are the probes in Robert Vadra’s land deal in Haryana, CBI raids on Virbhadra Singh and the Enforcement Directorate case against Shankersinh Vaghela examples of political vendetta? It depends which side of the fence you are on. Our political class has endowed itself with a sense of immunity. The unwritten arrangement is that all acts of omission and commission of predecessors will be swept under the carpet. This is cynical politics at its worst. Modi, in the run-up to the 2014 elections, had promised to change the obnoxious arrangement.\nIt takes some courage to open old files. One risks creating enemies and losing friends in political and other circles. If Narendra Modi’s government has decided to take the risk, then he has no reason to be defensive about it. Dealing with corruption cannot be a matter of political convenience and expediency. The prime minister has the unique advantage of being an outsider in Delhi’s political equations; if he cannot bring in the change nobody can.\nHowever, law taking its own course assumes the look of vendetta when cases are milked for political purpose. For example, if the Robert Vadra matter is allowed to linger just to gain political brownie points, then it becomes vendetta. There is growing suspicion that this is the case here. In the high profile defence deals such as AgustaWestland not much progress has been made despite the massive political noise. In fact, we have not seen much progress beyond the media noise in most of such cases. Modi would be doing a great service to the nation if he helped early conclusion in such cases through institutional efficiency.\nThere’s an impression that under the current dispensation the fight against corruption is selective, the targets mostly being those not in the good books of the BJP leadership. The Congress, in particular, has been crying foul since it has been at the receiving end. The party would like to link it to the BJP’s call for a Congress-mukt Bharat. There’s could be some truth in Congress’s allegation. There has been no headway in the big-ticket scams such as Vyapam in Madhya Pradesh and everyone has gone silent about the Lalit Modi matter. One does not hear of CBI and ED raids on those close to the BJP.\nIf that really is the case then the prime minister must give it a closer look. He could be inadvertently replacing one kind of cynical politics with another. It never hurts if the corrupt are brought to book, but if it means punishing one set and sparing the other then it becomes morally untenable.\nFirstpost is now on WhatsApp. For the latest analysis, commentary and news updates, sign up for our WhatsApp services. Just go to Firstpost.com/Whatsapp and hit the Subscribe button.", "url": "https://www.firstpost.com/india/yes-prime-minister-law-must-take-its-own-course-but-impartiality-is-critical-2989574.html", "label": 2}