{"authors": [], "date_download": "2019-03-27 14:00:21", "date_modify": "2019-03-27 14:00:21", "date_publish": "2017-10-07 17:37:33", "description": "The Punjab and Haryana High Court has granted interim bail to the owners of Ryan International School in Pradyuman murder case.", "filename": "india_story_pradyuman-murder-case-ryan-international-owners-interim-bail-security-lapses-1059833-2017-10-07_1553695221.html", "image_url": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/201710/pradyuman-story-647_091517054004_100717052954.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/indiatoday.in/india_story_pradyuman-murder-case-ryan-international-owners-interim-bail-security-lapses-1059833-2017-10-07_1553695221.html", "title": "Pradyuman case: Ryan owners get bail till December 5, school denies security lapses", "title_page": "Pradyuman case: Ryan owners get bail till December 5, school denies security lapses - India News", "title_rss": "NULL", "source_domain": "indiatoday.in", "text": "The Punjab and Haryana High Court today granted big relief to the owners of the Ryan International School in Pradyuman Thakur murder case.\nPradyuman Thakur, a class-II student of the high-profile school's Gurgaon campus, was murdered by slitting his throat by a sharp-edged weapon on the morning of September 8. The Haryana police said that he was killed by 42-year-old bus conductor Ashok Kumar inside the toilet as the boy resisted a bid to sodomise him.\nThe Ryan International group of schools is run by AF Pinto, his wife Grace Pinto and son Ryan. The Pinto family was today granted interim bail after they told the Punjab and Haryana High Court that they would join investigation.\nCounsel for the victim's family S Tekriwal said, \"Interim bail to Pintos was granted on certain conditions. They can't leave country and they will also have to join investigation when needed.\" The CBI, which is probing the Pradyuman murder case, opposed their bail plea in the court.\nThe high court also granted bail to Jeyus and Francis Thomas two senior officials of the Ryan International management. They had been arrested by the Haryana police after initial probe indicates lapses on their part. Earlier, Justice AB Choudhary of the Punjab and Haryana High Court had recused himself from hearing the bail petition of the Pinto family saying that he personally knew them.\nRYAN DENIES LAPSES IN SECURITY\nMeanwhile, the Ryan International School has denied that there were any lapses on its part that led to the killing of Pradyuman Thakur a month ago.\nThe Ryan International has sent its reply to the Central Board of Secondary Education (CBSE) refuting the charges mentioned in the show-cause notice in connection Pradyuman murder case.\nIn its response, the CBSE asserted that no compromise was made in regard with security arrangements. The CBSE had served a notice to the Ryan International School on September 16 seeking an explanation as to why its affiliation should not be revoked.\nBUT, CBSE DIFFERS\nThe CBSE, in its affidavit to the Supreme Court, had stated on Thursday that the Bhondsi, Gurgaon branch of the Ryan International School, where Pradyuman was killed, didn't have adequate number of CCTV cameras.\nThe CBSE also told the Supreme Court that some of the CCTV cameras were not working when it conducted an inspection. The CBSE further told the Supreme Court that electric panels were found open inside the school campus posing serious threat to the lives of children.\nThe CBSE had set up a fact finding committee, in its response to the plea filed by victim's father in the Supreme Court, to probe the incident. The committee concluded that there were \"severe irregularities and security lapses\" in the school premises.\n\"Yes, this incident has happened due to the negligence of the school authority as no provision of toilets/washrooms for drivers and conductors/cleaners who are involved in plying of buses could be found separately in the school premises which indicate that they were using the facilities meant for the students and the staff,\" the CBSE said in the affidavit.", "url": "https://www.indiatoday.in/india/story/pradyuman-murder-case-ryan-international-owners-interim-bail-security-lapses-1059833-2017-10-07", "label": 2}