{"authors": [], "date_download": "2019-03-27 14:00:03", "date_modify": "2019-03-27 14:00:03", "date_publish": "2017-07-15 18:22:17", "description": "Bazaz was a Kashmiri Pandit who backed Kashmir’s right to self-determination. Revisiting his legacy to mark his 112th birth anniversary", "filename": "india-news_pandit-prem-nath_cf147a88e858595f8456a38458ce617e_story-MXcRZoUTA3kcJcf3pseGTK_1553695203.html", "image_url": "https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2017/07/16/Pictures/_ee0196e4-69e2-11e7-ae46-9bfe7bf72e96.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/hindustantimes.com/india-news_pandit-prem-nath_cf147a88e858595f8456a38458ce617e_story-MXcRZoUTA3kcJcf3pseGTK_1553695203.html", "title": "Pandit Prem Nath Bazaz - a misunderstood and revolutionary Kashmiri Pandit", "title_page": "Pandit Prem Nath Bazaz - a misunderstood and revolutionary Kashmiri Pandit  | india news | Hindustan Times", "title_rss": "NULL", "source_domain": "hindustantimes.com", "text": "Like many Kashmiri Pandits, Sanjay Tickoo, a Srinagar businessman, is imprisoned by the history of his state, the ambivalent positions of its leaders, and his own paranoia of being a member of a minority community with a dominant past. Yet, in the mass exodus of the ’90s in which 34 Pandit families of his locality left Kashmir, his didn’t. In fact, he “still believes that by instinct, the Kashmiri Muslim is a secular person”. That Tickoo can say this is not simply magnanimity. Behind this outlook of his lies an almost forgotten history of a robust secular tradition. And over this tradition looms large the shadow of a man who symbolised it; almost perfectly one could say. That man was Prem Nath Bazaz, a committed progressive Kashmiri Pandit.\nThe story of Bazaz’s life is intimately entwined with the modern history of that secular tradition – at times referred to, a tad offhandedly, as ‘Kashmiriyat’ – and its vicissitudes. So, to tell his story is to also recall the history of that tradition, and its forgetting.\nSanjay Tickoo, president of the Kashmiri Pandit Sangharsh Samiti at his home in Srinagar. ( Burhaan Kinu / HT Photo )\nKashmiri Pandits have a past that is as invisible as it is visible. An influential minority in the Dogra Hindu kingdom (they occupied all major jobs in the king’s administration and revenue departments), some of them were social reformers attacking orthodoxies in religion. They took active part in the politics of the day. And one of them even took the unconventional step of forging a common platform with Kashmiri Muslims to try to build a fair society.\nBazaz, a small-time government official and a writer, was the man who took that initiative to bring the Yuvak Sabha, a predominantly Kashmiri Pandit outfit in the princely state of Jammu and Kashmir of the ’30s, to a working relationship with the Muslim Conference, Kashmir’s first political party, after the 1931 anti-Dogra uprising in which Muslims protesting age-old social inequalities were massacred. (22 men died in the uprising.) Bazaz was the confidant and comrade of Sheikh Abdullah, Kashmir’s first mass leader, and was a champion of Kashmiris’ right to self-determination, a stand unthinkable for Kashmiri Pandits today, and for most of mainland India.\nClearly, this ‘Kashmiryat’ was as much about politics as it was about culture. Its ground was laid through the ’30s and ’40s when the first cracks in the Dogra kingdom were emerging as a result of the mobilisation of Kashmiri Muslims led by Sheikh Abdullah.\nPragmatic Kashmiri Pandits like Prem Nath Bazaz (along with other Pandits such as Kashyap Bandhu, Shamlal Saraf, Jia Lal Kilam) realised the end of Dogra rule was near and set about building a common platform with Abdullah and his movement, the Muslim Conference (the predecessor of the National Conference or the NC). By working with them, people like Bazaz also came to terms with their own history of past privileges and understood the urgency of Muslims’ need to ease out the monarchy.\nBhushan Bazaz, Prem Nath Bazaz’s son at his home in Delhi. After Sheikh Abdullah came to power in Kashmir in 1947, Bazaz was externed to Delhi . ( Saumya Khandelwal / HT Photo )\nKashmiri Pandits and Kashmiri Muslims share no collective socio-political project now. Its potential was finished off by the Pandit exodus of the ’90s when, according to Kashmiri Muslims themselves, the “best of them left”. Pandits like Tickoo, not surprisingly, remember Bazaz only as the man who turned his back on his own community. Before a fact-finding commission set up after the anti-Dogra uprising in 1931, Bazaz had upheld the reality of Muslim grievances even when that would diminish the case and privileges of his own community. After Partition in 1947 he went on to back plebiscite and independence”.\nControversial from the start\nFor Kashmiri Muslims too, Bazaz’s positions then and now, are filtered by his eventual parting of ways with the NC and personal differences with Abdullah. They say he also influenced the changing of the name of Kashmir’s first mass party – from the Muslim Conference to the National Conference, a momentous event in Kashmir’s history. This change of denomination, Kashmiris say, had a fallout for which Bazaz cannot escape blame.\nMohammad Yousuf Taing, biographer of Sheikh Abdullah, says Bazaz was a great intellectual. He persuaded Sheikh Abdullah to honour Bazaz as a fellow of the Kashmir Academy of Art and Culture in the ’70s. ( Burhaan Kinu / HT Photo )\nMehmood ur Rashid, columnist, Greater Kashmir, says the emergence of the Muslim Conference was part of a larger political awakening of Muslims in the subcontinent. “By dropping the word ‘Muslim’, the DNA of the movement was changed ’40s onwards. It’s as if the documents of the property were changed and these secular/Islamic binaries have remained at the core of Kashmir’s politics as a whole. It gives people the chance to raise the fiction of the rise in Kashmir now of Salafi Islam over Sufi Islam as if the former is bad Islam and the latter good. But the reality is that Sufis too had always questioned power. They were great diplomats, they just did it skillfully. There is more in common with both Islams than is generally known.” Bazaz, Rashid seems to suggest, should have known better than to influence Abdullah to impose a secular grid on a national liberation struggle at a time when it could have mobilised itself on the strength of the majority religion.\nWithout Bazaz, would Abdullah have adopted a different path? Mohammad Yousuf Taing, biographer of Abdullah, an NC man, who also knew Bazaz well, says one shouldn’t second-guess men of history. “You don’t know what is in people’s hearts. In history, you go by records,” says he, while steering the conversation to that part of the story where Bazaz was beaten up by fellow Pandits after he deposed in the fact-finding commission set up after the 1931 uprising to address public grievances.\n“Bazaz said the Muslim grievances were correct. Some Pandits urinated in his mouth! He had to leave his home and move into another neighbourhood in Srinagar, at Amirakadal,” he adds. This displacement gave Bazaz a unique identity, bringing him into the vortex of the state’s politics. It gave him a new audience. And he came to be seen as a man of interest in the eyes of both Kashmir’s and India’s nationalists around the time of the buildup to India’s independence.\nJawaharlal Nehru addressing a meeting in Srinagar in 1947 with Sheikh Abdullah (L) by his side. ( HT Photo )\nNC old-timers, however, slip in that “Bazaz was writing letters to Nehru and Gandhi.” The suggestion is that he was a Congress informant, a perception that contradicted his public statements of conducting Kashmir and India’s respective freedom struggles “independent” of the other. The diaries maintained by his son Bhushan in Delhi, Bazaz, however, show how Bazaz saw this. Sometimes, he also refers to himself in the third person! He was clearly self-conscious of his role in history-making and saw himself criss-crossing both worlds -- he saw himself as the man who “cleared many misunderstandings” about Abdullah, that the anti-Dogra uprising was not a communal one, and that he had vouched for the secular credentials of Abdullah to Nehru.\n“Nehru also offered father one of the two general secretaryships of the States People’s Conference that the former headed. He declined saying he had work in Kashmir,” says Bhushan.\n“Sheikh Abdullah and Bazaz completely differed on the subject of Accession,” says Dr Farooq Abdullah, Sheikh’s son and a former chief minister of Jammu and Kashmir in Srinagar. ( Burhaan Kinu / HT Photo )\nThe ‘idea’ of Bazaz\nLike all years, this year too, Kashmir commemorated the 86th anniversary of Martyrs Day, on July 13, the date of the massacre of Kashmiris in the anti-Dogra uprising. Coincidentally, Bazaz’s 112th birthday also falls on the same date. Bazaz’s invisibility in official or popular memory is tied to an existential question that is relevant in Kashmir even today. It can be asked by one Muslim to another should they differ on the mode of the struggle, or simply while making sense of the conflict. It can be posed by a Pandit to a fellow Pandit not living in the Valley or by a Muslim to a Pandit, or vice-versa.\nAnd that question is simply this: If you are one of us, why are you with them? Or, since you are one of them, can you really be one of us? Ideas of a catholic politics – one that is open to all, and open for negotiation – like Bazaz’s, are suspect at all times. People like him are always out of place.\nTickoo fleshes out what he understands by ‘us’ and ‘them.’: “It is not the Jamaat or Hurriyat that branded us Hindus/Indians in the Kashmiri Muslims’ eyes. It was the RSS. And its activities in the Valley. Television too.” Dr Sameer Kaul, a Pandit who is with the NC, says even in the time of Bazaz and Abdullah, Pandits “didn’t have the numbers but we had say….That has been lost over the years as Pandits responding to changes in the Valley clung to religion and allowed the tragedy of the exodus to shape their lives.”\nSeparatist leader Mirwaiz Umar Farooq (centre). Farooq maintains close relations with Bazaz’s family in Delhi. ( Waseem Andrabi / HT Photo )\nOn the move\nBazaz wasn’t a man to be put off by roadblocks, personal or political. He joined organisations, left them, and put up others. A follower of the Communist-turned-Radical Humanist MN Roy after he left the NC in the ’40s, he built his politics and a milieu of like-minded people around his journals. Most got him into trouble. (Bazaz’s daily, Vitasta, started in 1932, was, in fact, Kashmir’s first newspaper.) Abdullah was unhappy with him for giving space to his opponents like Mirwaiz Yusuf Shah (the great-grand uncle of the present Mirwaiz, Umer Farooq) in Hamdard, the paper they jointly edited in the ’30s. When Abdullah was jailed by the Congress government in the ’50s, Bazaz, despite his fallout with the NC leader, published a booklet in his defence, Sheikh Abdullah-What is his crime?\nNehru replies to Bazaz’s letter: “You wrote to me about the accession of the state not being complete...It is complete.” ( Saumya Khandelwal / HT Photo )\nFlowing against the current – Bazaz simply didn’t know what that meant. In the ’60s, he was shooting off letters to Prime Minister Jawaharlal Nehru saying the “Accession of Kashmir to India was not complete”. His differences with Abdullah and his exile in Delhi – he was forbidden from entering Kashmir by the NC government for raising the issue of self-determination at periods inconvenient for the NC leader who himself vacillated on the issue – however changed Bazaz. He was “now willing” he wrote to Nehru, to work with Kashmiri Muslims to wean them to a position for Autonomy. But he kept raising the issue on Kashmir’s right to self-determination from time to time. On this point he would not budge.\nThe flip-flops of most Kashmiri leaders - Bazaz, Sheikh and the Mirwaiz included - is the story of a common Kashmiri under pressure to define his politics within and outside Kashmir, says academic Abir Bazaz of Haryana’s Ashoka University. “The pressure of politics forces a leader’s hand…. One wrong move and the movement suffers for years…or you can be made completely irrelevant. It can turn giants into dwarfs.”\nDual Identities\nPrem Nath Bazaz till the last remained a student of history. Like Rughonath Vaishnavi, another pro-freedom Kashmiri Pandit, Bazaz read the political awakening of Kashmiri Muslims as part of the community’s assertion in the subcontinent. He saw this assertion as a matter of right and their affiliation with Pakistan, and even their consideration of Pakistan as a post-colonial possibility, as natural.\nA Kashmiri who considered his regional identity to be on a par with his religious identity, Bazaz’s conception of a single society was one in which neither of the two communities would dominate the other, says Rashid. “The Kashmiri Pandit should not feel like an alien and the Kashmiri Muslim should not be a hegemon.”\nIt was from such a standpoint that Pakistan - or a Muslim-dominated discourse - did not seem an incompatible option to Bazaz, says Hurriyat Conference leader Mirwaiz Umer Farooq, who retains strong family ties with the Bazaz family even now. ‘Post-Plebiscite’, should Kashmir choose Pakistan, Bazaz never made clear if he would join it, but he stood for the right of Kashmiris to exercise that choice. “His views were that if Kashmir was to remain with India it should be out of choice not compulsion and that the democratic institutions should be allowed to run,” says the Mirwaiz. “India needs to ask itself whether it has increased that capability or shrunk it.”\nBazaz and Sheikh’s story shows that it was not inevitable that a Kashmiri Pandit would take an unambiguous pro-India position while a Kashmiri Muslim would take a pro-Pakistani one.\nHis achievement is that he represented the possibility of thinking a new politics across positions, points out Abir Bazaz. The question is: does Kashmir, in its most fraught period, need him now?\nFirst Published: Jul 15, 2017 18:22 IST", "url": "https://www.hindustantimes.com/india-news/pandit-prem-nath-bazaz-a-misunderstood-and-revolutionary-kashmiri-pandit/story-MXcRZoUTA3kcJcf3pseGTK.html", "label": 2}