{"authors": [], "date_download": "2019-03-27 14:00:07", "date_modify": "2019-03-27 14:00:07", "date_publish": "2017-08-27 09:24:51", "description": "The district administration on Sunday relaxed the curfew for five hours in and around Dera Sacha Sauda headquarters in Sirsa, after restrictions were impos", "filename": "india_ram-rahim-convicted-curfew-relaxed-sirsa-as-violence-subsides-2530707_1553695207.html", "image_url": "https://www.oneindia.com/img/2017/08/pti8-25-2017-000019b-27-1503806056.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/oneindia.com/india_ram-rahim-convicted-curfew-relaxed-sirsa-as-violence-subsides-2530707_1553695207.html", "title": "Ram Rahim convicted: Curfew relaxed in Sirsa as violence subsides", "title_page": "Ram Rahim convicted: Curfew relaxed in Sirsa as violence subsides - Oneindia News", "title_rss": "NULL", "source_domain": "oneindia.com", "text": "Ram Rahim convicted: Curfew relaxed in Sirsa as violence subsides\nIndia\noi-Madhuri\nThe district administration on Sunday relaxed the curfew for five hours in and around Dera Sacha Sauda headquarters in Sirsa, after restrictions were imposed on August 24.\nThe curfew has been relaxed between 6 am to 11 am. Petrol pumps, shops and other commercial establishments were allowed to open in the area.\nAt present, prohibitory orders imposed in 11 of the 13 police districts in the national capital in the wake of the violence following the conviction of Dera Sacha Sauda chief Ram Rahim Singh will continue for now, police said on Saturday. The violence also spilled over into neighbouring Punjab, Rajasthan and Delhi. However, the day-to-day life of the citizens would not be affected.\nSection 144 was imposed in the entire city except for North and Central police districts on Friday night after multiple incidents of arson in the city following the conviction of the rape accused self-styled godman in Panchkula in Haryana.\nThe Haryana government sealed over 30 congregation centres of the Dera Sacha Sauda across the state even as it came under attack from the high court over Friday's violence that claimed 36 lives. The self-styled godman Gurmeet Ram Rahim Singh, who is now prisoner number 1997 in Sunaria jail's 'approval cell' in Rohtak spent his first night by roaming inside the cell till midnight.\nOneIndia News", "url": "https://www.oneindia.com/india/ram-rahim-convicted-curfew-relaxed-sirsa-as-violence-subsides-2530707.html", "label": 2}