{"authors": [], "date_download": "2019-03-27 13:59:56", "date_modify": "2019-03-27 13:59:56", "date_publish": "2017-03-27 00:00:00", "description": "Delhi Police on Friday arrested two Kashmiri students from Punjab who were involved in hacking over 500 Indian websites, including those of the government, police said.", "filename": "india-news_2-kashmiri-students-held-for-hacking-500-indian-websites-1844024_1553695196.html", "image_url": "https://i.ndtvimg.com/i/2017-03/police-generic_650x400_51489747586.jpg", "language": null, "localpath": "/home/raj/news-please-repo//data/2019/03/27/ndtv.com/india-news_2-kashmiri-students-held-for-hacking-500-indian-websites-1844024_1553695196.html", "title": "2 Kashmiri Students Held For Hacking 500 Indian Websites", "title_page": "2 Kashmiri Students Held For Hacking 500 Indian Websites", "title_rss": "NULL", "source_domain": "ndtv.com", "text": "Police said the students were involved in the hacking over 500 Indian websites. (File photo)\nDelhi Police on Friday arrested two Kashmiri students from Punjab who were involved in hacking over 500 Indian websites, including those of the government, police said.The accused have been identified as Shahid Malla, a CSE student at Aryan Group of College in Punjab's Rajpura and Adil Hussain Teli, a BCA final year student at St Soldiers Management and Technical Institute in Jalandhar.They are natives of Baramulla and Anantnag districts of Jammu and Kashmir.\"Following a tip-off, Shahid Malla and Adil Hussain Teli were arrested on Friday when a team of Cyber Cell of Delhi Police raided their rented accommodation in Punjab,\" a senior police officer told IANS on the condition of anonymity.\"During investigation, it was found that their online activities were part of anti-national hacking group called 'Team Hackers Third Eye' which has hacked more than 500 Indian websites, including some government websites,\" the officer said.The officer said the accused were also involved in educating Kashmiri youth to bypass state-imposed social media ban during April and May in 2017 by using VPN.\"During investigation, they were found continuously in touch with several Pakistani-based anti-Indian hackers while hacking the websites and sharing the personal information of government websites with them. Some of them are believed to be backed by Pakistani intelligence agencies,\" he added.\"Through their seditious social media posts, Malla and Teli were found to be pro-Pakistan and anti-India,\" the officer said, adding that some laptops, mobile phones, SIM cards, Internet dongles, memory devices and other instruments were recovered from their rooms.The officer said the team was trying to ascertain their further plan and also their source of money. \"The probe in underway.\"\nGet the latest election news, live updates and election schedule for Lok Sabha Elections 2019 on ndtv.com/elections. Like us on Facebook or follow us on Twitter and Instagram for updates from each of the 543 parliamentary seats for the 2019 Indian general elections.", "url": "https://www.ndtv.com/india-news/2-kashmiri-students-held-for-hacking-500-indian-websites-1844024", "label": 2}