{"authors": [], "date_download": "2019-03-27 14:00:07", "date_modify": "2019-03-27 14:00:07", "date_publish": "2016-05-23 00:00:00", "description": "Haryana chief minister on Sunday ruled out political vendetta behind the central Bureau of Investigation (CBI) raids at 16 places in Haryana, Chandigarh and Delhi in connection with the alleged irregularities in allotment of 14 industrial plots by the previous Bhupinder Singh Hooda-led Congress government in Haryana.", "filename": "india_industrial-plot-allot_b6fba6f5978b3ee6e04b8cefe53cbd53_story-oJdy0goUng7pbAcufFEEAJ_1553695207.html", "image_url": "https://www.hindustantimes.com/rf/image_size_640x362/HT/p2/2016/05/23/Pictures/jpeg_46e5863a-20a6-11e6-aecf-2639299c9bfb.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/hindustantimes.com/india_industrial-plot-allot_b6fba6f5978b3ee6e04b8cefe53cbd53_story-oJdy0goUng7pbAcufFEEAJ_1553695207.html", "title": "Industrial plot allotment: Haryana CM denies vendetta behind CBI raids", "title_page": "Industrial plot allotment: Haryana CM denies vendetta behind CBI raids \n | india | Hindustan Times", "title_rss": "NULL", "source_domain": "hindustantimes.com", "text": "Haryana chief minister on Sunday ruled out political vendetta behind the central Bureau of Investigation (CBI) raids at 16 places in Haryana, Chandigarh and Delhi in connection with the alleged irregularities in allotment of 14 industrial plots by the previous Bhupinder Singh Hooda-led Congress government in Haryana.\n“There are no political motives behind these raids. The CBI was doing its work and they will take action as per their findings in the investigation,” Khattar said while talking to reporters here.\n“The former chief minister (Hooda) had himself stated on the floor of the state assembly that he was ready for any probe. Now, the investigation agencies are doing their job. If anybody did not do anything wrong, why should he be worried?” he added.\nJat stir: More guilty officers could face action, says CM\nTo a question, the chief minister said more officers could ace action for their role behind the violence during the Jat quota agitation in February.\nThe state government will go by the Prakash Singh committee report and initiate disciplinary action against all officers/officials found guilty of lapses during the widespread violence in February, the chief minister told the media in Karnal.\nKhattar reaches out to BJP workers\nFacing criticism for ignoring BJP workers in his own constituency, Haryana chief minister on Sunday reached out to his party activists and his supporters at their residences and assured them all support.\nThe chief minister, who visited the residences of 13 dedicated party workers and met people of Karnal assembly constituency, said the workers were the backbone of the party.\nHowever, during his visit some BJP workers complained that they were being ignored and not getting the due respect in the party.\n“I, along with my family members, worked hard for your victory in assembly elections, but I am being ignored now and not getting the due respect in the party,” a worker told the chief minister at the residence of senior deputy mayor Krishan Garg.\nLater addressing a gathering of workers in Sector 13, Khattar said the workers were the backbone of the party and they would be given importance, keeping in view their hard work.\nKhattar, the first time MLA from Punjabi-dominated Karnal constituency, also had lunch with the party workers.\nParty insiders said the CM’s move to meet party workers at their residences was initiated in the wake of the alleged resentment among the workers. Khattar swung into action after some influential families of the city, which played very active role in his election, left the BJP recently.\nRelief for workers, officers face heat\nThough the day-long visit of the chief minister brought some relief to his supporters, it was a tough day for senior officers of the district administration, including deputy commissioner (DC) Mandeep Singh Barar and superintendent of police (SP) Pankaj Nain, who accompanied the CM all along.\nAs the party leaders were called by the CM one by one for interaction, the DC and SP were seen waiting outside the residences of the party workers. Besides, the ADC, two SDMs and the officers of the CMO were also touring with Khattar in the scorching heat. However, the officers were tight-lipped about their presence in the meetings.\n“We do not know anything about it. You can ask the chief minister,” a senior officer said when asked about the presence of various officers during the CM’s visit to party workers.\n(With agency inputs)\nFirst Published: May 23, 2016 10:59 IST", "url": "https://www.hindustantimes.com/india/industrial-plot-allotment-haryana-cm-denies-vendetta-behind-cbi-raids/story-oJdy0goUng7pbAcufFEEAJ.html", "label": 2}