{"authors": [], "date_download": "2019-03-27 13:59:46", "date_modify": "2019-03-27 13:59:46", "date_publish": "2017-11-02 13:41:34", "description": "Meghalaya CM Mukul Sangma said he was yet to enrol himself for Aadhaar as he shared the concern of the people over the right to privacy.", "filename": "india_after-mamata-meghalaya-cm-expresses-his-opposition-aadhaar-2574596_1553695186.html", "image_url": "https://www.oneindia.com/img/2017/10/aadhaar3561-19-1492604245-25-1508938720.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/oneindia.com/india_after-mamata-meghalaya-cm-expresses-his-opposition-aadhaar-2574596_1553695186.html", "title": "After Mamata, Meghalaya CM expresses his opposition to Aadhaar over privacy issue", "title_page": "After Mamata, Meghalaya CM expresses his opposition to Aadhaar over privacy issue - Oneindia News", "title_rss": "NULL", "source_domain": "oneindia.com", "text": "After Mamata, Meghalaya CM expresses his opposition to Aadhaar over privacy issue\nIndia\noi-Oneindia\nBy Oneindia\nShillong, Nov 2: After West Bengal chief minister Mamata Banerjee took a firm stand against Aadhaar, even her government approaching the Supreme Court in this regard recently, now, her counterpart from Meghalaya, Mukul Sangma, too has come out against the 12-digit unique identification number issued by the Indian government to every individual resident of the country.\nOn Wednesday, Sangma said he was yet to enrol himself for Aadhaar as he shared the concern of the people over the right to privacy.\n\"I have not registered for Aadhaar number. I share the same concern with my people. (Our) right to privacy is important in a democracy else the whole idea of democracy is diluted,\" Mukul told reporters in Shillong.\nIn fact, the residents of hill state have started a campaign against mandatory possession of Aadhaar card and linking individual Aadhaar number with bank account, mobile phone number and social schemes, to name a few things.\nSangma said, \"I and my (Assam) counterpart (Sarbananda) Sonowalji have discussed and written to the Government of India. We both agreed to move in the right direction and our stand remains and we are moving together.\"\n\"The issue is that we are in a situation which is different from other states. The kind of problem due to illegal immigration and influx is a common concern of the people of Meghalaya and Assam and the entire North East,\" he added.\nThe chief ministers of Meghalaya and Assam had earlier shot off a letter to the Centre seeking exemption from Aadhaar.\n\"What we are saying is not to make it compulsory and binding for Meghalaya (and Assam),\" he said, adding that the registration is going on in the state for the convenience of students who are studying outside the state.\nSangma claimed there were \"lots of confusion\" with regards to registration for Aadhaar number and \"we want complete clarity on the matter\".\n\"Different authorities are giving diverse directions and inter-ministerial engagement is missing, synergy is missing and dialogue is missing,\" he said.\nIn Meghalaya, the registration for Aadhaar number has crossed over 14 per cent of the population, ahead of Assam (as per UIDAI statistics), following the resumption of Aadhaar registration in June this year.\nHowever, there is a group in the state which has been urging the people to demand the Aadhaar authorities to delete the information collected from them in the database.\nOver 260 people have submitted a personal letter to the Meghalaya People Committee on Aadhaar (MPCA), an umbrella organisation against Aadhaar enrolment in the state, demanding the data collected from them be deleted from the system.\nSeveral civil society groups, including the Thma u Rangli u Juki (TUR) and the influential Khasi Students Union (KSU), are leading the MPCA.\n\"The people were coerced into giving their personal details during the enrolment. This is done without having taken the consent of the people concerned and it infringes on their rights to privacy,\" TUR convener Angela Rangad said.\n\"There are enough doubts that Aadhaar numbers will be misused in surveillance and control by the powers that be. We have to be extra careful before we commit ourselves to the unknown,\" she said.\nMPCA secretary Auguster Jyrwa said that a campaign to collect signatures would conclude on November 3, after which they would approach authorities concerned seeking deletion of the data.\nThe constitution bench of Supreme Court will start hearing a clutch of petitions challenging the Centre's move to make Aadhaar card mandatory for availing various services and benefits of government welfare schemes from the last week of November.\nOneIndia News", "url": "https://www.oneindia.com/india/after-mamata-meghalaya-cm-expresses-his-opposition-aadhaar-2574596.html", "label": 2}