{"authors": [], "date_download": "2019-03-27 13:59:45", "date_modify": "2019-03-27 13:59:45", "date_publish": "2016-05-22 23:07:16", "description": "Six 29 Assam Rifles personnel were killed in an ambush laid by militants in Manipur's Chandel district.", "filename": "india_story_manipur-ambush-six-assam-rifles-personnel-killed-in-chandel-district-324931-2016-05-22_1553695185.html", "image_url": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/201605/assam-rifle-story_647_052216063630_0.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/indiatoday.in/india_story_manipur-ambush-six-assam-rifles-personnel-killed-in-chandel-district-324931-2016-05-22_1553695185.html", "title": "Manipur ambush: 6 Assam Rifles personnel killed in Chandel district", "title_page": "Manipur ambush: 6 Assam Rifles personnel killed in Chandel district - India News", "title_rss": "NULL", "source_domain": "indiatoday.in", "text": "Six 29 Assam Rifles personnel were killed in an ambush laid by militants in Manipur's Chandel district near the Indo-Myanmar border.\nThe convey was attacked by heavily armed militants around 1 PM in Joupi Hengshi area.\nTop developments: A Junior Commissioned Officer (JCO) and five jawans of the 29 Assam Rifles died in the attack. The attack was reportedly laid by CorCom (Coordination Committee) militant group. The militants attacked the jawans as they were returning after inspection of a landslide location in Chandel. Four AK-47 rifles, one INSAS rifle, one LMG rifle have been snatched away by the militants. More troops were rushed to the area and a massive search operation is underway. \"Extremely pained to learn of killing of Assam Rifles' JCO and jawans in Manipur. My condolences to families of the deceased,\" tweeted HM Home Minister Rajnath Singh.\nMore details are awaited\nAlso read:\nMilitants fire at Assam Rifles camp\nThe face that Bodo militants fear in Assam", "url": "https://www.indiatoday.in/india/story/manipur-ambush-six-assam-rifles-personnel-killed-in-chandel-district-324931-2016-05-22", "label": 2}