{"authors": [], "date_download": "2019-03-27 14:00:02", "date_modify": "2019-03-27 14:00:02", "date_publish": "2019-02-27 00:00:00", "description": "Adil Ahmad Dar, the Jaish-e-Mohammad terrorist behind the worst-ever terror attack on security forces in Jammu and Kashmir, lived just 10 km from the spot where he rammed his car full of explosives into a security convoy, killing over 40 Central Reserve Police Force (CRPF) personnel on Thursday.", "filename": "india-news_pulwama-terror-attack-jaish-e-mohammad-terrorist-who-attacked-crpf-in-jammu-and-kashmir-ived-10-km-f-1993899_1553695202.html", "image_url": "https://c.ndtvimg.com/2019-02/lid6gugg_adil-ahmad-dar-pulwama-attack-terrorist_625x300_14_February_19.jpg", "language": null, "localpath": "/home/raj/news-please-repo//data/2019/03/27/ndtv.com/india-news_pulwama-terror-attack-jaish-e-mohammad-terrorist-who-attacked-crpf-in-jammu-and-kashmir-ived-10-km-f-1993899_1553695202.html", "title": "Adil Ahmad Dar, Jaish-e-Mohammad Terrorist, Lived 10 km From Spot", "title_page": "Pulwama Terror Attack On CRPF: Adil Ahmad Dar, Jaish-e-Mohammad Terrorist, Lived 10 km From Spot", "title_rss": "NULL", "source_domain": "ndtv.com", "text": "Pulwama attack: Adil Ahmad Dar joined Jaish-e-Mohammad last year.\nHighlights Adil Ahmad Dar, 22, joined terror group Jaish-e-Mohammad last year He was also known as \"Adil Ahmad Gaadi Takranewala\" Police say he is the third local suicide terrorist recruited by Jaish\nAdil Ahmad Dar, the Jaish-e-Mohammad terrorist behind the worst-ever terror attack on security forces in Jammu and Kashmir, lived just 10 km from the spot where he rammed his car full of explosives into a security convoy, killing over 40 Central Reserve Police Force (CRPF) personnel on Thursday.\nAlso known as \"Adil Ahmad Gaadi Takranewala\" and \"Waqas Commando of Gundibagh\", he joined the Pakistan-based terror outfit last year. On Thursday, he drove towards the convoy of 78 CRPF busestransporting over 2,500 personnel from Jammu to Srinagar and rammed his SUV with 350 kg of explosives into a bus.\nAdil Ahmad, 22, was a school dropout from Gundibagh village in south Kashmir's insurgency hotbed of Pulwama district, according to police records and government officials. He quit school in March 2017 and a year later, joined the Pakistan-based terror group led by Masood Azhar.\nThe terror attack in Pulwama targetted a CRPF convoy.\nHis photo and videos emerged soon after the deadly attack.\n\"My name is Adil, I joined the Jaish e Mohammad a year ago. After a year's wait, I have got the chance to do what I joined the Jaish for... By the time this video reaches you, I will be in heaven... this is my last message for the people of Kashmir,\" Adil Ahmad says in the video, as part of an anti-India rant.\nInvestigators are baffled at the scale of the attack, given that almost the entire leadership of Jaish has been wiped out over the years.\nLast year, security forces had claimed a big win after Mohammad Usman, believed to be the head of the module behind sniper attacks on forces in the Kashmir Valley, was killed by security men. Usman was the nephew of Moulana Masood Azhar, the chief of Jaish-e-Mohammad. In 2017, security forces killed Jaish's operational chief Khalid in Baramulla.\nIndia has said it will retaliate appropriately to the Pulwama terror attack.\nAccording to the police, Adil Ahmad Dar is the third local \"fidayeen\" or suicide terrorist recruited by the Jaish-e-Mohammad for a big suicide attack.\nThe others were Fardeen Ahmad Khan, 16, of Tral and 17-year-old Afaq Ahmad Shah.\nFardeen was killed on December 31, 2017, when he, along with three foreign militants, sneaked into the CRPF training centre at Lethpora and killed five personnel.\nAfaq, the police say, was the first local fidayeen to carry out a car bomb attack on the forces. He blew up an explosive-laden vehicle outside the 15 Corps headquarters at Badami Bagh on the outskirts of Srinagar in early 2000, killing eight troopers.\nGet the latest election news, live updates and election schedule for Lok Sabha Elections 2019 on ndtv.com/elections. Like us on Facebook or follow us on Twitter and Instagram for updates from each of the 543 parliamentary seats for the 2019 Indian general elections.", "url": "https://www.ndtv.com/india-news/pulwama-terror-attack-jaish-e-mohammad-terrorist-who-attacked-crpf-in-jammu-and-kashmir-ived-10-km-f-1993899", "label": 2}