{"authors": [], "date_download": "2019-03-27 14:00:03", "date_modify": "2019-03-27 14:00:03", "date_publish": "2017-04-25 13:35:25", "description": "Condemning the attack on CRPF personnel in Chhattisgarh's Sukma district, the Congress said it is a clear case of intelligence failure and called upon Prime Minister Narendra Modi to act decisively against anti-national forces.", "filename": "india_story_congress-on-sukma-attack-maoists-centre-973423-2017-04-25_1553695203.html", "image_url": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/201704/manish-tewari_647_042517013210.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/indiatoday.in/india_story_congress-on-sukma-attack-maoists-centre-973423-2017-04-25_1553695203.html", "title": "What happened to Centre's claim that demonetisation has broken morale of Maoists: Congress on Sukma attack", "title_page": "What happened to Centre's claim that demonetisation has broken morale of Maoists: Congress on Sukma attack - India News", "title_rss": "NULL", "source_domain": "indiatoday.in", "text": "Condemning the attack on CRPF personnel in Chhattisgarh's Sukma district, the Congress said it is a clear case of intelligence failure and called upon Prime Minister Narendra Modi to act decisively against anti-national forces.\nComparing the entire episode with burning of Rome, Congress spokesperson Manish Tewari said, \"What we see is a classical case that when Rome is burning Nero is fiddling. Nero is this government, Nero are those people who are handling security matter in this government.\"\nWhile talking to India Today, former Union Minister Tewari said, \"Internal security situation in this country is extremely grave. We have Kashmir up in flames and you have Maoists on rampage in Chhattisgarh. The nation is facing an extremely grim situation. We would like to tell the PM that you need to get your house in order. It is an intelligence failure also.\"\nMainitaining their tough stance on demonetisation Tewari said, \"The principal opposition party also maintained that the government should revisit the entire demonetisation debate. Whosoever in the government had actually made the link between demonetisation and economic crackdown on Naxals, the Prime Minister should throw them out immediately from the government.\"\nMany leaders from BJP during demonetisation roll out had claimed that the move will also a financial impact on terrorists in Kashmir and Maoists in Chhattisgarh. \"It was absolutely ill-conceived, ill-thought theory and the PM must hold whosoever made that statement should now be held to accountable,\" former Union Minister added.\n\"There needs to be accountability. The strategic challenge that left wing extremists have now thrown to the govt needs to be combated. Whole issue of intelligence failure needs to be looked into,\" he said.\nALSO READ\nSukma cold-blooded murder, valour of CRPF jawans will not go in vain: Rajnath Singh on Naxal attack\nAfter Sukma Naxal attack, Jharkhand on alert; MHA seeks report from CRPF, feels leadership failure to blame\nCRPF jawan injured in Sukma attack recalls ambush: Shot Naxals in chest, they used villagers as human shield\nChhattisgarh: 80-km stretch from Dornapal to Jagargunda a death trap for CRPF\nNaxal attack on CRPF jawans in Sukma: All you need to know\nWATCH | Sukma attack cold-blooded murder, won't let jawans' sacrifice go in vain: Rajnath Singh", "url": "https://www.indiatoday.in/india/story/congress-on-sukma-attack-maoists-centre-973423-2017-04-25", "label": 2}