{"authors": [], "date_download": "2019-03-27 14:00:01", "date_modify": "2019-03-27 14:00:01", "date_publish": "2017-06-27 00:00:00", "description": "A meeting of Kashmiri separatists in Srinagar, apparently to discuss a series of raids in Jammu and Kashmir to detect terror funding, was stopped by the police this morning.", "filename": "india-news_meeting-of-kashmiri-separatists-amid-anti-terror-raids-stopped-by-police-1707949_1553695201.html", "image_url": "https://i.ndtvimg.com/i/2017-06/police-separatists-meet-foiled_650x400_81496643285.jpg", "language": null, "localpath": "/home/raj/news-please-repo//data/2019/03/27/ndtv.com/india-news_meeting-of-kashmiri-separatists-amid-anti-terror-raids-stopped-by-police-1707949_1553695201.html", "title": "Meeting Of Kashmiri Separatists, Amid Anti-Terror Raids, Stopped By Police", "title_page": "Meeting Of Kashmiri Separatists, Amid Anti-Terror Raids, Stopped By Police", "title_rss": "NULL", "source_domain": "ndtv.com", "text": "The police arrested Yasin Malik and placed Mirwaiz Umar Farooq under house arrest.\nA meeting of Kashmiri separatists in Srinagar, apparently to discuss a series of raids in Jammu and Kashmir to detect terror funding, was stopped by the police this morning.The meeting was called at the home of Hurriyat leader Syed Ali Shah Geelani. The police have sealed the house, arrested one separatist, Yasin Malik, and placed another, Mirwaiz Umar Farooq, under house arrest.The National Investigation Agency has raided some 40 places in the last two days not just in Jammu and Kashmir but also Delhi and Haryana, to crack down on funding of attacks in the Kashmir Valley by Pakistan-based terror groups.On the weekend, the agency carried out extensive raids on the homes and offices of separatist leaders.The offices of the Tehreek-e-Hurriyat, associated with Syed Ali Shah Geelani, were among the places that were raided. The homes of Ayaz Akbar, a close aide of Mr Geelani and a businessman, Farooq Bagoo, were also raided.A few thousand rupees in Pakistani currency, and currencies belonging to the United Arab Emirates and Saudi Arabia were seized during the raids and several people are being questioned.\"There is no compromise as far as the safety of the nation is concerned. Appropriate actions have been taken across or in the border. The people of Kashmir want this bluff to be called off,\" said union minister Jitendra Singh. The country's top anti-terror agency started its investigations after a television channel aired what it said was a sting operation in which a member of the Tehreek-e-Hurriyat apparently confesses that he received money from Pakistan based terror groups. He later denied making any such statement.\nGet the latest election news, live updates and election schedule for Lok Sabha Elections 2019 on ndtv.com/elections. Like us on Facebook or follow us on Twitter and Instagram for updates from each of the 543 parliamentary seats for the 2019 Indian general elections.", "url": "https://www.ndtv.com/india-news/meeting-of-kashmiri-separatists-amid-anti-terror-raids-stopped-by-police-1707949", "label": 2}