{"authors": ["Ht Correspondent"], "date_download": "2019-03-27 14:00:09", "date_modify": "2019-03-27 14:00:09", "date_publish": "2018-07-23 12:54:39", "description": "Rakbar Khan, alias Akbar of Kol village in Haryana’s Nuh district, was attacked by alleged cow vigilantes in Ramgarh in Alwar district on the intervening night of Friday and Saturday, leading to his death.", "filename": "india-news_cong-president-r_8863c5e98da40f3a83c19d8bf39063d1_story-95uYTAJhvpU1wIqD5AcEpJ_1553695209.html", "image_url": "https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2018/07/23/Pictures/monsoon-session-of-parliament_08e03cbc-8e46-11e8-950a-c127747267f3.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/hindustantimes.com/india-news_cong-president-r_8863c5e98da40f3a83c19d8bf39063d1_story-95uYTAJhvpU1wIqD5AcEpJ_1553695209.html", "title": "Cong president Rahul Gandhi calls Alwar lynching Modi’s ‘brutal New India’", "title_page": "Cong president Rahul Gandhi calls Alwar lynching Modi’s ‘brutal New India’ | india news | Hindustan Times", "title_rss": "NULL", "source_domain": "hindustantimes.com", "text": "Congress President Rahul Gandhi said on Monday that the inordinate delay by policemen in Rajasthan’s Alwar district to take a lynching victim to hospital reflected Prime Minister Narendra Modi’s ‘New India’ where hatred was replacing humanity and people are left to die.\nRakbar Khan, alias Akbar of Kol village in Haryana’s Nuh district, was attacked by alleged cow vigilantes in Ramgarh in Alwar district on the intervening night of Friday and Saturday, leading to his death.\nThe local police came under fire from various quarters after it was reported that they took Rakbar to the hospital three hours after they found him. The police have also been accused of taking Rakbar to the police station initially and beating him up.\nRahul Gandhi took to Twitter to strongly criticise the incident.\n“Policemen in #Alwar took 3 hrs to get a dying Rakbar Khan, the victim of a lynch mob, to a hospital just 6 KM away. Why? They took a tea-break enroute. This is Modi’s brutal “New India” where humanity is replaced with hatred and people are crushed and left to die,” he said.\nPolicemen in #Alwar took 3 hrs to get a dying Rakbar Khan, the victim of a lynch mob, to a hospital just 6 KM away.\nWhy?\nThey took a tea-break enroute.\nThis is Modi’s brutal \"New India\" where humanity is replaced with hatred and people are crushed and left to die. https://t.co/sNdzX6eVSU — Rahul Gandhi (@RahulGandhi) July 23, 2018\nGandhi’s tweet drew a sharp response from the BJP with Union finance minister Piyush Goyal who also took to Twitter to accuse the Congress chief of divisive politics and called him ‘a merchant of hate’.\nThe country has seen several cases of lynching of people by cow vigilantes on suspicion of smuggling bovines for slaughter or possessing beef in the last few years.\nIn April last year, a 50-year-old dairy farmer, Pehlu Khan, was also beaten to death by vigilantes suspecting him to be a cow smuggler in Alwar.\nFirst Published: Jul 23, 2018 12:54 IST", "url": "https://www.hindustantimes.com/india-news/cong-president-rahul-gandhi-calls-alwar-lynching-modi-s-brutal-new-india/story-95uYTAJhvpU1wIqD5AcEpJ.html", "label": 2}