{"authors": [], "date_download": "2019-03-27 14:00:17", "date_modify": "2019-03-27 14:00:17", "date_publish": "2017-11-25 06:55:01", "description": "New Delhi [India], November 25 (ANI): The family of Pradyuman Thakur, who was allegedly murdered at Gurugram's Ryan International School, will be approaching the Supreme Court on Monday challenging", "filename": "india-news_pradyuman-s-family-to-approach-sc-challenging-bail-granted-to-pinto-family-608429_ref=hp_news_1010&ani_1553695217.html", "image_url": "https://images.abplive.in/v2/aHR0cDovL3N0YXRpYy5hYnBsaXZlLmluL2FuaS1pbWFnZXMvU3VwcmVtZUNvdXJ0X05vdjI1LmpwZyM2NDA6NDgwI3Jlc2l6ZSNqcGVn/SupremeCourt_Nov25.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/abplive.in/india-news_pradyuman-s-family-to-approach-sc-challenging-bail-granted-to-pinto-family-608429_ref=hp_news_1010&ani_1553695217.html", "title": "Pradyuman's family to approach SC challenging bail granted to Pinto family", "title_page": "Pradyuman's family to approach SC challenging bail granted to Pinto family", "title_rss": "NULL", "source_domain": "abplive.in", "text": "New Delhi [India], November 25 (ANI): The family of Pradyuman Thakur, who was allegedly murdered at Gurugram's Ryan International School, will be approaching the Supreme Court on Monday challenging the bail granted to the Pinto family by the Punjab and Haryana High Court.\nOn November 21, the Punjab and Haryana High Court had granted anticipatory bail to the Pinto family, founders of the Ryan Group of Institutions, in connection with the Pradyuman murder case.\nHowever, the High Court bench of Justice Surender Gupta has barred them from leaving the country without permission and directed the family to extend their help in the investigation.\nThe anticipatory bail pleas by Ryan Pinto and his parents, founding Chairman Augustine Pinto and managing director Grace Pinto, were filed on September 19.\nEight-year-old Pradyuman was found in a pool of blood with his throat slit inside Ryan International school in Gurugram on September 8.\nThe incident sparked a public outcry following which Gurugram police arrested Ashok, accusing him of killing the seven-year-old student.\nBut the Central Bureau of Investigation (CBI), which is now probing the matter, gave him a clean chit and held a class 11 student responsible for the murder. (ANI)", "url": "https://www.abplive.in/india-news/pradyuman-s-family-to-approach-sc-challenging-bail-granted-to-pinto-family-608429?ref=hp_news_1010&ani", "label": 2}