{"authors": [], "date_download": "2019-03-27 14:00:13", "date_modify": "2019-03-27 14:00:13", "date_publish": "2015-05-25 00:00:00", "description": "Read more", "filename": "india_briefs_cid_1511653_1553695213.html", "image_url": "https://www.telegraphindia.com/assets/images/default_social_image.png?v=12", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/telegraphindia.com/india_briefs_cid_1511653_1553695213.html", "title": "Briefs", "title_page": " Briefs ", "title_rss": "NULL", "source_domain": "telegraphindia.com", "text": "Liquor nuisance\nNew Delhi, May 24 (PTI): Delhi High Court has directed the Delhi Development Authority to come up with a framework within four months to curb the \"nuisance associated with consumption of liquor\" in and around convenient shopping centres in residential areas.\nThe bench of Chief Justice G. Rohini and Justice R.S. Endlaw also questioned the DDA why retail sale of liquor was not permitted at shopping centres when there was no restriction on other commodities.\nAIIMS plan\nNew Delhi (PTI): A committee set up to re-frame rules at AIIMS has recommended that 40 per cent of the institute's professors who have completed 10 years of service be upgraded to the higher administrative grade scale.\nBus marshals\nNew Delhi (PTI): The Delhi government has decided to deploy 2,500 marshals in city buses to ensure security of women in public transport. The marshals will be chosen from among home guard and civil defence personnel. Groups of three or four marshals will patrol the buses.\nCM convoy\nChandigarh (PTI): A plumber was injured in the ankle when he was hit by an escort vehicle in Haryana chief minister Manohar Lal Khattar's cavalcade on Sunday. In March this year, a youth was killed after being allegedly hit by a vehicle in Khattar's convoy in Karnal.\nAMU probe\nIndore (PTI): Aligarh Muslim University has ordered a probe into this year's MBBS and BDS entrance test results following reports of inconsistencies. More than 30 candidates belonging to a particular exam centre in south India cleared the test, sparking speculation that high-tech Internet applications could have been used.\nZoo exchange\nNew Delhi (PTI): Delhi zoo will get a group of four-horned antelopes and water monitor lizards from Odisha's Nandankanan Zoological Park. The Delhi zoo will send a group of five bow-antlered deer to Nandankanan as part of the exchange programme.", "url": "https://www.telegraphindia.com/india/briefs/cid/1511653", "label": 2}