{"authors": [], "date_download": "2019-03-27 14:00:25", "date_modify": "2019-03-27 14:00:25", "date_publish": "2017-05-18 15:50:41", "description": "Indian girls hunger-strike to protest dangerous school commutes - By Rina Chandran\nMUMBAI, May 18 (Thomson Reuters Foundation) - More than 80 girls went on a hunger strike in northern India to protest the harassment they faced on the way to school, drawing attention to the dangerous commutes that are a key barrier to girls' education in the country.", "filename": "india_report-indian-girls-hunger-strike-to-protest-dangerous-school-commutes-2442996_1553695225.html", "image_url": "https://cdn.dnaindia.com/sites/all/themes/dnaindia/favicon-1016.ico", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/dnaindia.com/india_report-indian-girls-hunger-strike-to-protest-dangerous-school-commutes-2442996_1553695225.html", "title": "Indian girls hunger-strike to protest dangerous school commutes", "title_page": "Indian girls hunger-strike to protest dangerous school commutes", "title_rss": "NULL", "source_domain": "dnaindia.com", "text": "By Rina Chandran\nMUMBAI, May 18 (Thomson Reuters Foundation) - More than 80 girls went on a hunger strike in northern India to protest the harassment they faced on the way to school, drawing attention to the dangerous commutes that are a key barrier to girls' education in the country.\nThe teenagers, from grades nine and 10, ended the strike after eight days on Wednesday, when the education minister of northern Haryana state said he would add two grades to their school so they would not have to go to another village to complete their high school education.\nThe girls said they were harassed by young men on motorbikes who made lewd comments, tugged at their clothes and took pictures of them on their mobile phones as they walked or cycled to school everyday.\nFor grades 11 and 12, the girls would have had to travel 3 km (2 miles) to another school. They had said they would drop out, as the extra distance would mean more harassment.\n\"A principal has been appointed, and admissions will start for the 2017-18 session on Thursday itself for the new classes,\" Haryana education minister Ram Bilas Sharma told reporters.\nTelevision images showed the girls, in blue and white uniforms, slumped in the laps of their mothers and other students before they ended their fast. Some were hospitalised after they fainted.\nWhile literacy levels in India have steadily climbed as enrolment surged, the dropout rate remains high.\nAbout 18 percent of students dropped out before grade 10, according to official data. A survey by nonprofit Save the Children found the dropout rate for girls is as high as 70 percent.\nThat has led to an uneven national literacy rate of 65 percent for women compared to 82 percent for men.\nReasons for dropping out range from poverty to lack of facilities such as toilets, which affect adolescent girls more, said Soha Moitra, a director at nonprofit Child Relief and You (CRY) in Delhi.\nTo address these problems, officials passed the 2009 Right to Education Act promoting free, compulsory education for children up to age 14, and have introduced efforts to build more toilets under a national cleanliness campaign.\nPrime Minister Narendra Modi has stressed the importance of educating girls with the \"Beti Bachao, Beti Padhao\" (save your daughter, educate your daughter) campaign.\nBut the issue of unsafe commutes is unresolved, Moitra said.\n\"Especially in villages and small towns, students may have to walk through open fields and lonely neighbourhoods,\" she told the Thomson Reuters Foundation.\n\"Adolescent girls are particularly vulnerable because of the lack of safe public transport.\"\nA 2014 poll by the Thomson Reuters Foundation ranked India the fourth most dangerous place for a woman to take public transport.\nWith a patriarchal society and cultural preference for sons, Haryana has among the lowest sex ratios with 879 females per 1,000 males, compared to the national average of 943.\nThe state also has a high incidence of violence against women.\nEarlier this week, Haryana police said a 23-year-old woman was gang-raped and murdered by men who smashed her skull with bricks.\n\"The issue is no longer if girls want to study. It's an issue of safety. If we cannot guarantee that, how can we blame them for dropping out of school?\" Moitra said.\n(This article has not been edited by DNA's editorial team and is auto-generated from an agency feed.)", "url": "https://www.dnaindia.com/india/report-indian-girls-hunger-strike-to-protest-dangerous-school-commutes-2442996", "label": 2}