{"authors": ["Fe Online"], "date_download": "2019-03-27 14:00:25", "date_modify": "2019-03-27 14:00:25", "date_publish": "2018-11-09 22:37:00", "description": "Senior Manager of Tata Steel has been shot dead by a former company employee in Haryana's Faridabad.", "filename": "india-news_haryana-tata-steel-manager-killed-by-employee__1553695225.html", "image_url": "https://images.financialexpress.com/2018/11/crime-scene.jpg", "language": null, "localpath": "/home/raj/news-please-repo//data/2019/03/27/financialexpress.com/india-news_haryana-tata-steel-manager-killed-by-employee__1553695225.html", "title": "Haryana shocker! Former employee shoots dead manager at Tata Steel subsidiary", "title_page": "Haryana shocker! Former employee shoots dead manager at Tata Steel subsidiary - The Financial Express", "title_rss": "NULL", "source_domain": "financialexpress.com", "text": "Former employee shot at the manager five times.\nIn a shocking case, a Senior Manager of Tata Steel subsidiary has been shot dead by a former company employee in Haryana’s Faridabad. The police said that the former employee shot at the manager five times. He died on the way to the hospital. “Bullets were shot at senior manager by a former employee… he died on the way to the hospital… in initial reports, doctors say he was shot with 5 bullets… post-mortem reports awaited,” Mujesar SHO was quoted as saying by news agency ANI.\nReleasing a statement, Tata Steel said that the incident took place at around 1.10 pm in the day. “At around 1:10 pm today, i.e. Nov 9, 2018, an unfortunate incident took place at the Faridabad office of Tata Steel Processing and Distribution Ltd (TSPDL), a Tata Steel subsidiary located inside the Tata Steel stockyard in Faridabad, wherein Mr Arindam Pal, Sr Manager (Supply Chain), was shot dead with a firearm by Mr Vishwash Pandey, an ex-employee of the company,” the company said in a statement.\n“Pal expired on the way to the hospital. He is survived by his wife, parents and a daughter,” the statement added.\nThe company said that the attacker, Vishwash Pandey, 32, worked with TSPDL from 2015 till 2018. He was discharged from the services of the company in August 2018. “After shooting Pal, he immediately ran out of the office and is still at large,” the statement said further.\nThe local police are investigating the law and order incident and an FIR is being filed.", "url": "https://www.financialexpress.com/india-news/haryana-tata-steel-manager-killed-by-employee/1377343/", "label": 2}