{"authors": [], "date_download": "2019-03-27 14:00:23", "date_modify": "2019-03-27 14:00:23", "date_publish": "2018-05-30 00:00:00", "description": "Full text of US State Department's Annual Religious Freedom Report 2017 on India - Executive Summary", "filename": "india_report-full-text-of-us-state-department-s-annual-religious-freedom-report-2017-on-india-2620215_1553695223.html", "image_url": "https://cdn.dnaindia.com/sites/default/files/styles/full/public/2018/05/30/687841-us-state-department-2.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/dnaindia.com/india_report-full-text-of-us-state-department-s-annual-religious-freedom-report-2017-on-india-2620215_1553695223.html", "title": "Full text of US State Department's Annual Religious Freedom Report 2017 on India", "title_page": "Full text of US State Department's Annual Religious Freedom Report 2017 on India", "title_rss": "NULL", "source_domain": "dnaindia.com", "text": "Executive Summary\nThe constitution provides for freedom of conscience and the right of all individuals to freely profess, practice, and propagate religion; mandates a secular state; requires the state to treat all religions impartially; and prohibits discrimination based on religion.\nIt also states citizens must practice their faith in a way that does not adversely affect public order, morality, or health.\nOut of 29 states, eight have legislation restricting religious conversion, with laws in force in five of those states. Authorities often did not prosecute violence by vigilantes against persons, mostly Muslims, suspected of slaughtering or illegally transporting cows or trading in or consuming beef. Members of civil society and religious minorities stated that under the current government, religious minority communities felt increasingly vulnerable due to Hindu nationalist groups engaging in violence against non-Hindu individuals and their places of worship.\nRepresentatives of religious minority communities stated that, while the national government sometimes spoke out against incidents of violence, local political leaders often did not, and at times made public remarks individuals could interpret as condoning violence.\nOn April 2, Chhattisgarh’s Chief Minister Raman Singh said anyone who killed a cow in his state would be hanged. Some longstanding legal cases involving religiously motivated violence and riots continued to advance slowly. In May the Kerala High Court annulled a marriage between a Hindu woman and a Muslim man based on third-party allegations the woman was forcibly converted to Islam, despite her denial she was forced; the Supreme Court’s review of the case continued at year’s end.\nOn August 22, the Supreme Court ruled the practice through which a Muslim man could divorce his wife instantly by saying the word “talaq” (Arabic for divorce) three times was unconstitutional. On\nMay 23, the central government banned the sale of cattle for slaughter through animal markets; in July the Supreme Court stayed the implementation of the order across the country for three months. Following protests from farmers, beef consuming states, and the adverse Supreme Court ruling, the government considered making certain changes to make the rules more acceptable; however, no updates were available at year’s end. The government continued its challenge to the minority status of Muslim educational institutions, which affords them independence in hiring and curriculum decisions, in the Supreme Court.\nThere were reports of religiously motivated killings, assaults, riots, discrimination, vandalism, and actions restricting the right of individuals to practice their religious beliefs and proselytize. There were several violent incidents by so-called “cow protection” groups against mostly Muslim victims, including killings, mob violence, assaults, and intimidation. Authorities often failed to prosecute those committing the attacks.\nOn June 22, assailants on a train in Haryana accused 16-year-old Junaid Khan of being a “beefeater,” fatally stabbed him, and threw him off the train. Authorities investigated the railway police officer’s reported failure to intervene. On April 1, Hindus beat a Muslim man to death for carrying cattle in the back of a truck. Hindus threatened and assaulted Muslims and Christians and destroyed their property. In December a Hindu man posted an online video of his hacking, burning, and killing a Muslim laborer over religious differences. On October 8, the head of the Vishwa Hindu Parishad (VHP), described by media as a Hindu nationalist organization, stated Christian missionaries must leave the country, or else would be forced to do so. According to figures compiled by local partners of international nongovernmental organization (NGO) Open Doors, during the first six months of the year, Christians were harassed, threatened, or attacked for their faith in 410 reported incidents, compared with 441 incidents in all of 2016. Incidents included assaults on missionaries and attacks on churches and private property. From January through May, the Ministry of Home Affairs (MHA) reported 296 conflicts between religious communities, resulting in 44 deaths and 892 injuries.\nSenior US government officials underscored the importance of respecting religious freedom and promoting tolerance throughout the year.\nThe US embassy and four consulates general continued to discuss religious freedom and tolerance issues with the ruling and opposition parties, religious leaders belonging to various faith communities, including representatives of the Bahai, Buddhist, Christian, Hindu, Jain, Jewish, Muslim, Sikh, and Parsi communities, and with civil society and religious freedom activists.\nEmbassy officials also engaged officials from the National Commission for Minorities and the National Human Rights Commission, political leaders, state and local officials, religiously affiliated organizations, and civil society groups from all religious communities.\nSection I. Religious Demography\nThe US government estimates the total population at 1.28 billion (July 2017 estimate). According to the 2011 national census, the most recent year for which disaggregated figures are available, Hindus constitute 79.8 percent of the population, Muslims 14.2 percent, Christians 2.3 percent, and Sikhs 1.7 percent. Groups that together constitute less than 1 percent of the population include Buddhists, Jains, Zoroastrians (Parsis), Jews, and Bahais.\nThe Ministry of Tribal Affairs officially classifies more than 104 million members of Scheduled Tribes – indigenous groups historically outside the caste system who often practice animism and indigenous religious beliefs – as Hindus in government statistics. Approximately one-third of Christians also are listed as part of Scheduled Tribes.\nAccording to government estimates, there are large minority Muslim populations in the States of Uttar Pradesh, Bihar, Maharashtra, West Bengal, Telangana, Karnataka, and Kerala. Muslims constitute 68.3 percent of the population in the State of Jammu and Kashmir, the only state in which they constitute a majority. Slightly more than 85 percent of Muslims are Sunni; most of the rest are Shia. Christian populations are found across the country but in greater concentrations in the northeast, as well as in the southern States of Kerala, Tamil Nadu, and Goa.\nThree small northeastern states have large Christian majorities: Nagaland (90 percent of the population), Mizoram (87 percent), and Meghalaya (70 percent). Sikhs constitute 54 percent of Punjab’s population. The Dalai Lama’s office estimates there are significant resettled Tibetan Buddhist communities in Himachal Pradesh, Karnataka, Uttarakhand, and Delhi. According to a 2009 parliamentary report, the MHA estimates the total number of Tibetan Buddhists to be 110,000.\nSection II. Status of Government Respect for Religious Freedom\nLegal Framework\nSubject to considerations of public order, morality, and health, the constitution provides for freedom of conscience and the right of all individuals to profess, practice, and propagate religion freely, and mandates a secular state. It prohibits government discrimination based on religion, including with regard to employment, as well as any religion-based restrictions on individuals’ access to public or private facilities or establishments open to the general public.\nThe constitution states religious groups have the right to establish and maintain institutions for religious and charitable purposes, manage their own affairs in religious matters, and own, acquire, and administer property. It prohibits compelling anyone to pay taxes to promote or maintain any specific religion. National and state laws make freedom of religion “subject to public order, morality, and health.” The constitution stipulates the state shall endeavour to create a uniform civil code applicable to members of all religions across the country.\nFederal law empowers the government to ban religious organizations that provoke intercommunal tensions, are involved in terrorism or sedition, or violate laws governing foreign contributions.\nEight of the 29 states have legislation restricting religious conversion: Arunachal Pradesh, Chhattisgarh, Gujarat, Himachal Pradesh, Jharkhand, Madhya Pradesh, Odisha, and Rajasthan. Five of these states enforce the laws. There is no implementing legislation for the anticonversion law in Arunachal Pradesh. Rajasthan passed a bill in 2006 that has yet to be signed into law. In August Jharkhand also passed an anti-conversion bill, which was pending the governor’s approval at year’s end. Chhattisgarh and Madhya Pradesh prohibit religious conversion by the use of “force,” “allurement,” or “fraudulent means” and require district authorities be informed of any intended conversions one month in advance. Violators, including missionaries and other religious figures who encourage conversion, are subject to fines and other penalties, such as prison sentences of up to three years in Chhattisgarh and up to four years in Madhya Pradesh if the converts are minors, women, or members of government-designated, historically disadvantaged groups (known as Scheduled Castes or Scheduled Tribes).\nGujarat mandates prior permission from the district magistrate for any form of conversion and punishes forced conversions with up to three years’ imprisonment and a fine up to 50,000 rupees ($780). In Himachal Pradesh penalties are up to two years’ imprisonment and/or fines of 25,000 rupees ($390). Punishments for conversions involving minors, Scheduled Caste or Scheduled Tribe members, or, in the case of Odisha, women, may consist of jail sentences rather than fines. Himachal Pradesh and Odisha maintain similar prohibitions against conversion through “force,” “inducement,” or “fraud” and bar individuals from abetting such conversions. Odisha requires individuals wishing to convert to another religion and clergy intending to officiate in a conversion ceremony to submit formal notification to the government.\nAccording to the Supreme Court, converting from Hinduism to another religion ordinarily “operates as an expulsion from the caste” since caste is a structure affiliated with Hindu society. Societal definitions of caste affiliation are determinative of a person’s eligibility for government benefits based on caste.\nUnder Andhra Pradesh and Telangana law, authorities may prohibit proselytizing near another religion’s place of worship. Punishment for violations can include imprisonment for up to three years and fines up to 5,000 rupees ($78).\nThe federal penal code criminalizes “promoting enmity between different groups on grounds of religion” and “acts prejudicial to maintenance of harmony,” including acts causing injury or harm to religious groups and members. The penal code also prohibits “deliberate and malicious acts, intended to outrage religious feelings of any class by insulting its religion or religious beliefs.” Violations of any of these provisions are punishable by imprisonment for up to three years, a fine, or both. If the offense is committed at a place of worship, imprisonment may be for up to five years.\nThere are no requirements for registration of religious groups, although federal law requires religiously affiliated organizations to maintain audit reports on their accounts and a schedule of their activities and to provide these to state government officials upon request.\nA federal law, known as the Foreign Contribution Regulation Act (FCRA), regulates foreign contributions to nongovernmental organizations (NGOs), including faith-based organizations. Organizations with “definite cultural, economic, educational, religious or social programs” must receive a federal government certificate of registration to receive foreign funds. The federal government may also require that certified organizations obtain prior permission before accepting or transferring foreign funds. The federal government may reject an application for a certificate of registration or a request for prior permission to transfer funds if it judges the recipient to be prejudicially affecting “harmony between religious, racial, social, linguistic, regional groups, castes, or communities.”\nThe constitution states any reference to Hindus in law is to be construed as containing a reference to followers of Sikhism, Jainism, and Buddhism, meaning they are subject to laws regarding Hindus, such as the Hindu Marriage Act. Subsequent legislation passed throughout the 1950s continues to use the word Hindu to include Sikhs, Buddhists, Jains, and others, but clarifies these are separate religions whose followers are included under this legislation.\nFederal law provides minority community status to six religious groups: Muslims, Sikhs, Christians, Parsis, Jains, and Buddhists. State governments may grant minority status to religious groups that are minorities in a particular region and designate them as minorities under state law. Minority status makes these groups eligible for several government assistance programs. The constitution states the government will protect the existence of religious minorities and encourage conditions for the promotion of their individual identities.\nPersonal status laws are applicable only to certain religious communities in matters of marriage, divorce, adoption, and inheritance. The government grants significant autonomy to personal status law boards in drafting these laws. Law boards are selected by community leaders; there is no formal process, and selection varies across communities. One personal law board governs all the denominations and sects within a particular religious community. Hindu, Christian, Parsi, and Islamic personal status laws are legally recognized and judicially enforceable. These laws, however, do not supersede national- and state-level legislative powers or constitutional provisions. If the law boards cannot offer satisfactory solutions, the case is referred to the civil courts.\nFederal law permits interreligious couples to marry without religious conversion. Interreligious couples, as is the case for all couples marrying in a civil ceremony, are required to provide public notice 30 days in advance, including addresses, photographs, and religious affiliation, for public comment. Hindus, Buddhists, Sikhs, or Jains who marry outside their religions, however, face the possibility of losing their property inheritance rights under those communities’ personal status laws.\nThe law recognizes the registration of Sikh marriages. There are no divorce provisions for Sikhs under personal status laws, however, and other Sikh personal status matters fall under Hindu codes. Under the law, any person, irrespective of religion, may seek a divorce in civil court.\nThe constitution prohibits religious instruction in government schools. The law permits private religious schools.\nTwenty-four of the 29 states apply partial to full restrictions on bovine slaughter. Penalties vary among states, and also may vary based on whether the animal is a cow, calf, bull, or ox. In the majority of the 24 states where bovine slaughter is banned, punishments include imprisonment for six months to two years and a fine of 1,000 to 10,000 rupees ($16 to $160). Rajasthan, Punjab, Haryana, Himachal Pradesh, and Jammu and Kashmir penalize cow slaughter with imprisonment of two to 10 years. On March 31, the Gujarat government passed a law increasing the penalties for killing cows, selling beef, and illegally transporting cows or beef. The new law mandates a minimum 10-year sentence (the punishment for some counts of manslaughter) and a maximum sentence of life imprisonment (the punishment for premeditated murder of humans) for these offenses.\nThe National Commission for Minorities, which includes representatives from the six designated religious minorities and the National Human Rights Commission, investigates allegations of religious discrimination. The Ministry of Minority Affairs may also conduct investigations. These bodies have no enforcement powers but launch investigations based on written complaints by plaintiffs charging criminal or civil violations and submit their findings to law enforcement agencies for action. Eighteen of the country’s 29 states and the National Capital Territory of Delhi have state minorities commissions, which also investigate allegations of religious discrimination.\nThe constitution allows for a form of affirmative action for Scheduled Caste or Scheduled Tribe communities, and the “Other Backward Class” – a category for groups deemed to be socially and educationally disadvantaged. Since the constitution specifies only Hindus, Sikhs, or Buddhists shall be deemed a member of a Scheduled Caste, the only means through which Christian and Muslim individuals may qualify for affirmative action benefits as members of religious communities is if they are considered members of the “backward” classes due to their social and economic status.\nThe government requires foreign missionaries of any religious group to obtain a missionary visa.\nThe country is a party to the International Covenant on Civil and Political Rights.\nGovernment Practices\nSummary paragraph: Authorities often did not prosecute violence by vigilantes against persons, mostly Muslims, suspected of slaughtering or illegally transporting cows or trading in or consuming beef. Members of civil society and religious minorities said, under the current government, religious minority communities felt more vulnerable to Hindu nationalist groups engaging in violence against non-Hindu individuals and places of worship. Religious minority communities stated, while the national government sometimes spoke out against incidents of violence, local political leaders often did not, and at times made public remarks that individuals could interpret as condoning violence. Some long-standing legal cases involving religiously motivated violence and riots continued to advance slowly. In May the Kerala High Court annulled a marriage between a Hindu woman and a Muslim man based on third-party allegations the woman was forcibly converted to Islam, despite her denial she was forced to do so.\nOn August 22, the Supreme Court ruled the practice through which a Muslim man could divorce his wife instantly by saying the word “talaq” (Arabic for divorce) three times was unconstitutional. On May 23, the government banned the sale of cattle for slaughter through animal markets. In July the Supreme Court stayed the implementation of the order across the country for three months; the government was expected to withdraw the ban after receiving negative feedback from state-level agricultural sectors but had not done so by year’s end. The government continued its challenge to the minority status of Muslim educational institutions in the Supreme Court. Minority status afforded these institutions independence in hiring and curriculum decisions.\nAccording to media, on June 27, the Gujarat High Court granted bail to Atul Vaidya, a VHP leader who was one of 24 convicted in the 2002 anti-Muslim “Gulberg Society” killings.\nIn June 2016, a Gujarat special court convicted 24 individuals (11 of whom received sentences of life imprisonment) and acquitted 36 others for their role in the mob killing of 69 persons in the Gulberg Society neighborhood during the 2002 Gujarat riots. This incident was one of 10 mass killings in 2002 in Gujarat, which perpetrators of the violence said was in retaliation for the burning to death of 59 Hindu pilgrims on a train on February 27, 2002. According to media, on October 5, the Gujarat High Court dismissed an appeal submitted by Zakia Jafri, one of the Gulberg Society survivors. Jafri requested a new investigation into 58 individuals, including then-Chief Minister (and now prime minister) Narendra Modi, for conspiracy in the 2002 riots. According to press reports, the High Court stated Jafri could approach either the trial court or the Apex Court to seek a reinvestigation into her allegations challenging a 2013 ruling by a Supreme Court-appointed panel that stated there was insufficient evidence to prosecute the 58 individuals\nIn September the Allahabad High Court granted bail to the 18 individuals charged with participating in the September 2015 mob lynching of Mohammad Akhlaq Saifi in Dadri, Uttar Pradesh, for allegedly slaughtering a cow. In September 2016, investigating officials concluded there was no evidence to prove Akhlaq or his family ever slaughtered a cow. In October 2017 media reported a Bharatiya Janata Party (BJP) state legislator in Uttar Pradesh was working to help the 18 charged individuals out on bail secure employment and the family of one of the accused that died in jail would receive 800,000 rupees ($12,500).\nIn September the Rajasthan High Court granted bail to five of the seven individuals arrested for killing Pehlu Khan, a Muslim dairy farmer from Haryana, on the basis of a video of the attack gone viral. In September authorities also closed an investigation into six other individuals whom Khan had identified as participants in the attack. On April 1, a group of 200 so-called “cow vigilantes” had attacked Khan in Alwar while he was transporting two cows and two calves in the back of his truck; Khan died two days later.\nOn March 22, a National Investigation Agency (NIA) Special Court sentenced two workers from the Rashtriya Swayamsevak Sangh (RSS), a Hindu nationalist organization, to life imprisonment for the 2007 explosion at the shrine of Sufi mystic Khwaja Moinuddin Chishti in Ajmer, Rajasthan. The blast, which occurred just before an iftar, killed three persons.\nOn April 9, a member of Telangana’s legislative assembly, T. Raja Singh Lodh, reportedly stated he would behead those opposing the construction of the Ram temple at a disputed site in Ayodhya in Uttar Pradesh. Media outlets widely perceived his comments as targeting Muslims, whom the media expected to oppose the construction of a Hindu temple over the site where a mosque stood during the Mughal Empire. The Hyderabad police charged Lodh for taking deliberate and malicious acts intended to outrage religious feelings of any class by insulting its religion or religious beliefs. On May 13, police charged Lodh and Mohammed Abdul Majid, of the Islamic Darsgah-Jihad-O-Shahadath (DJS) organization, for promoting enmity between different groups on the basis of religion. The charges were based on alleged statements related to maintaining private armies to defend Hinduism and Islam, respectively. On July 27, the Telangana Law Department permitted police to prosecute Lodh for hate speech for inflammatory remarks he delivered at a “cow protection” rally in September 2013.\nOn July 13, Prime Minister Narendra Modi condemned a rise in deadly mob attacks on cattle traders, consumers of beef, and dairy farmers, and said killing persons in the name of protecting cows was unacceptable. On July 21, in response to a petition filed by social activist Tehseen Poonawala asking authorities to take action against “cow vigilantes,” Solicitor General Ranjit Kumar stated the federal government did not support “cow vigilantism” but that actions to curb such incidents needed to be taken at the state level.\nOn April 14, the Punjab government announced the formation of a commission, led by retired Justice Ranjit Singh, to investigate the October 2015 police shootings during widespread Sikh protests, which killed two and injured 80 protesters. Sikhs protested in five districts after reports a Sikh holy book had been desecrated by unknown persons. The state government formed the new commission after several Sikh organizations said the sacrilege case was “compromised” by the previous commission, led by former Press Council of India Chairman and retired Supreme Court Justice Markandey Katju, which had investigated the incident at the behest of several human rights NGOs. On June 28, the new commission recommended charges against the police officers involved for “unwarranted firing,” and compensation of 2.5 million rupees ($39,200) and regular employment to family members of Gujreet Singh and Krishan Bhagwan Singh, both killed in the shootings. By year’s end, authorities had not paid compensation to the victims.\nPress reports noted the Supreme Court formed a new Special Investigation Team (SIT) to assess 186 cases related to anti-Sikh riots in Delhi and Punjab in 1984. Reports said the SIT would include a retired High Court judge, a police officer of the rank of inspector general, and a serving police officer of the rank of superintendent. Previously, on August 16, the court had appointed a supervisory panel made up of two retired judges to examine a previous SIT’s decision to close 241 cases due to lack of evidence. The court asked the supervisory panel to produce a report on their finding in three months. The supervisory panel determined 186 cases out of the 241 should be investigated further.\nOn May 4, the Bombay High Court upheld the conviction of 11 individuals sentenced to life imprisonment in January 2008, for participating in the gang rape of pregnant 19-year-old Bilkis Bano during the 2002 communal riots in Gujarat. The twelfth individual convicted for the crime died before the May ruling. The court also set aside the previous acquittal by a lower court of seven other individuals – five police officers and two doctors – accused of participating in the rape and convicted of failing to perform their duties and tampering with evidence. The court rejected the Criminal Bureau of Investigation’s request to change the penalties of the three “main perpetrators” from life sentences to death penalties.\nMembers of civil society and religious minorities stated that under the current BJP government religious minority communities felt more vulnerable due to Hindu nationalist groups engaging in violence against non-Hindu individuals and places of worship. Religious minority communities stated, while the national government sometimes spoke out against incidents of violence, local political leaders often did not, and at times made public remarks individuals could interpret as condoning violence. On April 2, Chhattisgarh’s BJP Chief Minister Raman Singh told reporters anyone killing a cow in his state would be hanged. In a speech at University of Bangalore on August 7, then-Vice President of India Hamid Ansari said Dalits, Muslims, and Christians were feeling increasingly insecure. In an August 10 interview, Ansari stated there was a feeling of “unease” and “insecurity creeping in” among Muslims in the country. His remarks drew criticism from the BJP and Hindu nationalist groups.\nOn May 21, Madhya Pradesh police arrested six Christians for allegedly kidnapping 72 minors with the intention of forcibly converting them to Christianity. The children’s parents stated they were already Protestants and had given consent for their children to attend a summer Vacation Bible School (VBS) camp in Nagpur under the care of the arrested Christians. Police stated the children’s families had not provided proof they had already converted to Christianity. According to the Christian NGO Morning Star News (MSN), on June 12, the state high court denied bail to the six VBS volunteers: Ameya Jaal, Alkesh Ganava, Pandu Singh Vasuniya, Nitin Mandod, Lalu Babore, and Vijay Meda, a 17-year-old minor. Authorities reportedly held one of the VBS attendees, 15-year-old Akash Gundia, in juvenile detention center for nearly a month before releasing him on June 20. Gundia said children as young as six years old were also in police custody until police released them when their parents arrived. His father, Singh Gundia, told MSN, “I got to know from the police station that police had not intended to file the case, but that there was pressure from RSS [a self-defined Hindu nationalist group] and Bajrang Dal activists, because of whom my child spent 25 days in judicial custody.” NGO Human Rights Without Frontiers (HRWF)’s Prisoners List 2017 stated, although it was reported police released the children to their parents, there was no precise information on the status of the 71 children besides Gundia.\nMedia reported police arrested seven Christian pastors – Stanley Jacob, Vijay Kumar, Sumit Varghese, David from New Delhi, Amit from Mathura, Anita from Hathras, and Dinesh from Rajasthan – on December 4 while they were holding a prayer meeting in a private home. The following day a court sentenced them to 14 days in judicial custody for carrying out a forcible conversion campaign. Family members of the seven pastors said local residents were upset because some individuals were converting to Christianity.\nAccording to news sources, on March 12, the Ghaziabad police arrested four men after the anti-Muslim video they uploaded on WhatsApp went viral. Authorities charged Ajay Chaprana, Prakash Dubey, Nakul Nagar, and Mukesh Yadav, all under the age of 25, with using inappropriate language, fanning communal hatred, making abusive comments against a community, and uploading the video to various social media. The video was deleted and the accused men were sent to judicial custody. No updates were available at year’s end.\nMSN reported police arrested Christian teenager Karan Anthony on August 23 for promoting enmity between classes. His former classmate and friend Sathin Gaur had filed a police complaint that Anthony posted anti-Hindu comments on Facebook. Anthony denied the charge, saying he had not used Facebook in months because whenever he posted something about Christianity, his classmates started sending abusive comments to him. Anthony told MSN, “It was my good friend who falsely framed me by joining hands with Rudra Sena [a self-defined Hindu nationalist group] activists.” Police held Anthony in jail for 12 days, and then released him on bail on September 3.\nOn March 28, media reported Madhya Pradesh police arrested Dr. Aatik Khan after an individual objected to his sharing an image on social media of a sadhu (Hindu ascetic) standing near a meat shop. Police reportedly said the post mocked the closure of illegal slaughterhouses in Uttar Pradesh and, as directed by Uttar Pradesh Chief Minister Yogi Adityanath, charged Khan for making statements conducive to “public mischief.”\nOn June 15, the government railway police forced a Catholic nun, three women, and a minor to disembark from a train in Satna, Madhya Pradesh, after Matrushakti, the women’s wing of VHP, accused the nun of forcible conversion. Police released the detainees but later charged Sister Bina Joseph for abduction of a minor after the child’s parent filed a complaint. Prior to the incident, Father Stephen P. Maria, the public relations officer of the Catholic Diocese of Madhya Pradesh, had submitted a statement to railway police reporting harassment of Christian missionaries traveling by train in the region.\nThe media reported on May 25 that the Kerala High Court annulled a marriage between a Hindu woman and a Muslim man, based on third-party allegations the woman was forcibly converted to Islam. Acting upon a petition from the woman’s father, the court ordered the woman to return to her parents’ home. She denied that she was forced to convert. On July 6, the husband appealed the Kerala High Court ruling to the Supreme Court, arguing his wife had consented to conversion. The Supreme Court accepted the case and referred it to the NIA, which stated the case of the woman converting from Hinduism to Islam was not an isolated one and it could be part of a larger plot by Muslim men to convert Hindu women. Following this statement, the Supreme Court ordered the NIA to investigate the allegations of forced conversion in this case. On November 27, after the wife appeared before the Supreme Court, it ruled she could leave her parent’s custody and return to her college in Kerala under the supervision of the school’s superintendent. Media reported that on December 9, she reunited with her husband at the college for the first time in more than a year.\nOn May 23, the central government issued a regulation banning the sale of cattle for slaughter through animal markets. Some observers reportedly expressed concern that the ban would most negatively impact Muslims, who dominate the country’s quarter trillion rupee ($3.9 billion) buffalo meat export industry. In July the Supreme Court stayed the implementation of the order for three months. According to media reports, the ban resulted in major protests from farmers, beef-consuming states, and an adverse order from the Supreme Court. On November 30, a senior official at the Ministry of Environment, Forest, and Climate Change said the government was “considering certain changes, which will make rules more acceptable” but no updates were available by the end of the year.\nOn August 25, the Supreme Court clarified its verdict declaring privacy a fundamental right would also have a bearing in matters related to the possession of beef in Maharashtra. Earlier that month the Supreme Court agreed to hear a Maharashtra government appeal of the May 2016 Bombay High Court ruling that a portion of the state’s 2015 beef ban was unconstitutional. The Bombay High Court stated Maharashtra could not prohibit possession of beef from cows slaughtered outside the state because doing so would violate the right of citizens to possess and consume food of their choice. The Supreme Court had not heard the appeal by year’s end. Consumers, butchers, and sellers in Maharahstra State said they remained vulnerable to prosecution in court because the burden of proof the cow was not slaughtered in Maharashtra rested on the accused.\nOn September 6, the Supreme Court directed all state governments to appoint a senior police officer in each district to prevent and respond effectively to incidents of “cow vigilantism.” A three-judge panel also directed the chief secretaries of all state governments to report on actions taken to prevent incidents of “cow vigilantism.”\nOn August 22, the Supreme Court ruled the provision of Muslim personal law permitting a Muslim man to divorce his wife instantly by saying the word “talaq” (Arabic for divorce) three times was unconstitutional. The court preserved all other aspects of Muslim personal law, including other forms of divorce. The ruling came in response to a petition a Muslim woman, Shayara Banu, filed in 2016.\nOn September 8, the Jammu and Kashmir State government imposed restrictions in parts of Srinagar limiting protests against Burmese treatment of its Muslim Rohingya population. The restrictions included a ban on Friday Islamic prayers. The Muttahida Majlis-e-Ulema (MMU), a Kashmiri council of Muslim leaders and scholars, had called for protests following Friday prayers to express solidarity with Rohingya, and authorities placed under house arrest MMU leader Mirwaiz Umar Farooq. An MMU spokesperson stated “the government continues to follow the policy of oppression, and disallowing Friday prayers is a direct interference in religious activity.”\nIn March the US faith-based organization Compassion International, which the government had placed on its prior approval list, closed its operations in the country because it could not transfer funds to its local implementing partners. Compassion International maintained that the government used the law to restrict the work of Christian charitable organizations.\nIn July the Maharashtra Prohibition of People from Social Boycott (Prevention, Prohibition and Redressal) Act became law – the first law of its kind in the country to punish social excommunication and abuses by extrajudicial caste and community courts. Pune city resident Umesh Rudrap filed the first complaint in Maharashtra against his community council, the Telugu Madelwar Parit Community, after it sanctioned a social boycott following his intercaste marriage. The boycott prevented him from attending religious ceremonies in his community.\nThe Chhattisgarh Christian Forum reported that on July 14, in Belwapar village of Sukma District, a mob attacked 18 Christian families and vandalized property while the families attended a prayer meeting at a local Christian’s home. The forum stated police did not press charges against the assailants, and that the Christian families were subsequently under threat of social boycott in the village and of being arrested as Maoist insurgents. The Forum reported local police did not investigate incidents of a similar nature occurring in 22 villages in southern Chhattisgarh during the year.\nMSN reported police detained six Christians on June 27 for unlawful assembly, defined as knowingly joining or continuing in any assembly of five or more persons after being commanded to disperse. Pastor Asha Ram Sahni said Station House Officer Aravind Kumar berated and slapped him multiple times for reading the Bible instead of Hindu texts. Another detainee, Gurudeen, said Kumar told him, “You instigate people and convert them to Christianity, and you consume beef too. You will spend your life in jail.” Gurudeen said the inspector reportedly sent police officers to his house to harass his wife for four days during his incarceration. The other four detainees were Chote Lal, Ram Naresh, Gobrey Nishad, and Lal Bihari Verma. HRWF reported all six were granted bail and released on July 5.\nOn September 28, the Maharashtra State government announced that “neo-Buddhists” (Dalits who adopted Buddhism in the mid-twentieth century) were eligible for minority welfare benefits in the state. Members of Muslim, Christian, Jewish, Buddhist, Sikh, Parsi, and Jain minority communities continued to be eligible for minority welfare benefits in the state.\nOn March 19, more than 100 persons, many of whom stated they were “cow protectors,” protested in front of a hotel owned by a Muslim in Jaipur and alleged that the hotel was serving beef, which is banned in Rajasthan. The Jaipur Municipal Corporation, an urban-level government body, reportedly shut down the hotel following the protests, triggering nationwide condemnation. One media report stated the community was primarily upset about the manner in which the hotel was disposing nonvegetarian foods, which were subsequently eaten by the nearby cows. On May 9, police stated forensic examination of meat samples seized from the hotel ruled out the possibility that it was from a cow. The hotel reopened on June 1, after having remained closed for 74 days.\nSection III. Status of Societal Respect for Religious Freedom\nSummary paragraph: There were reports of hundreds of religiously motivated killings, assaults, riots, restrictions on the right to practice religion and proselytize, discrimination, and attacks on property. Groups most frequently targeted were Muslims and Christians. Cow protection groups, many of whose members believed cow slaughter and eating beef were an attack on the Hindu deities representing motherhood, carried out several violent attacks, including killings, beatings, harassment, and intimidation against consumers of beef or those involved in the beef industry.\nAccording to the MHA 2016-17 Annual Report, from January through May, there were 296 conflicts between religious communities, resulting in 44 deaths and 892 injuries. MHA reported 703 “communal incidents” in 2016, resulting in 86 deaths and 2,321 injuries, compared with 751 such incidents in 2015, resulting in 97 deaths and 2,264 injuries. MHA defined “communal incidents” as violent conflicts involving religious communities on the issues of organizing religious congregations, desecration of religious symbols, and the ownership of community properties and facilities.\nAccording to media data project IndiaSpend, 63 incidents of cow-linked violence occurred between 2010 and June 2017, leading to 28 deaths. Ninety-seven percent of those incidents occurred between 2014 and 2017, and 86 percent of those killed were Muslim. There were 11 deaths related to “cow vigilantes” during the year, the highest toll since 2010, when IndiaSpend began collecting data.\nThe Religious Liberty Commission of the Evangelical Fellowship of India (EFI-RLC) documented at least 351 cases of violence and attacks against Christians and churches during the year, compared with 300 in 2016 and 177 in 2015. It noted the year had been one of the most traumatic for the Christian community. The EFI-RLC urged the government to intervene and uphold the rule of law to restore community confidence in the government. EFI general secretary Vjayesh Lal remarked the instances of attacks on churches on Sundays and other important days of worship – Palm Sunday, Good Friday, Easter, and Christmas – had increased, and Hindu nationalists attacked “even private worship,” “violating the privacy and sanctity of an individual or a family and trampling upon their constitutional rights.” An analysis of the year’s data showed Tamil Nadu with the highest incidence of violence against Christians, with 52 cases, followed by Uttar Pradesh with 50; Chhattisgarh, 43; Madhya Pradesh, 36; and Maharashtra, 38. Six cases were reported in Delhi.\nAccording to the Union of Catholic Asian News (UCAN), Persecution Relief, an interdenominational Christian NGO, recorded 736 attacks on Christians during the year, compared with 348 in 2016. The report stated Hindu attacks on Christians doubled as part of an unprecedented trend to portray Christians as acting against the state, the country’s religious tolerance, and the national ethos. Most police complaints filed against Christians reportedly accused them of crimes, including committing sedition, working against religious tolerance, discriminating against others, acting against integration, defiling places of worship, and insulting other religions. The founder of Persecution Relief told UCAN, “In 99 percent of cases, [Hindus] bring false witnesses and charge victimized Christians with serious offenses like sedition.” He added, if sedition charges were proved, the accused could be sentenced to life in prison.\nOn June 22, assailants stabbed to death 16-year-old Junaid Khan on a train in Haryana during an argument over a seat. According to the press and eye-witness accounts, the perpetrators accused Khan of being a “beefeater,” fatally stabbed him, and threw him off the train. Two of Khan’s brothers were injured in the incident. Haryana police arrested six accused in connection with the incident, including Naresh Kumar and Rameshwar Dass. By August local courts had reportedly granted bail to four of the six after police dropped charges of rioting, unlawful assembly, and common intention (intent to commit murder). Authorities continued to investigate the railway police officer’s reported failure to intervene. On June 28, in response to this incident and recent “cow vigilante” attacks, civil society groups organized countrywide protests. Known as the Not In My Name campaign, thousands of participants in more than 10 cities condemned cow-vigilante violence and called for the government to take more decisive action.\nOn December 6, media reported a Hindu man, Shambhulal Regar, hacked, burned alive, and killed a Muslim laborer whose burned body police found the next morning. The attacker filmed himself leading the victim to a secluded spot, attacking him with a weapon, and setting on fire the unconscious man. Then he faced the camera to warn against “love jihad,” “or else you will meet the fate of this man.” In a press conference, a police spokesperson called the incident a brutal crime, and announced a special investigation team, the arrest of the attacker, and beginning an investigation.\nAuthorities in Tamil Nadu charged six Muslim youths with murder for the March 17 killing in Coimbatore of H. Farooq, who had reportedly posted material supporting atheism on social media. Their trial began in October; no update was available at year’s end.\nOn July 15, two unidentified men on a motorcycle shot and killed Sultan Masih, the pastor of an independent church in Punjab. Punjab Chief Minister Amarinder Singh said the killers would be brought to justice and promised 500,000 rupees ($7,800) to Masih’s widow and a job with local police for one of Masih’s sons. On December 1, media reported the NIA arrested two men who had ties to Sikh violent extremist elements. Ramandeep Singh and Hardeep Singh reportedly admitted involvement in eight murders and attempted murders in Punjab since 2016, including Masih’s. Their trial was ongoing at year’s end.\nOn July 17, in Muzaffarnagar District, Uttar Pradesh, Naseem Khan was killed by members of his wife’s family two years after she converted to Islam and married him against her family’s wishes. The police filed initial charges against four members of the wife’s family, who remained in custody awaiting trial at year’s end.\nMedia reported on September 25 that a 28-year-old Hindu woman registered a complaint with the Kerala High Court that she was detained by her father and other family members and taken to the Yoga and Charitable Trust center where she was confined for 22 days for marrying a Christian man. The woman said while she was held captive along with 65 others, they were physically assaulted by five individuals and taught the “evils of Christianity and Islam.” She said they were also subjected to sexual assault. According to the woman, her family pressured her to marry a Hindu, and she left the center on August 21 after pretending to agree with her family’s demands.\nThe Udhayamperur police registered a case against six individuals, including the woman's brother-in-law, Manoj Guruji, who ran the yoga center with four others. Following the complaint, police issued a notice seeking immediate closure of the center because it did not have a license. The center counselor said the allegations of torture and sexual assault were baseless and the woman had attended yoga and counseling to treat her depression.\nOn April 25 in Reasi, Jammu and Kashmir State, a group of “cow vigilantes” attacked a Muslim family, leaving at least seven persons injured. The family members were transporting a herd of cattle when the individuals attacked them. Media report that police charged 11 individuals involved in the incident with attempted murder. Police also charged the Muslim family with transporting cattle without permission.\nMedia reported a group of 10 unidentified members of the Hindu nationalist organization Jagaran Vedike physically attacked and smeared black oil on the face of writer Yogesh Master in Davangere, Karnataka on March 12. Master said the group threatened to kill him for writing against Hindu gods. Police arrested two attackers and reportedly continued to search for the remaining eight.\nMultiple media reports stated communal riots took place on July 3, approximately 30 miles outside Kolkata in two Muslim-majority areas of West Bengal’s North 24 Parganas District after a Hindu teenager made a Facebook post that some Muslims said was offensive. Muslim and Hindu mobs attacked the police, ransacked shops and homes, and blocked the highway leading to Bangladesh. West Bengal Chief Minister Mamata Banerjee blamed the BJP for inciting violence. BJP leaders blamed Bangladeshi Muslims, while Banerjee’s Trinamool Congress Party held Hindu nationalists responsible. There were no reported injuries or deaths.\nEFI reported at least five incidents on April 9, targeting Christians in Madhya Pradesh, Haryana, Uttar Pradesh, Rajasthan, and Tamil Nadu. In Kaithal, Haryana, local Hindus reportedly disrupted a church meeting and accused worshippers of attempting to induce locals to convert to Christianity. Police detained the pastor and worshippers but later released them. In Sri Ganganagar, Rajasthan, Hindus disrupted a Church of God service; police subsequently arrested the church’s pastor and seven worshippers for reportedly converting local villagers. Police released them after local Christian leaders intervened.\nOn May 6 and 7, media reports and others stated VHP and Bajrang Dal activists confronted a group of Muslims in the town of Utnoor in Adilabad District, Telangana. Following the confrontation, Hindu activists attacked local police. The attackers injured 10 police officers and damaged property. The incident followed the circulation of a WhatsApp audio clip members of the Hindu community considered offensive. Hindu activists filed a complaint with police upon discovering the audio clip, but when they believed police did not act quickly enough, they attacked Muslim-owned properties. Muslim groups retaliated by pelting stones at the Hindu activists. Police intervened and the Muslim groups withdrew, but the Hindu activists pelted stones at police. Police arrested some individuals involved in the incident and the case continued through year’s end.\nOn June 7, during Ramadan, a mob demolished a mosque under construction in New Delhi. Two days later a mob assaulted and handed over to police Basit Malik, a Kashmiri Muslim freelance journalist who had gone to the neighborhood to investigate the demolition. On June 7, media reported police charged seven individuals with trespassing and mischief causing damage. Malik reportedly declined to file a police complaint.\nOn August 25, communal clashes occurred after a cow carcass was spotted near Muslim households in Adauli village in Uttar Pradesh. The following day police reportedly arrested five individuals and detained 10 others for interrogation. The senior superintendent of police told a news agency they registered three cases for cow slaughter, stone pelting, and damaging two mosques in the village.\nOn February 24, a mob of approximately 200 Hindus attacked a group of 1,700 Christians who had gathered at a peace festival organized by 12 churches from the Delhi and National Capital Region in Badarpur, Delhi. According to EFI, the mob assaulted persons in seats and on stage, and vandalized property, resulting in a significant financial loss of the organizers. Global Christian News (GCN) said many were injured, including a pastor who bled from his nose and mouth for several hours after 10-15 assailants beat him. The next day police filed charges against the attackers. No updates were available at year’s end.\nOn April 6 and 7, violence broke out in the town of Bhadrak in Odisha after three Muslim youths reportedly posted comments on Facebook against Hindu deities. The district administration imposed a curfew, shut down internet service for 48 hours, and deployed additional police forces. The unrest included incidents of arson and damage to an estimated 500 commercial and residential properties. A government estimate put the total loss at 90 million rupees ($1.4 million). Civil society activists blamed the district administration for contributing to an escalation in tensions by permitting a bikers’ rally that reportedly displayed pro-Pakistan slogans. An activist pointed to the failure of the state and district administrations to follow the Ministry of Home Affairs’ standard operating procedure for maintaining communal harmony. Police arrested 146 persons and announced compensation ranging from 15,000 rupees ($240) to 200,000 rupees ($3,100) to the owners of damaged properties.\nMedia reported a March 25 dispute between two Hindu and Muslim high school students in Vadavali village in the Patan district of Gujarat escalated into a mob attack on the village’s Muslim residents. The mob set homes and vehicles on fire, ransacking around 50 houses and many vehicles. Two persons died, one of them in police firing, and ten others were injured.\nMedia reported that, on August 20, police arrested 39 Wisdom Global Islamic Mission (WGIM) members in Paravoor, Kerala State, on charges of “disrupting communal harmony” for attempting to distribute pamphlets. Muslim leaders stated the arrests were made at the behest of Hindu activists and said Hindus had physically attacked the WGIM members at the police station prior to the arrests. According to media reports, Kerala Chief Minister Pinarayi Vijayan told the state legislative assembly the pamphlets distributed by the WGIM members criticized polytheists and idol worshippers. A local court granted bail to the arrested WGIM members and stated they were exercising their constitutional rights.\nIn February students of Government First Grade College in the Uttara Kannada District of Karnataka protested against three guest faculty members from the Muslim community wearing burqas, according to College principal professor Manjula. Some protesters in turn triggered a threat of action from a Muslim organization, Tanjim, against the faculty members should the faculty members not wear burqas to the school. The protest ended after Manjula told students they would face legal consequences if they continued to create problems. At year’s end, one of the guest faculty members remained at the college and continued wearing a burqa.\nOn September 21, media reported members of Hindu nationalist political party Shiv Sena forced more than 500 meat shops to shut down in Gurugram, Haryana, during Navratri, a Hindu festival observed twice a year when many Hindus abstain from eating meat. On March 28, 200 Shiv Sena activists reportedly forced all meat shops in Gurugram to close during Navratri.\nMSN reported that on January 21, VHP members threatened K.A. Swamy and took him to the police station to prevent him from distributing copies of the Bible to passersby in Hyderabad. GCN said video clips went viral on social media showing six men using derogatory language against him, his wife, and his children. They reportedly forced him to put his Bible on his head and swear that he would no longer distribute Bibles. Afterwards, they took him to the police station where police reportedly questioned and released him without charge. According to GCN, on his ride home Swamy suffered a brain hemorrhage and a paralytic stroke – most likely due to hypertension, according to MSN. He went into a coma but eventually recovered; his wife told MSN he was discharged from the hospital and doing better, as of May 9. The VHP denied that its members had physically harassed Swamy and stated its activists only verbally confronted Swamy when he was offending Hindu deities. Following a complaint filed by Swamy’s wife, police arrested three VHP activists.\nMedia reported VHP’s joint general secretary on October 9 told Christian missionaries to leave the country and said VHP would hold a rally called “Quit India.” He added VHP would not allow a single Christian missionary to remain in the country.\nOn June 9, the Christian community in Ahmedabad, Gujarat, protested the publication of a Hindi language textbook they said characterized Jesus Christ as a “devil” (the textbook used the Hindi word “haivan”), prompting the Gujarat State School Textbook Board (GSSTB) to remove the word in online versions of the book on June 10. Similarly, another GSSTB textbook defined the Muslim practice of fasting during Ramadan as “cholera.” The GSSTB chair said both were “printing errors” and promised to correct them in later editions.\nOn June 17 in Goa, at the sixth All India Hindu convention organized by Hindu Janajagruti Samiti, a Hindu nationalist organization, an estimated 132 Hindu organizations resolved to establish the country as a Hindu state by 2023, ensure a ban on cattle slaughter, declare the cow as the country’s national animal, and ban all religious conversions.\nIn September the Gujarat High Court directed Junagadh police to protect an interfaith couple following the petition of the Hindu woman’s father to the court objecting to his daughter’s marriage to a Muslim man. The couple stated they were being threatened by Hindu organizations and pressured to separate. The court also ordered the father to return all identification documents to his daughter.\nSection IV. US Government Policy and Engagement\nThroughout the year representatives from the embassy and its consulates general met government officials, civil society, and religious leaders to discuss issues including Islamic divorce and the challenge of protecting personal religious laws in accordance with the constitution, the minority status of universities, beef bans, and religiously motivated political violence. In April the Charge d’Affaires hosted a roundtable lunch for women interfaith leaders at her residence. The theme of the lunch was interfaith and religious diversity; they also discussed the role of women in religious institutions.\nThe embassy and consulates general continued to meet with religious organizations, missionary communities, and NGOs of all religious backgrounds to discuss religious freedom concerns and US government responses. They discussed concerns related to a perceived increase in attacks against religious minorities and the perceived diminishing space for religious freedom. Interlocutors included the Cardinal of the Syro-Malankara Catholic Church, Metropolitan Bishop of the Mar Thoma Church, Imam of Jama Masjid, leaders of several mosques, Hindu priests of Akshardham Temple, priests of the International Society for Krishna Consciousness, as well as representatives of the India Islamic Cultural Center, All India Imams’ Organization, the Catholic Bishops Conference of India, the Church of North India, the Delhi Catholic Archdiocese, the Paris community, the Buddhist-dominated Kushinagar, the Bharatiya Sant Samiti, the Chinmaya Mission, the Bahai community, and Sikh leaders. Representatives from most of these organizations were also present at the interfaith iftar dinner the Charge d’Affaires hosted in June.\nIn May the Charge d’Affaires inaugurated a traveling art exhibit called “Keeping Faith: Indian Religions in the United States.” She emphasized religious tolerance and interfaith diversity as a strength of both the United States and India. The exhibition included a total of 37 framed photographs and showcased the religious diversity of the Indian American diaspora, and the effect this community had on American culture. The exhibit traveled to several Indian cities and became a platform for embassy personnel to discuss issues of religious tolerance and diversity.\nThe Consulate General in Mumbai organized a “faith walk” in Mumbai’s Mahim neighborhood in March, visiting an Islamic shrine, a Catholic church, and a Hindu temple to promote interfaith dialogue and religious diversity. Members from each religious community participated in the walk. In May the Consul General, together with Catholic Archbishop Felipe Neri Ferrao of the Archdiocese of Goa and Daman, organized a roundtable in Goa to discuss the Catholic community’s concerns about antiminority rhetoric and rising religious intolerance.\nThe Consulate General in Kolkata engaged in outreach to a range of community leaders and religious establishments. The Consul General visited Belur Math – headquarters of the Hindu order Ramakrishna Mission founded by Swami Vivekananda – and discussed religious harmony and tolerance with senior monks. The Consul General visited the Kamakhya temple, a Hindu pilgrimage site in Assam. He met with the Imam of Nakhoda Masjid, the largest mosque in Kolkata, and with the leaders of the Ahmadi Muslim community. In Patna city in Bihar, he visited the gurudwara marking the birthplace of Guru Gobind Singh, the last Sikh guru. In Bihar’s Buddhist religious site of Bodh Gaya, he visited the Maha Bodhi temple. During his outreach, the Consul General delivered a message of tolerance and actively promoted the need to work across religious communities to achieve common objectives. During the discussion the Consul General, senior Hindu and Buddhist monks, an imam, a Christian priest, and Sikh and Jewish community leaders expressed the need for interfaith dialogue and tolerance.\nThe embassy and consulates general hosted celebrations marking major religious holidays, including Ramadan, Holi, Eid al-Fitr, and Easter to bring together leaders from different religious groups. During these events, representatives of the embassy or consulates general and interfaith guests raised religious freedom and tolerance in speeches and informal discussions. Embassy and consulate general officials continued to monitor cases involving reports of religious persecution, intolerance, and religiously motivated attacks.\nSource: US State Department Website", "url": "https://www.dnaindia.com/india/report-full-text-of-us-state-department-s-annual-religious-freedom-report-2017-on-india-2620215", "label": 2}