{"authors": [], "date_download": "2019-03-27 14:00:00", "date_modify": "2019-03-27 14:00:00", "date_publish": "2015-12-13 22:47:27", "description": "The Bombay High Court continued to dictate its order in the 2002 hit and run case involving actor Salman Khan today and indications are that the superstar will get a reprieve.", "filename": "india_story_salman-khan-hit-and-run-case-possible-relief-for-superstar-276336-2015-12-09_1553695200.html", "image_url": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/201512/salman_story-647_120915014902.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/indiatoday.in/india_story_salman-khan-hit-and-run-case-possible-relief-for-superstar-276336-2015-12-09_1553695200.html", "title": "Salman Khan hit and run case: Possible relief for superstar", "title_page": "Salman Khan hit and run case: Possible relief for superstar - India News", "title_rss": "NULL", "source_domain": "indiatoday.in", "text": "The Bombay High Court continued to dictate its order in the 2002 hit and run case involving actor Salman Khan today and indications are that the superstar will get a reprieve.\nJustice A R Joshi, who is dictating the order in the case, pointed out that the prosecution has to prove their case beyond reasonable doubt that Salman was driving his Land Cruiser when it hit a pavement killing one and injuring four others.\n\"Evidence of Ravindra Patil is not to be considered as an alternative as it was recorded for a lesser charge,\" the order stated. The final verdict in the case is likely to come later this week.\nIn May this year, Salman was convicted for culpable homicide not amounting to murder amongst other charges. The Bombay High Court, however, has suspended his sentence.\nTimeline of Salman hit and run case:\nSeptember 28, 2002: Salman's white-colour Toyota Land Cruiser crashes into American Express Bakery at Hill Road at Bandra, killing one person and injuring four others.\nSeptember 28: Salman's blood samples taken.\nSeptember 28: Salman arrested by Bandra Police, granted bail.\nOctober 1: Salman booked under provisions of IPC, Motor. Vehicles Act, 1988, and Bombay Prohibition Act, 1949.\nOctober 2002: Mumbai Police invokes section 304-II of IPC i.e culpable homicide not amounting to murder which attracts punishment of jail term of 10 years.\nOctober 7, 2002: Salman surrenders again before Bandra Police, he is arrested.\nOctober 21, 2002: Mumbai Police files charge sheet in Bandra magistrate court.\nOctober 24, 2002: Salman granted bail.\nMarch 2003: Salman challenges application of section 304-II of IPC in Mumbai sessions court.\nMay 2003: Sessions court rejects the plea, asks magistrate court to frame charges.\nJune 2003: Salman moves Bombay High Court, which opines that section 304-II of IPC not applicable in the case.\nOctober 2003: Maharashtra government challenges Bombay HC order in Supreme Court.\nDecember 2003: SC rules that the magistrate court may decide whether section 304-II of IPC could be applied.\nOctober 2006: Magistrate frames charges against Salman Khan.\nOctober 3, 2007: Police bodyguard Ravindra Patil, who filed the first FIR, dies of TB.\nOctober 2011: Prosecution demands Salman Khan must be tried under harsher sections.\nDecember 23, 2013: Additional Chief Metropolitan Magistrate V S Patil, after examining 17 witnesses, invokes charge of culpable homicide not amounting to murder on the actor and refers case to Sessions Court for trial.\nJune 24, 2013: Sessions Court holds that culpable homicide charge is applicable, rejects Salman's appeal against the order of Magistrate.\nApril 27, 2014: Fresh trial begins in Sessions Court, first witness deposes.\nJuly 24, 2014: Charges framed against Salman in fresh trial by Sessions Court.\nJuly 2014: Files in the case disappear from Bandra Police Station. Original statements of 63 witnesses reported missing. Court orders inquiry.\nSeptember 12, 2014: Files found and produced before court.\nSeptember 2014: Pradeep Gharat appointed Special Public Prosecutor in this case.\nMarch 25, 2015: Prosecution closes evidence after examining 24 witnesses.\nMarch 27, 2015: Salman Khan's statement recorded under section 313 CrPC by Additional Sessions Judge D W Deshpande.\nMarch 31: Salman's driver Ashok Singh examined as defence witness, says he was driving the car and not the actor.\nApril 1: Prosecution beings arguments.\nApril 10: Salman's lawyer begins arguments.\nApril 20: Arguments conclude.\nApril 21: Court says it would give judgement on May 6.\nMay 6: Court delivers verdict, Salman is convicted.", "url": "https://www.indiatoday.in/india/story/salman-khan-hit-and-run-case-possible-relief-for-superstar-276336-2015-12-09", "label": 2}