{"authors": ["Oi-Vikas Sv"], "date_download": "2019-03-27 14:00:17", "date_modify": "2019-03-27 14:00:17", "date_publish": "2019-01-25 15:38:01", "description": "Former Haryana chief minister Bhupinder Singh Hooda on Friday dubbed CBI raids against him in connection with a land scam case as a “political vendetta”.", "filename": "india_bs-hooda-dubs-cbi-raids-against-him-as-political-vendetta-congress-says-govt-rattled-2841864_1553695217.html", "image_url": "https://www.oneindia.com/img/2019/01/bhupinder-singh-hooda-1548410799.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/oneindia.com/india_bs-hooda-dubs-cbi-raids-against-him-as-political-vendetta-congress-says-govt-rattled-2841864_1553695217.html", "title": "BS Hooda dubs CBI raids against him as 'political vendetta'; Congress says govt rattled", "title_page": "BS Hooda dubs CBI raids against him as 'political vendetta'; Congress says govt rattled - Oneindia News", "title_rss": "NULL", "source_domain": "oneindia.com", "text": "BS Hooda dubs CBI raids against him as 'political vendetta'; Congress says govt rattled\nIndia\noi-Vikas SV\nNew Delhi, Jan 25: Former Haryana chief minister Bhupinder Singh Hooda on Friday dubbed CBI raids against him in connection with a land scam case as a \"political vendetta\".\nThe Central Bureau of Investigation (CBI) raided over 30 places in the Delhi-NCR in connections land scam case involving BS Hooda.\n\"This is a result of political vendetta. I will fight this battle myself. I have complete faith in the judiciary. No one can silence my voice,\" Hooda told the media after raids.\nCBI raids former Haryana CM Hooda\nThe Congress said raids against Hooda shows that the government is rattled.\n\"Officials must hear this. Governments do not have any permanency. There are few weeks left for the general elections to begin. It is certain this government is rattled, Prime Minister is staring at an imminent defeat, that's why these actions,\" senior Congress leader Anand Sharma said.\n\"When the new government resumes office, all such actions which have been at the behest of the political masters of today to harass, intimidate, frame and defame, even the charges, they will be held to account and they will have to answer,\" he added.\nThe Central Bureau of Investigation (CBI) had last year (2018) filed charge-sheet against former Haryana CM Bhupinder Singh Hooda and 33 others in Panchkula court in connection to a land acquisition scam causing loss of around Rs 1500 crore to farmers of Gurugram. The chargesheet, along with annexures, runs into more than 80,000 pages.\nIn May 2017, CBI questioned Hooda, who headed the government for 10 years till 2014, in connection with alleged irregularities in the allotment of industrial plots in Panchkula. The agency had registered the case in September 2015 on allegations that private builders in conspiracy with unknown public servants of the Haryana government had purchased around 400 acres of land from farmers and land owners of village Manesar, Naurangpur and Gurgaon at throwaway prices.", "url": "https://www.oneindia.com/india/bs-hooda-dubs-cbi-raids-against-him-as-political-vendetta-congress-says-govt-rattled-2841864.html", "label": 2}