{"authors": [], "date_download": "2019-03-27 13:59:40", "date_modify": "2019-03-27 13:59:40", "date_publish": "2018-06-17 21:00:00", "description": "Two Assam Rifles jawans were martyred during a fierce gun-battle with suspected NSCN-K militants in Nagaland's Mon district on Sunday.", "filename": "india_story_nscn-k-attacks-security-forces-in-nagaland-two-assam-rifles-jawans-martyred-1262722-2018-06-17_1553695180.html", "image_url": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/201806/WhatsApp_Image_2018-06-17_at_19.44.27.jpeg?zULDbi87K6vOQHMA8fOygSeR2q6LJR23", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/indiatoday.in/india_story_nscn-k-attacks-security-forces-in-nagaland-two-assam-rifles-jawans-martyred-1262722-2018-06-17_1553695180.html", "title": "Insurgent group attacks security forces in Nagaland, 2 Assam Rifles jawans killed", "title_page": "Insurgent group attacks security forces in Nagaland, 2 Assam Rifles jawans killed - India News", "title_rss": "NULL", "source_domain": "indiatoday.in", "text": "Two Assam Rifles jawans were martyred during a fierce gun-battle with suspected NSCN-K militants in Nagaland's Mon district on Sunday.\nThe gun fight took place at Aboi town in Tenyak nalla area near BRO camp in Mon District and continues for a few hours between Assam Rifles personnel and suspected NSCN-K militants.\nSounds of bomb and guns continuing for more than an hour leaving around six jawans seriously injured.\nForces have rushed in more reinforcements of security personnel towards the site. Senior officials of Nagaland Police too have been moved to the location.\nAccording to the reports, suspected NSCN-K militants ambushed on the Assam Rifles vehicle at the area when Assam Rifles personnel were on the way to collect water from a river between Aboi-Mohung, Nagaland.\nBanned outfit group NSCN-K took responsibility of the ambush and claimed in a press release. The outfit however has threatened for more such attacks in the future. In recent past the NSCN -K faction had claimed the responsibility of attacking senior officials of Security forces in Shengha Lampong area. This is the second such attack in just a month.\nNagaland has recently seen a new government under the leadership of Neiphiu Rio in alliance with BJP. From various factions that have been on the same page with the Government of India, NSCN -K has been the one which has been regularly opposing it and attacking the security forces on all occasions even when the personnel are traversing for taking care of ferrying basic essentials like water from nearby rivers.\n(With inputs from Manoj Kumar Dutta and Hemanta Kumar Nath in Assam)", "url": "https://www.indiatoday.in/india/story/nscn-k-attacks-security-forces-in-nagaland-two-assam-rifles-jawans-martyred-1262722-2018-06-17", "label": 2}