{"authors": [], "date_download": "2019-03-27 14:00:19", "date_modify": "2019-03-27 14:00:19", "date_publish": "2018-08-07 00:00:00", "description": "Manohar Khattar has said that a registration ought to be done at the national level as well.", "filename": "india_after-assams-nrc-debate-haryana-could-have-registration-to-check-on-illegal-immigrants-2130996_1553695219.html", "image_url": "https://english.cdn.zeenews.com/sites/default/files/2018/08/07/710313-691496-manohar-lal-khattar-pti.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/zeenews.india.com/india_after-assams-nrc-debate-haryana-could-have-registration-to-check-on-illegal-immigrants-2130996_1553695219.html", "title": "After Assam's NRC debate, Haryana could have registration to check on illegal immigrants", "title_page": "After Assam's NRC debate, Haryana could have registration to check on illegal immigrants | India News", "title_rss": "NULL", "source_domain": "zeenews.india.com", "text": "New Delhi: Despite a massive furore over the second and final draft of the National Register of Citizens (NRC) in Assam, Haryana could soon follow suit and have its own NRC. Chief Minister Manohar Lal Khattar has said that while it is a call for the Centre to make, he would oblige if directions in the regard are given.\nNews agency ANI quoted Khattar as saying that Haryana would act towards having its own NRC if the Centre decided upon it. \"A decision regarding this will be taken at central level. After that, we will act as and when the states are directed,\" he said.\nKhattar also said that such a registration ought to be done at the national level as well.\nA decision regarding this will be taken at central level. After that we'll act, as & when the states are directed. A registration of such kind should also be done at the national level: Haryana CM when asked if a registration will be done in the state regarding illegal immigrants pic.twitter.com/lEucpgBRfZ — ANI (@ANI) August 7, 2018\nThe BJP and many rival parties have clashed over the NRC issue in Assam with Trinamool Congress' Mamata Banerjee even predicting civil war and bloodbath. While she has already warned against NRC in West Bengal, there are some states in the north-eastern part of the country that have already begun checking on the influx of immigrants.\n(Also read: A traitor and an anarchist - how BJP hit back at Mamata)\nThe issue at hand is that names of 40.07 lakh applicants in Assam did not find a place in the final draft of NRC. While BJP has assured that they have a two-month window to appeal, the Supreme Court too has said that no coercive measures would be taken against those not on the list. To counter the charges laid by several opposition parties, BJP president Amit Shah has said that the uproar is all about vote-bank politics and that nothing can supercede the interests of Indian citizens and the security of the country.", "url": "https://zeenews.india.com/india/after-assams-nrc-debate-haryana-could-have-registration-to-check-on-illegal-immigrants-2130996.html", "label": 2}