{"authors": [], "date_download": "2019-03-27 14:00:16", "date_modify": "2019-03-27 14:00:16", "date_publish": "2018-08-23 14:11:49", "description": "The Delhi Police have arrested two youths from Haryana over charges of attacking JNU student Umar Khalid", "filename": "india_umar-khalid-shooting-delhi-police-arrests-two-youths-from-haryana-for-attacking-jnu-student-5028551_1553695216.html", "image_url": "https://images.firstpost.com/wp-content/uploads/2018/08/Untitled-design-144.jpg", "language": null, "localpath": "/home/raj/news-please-repo//data/2019/03/27/firstpost.com/india_umar-khalid-shooting-delhi-police-arrests-two-youths-from-haryana-for-attacking-jnu-student-5028551_1553695216.html", "title": "Umar Khalid shooting: Delhi Police arrests two youths from Haryana for attacking JNU student", "title_page": "Umar Khalid shooting: Delhi Police arrests two youths from Haryana for attacking JNU student - Firstpost", "title_rss": "NULL", "source_domain": "firstpost.com", "text": "New Delhi: The Delhi Police has detained two youth from Haryana for their murderous attack on Jawaharlal Nehru University (JNU) student leader Umar Khalid, days after their self-confession video went viral, an officer said on Monday.\n\"Special Cell teams detained Darvesh Shahpur and Naveen Dalal from Haryana on Sunday following a tip-off of their location,\" the senior police officer told IANS.\nIn the video that went viral on 16 August, Shahpur and Dalal said that they will surrender to police at a gurdwara near the house of freedom fighter Kartar Singh Sarabha the next day.\n\"We are responsible for the attack on Khalid (outside Constitution Club) that was meant to be a gift to our country men before the Independence Day. We appeal to police to not punish any innocent youngster for our crime,\" they claimed in the video.\nKhalid was attacked by an unknown assailant carrying a revolver on 13 August at a tea stall outside the Constitution Club. Accused of raising anti-national slogans in 2016. The student leader survived the attack.\n\"We are presently interrogating them to establish the reality behind their claims or whether they created the video clip to only create sensation on social media. We are investigating,\" the officer added.\nFirstpost is now on WhatsApp. For the latest analysis, commentary and news updates, sign up for our WhatsApp services. Just go to Firstpost.com/Whatsapp and hit the Subscribe button.", "url": "https://www.firstpost.com/india/umar-khalid-shooting-delhi-police-arrests-two-youths-from-haryana-for-attacking-jnu-student-5028551.html", "label": 2}