{"authors": [], "date_download": "2019-03-27 14:00:04", "date_modify": "2019-03-27 14:00:04", "date_publish": "2018-11-22 22:51:25", "description": "India News: MUMBAI: A day after recording the statement of a chief investigating officer in the Sohrabuddin Shaikh and Tulsiram Prajapati alleged fake encounter c.", "filename": "india_sohrabuddin-encounter_bdfdf66f9480f80217fddec2d30e32ed_66756331_1553695204.html", "image_url": "https://static.toiimg.com/thumb/msid-66756332,width-1070,height-580,imgsize-158390,resizemode-6,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "language": null, "localpath": "/home/raj/news-please-repo//data/2019/03/27/timesofindia.indiatimes.com/india_sohrabuddin-encounter_bdfdf66f9480f80217fddec2d30e32ed_66756331_1553695204.html", "title": "Sohrabuddin encounter: Examination of prosecution witnesses over", "title_page": "Sohrabuddin encounter: Examination of prosecution witnesses over | India News - Times of India\n\t\t\t", "title_rss": "NULL", "source_domain": "timesofindia.indiatimes.com", "text": "MUMBAI: A day after recording the statement of a chief investigating officer in the Sohrabuddin Shaikh and Tulsiram Prajapati alleged fake encounter cases, the prosecution said on Thursday that it was closing its case.Special prosecutor B P Raju informed trial court judge S J Sharma here that the Central Bureau of Investigation (CBI) has completed the examination of all its witnesses.The prosecution examined 210 witnesses, of which 92 turned hostile.Its last witnesses were chief investigating officers Amitabh Chaudhary and Sandeep Tamgadge.Besides, the CBI examined about 40 other officials.Other key witnesses included Sohrabuddin's brother Rubabuddin Shaikh and Azam Khan, an associate of Sohrabuddin and Tulsiram.Sohrabuddin Shaikh, a suspected gangster with terror links, was shot dead on November 26, 2005 while he was in the custody of Gujarat Police in an alleged fake encounter. His wife Kausar Bi was allegedly killed later.Prajapati, an aide of Shaikh who was said to be a witness to the encounter, was allegedly killed by Gujarat and Rajasthan police officials at Chapri in Gujarat's Banaskantha district in December 2006.Of the 38 people charged by the CBI for the alleged fake encounters, 15, including BJP chief Amit Shah (who was minister of state for home in Gujarat then) and all senior police officials have been discharged.The judge will now examine the accused under Section 313 of the Code of Criminal Procedure. Under this provision, the accused can personally explain any circumstances appearing in the evidence against him or her.", "url": "https://timesofindia.indiatimes.com/india/sohrabuddin-encounter-examination-of-prosecution-witnesses-over/articleshow/66756331.cms", "label": 2}