{"authors": [], "date_download": "2019-03-27 13:59:50", "date_modify": "2019-03-27 13:59:50", "date_publish": "2015-06-18 19:14:41", "description": "India News: Opposition parties on Thursday launched a fresh offensive seeking the removal of external affairs minister Sushma Swaraj and Rajasthan chief minister", "filename": "india_Lalitgate-PM-Modi-Raj_307311263fb436942947ccfb204fbcc3_47722878_1553695190.html", "image_url": "https://static.toiimg.com/thumb/msid-47722939,width-1070,height-580,imgsize-1,resizemode-6,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "language": null, "localpath": "/home/raj/news-please-repo//data/2019/03/27/timesofindia.indiatimes.com/india_Lalitgate-PM-Modi-Raj_307311263fb436942947ccfb204fbcc3_47722878_1553695190.html", "title": "Lalitgate: PM Modi, Rajnath meet to chalk out strategy amid opposition fire", "title_page": "Lalitgate: PM Modi, Rajnath meet to chalk out strategy amid opposition fire | India News - Times of India\n\t\t\t", "title_rss": "NULL", "source_domain": "timesofindia.indiatimes.com", "text": "NEW DELHI: Opposition parties on Thursday launched a fresh offensive seeking the removal of external affairs minister Sushma Swaraj and Rajasthan chief minister Vasundhara Raje over the \" Lalitgate \" as the BJP and the Modi government maintained a studied silence on the swirling controversy surrounding them.With the government's image taking a knock in the wake of the Lalit Modi episode, Prime Minister Narendra Modi is believed to have discussed the fallout with home minister Rajnath Singh in his South Block office after an official meeting. While the national leadership maintained silence, a Rajasthan minister, Rajendra Rathore, claimed the BJP and the central government were with Raje and that there was no need for her resignation. However, state leaders maintained that it was for Raje's son Dushyant Singh to explain Lalit Modi's investment in a company owned by him.BJP patriarch LK Advani's fears of the possibility of another Emergency in India also came to the aid of the opposition parties which said the veteran leader had expressed \"no confidence\" in the Prime Minister.The opposition said the continuance of the two top BJP leaders in their positions has become untenable over what it alleged were acts of grave impropriety in helping the tainted former IPL boss, considered a fugitive as he was facing serious charges, including money laundering.The Congress mounted further attack on Sushma and Raje and demanded that the Prime Minister break his \"meditation\" and speak on the issue.\"The Prime Minister must answer whether the chief minister acted the way she did with his consent. Whether the external affairs minister did what she did with his consent? Are there other people involved, the Prime Minister must come clean. He must come out of his political Vipassana,\" Congress spokesman Tom Vadakkan said.", "url": "https://timesofindia.indiatimes.com/india/Lalitgate-PM-Modi-Rajnath-meet-to-chalk-out-strategy-amid-opposition-fire/articleshow/47722878.cms", "label": 2}