{"authors": [], "date_download": "2019-03-27 13:59:44", "date_modify": "2019-03-27 13:59:44", "date_publish": "2018-11-05 01:18:15", "description": "India News: Maneka slammed the Maharashtra government for its handling of the matter and said she would write to CM Devendra Fadnavis seeking strong action. It is", "filename": "india_maneka-gandhi-slams-m_83381e876e1eee841a366a5c7f05c93a_66503854_1553695184.html", "image_url": "https://static.toiimg.com/thumb/msid-66503870,width-1070,height-580,imgsize-1729175,resizemode-6,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "language": null, "localpath": "/home/raj/news-please-repo//data/2019/03/27/timesofindia.indiatimes.com/india_maneka-gandhi-slams-m_83381e876e1eee841a366a5c7f05c93a_66503854_1553695184.html", "title": "Tigress Avni Maharashtra: Maneka Gandhi slams Maharashtra government on T1 tigress death", "title_page": "Tigress Avni Maharashtra: Maneka Gandhi slams Maharashtra government on T1 tigress death | India News - Times of India\n\t\t\t\t   \t", "title_rss": "NULL", "source_domain": "timesofindia.indiatimes.com", "text": "NEW DELHI:\nCalling the killing of tigress Avni, a mother of two cubs, a “ghastly murder”, a BJP Union cabinet minister lashed out at a party colleague and the BJP-led Maharashtra government and said she would take up the “utter lack of empathy for animals as a test case — legally, criminally as well as politically”.Avni, believed to be responsible for the deaths of 13 people in two years, was killed in Maharashtra’s Yavatmal on Friday as part of an operation.“It is nothing but a straight case of crime. Despite requests from his own forest department and people all over India, Sudhir Mungantiwar , minister for environment and forests, Maharashtra, gave orders for the killing,” said Maneka Gandhi , women and child development minister, in a statement on Sunday, adding that she will write to CM Devendra Fadnavis seeking strong action. The CM did not respond to the comments.Continuing her personal attack on another BJP minister, she said: “This is the third tiger being killed on directions of the environment and forests minister. Earlier, a dozen leopards and 300 wild boars were killed on his directions. I am shocked that such a person is continuing to hold a ministerial position.”Later in the evening, Mungantiwar issued a statement, rebutting Gandhi’s claims. “Although she is an animal lover, as a women and child development minister she (Gandhi) should also think of those women who died in tigress attack,” he added.Mungantiwar said instead of taking up the issue legally or complaining to the CM, the Union minister has the right to set up a five-judge high-level committee to investigate the matter. “Maneka Gandhi criticised the lack of information. Neither minister nor secretary has a right to decide to kill animal; the decision was taken as per the guidelines of the NTCA.”The minister taunted Gandhi, saying the government had ordered the tigress to be caught after five people were killed. The number of deaths jumped to 13 after animal lovers got a stay from the high court.Earlier, the Maharashtra minister had defended the Avni operation. “Avni was shot dead as a last resort when all attempts to tranquillise her failed and she attacked officials,” he was quoted by PTI as saying. The minister said nobody in the forest department wanted to kill the tigress and hundreds of personnel were trying to capture her alive for the last three months. In September, the Supreme Court had said Avni could be shot at sight, which prompted a flurry of online petitions seeking pardon for the tigress.In other tweets, Gandhi said: “Every time, he (Mungantiwar) has used the Hyderabad shooter Shafat Ali Khan and this time, his son has also appeared on the scene illegally to kill the tigress. His son was not authorised to kill. This is patently illegal.” She added that Shafat Ali Khan is a “criminal known for supplying guns to anti-nationals and for a suspected case of murder in Hyderabad”.Mungantiwar claimed Khan was hired by the Bihar government 15 days ago. And Gandhi being a Union minister, she could have a warrant issued against Khan for criminal charges and put him behind bar. To take action against him is not the duty of his forest department.“The tigress was a mother. Now her two cubs will also die. We cannot allow this kind of insensitive and merciless attitude towards animals to prevail,” said Gandhi. Mungantiwar was quoted by PTI as saying that the cubs are now nearly 11 months old and capable of surviving in the wild. “Yet, the forest department will ensure their upkeep,” he said.(With inputs by Sujit Mahamulkar)", "url": "https://timesofindia.indiatimes.com/india/maneka-gandhi-slams-maharashtra-government-for-t1s-murder/articleshow/66503854.cms", "label": 2}