{"authors": [], "date_download": "2019-03-27 14:00:05", "date_modify": "2019-03-27 14:00:05", "date_publish": "2017-07-27 00:00:00", "description": "Hundreds of personnel from central security forces and the Haryana Police were stationed along the Haryana-Punjab border on Monday in view of the road block protest by the Indian National Lok Dal (INLD).", "filename": "india-news_security-tightened-along-haryana-punjab-border-for-indian-national-lok-dal-protest-1722848_1553695205.html", "image_url": "https://i.ndtvimg.com/i/2017-07/inld-protest_650x400_41499675346.jpg", "language": null, "localpath": "/home/raj/news-please-repo//data/2019/03/27/ndtv.com/india-news_security-tightened-along-haryana-punjab-border-for-indian-national-lok-dal-protest-1722848_1553695205.html", "title": "Security Tightened Along Haryana-Punjab Border For Indian National Lok Dal Protest", "title_page": "Security Tightened Along Haryana-Punjab Border For Indian National Lok Dal Protest", "title_rss": "NULL", "source_domain": "ndtv.com", "text": "According to reports INLD activists have also started gathering on the Ambala-Delhi National Highway.\nHaryana's main opposition INLD's today began its protest over the issue of the Sutlej Yamuna Link (SYL) canal by blocking roads, including in Ambala and Sirsa districts, disrupting movement of vehicles entering Haryana from Punjab.According to reports INLD activists have also started gathering on the Ambala-Delhi National Highway. Led by senior leaders, INLD activists have started to gather at various protest points in Haryana including in Ambala and Sirsa districts which lie close to the state's border with Punjab.They squatted on roads, placed tyres and even parked their own vehicles and tractors to stop vehicular movement causing inconvenience to thousands of commuters.Party activists forced closure of the Shambhu toll plaza near the Ambala-Shambhu border disrupting movement of traffic, following which Rapid Action Force personnel have been deployed at the site.In the wake of the INLD's protest, Punjab's Pepsu Road Transport Corporation and Punjab Roadways have decided not to ply its Haryana and Delhi-bound buses.The party has said their protest would be peaceful, but barring emergency services like ambulances, they will not allow any other vehicle from Punjab to enter Haryana.According to officials, traffic diversions have been effected at various points in view of the protest.Sufficient security arrangements have been made to deal with the situation and to ease the inconvenience that common people have to face, Haryana DGP B S Sandhu, who has been in constant touch with his Punjab counterparts, said. Four Companies of paramilitary forces have reached the state, Sandhu said.The INLD is holding protest at many points from 9 am to 3 pm, including in Lalru-Chandigarh road, Ambala-Shambhu border, Narwana-Dhanauri, Ratia-Budlahada road (Jakhal point) in Fathehabad district and Dabwali on Haryana-Punjab border.Led by INLD MP Charanjit Singh Rori, activists also gathered in large numbers in Dabwali in Sirsa district on the Haryana-Punjab border, where they squatted on roads and placed tyres blocking traffic.While senior party leader Abhay Singh Chautala will visit various protest points and address the workers, INDL's state unit chief Ashok Arora was leading the protesters between Ambala and Kurukshetra districts.\"Our protest today is symbolic and will remain peaceful. We are giving flowers to people at protest points and making them aware how Haryana has been waiting for 50 long years to get its share (of water),\" Arora told reporters in Ambala district.\"We don't have anything against the people of Punjab, but we want to wake up both the Central and Haryana governments out of their slumber on SYL, which is Haryana's lifeline,\" he said.\"There is no bar on the Centre to take up construction of the canal to give the rightful share of water to Haryana,\" Arora said.He said various political parties in Punjab including the ruling Congress, the SAD-BJP alliance and even AAP speak in one voice on water issue concerning their state. \"But (in Haryana) it is unfortunate that parties like the ruling BJP and even the opposition Congress are not rising above petty political interests on this critical issue,\" Arora said.The Om Prakash Chautala-led party had sought from the Centre and Haryana governments an immediate announcement on getting the SYL canal constructed and warned that the \"situation in the state may turn bad\" if they fail to do so.Punjab Police's Patiala Range IG, A S Rai had earlier said that traffic would be diverted to routes including Ghanaur-Pehowa and Panchkula-Nada Sahib, while 1,000 Punjab police personnel would be deployed to maintain law and order. Senior police officials including SPs and DSPs would also be stationed at key locations, Rai had said.Haryana Chief Minister Manohar Lal Khattar has accused the INLD of doing politics on the SYL issue.State agriculture minister O P Dhankar said the state's claim on SYL is legally strong and the INLD deciding to prevent the entry of Punjab vehicles into Haryana will not only dent the claim but also spoil the peaceful atmosphere in the state.Former Haryana Chief Minister and Congress leader Bhupinder Singh Hooda termed the INLD's protest as \"political drama\".\"In February, they said they will pick up tools to dig the SYL canal themselves... Will Haryana get SYL water by stopping Punjab's vehicles, this is just a political drama which they are doing,\" he said.Punjab has been maintaining that it does not have surplus water to share with Haryana.Notably, in February, several INLD leaders, including Chautala, were stopped from marching into Punjab to undertake the digging of the SYL canal.After that they held a protest at Delhi's Jantar Mantar for several days on the issue.In November last year, the court had thwarted Punjab's attempt to wriggle out of SYL water sharing pact, saying it cannot \"unilaterally\" terminate it or legislate to \"nullify\" the verdict of the highest court.\nGet the latest election news, live updates and election schedule for Lok Sabha Elections 2019 on ndtv.com/elections. Like us on Facebook or follow us on Twitter and Instagram for updates from each of the 543 parliamentary seats for the 2019 Indian general elections.", "url": "https://www.ndtv.com/india-news/security-tightened-along-haryana-punjab-border-for-indian-national-lok-dal-protest-1722848", "label": 2}