{"authors": [], "date_download": "2019-03-27 13:59:47", "date_modify": "2019-03-27 13:59:47", "date_publish": "2018-05-27 00:00:00", "description": "Assam faces a huge demographic threat from illegal Bangladeshi immigration.", "filename": "insta_bangladesh-border-to-be-completely-sealed-off-by-december-immigrant-influx-has-stopped-assam-cm-sonowal_1553695187.html", "image_url": "https://images.assettype.com/swarajya/2018-05/d1f07e72-c0f1-4546-9db6-c53fdf825dbb/055f3aad_f20f_4751_9cdf_4a563a9a4766.jpg?w=700", "language": null, "localpath": "/home/raj/news-please-repo//data/2019/03/27/swarajyamag.com/insta_bangladesh-border-to-be-completely-sealed-off-by-december-immigrant-influx-has-stopped-assam-cm-sonowal_1553695187.html", "title": "Bangladesh Border To Be Completely Sealed Off By December, Immigrant Influx Has Stopped: Assam CM Sonowal", "title_page": "Bangladesh Border To Be Completely Sealed Off By December, Immigrant Influx Has Stopped: Assam CM  Sonowal", "title_rss": "NULL", "source_domain": "swarajyamag.com", "text": "The 263-kilometre (km) long India-Bangladesh border in Assam will be completely sealed off by 31 December, Assam Chief Minister (CM) Sarbananda Sonowal has said, Times of India has reported.\nThe December date for completion is reportedly three months ahead of the deadline set by the Home Ministry. The boundary also consists of 48.11 km of riverine frontier which will be sealed using lasers and electronic eyes scanning over vast distances.\n“Sealing the India-Bangladesh border was one of our poll promises. The border will be completely sealed by December 31 this year. There are smart fencing on the land border and non-physical barriers on the riverine sector of the border,” Sonowal said.\nThe fencing on the land border will consist of sensors to sound alerts to quick reaction teams of the Border Security Force who can then reach the location of the breach.\nThe border fencing project was started in 1986 but has seen several deadline extensions earlier. The Assam CM also stressed that illegal Bangladeshi immigration and smuggling of cattle and arms across the border have also been checked through continuous vigilance.\n“In the past two years since we came to power, 100 MLAs of the state visited the India-Bangladesh border areas and took stock of the situation. I visited the border thrice and I keep myself updated on the activities along the border. I can tell you the influx of the immigrants and cross-border crimes including the smuggling of cattle and arms have been stopped,” Sonowal was quoted as saying.\nThe project completion comes after Sonowal had pushed for the Indian Army to take over the fencing following no significant progress on ground earlier.", "url": "https://swarajyamag.com/insta/bangladesh-border-to-be-completely-sealed-off-by-december-immigrant-influx-has-stopped-assam-cm-sonowal", "label": 2}