{"authors": ["Filed On August"], "date_download": "2019-03-27 13:59:59", "date_modify": "2019-03-27 13:59:59", "date_publish": "2015-08-31 00:00:00", "description": "Police sources claimed that Indrani and Khanna were not fully cooperative with the investigators.", "filename": "international_india_sheena-murder-accused-duo-taken-to-raigad-crime-spot_1553695199.html", "image_url": "https://images.khaleejtimes.com/storyimage/KT/20150831/ARTICLE/150839958/AR/0/AR-150839958.jpg&NCS_modified=&exif=.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/khaleejtimes.com/international_india_sheena-murder-accused-duo-taken-to-raigad-crime-spot_1553695199.html", "title": "Sheena murder: Accused duo taken to Raigad crime spot", "title_page": "Sheena murder: Accused duo taken to Raigad crime spot - Khaleej Times", "title_rss": "NULL", "source_domain": "khaleejtimes.com", "text": "Police sources claimed that Indrani and Khanna were not \"fully cooperative\" with the investigators.\nA team of Mumbai police on Sunday brought two of the accused in the sensational Sheena Bora murder case to the crime spot near Dagode, in the forest near Pen in Raigad district, where her body was partially burnt and thrown away in a suitcase three years ago, official sources said.\nThe Raigad trip was part of Mumbai police's efforts to recreate the crime scene, the exact sequence of events and other aspects related to Sheena's killing on April 24, 2012.\nA police team brought the two accused - Sanjeev Khanna, the ex-husband of Sheena's mother Indrani Mukherjea, and Shyam Rai, prime accused Indrani's former driver - under tight security from Mumbai with a team of Raigad police helping out in the probe.\nThe investigators are trying to recreate the entire cold-blooded crime, starting with Indrani's meeting with Sheena in Bandra, the drive to Raigad, killing her en route and dumping her body before returning to Mumbai.\nAccording to the investigation so far, Sheena was lured by Indrani to meet her at a spot near National College in Bandra that evening. Later, Sheena was strangulated in the vehicle and her body taken to the isolated spot near Pen.\nThere the accused allegedly poured petrol on Sheena's body, set it afire and decamped from the spot.\nAfter a month, on May 23, 2012, a local mango-seller found the half-burnt carcass and alerted the local police outpost.\nStrangely, it has now transpired that the then police brass of Raigad failed to register any crime or accident case in the matter.\nThe current Raigad Superintendent of Police Mohammed Suvez Haque has been ordered to probe into the lapses of his predecessors and file a report soon.\nMeanwhile, police are keeping their fingers crossed for the crucial DNA and forensic analysis reports of the remains of the body believed to be of Sheena recovered on Friday from the spot.\nPolice sources claimed that Indrani and Khanna were not \"fully cooperative\" with the investigators and were giving contradictory versions of the heinous crime they have been charged with.\nSince the police remand of Indrani, Khanna and the driver ends on Monday, they will be produced before the Bandra magistrate's Court for further extension of their police custody.\nShare\nMore >\nVote\nClick/tap here to subscribe to Khaleej Times news alerts on WhatsApp. Make sure you save the phone number under Contacts on your phone for uninterrupted service.\nERROR: Macro /ads/dfp-ad-article-new is missing!", "url": "https://www.khaleejtimes.com/international/india/sheena-murder-accused-duo-taken-to-raigad-crime-spot", "label": 2}