{"authors": ["Scroll Staff"], "date_download": "2019-03-27 14:00:09", "date_modify": "2019-03-27 14:00:09", "date_publish": "2018-06-24 08:20:52", "description": "The 17-year-old student was arrested in Valsad town under the Juvenile Justice (Care and Protection of Children) Act.", "filename": "latest_883864_vadodara-class-10-student-killed-junior-to-get-school-shut-after-teacher-scolded-him-say-police_1553695209.html", "image_url": "https://d1u4oo4rb13yy8.cloudfront.net/book/zlgjprzenk-1529734263.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/scroll.in/latest_883864_vadodara-class-10-student-killed-junior-to-get-school-shut-after-teacher-scolded-him-say-police_1553695209.html", "title": "Police blame Class 10 student, claim he wanted school closed", "title_page": "Vadodara school murder: Police blame Class 10 student, claim he wanted school closed", "title_rss": "NULL", "source_domain": "scroll.in", "text": "A Class 10 student has been arrested for allegedly killing a teenager in the washroom of his school in Vadodara, PTI reported on Saturday. He allegedly stabbed the Class 9 student on Friday morning to force the school to close after a teacher had scolded him – similar to an incident in Gurugram last year, the police said.\nThe 17-year-old student was arrested in Valsad town under the Juvenile Justice (Care and Protection of Children) Act. The police said that he did not know the victim and had no animosity towards him. The Class 9 student who was killed was admitted to the school just over a week ago.\n“The accused had displayed behavioural problems on several occasions in the past, for which he was scolded by his teachers,” Vadodara Police Commissioner Manoj Shashidhar told the Hindustan Times. “The accused wanted to take revenge against the school and wanted it to shut down. He found the victim when he reached the school on Friday. The victim could have been any student.”\nThe accused had allegedly collected all the sharp weapons by himself from various places for the crime, investigators said. After the boy’s body was found with stab injuries, investigating officials had made the Class 10 student a suspect based on closed-circuit television footage. They had found a sharp-edged weapon and a chilli powder mixture in the student’s bag.\nIn September 2017, a seven-year-old boy was found murdered in the toilet of a private school in Gurugram, Haryana. A 16-year-old student was detained for the murder. The Central Bureau of Investigation said the Class 11 student took the step to get the school closed so that a parent-teacher meeting and an examination would be deferred.", "url": "https://scroll.in/latest/883864/vadodara-class-10-student-killed-junior-to-get-school-shut-after-teacher-scolded-him-say-police", "label": 2}