{"authors": [], "date_download": "2019-03-27 13:59:55", "date_modify": "2019-03-27 13:59:55", "date_publish": "2017-10-26 06:21:05", "description": "Delhi Police data reveal that illicit relationships account for 17 per cent of murders in 2017, 5 per cent higher than the number of premeditated killings last year.", "filename": "mail-today_story_delhi-murders-over-adultery-on-the-rise-1070644-2017-10-26_1553695195.html", "image_url": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/201710/delhi647_102617020547.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/indiatoday.in/mail-today_story_delhi-murders-over-adultery-on-the-rise-1070644-2017-10-26_1553695195.html", "title": "Love, sex, dhoka in Delhi: Murders over adultery on the rise in capital", "title_page": "Love, sex, dhoka in Delhi: Murders over adultery on the rise in capital - Mail Today News", "title_rss": "NULL", "source_domain": "indiatoday.in", "text": "Out of total murder and attempt to murder cases, nearly 17% related to illicit indulgences.\nSleaze and betrayal appear to be the twin dominant factors behind murders and attempts to murder in the national Capital, crime statistics with Delhi Police show.\nAccording to the police data accessed by Mail Today, illicit relationships accounted for 17 per cent of the 402 cases of murder registered in Delhi till October this year.\nThe figure is nearly 5 per cent higher than the premeditated homicide cases the previous year.\n\"The victims in most such cases were done away with callous brutality,\" a senior police official, who is an expert in homicidal cases, told Mail Today.\n\"In almost all the cases, the accused is found to be a first-timer. And a sense of betrayal or feeling of revenge precedes the act,\" the officer said, requesting anonymity.\nThe official said while such cases are not very difficult to crack, as the motive can be established by scanning the phone call details of the deceased and the suspect, the worrying part is that such crimes of passion are on the rise.\n\"In some cases, the killer planned the act on the line of true crime shows aired on TV to evade arrest as these shows often reveal investigation mechanism to solve a murder case,\" he said.\nHALF A DOZEN MURDERS EVERY MONTH\nThe data reveals that nearly half a dozen murders take place every month where reasons were found to be the suspect learning about an illicit relationship of his or her partner, finding one's partner in a compromising position with another person, and argument over sexual problems or incompatibility.\nTill October 15, as many as 402 cases of murders and 505 of attempts to murder were reported in the city.\nAn analysis shows that out of total murder and attempt to murder cases, about 17 per cent were related to illicit relationships or inappropriate sexual indulgence.\nLast year, similar motives were established in about 12 per cent of murder cases. \"In most of these cases, sharp-edged weapons or fire arms have been used by the killer to ensure the death,\" a senior police officer said.\nEXPERT SPEAK\nExperts attribute social, cultural or psychological pressures behind such crimes. Psychiatrists said male chauvinism and suspicion of an affair on the partner may result into behavioural change.\n\"When the partner learns about the betrayal, he tends to think of revenge,\" Rajiv Mehta, consultant psychiatrist at Sir Ganga Ram hospital, told Mail Today.\n\"There are many aspects that force him to kill the partner or the other person. It includes the broken promises; investment on the relationship; and time spent with one another. Also, the person begins to think about the loss of face among his or her peer groups,\" Mehta said.\nVICTIMS NOT ALWAYS WOMEN\nPolice officials said that the victim need not necessarily be a woman in these cases. There were numerous cases where a woman conspired to eliminate her lover or husband, with the help of a male partner.\n\"At times, these motivated murders follow arguments and altercations over sexual behaviour,\" an official said.\nA look into the recent spate of sleaze and revenge murders proves the points of social pressure and brutality as pointed out by officers and doctors.\nIn August, a 30-year-old woman was killed by her husband over suspicion of an illicit relationship in Badarpur area. Minakshi was attacked with a cylinder and her husband Praveen slit her throat in front of their sons.\nA week ago, a bartender chopped off the body of his coworker in south Delhi's Mehrauli before stuffing it into a refrigerator.\nAfter the arrest of Badal Mandal, alias Swapan Singra, it was learnt that he suspected that his wife was having an illicit affair with Vipin Joshi, following which he planned to kill him.\nLast Monday, a bakery shop owner in southeast Delhi's Jaitpur area was shot dead by his neighbour allegedly after learning about an affair of his wife with the former.\nThe accused Jamuna Singh called the unsuspecting victim, Thakur Ravi Chauhan, to his bakery and questioned him about the affair. There was an argument and Singh shot Chauhan thrice.", "url": "https://www.indiatoday.in/mail-today/story/delhi-murders-over-adultery-on-the-rise-1070644-2017-10-26", "label": 2}