{"authors": [], "date_download": "2019-03-27 14:00:06", "date_modify": "2019-03-27 14:00:06", "date_publish": "2018-12-22 04:21:00", "description": null, "filename": "metros_mumbai_221218_all-22-accused-in-sohrabuddin-case-acquitted_1553695206.html", "image_url": "https://s3.ap-southeast-1.amazonaws.com/images.asianage.com/images/aa-Cover-329ub0bmo6uq57ds9v05r4dpq7-20181201024039.Medi.jpeg", "language": null, "localpath": "/home/raj/news-please-repo//data/2019/03/27/asianage.com/metros_mumbai_221218_all-22-accused-in-sohrabuddin-case-acquitted_1553695206.html", "title": "All 22 accused in Sohrabuddin case acquitted", "title_page": "All 22 accused in Sohrabuddin case acquitted", "title_rss": "NULL", "source_domain": "asianage.com", "text": "The judge also noted that 92 prosecution witnesses out of the 210 examined by the prosecution had turned hostile.\nMumbai: The special CBI court on Friday acquitted all the 22 accused in the 2005 Sohrabuddin Sheikh and 2006 Tulsiram Prajapati fake encounter cases and on the charge of killing Sheikh’s wife Kausar Bi. The judge held that there was lack of evidence to prove the charges against the accused beyond reasonable doubt.\nSpecial CBI judge S.J. Sharma said the prosecution had failed to establish that there was any conspiracy to kill Sheikh and the others and that the accused had a role in the\nconspiracy.\nThe judge also noted that 92 prosecution witnesses out of the 210 examined by the prosecution had turned hostile. He said some important witnesses did not stand by their statement to the police in the past and this had a strong impact on the prosecution’s case. The case rested on circumstantial evidence and hearsay, and as a result the chain of events was not complete enough to believe that the encounter was the result of a criminal conspiracy, according to the judge.\nThe judge said though Sheikh and others were killed, “going by the evidence on record, the court could not conclude that the present accused persons could be questioned or held accountable for those deaths”.\nSpecial public prosecutor B.P. Raju refused to comment on the verdict, saying he could not comment before perusing the judgment. He had, however, in the past told the judge that initially the local police had handled the case, then it was transferred to a special investigating team of the state CID and finally to the CBI. He had said the case came to CBI after a long gap and it was very difficult to investigate the matter further. While pronouncing judgment, the judge also spoke about former DIG D.G. Vanzara, who had already been discharged from the case in August 2017. The judge said it was improbable that Mr Vanzara could have any knowledge of the alleged conspiracy. The CBI’s case was that it was Vanzara\nwho called Gujarat police officer Ashish Pandya, who was on leave at that time, to lead Prajapati’s encounter.\nHowever, according to the judge, the CBI could not bring on record any substantial piece of evidence like phone records to prove that Vanzara called Pandya during this period.\nThe CBI had chargesheeted 38 accused, of whom 16 accused, including Mr Vanzara, BJP president Amit Shah, Rajasthan home minister Gulabchand Kataria, Rajasthan-based businessman Vimal Patni, former Gujarat police chief P.C. Pande, additional director-general of police Geetha Johri, Gujarat police officer Abhay Chudasama, Gujarat police official N.K. Amin, Yashpal Chudasama and Ajay Patel (both senior office-bearers at the Ahmedabad District Cooperative Bank), Gujarat IPS officer Rajkumar Pandiyan and Andra Pradesh cadre IPS official N. Balasubramanyam, were discharged before the commencement of the trial.\nAltogether 22 accused had faced trial. Of them, only one, Jeerawala, the owner of Arham farmhouse, was a civilian. All the police personnel are junior officers and constables.\nThe prosecution’s case was that the Gujarat police had abducted Sheikh, an alleged gangster, his wife Kausar Bi and his aide Prajapati from a bus when the trio was on their way to Sangli in Maharashtra from Hyderabad on the night of November 22, 2005. Sheikh was killed in an alleged fake encounter on November 26, 2005, near Ahmedabad. His wife was killed three days later and her body was disposed of, the CBI said. It claimed that a year later, on December 27, 2006, the Gujarat and Rajasthan police forces had shot Prajapati dead in an alleged fake encounter near Chapri on the Gujarat-Rajasthan border.", "url": "https://www.asianage.com/metros/mumbai/221218/all-22-accused-in-sohrabuddin-case-acquitted.html", "label": 2}