{"authors": [], "date_download": "2019-03-27 14:00:25", "date_modify": "2019-03-27 14:00:25", "date_publish": null, "description": "Arindam Pal, who was a senior supplies manager at Tata Steel warehouse in Bata Chowk, Faridabad was shot dead by a formerly laid-off employee named Vishwas Pandey.", "filename": "mirror-now_crime_article_fa_fa5d6d2f0f6d56cb37083ba418913e6e_311573_1553695225.html", "image_url": "https://img.timesnownews.com/story/1541782117-ANI_Arindam_Pal.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/timesnownews.com/mirror-now_crime_article_fa_fa5d6d2f0f6d56cb37083ba418913e6e_311573_1553695225.html", "title": "Tata Steel senior executive shot dead by formerly fired employee; 'had to settle final dues', claimed accused", "title_page": "Tata Steel senior executive shot dead by formerly fired employee; 'had to settle final dues', claimed accused | Crime News", "title_rss": "NULL", "source_domain": "timesnownews.com", "text": "Tata Steel senior executive shot dead by former employee | Photo Credit: ANI\nNew Delhi: A senior manager at Tata Steel company was allegedly shot dead by a former employee at the warehouse of the company situated in Faridabad on Friday afternoon. Identified as Arindam Pal, the deceased was a senior supplies executive at the warehouse and was reportedly shot five times from a close range.\nAs per the police, the accused, identified as Vishwas Pandey, was a former employee who was dismissed from employment about five months ago. He entered the warehouse located in Bata Chowk, around 10 km away from Badarpur border, New Delhi and claimed that he wanted to ‘settle his final dues.’\nNews reporting agency ANI tweeted that Senior Manager of Tata Steel was shot dead by a former employee in Faridabad. As per Mujesar Station House Officer, the bullets were shot at the senior manager by a former employee who subsequently died en route the hospital.\n#Haryana: Senior Manager of Tata Steel shot dead by former employee in Faridabad. Mujesar SHO says,“Bullets were shot at senior manager by a former employee.He died on the way to the hospital. In initial reports,doctors say he was shot with 5 bullets. Post-mortem reports awaited” pic.twitter.com/CNWhngKhAJ — ANI (@ANI) November 9, 2018\nHe added that doctors, as per initial reports, claim that he was shot with 5 bullets. His post-mortem examination is being conducted at present and reports are awaited to ascertain the claim.\nThe police told NDTV that the accused was shot five times by Pandey who had stormed into Arindam Pal’s cabin on Friday. He later went absconding by making an escape via the rear gate of the warehouse. Pal was declared brought dead after he was immediately rushed to a local hospital by his colleagues.\nAlso Read | Man arrested after duping 105-year-old grandfather of Rs 28 lakh", "url": "https://www.timesnownews.com/mirror-now/crime/article/faridabad-tata-steel-senior-executive-arindam-pal-shot-dead-by-formerly-fired-employee-had-to-settle-final-dues-claimed-accused-vishwas-pandey-bata/311573", "label": 2}