{"authors": [], "date_download": "2019-03-27 14:00:21", "date_modify": "2019-03-27 14:00:21", "date_publish": null, "description": "A 20-year-old student named Anshu pursuing first year of BA programme from Swami Shraddhanand College of Delhi University was arrested along with his six accomplices for the murder of two brothers in Haryana.", "filename": "mirror-now_crime_article_ne_7bb491dd3d68602d69a303df4d304294_293877_1553695221.html", "image_url": "https://img.timesnownews.com/story/1538583423-gun_6.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/timesnownews.com/mirror-now_crime_article_ne_7bb491dd3d68602d69a303df4d304294_293877_1553695221.html", "title": "20-year-old DU student arrested along with five accomplices for killing two brothers in Haryana", "title_page": "20-year-old DU student arrested along with five accomplices for killing two brothers in Haryana | Crime News", "title_rss": "NULL", "source_domain": "timesnownews.com", "text": "DU student arrested for killing two brothers in Haryana | Photo Credit: Thinkstock\nNew Delhi: A 20-year-old student of Delhi University was arrested on Wednesday for allegedly killing two brothers in Haryana along with his accomplices. The brothers had allegedly thrashed him badly and made him a laughing stock in their village.\nIdentified as Anshu, the accused is a resident of Sonepat and was arrested from Najafgarh in outer Delhi where he was visiting his relatives and was still in possession of an illegal weapon. His five accomplices had already been arrested by Haryana Police.\nDwarka Deputy Commissioner of Police (DCP) Anto Alphonse told news reporting agency PTI that Anshu was revealed to be a first-year student of BA programme in Swami Shraddhanand College situated in Alipur at the time of interrogation. He said that he fell in the company of anti-social elements and resorted to committing crimes under their influence while studying at the college.\nThe accused had last year gotten into a fight over some issue with the deceased 25-year-old named Aashish aka Ashu hailing from Halalpur in Haryana. Aashish had then thrashed Anshu, said the DCP.\nAlso Read | Murdered Apple executive was alive for an hour, was admitted half an hour later after having been shot\nInfuriated and driven by the motive of seeking revenge, Anshu called his friends Kartik, Sandeep, Mannu, Rohit and Arun from Narela and hatched up a conspiracy to attack Ashish in September this year.\nAll six of them open fired at Ashish and also his brother Himanshu when he came to save his brother. The brothers died on the spot. A 7.65 mm pistol and two live cartridges were confiscated from Anshu.\nAlso Read | Brothers who held an empty gun to the head of a hotelier directed to clean up Versova beach as punishment", "url": "https://www.timesnownews.com/mirror-now/crime/article/new-delhi-20-year-old-du-student-arrested-in-najafgarh-along-with-six-accomplices-for-killing-two-brothers-in-sonepat-haryana/293877", "label": 2}