{"authors": [], "date_download": "2019-03-27 13:59:58", "date_modify": "2019-03-27 13:59:58", "date_publish": "2015-09-27 00:00:00", "description": "As part of the investigation into the high-profile Sheena Bora murder case, prime accused Indrani Mukerjea was taken to the crime scene for reconstruction by the Mumbai police's investigating team yesterday.", "filename": "mumbai-news_sheena-murder-cops-reconstruct-crime-in-indrani-mukerjeas-presence-1214927_1553695198.html", "image_url": "https://i.ndtvimg.com/i/2015-09/indrani-mukherjea_650x400_81441607092.jpg", "language": null, "localpath": "/home/raj/news-please-repo//data/2019/03/27/ndtv.com/mumbai-news_sheena-murder-cops-reconstruct-crime-in-indrani-mukerjeas-presence-1214927_1553695198.html", "title": "Sheena Murder: Cops Reconstruct Crime in Indrani Mukerjea's Presence", "title_page": "Sheena Murder: Cops Reconstruct Crime in Indrani Mukerjea's Presence", "title_rss": "NULL", "source_domain": "ndtv.com", "text": "Indrani Mukerjea at the Bandra Metropolitan Magistrate's court on Saturday. She and the other two accused, Sanjeev Khanna and Shyam Rai, will be produced there again today. (PIC/PTI)\nAs part of the investigation into the high-profile Sheena Bora murder case, prime accused Indrani Mukerjea was taken to the crime scene for reconstruction by the Mumbai police's investigating team yesterday.Around 4.35 pm, Indrani was taken to Linking Road, opposite National College in Bandra, where she reportedly picked up Sheena before the murder. Police questioned her there for 10 minutes. Later, she was taken to her and Peter Mukerjea's residence in Worli. Sources said she told the team how they took the body to the garage that day with the help of driver Shyam Rai.Later, the police recovered bank details of Indrani's foreign transactions, which arrived via courier from the UK yesterday.\"Indrani's police custody ends on Monday and this reconstruction was very essential as part of evidence and to demand further police custody of the accused,\" said a senior IPS officer who is part of the investigating team.Mumbai police also recovered several other bank account details and documents from Indrani's residence in Worli. Indrani was taken to the spots after she met with her lawyer in private on Sunday afternoon. Police will now produce all three accused in Bandra court today (Monday).\nGet the latest election news, live updates and election schedule for Lok Sabha Elections 2019 on ndtv.com/elections. Like us on Facebook or follow us on Twitter and Instagram for updates from each of the 543 parliamentary seats for the 2019 Indian general elections.", "url": "https://www.ndtv.com/mumbai-news/sheena-murder-cops-reconstruct-crime-in-indrani-mukerjeas-presence-1214927", "label": 2}