{"authors": ["Farhan Sheikh"], "date_download": "2019-03-27 14:00:00", "date_modify": "2019-03-27 14:00:00", "date_publish": "2017-02-05 00:09:17", "description": "The police learnt about the body after the police control room received a call from a person who spotted it around 7.10 am on Saturday.", "filename": "mumbai-news_mumbai-police-f_0828b70ac463df4796930ffec1f95c3e_story-aZqz7WtFRN2TOQzpxCkTeJ_1553695200.html", "image_url": "https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2017/02/05/Pictures/_d2a8f6b6-eb08-11e6-93cc-bb55973994db.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/hindustantimes.com/mumbai-news_mumbai-police-f_0828b70ac463df4796930ffec1f95c3e_story-aZqz7WtFRN2TOQzpxCkTeJ_1553695200.html", "title": "Mumbai police finds body with injuries in Bandra, suspects murder", "title_page": "Mumbai police finds body with injuries in Bandra, suspects murder | mumbai news | Hindustan Times", "title_rss": "NULL", "source_domain": "hindustantimes.com", "text": "The Bandra police are investigating a case of murder after a body of an unidentified man was found in Bandra (West) early on Saturday.\nAccording to officials at the Bandra police station, the victim appears to be between 25 and 30 years of age.\nThe police learnt about the body after the police control room received a call from a person who spotted it around 7.10 am on Saturday. Officials said the body was found along Link Road near the bridge that leads to the Bandra railway station.\n“There are severe head injuries on the deceased person’s head. It appears to be a case of murder based on the injuries inflicted on the body,” said an officer from Bandra police who is a part of the investigating team.\nThe police suspect that the assailant used a blunt object to smash the deceased on the head, a preliminary investigation revealed. Officials are investigating if the murder took place late on Friday.\n“The deceased has not been identified yet but investigation is underway,” said Satyanarayan Chaudhari, deputy commissioner of police, zone IX.\nThe police said they are checking for the CCTV footage of the nearby locality to identify suspects. They are rummaging through the footage to sketch together a sequence of events based on the people moving around the area before the body was discovered.\nOfficers are also checking with the other local police stations to ascertain whether any missing persons’ complaint was filed within the last few days. Meanwhile, the body was sent for an autopsy at the Bhabha Hospital, the reports of which are awaited.\nThe Bandra police have registered a case under section 302 (punishment for murder) of the Indian Penal Code against unknown people.\nAlso read:Physio rape and murder in Mumbai: Change in suspect’s behaviour helped police zero-in on him\nFirst Published: Feb 05, 2017 00:09 IST", "url": "https://www.hindustantimes.com/mumbai-news/mumbai-police-finds-body-with-injuries-in-bandra-suspects-murder/story-aZqz7WtFRN2TOQzpxCkTeJ.html", "label": 2}