{"authors": [], "date_download": "2019-03-27 14:00:20", "date_modify": "2019-03-27 14:00:20", "date_publish": "2017-05-25 20:41:00", "description": null, "filename": "nation_crime_250517_manesar-land-case-ed-raids-house-of-senior-ias-officer-in-union-govt_1553695220.html", "image_url": "https://s3.ap-southeast-1.amazonaws.com/images.deccanchronicle.com/dc-Cover-e1ai451m8dd9vum2bl2352up05-20170223155722.Medi.jpeg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/deccanchronicle.com/nation_crime_250517_manesar-land-case-ed-raids-house-of-senior-ias-officer-in-union-govt_1553695220.html", "title": "Manesar land case: ED raids house of senior IAS officer in Union govt", "title_page": "Manesar land case: ED raids house of senior IAS officer in Union govt", "title_rss": "NULL", "source_domain": "deccanchronicle.com", "text": "New Delhi: The ED on Thursday raided 10 locations in Delhi and Haryana, including residence of an IAS officer serving in the Union government in New Delhi, in connection with its money laundering probe in the Rs 1,500-crore alleged illegal land acquisition in Gurgaon's Manesar.\nSeveral farmers and land owners are alleged to have been cheated in this case, in which former Haryana Chief Minister Bhupinder Singh Hooda is one of the accused.\nThe ED teams swooped down on various premises of at least eight people, including a retired IAS officer, in Panchkula, Gurgaon, Chandigarh and the official residence of IAS officer Rajeev Arora in New Moti Bagh area in Lutyens' Delhi.\nArora, a 1987-batch Haryana cadre Indian Administrative Service (IAS) officer, has served as the Managing Director of the Haryana State Industrial and Infrastructure Development Corporation Limited (HSIIDC) between 2005-2011.\nAt present, he is serving as a Joint Secretary in the Union Labour ministry on central deputation.\nWhen contacted, Arora said he has \"nothing to say as the inquiry is going on\".\nThe ED questioned Arora during the raids and is probing his role in granting approvals in this case during his tenure at the HSIIDC.\nA CBI probe is also on in the matter.\nThe other officials raided by ED include Surjit Singh, Chief Town Planner and Director Planning of the HSIIDC, and retired IAS officer D R Dhingra, who served as Director of Industry and Commerce in Haryana government.\nThe ED also raided K Lamba, then Superintendent of Department of Industries and Commerce, an official identified as Jaswant Singh and two directors of a real estate firm based in Gurgaon.\nCongress leader Hooda has been named as an accused in the FIR registered by the Enforcement Directorate in September last year under the Prevention of Money Laundering Act (PMLA) in this case.\nThe former CM has been questioned by the CBI in this case and it is expected that the ED will also record his statement soon.\nThe ED has filed the criminal complaint against Hooda and others based on a FIR filed by the Central Bureau of Investigation (CBI).\nIt suspects that illegal money made from this land deal was \"laundered\" by the accused officials and real estate developers and a number of movable and immovable assets were created by them.\nThe agency is working to prepare a list of these assets to subsequently attach them under PMLA law.\nThe CBI had last year registered a case on allegations that some private builders, in conspiracy with unidentified public servants of the Haryana government, had purchased around 400 acres of land in Manesar, Naurangpur and Lakhnoula villages in Gurgaon district at throwaway prices between 2004 and 2007, after threatening the land owners that the plots would otherwise be acquired by the government.\nIt was alleged that a loss of Rs 1,500 crore was caused to the land owners.\nThe CBI had alleged that initially the Haryana government had issued a notification under the Land Acquisition Act (section 4) for acquiring land measuring about 912 acres for setting up an Industrial Model Township.\nAfter this, all the plots had allegedly been grabbed from the land owners by private builders at ‘meagre’ rates.\nIt was also alleged that an order was then passed by the the competent authority, i.e. the Director of Industries, on August 24, 2007 releasing this land from the acquisition\nprocess in violation of the government policy, in favour of the builders, their companies and agents, instead of the original land owners.\nThe CBI has alleged in its FIR that in this manner land measuring about 400 acres, the market value of which at that time was above Rs 4 crore per acre, was allegedly purchased by the private builders and others from the innocent land owners for only about Rs 100 crore.", "url": "https://www.deccanchronicle.com/nation/crime/250517/manesar-land-case-ed-raids-house-of-senior-ias-officer-in-union-govt.html", "label": 2}