{"authors": [], "date_download": "2019-03-27 14:00:14", "date_modify": "2019-03-27 14:00:14", "date_publish": "2016-05-27 18:51:00", "description": null, "filename": "nation_current-affairs_270516_haryana-cops-booked-for-murder-of-gangster-in-mumbai-sc-told_1553695214.html", "image_url": "https://dc-cdn.s3-ap-southeast-1.amazonaws.com/dc-Cover-p9mo7olm8e9lio71s390k11om0-20160527185016.Medi.jpeg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/deccanchronicle.com/nation_current-affairs_270516_haryana-cops-booked-for-murder-of-gangster-in-mumbai-sc-told_1553695214.html", "title": "Haryana cops booked for murder of gangster in Mumbai, SC told", "title_page": "Haryana cops booked for murder of gangster in Mumbai, SC told", "title_rss": "NULL", "source_domain": "deccanchronicle.com", "text": "The SIT has made all the eight persons, including five cops, accused and a magistrate has been informed about the change of section from 307 (attempt to murder) to section 302 (murder) of the IPC. (Photo: Representational Image/PTI)\nNew Delhi: Five Haryana policemen and three others have been booked for killing of gangster Sandeep Gadoli allegedly in a fake encounter at a hotel in Mumbai suburb, the Supreme Court was informed on Friday.\n\"Five policemen and three private individuals including a lady who was with gangster Sandeep Gadoli has been booked under section 302 (murder) of the IPC. Special Investigation Team of Mumbai police, after investigation, has found that it was a fake encounter,\" Attorney General Mukul Rohatgi told a vacation bench of Justices P C Pant and D Y Chandrachud.\nHe said that the SIT has made all the eight persons, including five cops, accused and a magistrate has been informed about the change of section from 307 (attempt to murder) to section 302 (murder) of the IPC.\nThe \"notorious\" gangster Sandeep Gadoli was carrying a reward of Rs 1 lakh on his head and was wanted in over 40 FIRs since 1999. He was killed in an alleged shootout by the Gurgaon police on February 7 in a Mumbai suburb hotel.\nThe apex court, which recorded the statement of Attorney General and posted the plea filed by Gadoli's relative seeking judicial inquiry into the killing for further hearing on July 13.\nRohatgi opposed the plea saying that autopsy has been done and the inquest proceedings had been completed by an Executive Magistrate.\n\"The main prayer in the petition before the Bombay High Court was that it was a fake encounter and murder charges be slapped on police officials, who were involved in the fake encounter. Now all these have been done, so the petition has now become infructuous,\" Rohatgi said.\nAdvocate Sanjay Parikh appearing for relative of Gadoli said that as per settled preposition of law, inquiry by a judicial magistrate needs to be conducted into the incident as it was an alleged police encounter.\nHe said that the High Court has said that there cannot be two FIRs into the same incident and there cannot be a magisterial inquiry into it.\nTo this, the bench said, \"There can be two versions. There can be two FIRs and even two chargesheet can also be filed into an incident.\"\nThe counsel appearing for Gadoli's relative said the dead body was lying in the mortuary for the past three months and they have not bee allowed to take the body as there was no magisterial inquiry.\nAttorney General said that \"since Gadoli was not in police custody nor killed in police custody, inquiry by judicial magistrate can't be conducted.\"\nThe Bombay High Court had earlier ordered registration of FIR against the Gurgaon policemen, who were involved in the killing of the gangster in the shoot out.\nEarlier, Haryana police had told the apex court while challenging the decision of Bombay High Court, that the state officials were only discharging their official duties at the time of the incident and carried out a meticulous operation which lasted for almost 48 hours to nab a notorious gangster which can be verified and cannot be said to be a \"fake encounter\".\n\"Consequently, the direction for registration of FIR against the police officials of the petitioner state is not only demoralising but shocking for the entire police machinery of the state.\n\"As such, if the second FIR will be registered against the innocent police officers, it will cause undue harassment and embarrassment to them,\" the Haryana police contended.", "url": "https://www.deccanchronicle.com/nation/current-affairs/270516/haryana-cops-booked-for-murder-of-gangster-in-mumbai-sc-told.html", "label": 2}