{"authors": [], "date_download": "2019-03-27 13:59:57", "date_modify": "2019-03-27 13:59:57", "date_publish": "2016-03-06 00:00:00", "description": "Two more officials from the Forensic Science Laboratory disclosed that former Special Investigation Team member and senior IPS officer Satish Verma had threatened them during the probe.", "filename": "nation_2016_mar_06_Was-Tortured-By-CBI-Team-to-Implicate-IB-Officers-in-Controversy-Claims-Mani-900341_1553695197.html", "image_url": "http://images.newindianexpress.com/uploads/user/imagelibrary/logo/nie_logo_600X390.jpg", "language": null, "localpath": "/home/raj/news-please-repo//data/2019/03/27/newindianexpress.com/nation_2016_mar_06_Was-Tortured-By-CBI-Team-to-Implicate-IB-Officers-in-Controversy-Claims-Mani-900341_1553695197.html", "title": "Was Tortured By CBI Team to Implicate IB Officers in Controversy, Claims Mani", "title_page": "Was Tortured By CBI Team to Implicate IB Officers in Controversy, Claims Mani- The New Indian Express", "title_rss": "NULL", "source_domain": "newindianexpress.com", "text": "Yatish Yadav By\nNEW DELHI: Following former home secretary GK Pillai and two others’ revelations that the alleged 2004 fake encounter in Ahmedabad in which Mumbai girl Ishrat Jahan and three others were killed by Gujarat police on suspicion of them being LeT terrorists, two more officials from the Forensic Science Laboratory on Saturday disclosed that former Special Investigation Team (SIT) member and senior IPS officer Satish Verma had threatened them during the probe.\nHoping to cash in on the former bureaucrats’ revelations in the case, the accused police officers are blaming the previous UPA regime for targeting the security and intelligence establishment for an encounter they claimed was genuine and based on excellent inputs. This has put Verma in the dock, who – according to another ex-Home Ministry official – tortured him to implicate IB officers.\nThe most-damaging comments came from former deputy secretary RVS Mani, who said the “CBI team probing the Ishrat case tortured him to implicate IB officers in the controversy.”\n“Why didn’t anyone question IB inputs and reports from Maharashtra and Gujarat governments till 2009? Facts are facts. What suddenly changed that the Centre was forced to file two affidavits contradicting reports of its own agency?” wondered Arun Kumar Jain, ex-joint secretary in the Home Ministry. Jain never received any input suggesting that Ishrat, Amjad Ali, Pillai alias Javed Sheikh and Zeeshan Johar were not terrorists.\nAfter Mani’s disclosure, another officer, K M Mehri from the Ahmedabad FSL, narrated Verma’s high handedness, saying he had a hidden agenda. Mehri said Verma had threatened his senior with dire consequences. “We were telling the truth, but it appears he wanted something else,” Mehri said.\nEarlier, Verma had told a TV channel that all the charges Mani had levelled against him were baseless and he never tortured him. Verma, who is accused of an alleged fake encounter in Porbandar, had concluded that Ishrat and three others were killed in a fake encounter and the IB was involved in the incident.\nThe Special Investigation Team, which probed the alleged fake encounter, maintained it was tasked to probe whether the encounter was staged. This argument seems weak as a senior Home Ministry official noted that the change in affidavit was made before the SIT was constituted and it was part of larger conspiracy to “fix” Narendra Modi.\n“The previous government changed the affidavit, discrediting Intelligence Bureau (IB), so that Central Bureau of Investigation (CBI) could be allowed to take up the case. The second affidavit favoured a central probe in the encounter. This is what UPA wanted,” the official said.\nMuch evidence, including phone intercepts of terrorists, was overlooked to ensure that the focus of the investigation continued to be political.\nThe official said that Sheikh and Ishrat assumed false identities whenever they checked into a hotel. “Why would anyone come up with false identity unless there is something to hide or someone on a mission with ulterior motive,” he said.\nIshrat and Sheikh were in Lucknow in May 2004, a month before the encounter. The record in Mezbaan International Hotel shows that Sheikh introduced himself as Abdul Rehman and Ishrat as his wife Ayesha.\nAnother LeT terrorist, Amjad Ali, was introduced as Rajkumar.\nSheikh had also rented accommodation in Pune in the name of Sayeed Abdul Wahid. They stayed in Hotel Radhika as a couple where he gave his name as Ahmad Yusuf in the hotel register. On May 26, both had checked in Hotel Ajanta as Rajesh Kumar and Geeta.", "url": "http://www.newindianexpress.com/nation/2016/mar/06/Was-Tortured-By-CBI-Team-to-Implicate-IB-Officers-in-Controversy-Claims-Mani-900341.html", "label": 2}