{"authors": ["Pti Feeds"], "date_download": "2019-03-27 14:00:19", "date_modify": "2019-03-27 14:00:19", "date_publish": "2017-08-09 23:34:18", "description": "Chandigarh, Aug 9 (PTI) The flying squad of Haryana Chief Minister Manohar Lal Khattar today conducted raids at 25 places in the state, including offices of secretary and Regional Transport Authority (RTA). - Haryana CM's flying squad conducts raids; 3 cases registered", "filename": "news_agencies__1553695219.html", "image_url": "https://s3.india.com/wp-content/uploads/2015/06/indiacom-image-banner_01.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/india.com/news_agencies__1553695219.html", "title": "Haryana CM's flying squad conducts raids; 3 cases registered", "title_page": "Haryana CM's flying squad conducts raids; 3 cases registered | Agencies News, India.com", "title_rss": "NULL", "source_domain": "india.com", "text": "Chandigarh, Aug 9 (PTI) The flying squad of Haryana Chief Minister Manohar Lal Khattar today conducted raids at 25 places in the state, including offices of secretary and Regional Transport Authority (RTA).\nThe squad registered three cases besides initiating inquiry in several other cases.\nInspector General of Police (IGP), Security, Sanjay Kumar said here that various irregularities were found during the raids conducted at the RTA offices.\nInvestigation in many other cases is in progress and it is expected that more cases would be registered, he said.\n“Complaints have been received that work in the RTA offices was being done in connivance with middlemen, thus giving a hard time to people visiting these offices. Taking cognisance of the complaints, the chief minister had directed to conduct raids to unearth this nexus,” he said.\nKumar said during a raid conducted in the office of RTA Faridabad, a middleman named Succha alias Saurabh was caught taking bribe.\n“During the interrogation, he revealed that he indulged in preparing documents regarding passing of vehicles by taking money. A case under relevant provisions of Indian Penal Code (IPC) has been registered against the accused at city police station in Ballabhgarh. Further investigation into the case is in progress,” he added.\nThe officer said 29 challans were found wherein vehicle owners were allegedly given undue benefit by tempering receipts.\n“A case has been registered against then regional transport officer, assistant secretary and clerk concerned in this regard. A similar case was also detected in RTA Office, Bhiwani where huge loss has been caused to the government revenue,” he said.\nKumar said that in RTA office, Hisar four persons were found working illegally.\nFour buses in Sirsa and one in Fatehabad have been impounded for plying without permit, he said.\nIn the office of RTA Yamunangar, it was found that applications of December 2016 and January 2017 regarding issuance of new license and registration of vehicles were still lying pending, he said, adding in the RTA Office, Panchkula, an empty challan book which was ‘pre-signed’ by assistant secretary has been recovered.\nHe said further verification of record was being done by the squad in other districts and appropriate action will be taken against those in the wrong.\nThis is published unedited from the PTI feed.", "url": "https://www.india.com/news/agencies/haryana-cms-flying-squad-conducts-raids-3-cases-registered-2390133/", "label": 2}