{"authors": ["India Blooms News Service"], "date_download": "2019-03-27 13:59:55", "date_modify": "2019-03-27 13:59:55", "date_publish": "2017-01-15 00:00:00", "description": "Kolkata, Nov 1 (IBNS): West Bengal Chief Minister Mamata Banerjee on Wednesday condemned the attack in New York city which killed at least eight people.", "filename": "news-details_N_35432_west-bengal-chief-minister-mamata-banerjee-condemns-new-york-attack_1553695195.html", "image_url": "https://www.indiablooms.com/news_pic/2017/1-1509533624.jpg", "language": null, "localpath": "/home/raj/news-please-repo//data/2019/03/27/indiablooms.com/news-details_N_35432_west-bengal-chief-minister-mamata-banerjee-condemns-new-york-attack_1553695195.html", "title": "West Bengal Chief Minister Mamata Banerjee condemns New York attack", "title_page": "West Bengal Chief Minister Mamata Banerjee condemns New York attack | Indiablooms - First Portal on Digital News Management", "title_rss": "NULL", "source_domain": "indiablooms.com", "text": "Kolkata, Nov 1 (IBNS): West Bengal Chief Minister Mamata Banerjee on Wednesday condemned the attack in New York city which killed at least eight people.\nBanerjee said terror in any form was unacceptable.\n\"Terror in any form is unacceptable.Thoughts & prayers from all the great cities in India,to one of America's greatest cities#NewYorkAttack,\" she tweeted.\nAt least eight people were killed as a trucker ran over them in New York's Lower Manhattan area, reports said.\nThe deadly incident also left 11 gravely injured.\nOfficials have termed it a terror attack and said that a man has been nabbed.\nThe arrested man has been identified as 29-years-old Sayfullo Saipov, an immigrant who came to the US in 2010.\nReports quoted witnesses as saying that he shouted Allahu Akbar before killing the pedestrians.\nNew York City Mayor Bill de Blasio has said that it was a \"cowardly act of terror aimed at innocent civilians\".\n\"We know that this action was intended to break our spirit. But we also know that New Yorkers are strong, New Yorkers are resilient and our spirit will never be moved by an act of violence and an act meant to intimidate us,\" the Mayor added.\nUS President Donald Trump condoled the loss and tweeted, \"My thoughts, condolences and prayers to the victims and families of the New York City terrorist attack. God and your country are with you!\"", "url": "https://www.indiablooms.com/news-details/N/35432/west-bengal-chief-minister-mamata-banerjee-condemns-new-york-attack.html", "label": 2}