{"authors": ["Tribune News Service"], "date_download": "2019-03-27 14:00:14", "date_modify": "2019-03-27 14:00:14", "date_publish": "2017-09-20 00:00:00", "description": "TheTribune: PATNA: Bihar Chief Minister Nitish Kumar on Monday spoke to the family of the seven-year-old boy who was killed at a Gurugram school. Kumar also spoke to his Haryana counterpart Manohar Lal Khattar, requesting him to meet the family who hail from Bihar’s Madhubani district.", "filename": "news_nation_student-s-murde_88591d4664050fd5be209324f9111f4f_465439_1553695214.html", "image_url": "https://images.tribuneindia.com/cms/gall_content/2017/9/2017_9$largeimg11_Monday_2017_155553894.JPG", "language": null, "localpath": "/home/raj/news-please-repo//data/2019/03/27/tribuneindia.com/news_nation_student-s-murde_88591d4664050fd5be209324f9111f4f_465439_1553695214.html", "title": "Student’s murder: Bihar CM speaks to family, Haryana CM", "title_page": "\r\n\tStudent’s murder: Bihar CM speaks to family, Haryana CM\r\n", "title_rss": "NULL", "source_domain": "tribuneindia.com", "text": "Patna, September 11\nBihar Chief Minister Nitish Kumar on Monday spoke to the family of the seven-year-old boy who was killed at a Gurugram school.\nKumar also spoke to his Haryana counterpart Manohar Lal Khattar, requesting him to meet the family who hail from Bihar’s Madhubani district.\nIn his telephonic conversation, Kumar said a meeting of the Haryana Chief Minister with the deceased’s family would not only instill a sense of confidence but also ensure a faster and impartial probe, an official release said.\nKhattar assured Kumar that he would meet the family, it said.\nKumar on Sunday had also asked Khattar to take stern action against those involved in the killing.\nThe Bihar Chief Minister had directed the resident commissioner in Delhi to immediately send officials to Gurugram to meet the grieving family and console them.\nOn the Chief Minister’s directive, Bihar Director General of Police PK Thakur had talked to his Haryana counterpart and requested him to take stern action against the culprits.\nThe Class II student was found dead with his throat slit inside a toilet of Ryan International School on September 8. PTI", "url": "https://www.tribuneindia.com/news/nation/student-s-murder-bihar-cm-speaks-to-family-haryana-cm/465439.html", "label": 2}