{"authors": ["In This New Podcast Series Tracking Major Campaign Speeches Across The Country", "Varghese K George Is In Conversation With Jayant Sriram To", "Opposition Shows Video Of", "Bjp Leader", "Exchanging Old Currency Past Deadline"], "date_download": "2019-03-27 14:00:05", "date_modify": "2019-03-27 14:00:05", "date_publish": "2018-11-28 19:45:48", "description": "Five policemen record statements before Special CBI Judge in Mumbai.", "filename": "news_national_sohrabuddin-s_3a16fa2177667ac26220892404fd70fe_article25615370_1553695205.html", "image_url": "https://www.thehindu.com/news/national/p38228/article25615369.ece/ALTERNATES/LANDSCAPE_615/SOHRABUDDIN", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/thehindu.com/news_national_sohrabuddin-s_3a16fa2177667ac26220892404fd70fe_article25615370_1553695205.html", "title": "Sohrabuddin Shaikh fake encounter: Junior policemen say they were falsely implicated due to ‘political rivalry’", "title_page": "\nSohrabuddin Shaikh fake encounter: Junior policemen say they were falsely implicated due to ‘political rivalry’ - The Hindu\n", "title_rss": "NULL", "source_domain": "thehindu.com", "text": "Several policemen who are accused in the Sohrabuddin Shaikh alleged fake encounter case of Gujarat claimed before a special CBI court here on Wednesday that junior personnel like them were falsely implicated in the matter due to “political rivalry“.\nSpecial CBI Judge S.J. Sharma is currently recording the final statements of the accused in the 2005 case. Under section 313 of the Code of Criminal Procedure (CrPC), after examination of witnesses, the court records statements of all the accused in a case.\nAbdul Rahman, former inspector with the Rajasthan Police, in his statement told the court he was in no way related to the case and that he has been falsely implicated in it. Mr. Rahman refuted the charge levelled by the Central Bureau of Investigation, which probed the high-profile case, that he was the one who fired at Shaikh.\nAlso Read Amit Shah benefited from Sohrabuddin case: former CBI officer deposes\nOther policemen who are accused in the case, Vijay Kumar Rathod, Yudvir Singh, Kartar Singh and Narayan Singh — all constable to assistant sub-inspector rank personnel — made similar submissions in the court. They told the judge they were falsely implicated in the case due to “political rivalry”.\nShaikh was shot dead on November 26, 2005 in a “fake” encounter while he was in the Gujarat police custody, according to the CBI. His wife Kausar Bi too was later killed allegedly in another alleged stage-managed gunfight, the central agency had claimed.\nTulsi Prajapati, an aide of Shaikh who was said to be an eyewitness to the twin fake encounters, was allegedly killed by Gujarat and Rajasthan Police personnel at Chapri in Gujarat’s Banaskantha district in December 2006, it had said.\nOf the 38 people charged by the CBI for the alleged fake encounters, 16 have been discharged including BJP chief Amit Shah, who was then the Gujart Minister of State for Home, and all senior police officials, some of them of IPS rank.\nAs per the CBI charge sheet, Shaikh and Bi were abducted by officers of the Gujarat ATS and the Rajasthan Police from near Hyderabad.\nPrajapati was shot dead at the behest of the Gujarat and Rajasthan officers, who had been allegedly involved in the killing of the husband-wife duo, the CBI had claimed.\nThe encounter cases of Shaikh, Bi and Prajapati were clubbed together in 2013 after the Supreme Court directed that the trial be shifted to Mumbai from Gujarat.", "url": "https://www.thehindu.com/news/national/sohrabuddin-shaikh-fake-encounter-junior-policemen-say-they-were-falsely-implicated-due-to-political-rivalry/article25615370.ece", "label": 2}