{"authors": [], "date_download": "2019-03-27 13:59:58", "date_modify": "2019-03-27 13:59:58", "date_publish": "2019-02-20 20:10:00", "description": "Gogoi was referring to extrajudicial killings of the late 1990s when masked men, allegedly sponsored by the government, would kill suspected ULFA militants and their kin.", "filename": "news_politics-and-nation_nd_a572750ad394df938e94a485af7162a8_68083479_1553695198.html", "image_url": "https://img.etimg.com/thumb/msid-68083505,width-1070,height-580,imgsize-28406,overlay-economictimes/photo.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/economictimes.indiatimes.com/news_politics-and-nation_nd_a572750ad394df938e94a485af7162a8_68083479_1553695198.html", "title": "NDA government pressured me to go ahead with \"secret killings\": Tarun Gogoi", "title_page": "NDA government pressured me to go ahead with \"secret killings\": Tarun Gogoi - The Economic Times", "title_rss": "NULL", "source_domain": "economictimes.indiatimes.com", "text": "Former Assam Chief Minister Tarun Gogoi claimed Wednesday he was under pressure from the previous NDA government at the Centre to continue with the \" secret killings \", a practice \"rampant\" during his predecessor Prafulla Kumar Mahanta's tenure.The BJP rubbished the allegation as \"baseless\" and accused the veteran Congress leader of doing \"divisive politics\", while Mahanta hit back, insisting it was under the Congress rule that extrajudicial killings started in the state.Gogoi, who helmed the state for 15 years from 2001 to 2016, claimed Lal Krishna Advani, who was then the union home minister, wanted to send former Punjab police chief K P S Gill, largely credited with crushing militancy in the northern state, to Assam as governor to quell insurgency.\"We were pressured to continue the secret killings, but we did not do it. When I took over (in 2001), the BJP wanted the secret killings to continue and Advani wanted to send KPS Gill as the governor for this reason,\" Gogoi said.He claimed it was because of the stiff resistance by his government that Gill, an IPS officer of Assam and Meghalaya cadre, was not sent to the northeastern state.Gogoi was referring to extrajudicial killings of the late 1990s when masked men, allegedly sponsored by the government, would kill suspected ULFA militants and their kin.\"The secret killings in Assam happened when Mahanta was in power. The BJP was in power at the Centre then. Now, Mahanta says that he did it on instructions of the Centre,\" Gogoi said.When reached for comments, the BJP's Assam unit general secretary Dilip Saikia trashed the accusation.\"It is a baseless allegation. We have always believed in integrity of India but not at the cost of secret killings of innocent people. Why did he not order an enquiry on secret killings if he was honest? He is doing cheap, divisive politics,\" Saikia said.The BJP leader said his party favoured dialogue for lasting peace in the North-East for which its governments held talks with the ULFA, NDFB, NSCN and other insurgent groups.He claimed it was the Congress that derailed talks with the ULFA.Prafulla Kumar Mahanta of the AGP claimed it was his Congress predecessor Hiteswar Saikia who started the practice of secret killings.\"It is the Congress that started secret killings. It was Hiteswar Saikia....The first victim was Tezpur's Bhupen Bora, who was kidnapped and killed by the Congress government,\" he alleged.Saikia was the chief minister of Assam between 1991 and 1996.When asked whether such killings continued even after he took over, Mahanta said, \"The Unified Command was responsible for all sacurity related issues and it was functioning under the central government.\"Gogoi said the NDA 1 government accused him of being \"soft\" on ULFA as he did not allow the killing of innocent people.He claimed Mahanta, a two-term former chief minister who led the All Assam Students Union's agitation for idenfication and deportation of illegal migrants that led to the signing of the Assam Accord, had refused to accept 1967 as the cut-off year for detection of foreigners that was suggested by the then prime minister Indira Gandhi in 1980.\"The leaders, including Mahanta, refused to accept 1967 as cut-off year in 1980, but they accepted 1971 as the cut-off year in 1985. Had they accepted the first proposal, 855 people who lost their lives during the Assam agitation would have lived,\" Gogoi said.", "url": "https://economictimes.indiatimes.com/news/politics-and-nation/nda-government-pressured-me-to-go-ahead-with-secret-killings-tarun-gogoi/articleshow/68083479.cms", "label": 2}