{"authors": [], "date_download": "2019-03-27 13:59:43", "date_modify": "2019-03-27 13:59:43", "date_publish": "2018-02-06 12:23:28", "description": "India News – According to reports, terrorists fired shots at the hospital in Srinagar when policemen were escorting a Pakistani prisoner Naveed. The prisoner escaped during the firing. One police personnel has passed away, while another is injured.", "filename": "news_india-j-k-cop-dies-as-terrorists-open-fire-in-srinagar-s-shri-maharaja-hari-singh-hospital-pakistani-prisoner-naveed-escapes-426288_1553695183.html", "image_url": "https://resize.indiatvnews.com/en/resize/newbucket/715_-/2018/02/smhs-1517911246.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/indiatvnews.com/news_india-j-k-cop-dies-as-terrorists-open-fire-in-srinagar-s-shri-maharaja-hari-singh-hospital-pakistani-prisoner-naveed-escapes-426288_1553695183.html", "title": "Srinagar hospital firing: LeT terrorist brought for treatment flees after killing two cops", "title_page": "Srinagar hospital firing: LeT terrorist brought for treatment flees after killing two cops | India News – India TV", "title_rss": "NULL", "source_domain": "indiatvnews.com", "text": "SMHS Hospital, Srinagar\nTwo cops died after a terrorist on Tuesday opened fire in Shri Maharaja Hari Singh hospital in Srinagar. The attacker, Abu Hanzulla alias Naveed fired on policemen who escorted him to the hospital.\nBoth the policemen were fired upon by Lashkar terrorist Naveed, and were rushed to hospital in critical condition. They later succumbed to their injuries.\nArrested by police a few months ago in Jammu and Kashmir's Shopian, Naveed was among the six detainees who had been brought to the hospital from Central Jail. He immediately escaped after the firing incident.\nPakistani prisoner Naveed\nA wreath laying ceremony to pay tribute to Mushtaq Ahmed, one of the killed policemen, was held in Srinagar.\nSrinagar: Wreath laying ceremony of policeman Mushtaq Ahmed; he lost his life in shooting by a prisoner at Shri Maharaja Hari Singh hospital #JammuAndKashmir pic.twitter.com/o6BE4SFoI2 — ANI (@ANI) February 6, 2018\nMeanwhile, SSP Srinagar, Imtiaz Ismail Parray said \"six detainees were being brought from Central Jail. Out of them, one snatched weapons from police & fired at the protection party. The prisoner's name is Naveed. He is probably an outsider\"\nThe area has been cordoned off and searches are on to track him down.", "url": "https://www.indiatvnews.com/news/india-j-k-cop-dies-as-terrorists-open-fire-in-srinagar-s-shri-maharaja-hari-singh-hospital-pakistani-prisoner-naveed-escapes-426288", "label": 2}