{"authors": [], "date_download": "2019-03-27 14:00:13", "date_modify": "2019-03-27 14:00:13", "date_publish": null, "description": "Haryana govt decided to gift a residential plot to the widow of a soldier who was killed in an anti-militancy operation in nearly 18 years ago.", "filename": "news_plot-for-widow-18-years-after-soldier-s-death-_57028_1553695213.html", "image_url": "https://www.btvi.in/media/images/news/88625b44167fc89ac633d2a1fadcc5fb.jpeg", "language": null, "localpath": "/home/raj/news-please-repo//data/2019/03/27/btvi.in/news_plot-for-widow-18-years-after-soldier-s-death-_57028_1553695213.html", "title": "Plot for widow 18 years after soldier's death", "title_page": "Plot for widow 18 years after soldier's death ", "title_rss": "NULL", "source_domain": "btvi.in", "text": "Chandigarh: The Haryana government on Saturday decided to gift a residential plot to the widow of a soldier who was killed in an anti-militancy operation in Jammu and Kashmir nearly 18 years ago.\nThe decision was taken at a meeting of the state Cabinet here, presided over by Chief Minister Manohar Lal Khattar.\n\"The Cabinet approved a proposal of Gram Panchayat, Bijopur in Block Ballabhgarh, district Faridabad, to gift 200 square yards residential plot to Mamuna, widow of martyr Mohammed Sadik, who died in 'Operation Rakshak Jammu and Kashmir-2000',\" a state government spokesman said here.\n\"Approval to gift plot to Mamuna has been given keeping in view Rule 13 of the Punjab Village Common Lands (Regulation) Rules, 1964, which provides that a Gram Panchayat with prior approval of the state government, can gift land...vested in it for residential purposes up to the extent of 200 square yards, to the members of defence forces and paramilitary forces seriously injured and rendered handicapped or to the dependent families of such members killed, in any war or counter insurgency operation during their service, not having sufficient residential accommodation,\" the Cabinet note stated.\n(IANS)", "url": "https://www.btvi.in/news/plot-for-widow-18-years-after-soldier-s-death-/57028", "label": 2}