{"authors": ["Known As The Poor Man S Cocaine", "Mephedrone Is Cheaper", "More Easily Available", "Therefore More In Demand", "Say Police"], "date_download": "2019-03-27 14:00:24", "date_modify": "2019-03-27 14:00:24", "date_publish": "2016-07-07 07:50:01", "description": "Ghadoli, a history-sheeter who also had a reward on his head, was staying at Airport Metro hotel in Andheri when he was shot by a team of five policemen.", "filename": "news_cities_mumbai_Ghadoli-_cd1c796624298fc714280e83dc1b58a4_article14475795_1553695224.html", "image_url": "https://www.thehindu.com/migration_catalog/article14442279.ece/ALTERNATES/LANDSCAPE_615/Ghadoli", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/thehindu.com/news_cities_mumbai_Ghadoli-_cd1c796624298fc714280e83dc1b58a4_article14475795_1553695224.html", "title": "Ghadoli encounter: Haryana cop who led team held", "title_page": "\nGhadoli encounter: Haryana cop who led team held - The Hindu\n", "title_rss": "NULL", "source_domain": "thehindu.com", "text": "The Mumbai Police Crime Branch on Wednesday made its first arrest in connection with the encounter of Sandeep Singh alias Sandeep Ghadoli, who was shot dead by a team of Haryana police personnel earlier this year.\nGhadoli, a history-sheeter who also had a reward on his head, was staying at Airport Metro hotel in Andheri when he was shot by a team of five policemen lead by Sub-Inspector Pradyuman Yadav on February 7.\nThe Haryana cops had contended that Ghadoli was the first to open fire and was killed in retaliatory fire. However, a Special Investigation Team (SIT) of the Mumbai Crime Branch charged the police team with murder after finding evidence to indicate that the encounter was staged.\nAccording to Crime Branch sources, Yadav was detained late on Tuesday night near his residence in Gurugram in Haryana.\n“Our teams have been in Gurugram for the last two months, and on Tuesday, one of the teams received a tip-off that he was going to visit his house. He was placed under arrest in the early hours of Wednesday morning and brought to Mumbai,” said one of the officers.\nAnother officer said that Yadav played a major role in staging the encounter, and the bullets that killed Ghadoli were fired by him. The police are now interrogating Yadav to ascertain the sequence of events on the day of the encounter.\nThey will also seek information on the whereabouts of the four constables he was leading, who are also accused in the case.\nYadav was produced in court on Wednesday and has been remanded in SIT custody till July 9, said officials.\nGhadoli’s brother Kuldeep, who had demanded an inquiry into the matter, is still in Mumbai. He has refused to conduct his brother’s last rites till all the policemen who participated in the encounter are brought to book. In June this year, he told the police that he had been threatened by three men and warned that he would meet the same fate as his brother if he stuck to his demand.", "url": "https://www.thehindu.com/news/cities/mumbai/Ghadoli-encounter-Haryana-cop-who-led-team-held/article14475795.ece", "label": 2}