{"authors": [], "date_download": "2019-03-27 13:59:54", "date_modify": "2019-03-27 13:59:54", "date_publish": "2015-08-25 23:42:23", "description": "World News – India also used the confessional statement of Ajmal Kasab to provide full details of the role of Saeed in the attacks.Read more on indiatvnews.com", "filename": "news_world_hafiz-saeed-kept-supporting-perpetrators-even-after-attacks-26083_1553695194.html", "image_url": "https://resize.indiatvnews.com/en/resize/newbucket/715_-/maininternational/IndiaTv661e2e_saeed.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/indiatvnews.com/news_world_hafiz-saeed-kept-supporting-perpetrators-even-after-attacks-26083_1553695194.html", "title": "Hafiz Saeed kept supporting 26 11 perpetrators even after attack", "title_page": "Hafiz Saeed kept supporting 26 11 perpetrators even after attack | World News – India TV", "title_rss": "NULL", "source_domain": "indiatvnews.com", "text": "hafiz saeed kept supporting 26/11 perpetrators even after attacks\nNew Delhi: Hafiz Saeed, chief of Jamaat-ud-Dawa, the fountain head of terror groups including Lashkar-e-Taiba, continued to financially support the perpetrators of 26/11 Mumbai attacks even after the incident in 2008.\nThe information was part of the dossier which was to be presented by National Security Advisor Ajit Doval during his proposed meeting with his Pakistani counterpart Sartaz Aziz last week.\nThe dossier lists agenda point 5 as role of Saeed in 26/11 Mumbai terror attacks in which 166 persons were killed who included foreigners. It was Saeed who had approved the conspiracy to attack various cities in India, the sources said giving details about the dossier.\nThey said India has the documentary evidence in the form of email from Sajid Majid, LeT operative who played a crucial role in executing the attack, to David Headley, Pakistan-born US citizen who did reconnaissance of Mumbai to identify targets for the ghastly attacks.\n“There is evidence that Hafiz Saeed had met David Headley on several occasions and took briefings on the progress of reconnaissance and other tasks assigned to Headley in connection with Mumbai terror attacks,” the dossier says. It said India has evidence of Saeed speaking to each terrorist involved in the 26/11 attacks giving them sermons on ‘fruits of martyrdom', the sources said.\nIndia also used the confessional statement of Ajmal Kasab to provide full details of the role of Saeed in the attacks. Pakistan had on Saturday night called off the NSA-level talks in Delhi between Doval and Aziz, hours after India made it clear that discussions on Kashmir and a meeting with separatists will not be acceptable to it.", "url": "https://www.indiatvnews.com/news/world/hafiz-saeed-kept-supporting-perpetrators-even-after-attacks-26083.html", "label": 2}