{"authors": ["India.Com News Desk"], "date_download": "2019-03-27 14:00:06", "date_modify": "2019-03-27 14:00:06", "date_publish": "2017-12-10 14:33:24", "description": "Narrating the horrifying story, victim's mother said that the girl was sleeping with her in the tent. But when she woke up yesterday morning, her daughter was not there. - Haryana: Five-year-old Allegedly Raped in Hisar; Body Found Near Telephone Exchange With Wooden Stick Inserted Into Private Parts", "filename": "news_india__1553695206.html", "image_url": "https://www.india.com/wp-content/uploads/2017/09/rape-up-1.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/india.com/news_india__1553695206.html", "title": "Haryana: Five-year-old Allegedly Raped in Hisar; Body Found Near Telephone Exchange With Wooden Stick Inserted Into Private Parts", "title_page": "Haryana: Five-year-old Allegedly Raped in Hisar; Body Found Near Telephone Exchange With Wooden Stick Inserted Into Private Parts | India News, India.com", "title_rss": "NULL", "source_domain": "india.com", "text": "New Delhi, Dec 10: In yet another shocking incident, a five-year-old girl was allegedly raped and brutally killed in Uklana village of Haryana’s Hisar district. The body of the girl with a wooden stick inserted in her private parts was spotted by passerby near a telephone exchange on Saturday.\nThe incident reportedly took place when the girl was sleeping along with her mother. Narrating the horrifying story, victim’s mother said that the girl was sleeping with her in the tent. But when she woke up yesterday morning, her daughter was not there.\nSpeaking to ANI, Deputy Superintendent of Police (DSP), Jitender Kumar said, “We rushed to the spot as soon as we got information on it. When we reached the post, villagers were protesting over the murder and demanded a quick action. An FIR has been registered in this case.\n“A Special Investigation Team (SIT) has been formed for a thorough investigation. No one has been arrested till now. Further investigation is underway,”Kumar added.\nFollowing the incident, former CM Bhupinder Singh Hooda condemned the BJP government and held the deteriorated law and order situation in the state responsible for the death of five-year-old girl. He also sought strict action against the accused.", "url": "https://www.india.com/news/india/haryana-five-year-old-allegedly-raped-and-killed-in-hisar-wooden-stick-inserted-into-her-private-parts-2734982/", "label": 2}