{"authors": ["India Blooms News Service"], "date_download": "2019-03-27 13:59:51", "date_modify": "2019-03-27 13:59:51", "date_publish": "2019-03-27 00:00:00", "description": "Tura, Meghalaya, Oct 27 (IBNS): A hardcore militant of Meghalaya's outfit group Garo National Liberation Army (GNLA) was killed in a fierce gun battle with security forces in Meghalaya's South Garo Hills district on Thursday morning.", "filename": "news-details_N_25401_meghalaya-gnla-militant-killed-in-fierce-gun-battle-huge-quantity-arms-recovered_1553695191.html", "image_url": "https://indiablooms.com/news_pic/2016/Militant-attack-1477577826.jpg", "language": null, "localpath": "/home/raj/news-please-repo//data/2019/03/27/indiablooms.com/news-details_N_25401_meghalaya-gnla-militant-killed-in-fierce-gun-battle-huge-quantity-arms-recovered_1553695191.html", "title": "Meghalaya: GNLA militant killed in fierce gun battle, huge quantity arms recovered", "title_page": "Meghalaya: GNLA militant killed in fierce gun battle, huge quantity arms recovered | Indiablooms - First Portal on Digital News Management", "title_rss": "NULL", "source_domain": "indiablooms.com", "text": "Tura, Meghalaya, Oct 27 (IBNS): A hardcore militant of Meghalaya's outfit group Garo National Liberation Army (GNLA) was killed in a fierce gun battle with security forces in Meghalaya's South Garo Hills district on Thursday morning.\nA team of South Garo Hills launched operation at Nangalbibra region following intelligence input of in presence of a militant group.\n“When troops reached the remote area, the militants started fire and heavy bullets were exchanged lasting for half an hour. In the fierce gun fight a militant killed on spot. But the other militants of the group managed to flee from the area,” a top police official said.\n“After fierce gun battle, the general area was searched and one unidentified male dead body was recovered with one AK rifle in his hands. A huge amount of sophisticated weapons, ammunition and huge number of GNLA demand pads were recovered from the area,” the police official said.\nThe slain militant is yet to be identified.\nSecurity personnel have recovered one HK Rifle, 1 AK rifle, 1 SLR, a 2 inch mortar, one grenade launcher, 2 mortar shells, 1 Chinese live grenade, 7 magazines, 160 live ammunition, one walkie talkie, 3 mobile handsets, one notebook, huge number of GNLA demand pads and other warlike stores from the area.\nPolice and special commando have launched combing operation at the area to nab the fled militants.\n(Reporting by Hemanta Kumar Nath)", "url": "https://indiablooms.com/news-details/N/25401/meghalaya-gnla-militant-killed-in-fierce-gun-battle-huge-quantity-arms-recovered.html", "label": 2}