{"authors": ["Tribune News Service"], "date_download": "2019-03-27 14:00:22", "date_modify": "2019-03-27 14:00:22", "date_publish": "2017-11-20 00:00:00", "description": "TheTribune: MUMBAI: A Haryana Police constable who was arrested last month for running an illegal casino in Gurugram has spilt the beans about a gang war between two outfits.", "filename": "news_haryana_haryana-gang-w_d4702eb3ea57a39555f1a3311d18e170_491276_1553695222.html", "image_url": "https://images.tribuneindia.com/cms/gall_content/2017/11/2017_11$largeimg02_Thursday_2017_113804114.jpg", "language": null, "localpath": "/home/raj/news-please-repo//data/2019/03/27/tribuneindia.com/news_haryana_haryana-gang-w_d4702eb3ea57a39555f1a3311d18e170_491276_1553695222.html", "title": "Haryana gang war that led to gangster’s murder in Mumbai", "title_page": "\r\n\tHaryana gang war that led to gangster’s murder in Mumbai\r\n", "title_rss": "NULL", "source_domain": "tribuneindia.com", "text": "Shiv Kumar\nTribune News Service\nMumbai, November 2\nA Haryana Police constable who was arrested last month for running an illegal casino in Gurugram has spilt the beans about a gang war between two outfits which resulted in the murder of a gangster in Mumbai last year.\nAccording to police here, Constable Paramjeet Singh who was on the run for more than a year was nabbed by the police in that state after they busted an illegal casino. Singh was running the casino on behalf of local gangsters Binder Gujjar and Manoj Gujjar after he went into hiding, a police official said.\nSingh was brought to Mumbai last month after his arrest in Haryana and questioned by the Crime Branch here. Police sources say he has revealed plenty of details on the rivalry between the Gujjar gang and alleged gangster Sandeep Gadoli who was killed in a fake encounter here last year.\n(Follow The Tribune on Facebook; and Twitter @thetribunechd)\nPolice here said Paramjeet Singh had gone into hiding after several of his colleagues were arrested for the murder. He and a partner then set up an illegal casino till his arrest.\nThe arrest of Singh has brought the total number of arrests in the fake encounter case to seven.\nAccording to police, a five-member team of Haryana Police shot dead alleged gangster Sandeep Gadoli at the Airport Metro Hotel near the Chatrapati Shivaji International Airport where he was holed up.\nThe other four members of the encounter team have already been arrested and a hunt was on for Paramjeet Singh, police said.\nThe encounter team was headed by sub-inspector Pradyuman Yadav who was among the first to be nabbed in the case.\nThe other two persons to be held in the case are Gadoli’s girlfriend Divya Pahuja and her mother, who the police say, tipped off the Haryana Police team about the gangster’s whereabouts. Divya Pahuja was staying in the hotel room along with Gadoli when the encounter team stormed into the room and shot him dead, according to the police.\nThe Gujjars allegedly paid a huge sum of money to Divya’s mother Sonia to obtain the whereabouts of Gadoli which they then passed on to the encounter team from Haryana Police. Sub-inspector Yadav’s team allegedly smashed some of the CCTVs at the Airport Metro Hotel before shooting Gadoli dead in his room, police said.\nHowever, footage from a few cameras that escaped the attention of the encounter team helped nail the encounter team, sources here say.", "url": "https://www.tribuneindia.com/news/haryana/haryana-gang-war-that-led-to-gangster-s-murder-in-mumbai/491276.html", "label": 2}