{"authors": ["Anupa Kujur"], "date_download": "2019-03-27 13:59:44", "date_modify": "2019-03-27 13:59:44", "date_publish": null, "description": "Global beverage major Coca-Cola's decision to exit India in 1977 had more to do with the provisions of the Foreign Exchange Regulation Act.", "filename": "news_business_did-george-fernandes-drive-coca-cola-out-from-india-in-the-70s-3447791_1553695184.html", "image_url": "https://static-news.moneycontrol.com/static-mcnews/2018/05/Coca-Cola-logo-770x433.jpg", "language": null, "localpath": "/home/raj/news-please-repo//data/2019/03/27/moneycontrol.com/news_business_did-george-fernandes-drive-coca-cola-out-from-india-in-the-70s-3447791_1553695184.html", "title": "Did George Fernandes drive Coca-Cola out from India in the 70s?", "title_page": "Did George Fernandes drive Coca-Cola out from India in the 70s? - Moneycontrol.com", "title_rss": "NULL", "source_domain": "moneycontrol.com", "text": "Former Defence Minister George Fernandes died on January 29 after battling Alzheimer's disease for sometime. He was 88.\nThe anti-Emergency crusader and \"rebel leader\" was the Industries Minister in Morarji Desai's Janata Party government, which came to power in 1977 after trouncing the Congress. Among other things, he is credited with booting out a few MNCs from India, notably Coca-Cola, during the Janata government's brief tenure.\nBut was Fernandes the man responsible for Coca-Cola quitting India in 1977?\nThe countdown to Coca-Cola's impending exit started in January 1974 when the Indira Gandhi government had introduced the Foreign Exchange Regulation Act (FERA). The law had been created to protect and boost India's paltry foreign exchange reserves.\nUntil FERA was introduced, multinational companies' (MNCs) subsidiaries operating in India were wholly owned by their parent corporations. They would repatriate all profits made from India operations to their parent companies abroad.\nThis hurt India's economy on two counts -- one, the companies were not investing their profits back into the country; and two, they were depleting India's already feeble forex reserves on the way out. When foreign companies take money out of India, they need to convert it into the currency of their origin.\nOne of the provisions of FERA required the Indian subsidiaries of MNCs in low priority industries like consumer goods to dilute their holding in the subsidiaries to 40 percent. They could do this by either issuing fresh shares or selling part of their stake to domestic investors. MNCs in technologically superior industries like pharma and computer hardware were allowed to have a much higher holding. Most MNCs complied with the rule, and diluted their stake, resulting in a bonanza for India's financial institutions as well as retail investors who had the money to invest in stocks.\nBut Coca-Cola had other plans. It initially tried to seek an exemption from the 40 percent rule by claiming that it was a technology-driven company, the technology being the formula to make the concentrate used in the drink. But this argument did not deter authorities.\nCoca-Cola had been in India since 1950 when it opened its first bottling plant in New Delhi, and by all accounts, was doing well.\nIndustry experts said that Coca-Cola feared if it did not have majority ownership, it would have to share its trade secret with shareholders.\nSince its founding in 1886, the company's formula for its flagship drink remained one of the most heavily guarded trade secrets in the world.\nAs retired finance ministry official K Subramaniam points out in this column in 2002, Coca-Cola tried to work around the FERA rule by operating two companies in India. One would be a bottling plant in which it would reduce its holding to 40 percent, and the other would be a technical arm which owned the formula for the concentrate.\nCoca-Cola wanted to hold 100 percent in the technical arm. Reserve Bank of India rejected the proposal and pointed out that FERA guidelines required the entire operations of a branch to be brought under one company with foreign equity capped at 40 percent. This was unacceptable to Coca-Cola, which then decided to pack its bags and leave.\nIn September 1977, then Industries Minister George Fernandes said he had \"no second thoughts\" on the question of allowing Coca-Cola to continue its operations in India, according to a report by New York Times.\n\"Our policy toward multinationals is uniform,\" the report quoted Fernandes as saying, adding that Coca-Cola had to abide by the law of the land if they wanted to do business in India.\nCoca-Cola alleged that it had decided to exit India as local authorities wanted full disclosure of the formula for making the concentrate. That allegation was not entirely true, though by insisting that Coca-Cola operate only one company, the India regulator did not allow the cola maker to ring fence its secret sauce.\nAfter Coca-Cola's exit, several Indian employees of the company were left jobless. To avoid a backlash, the government decided to come up with its own version of Coca-Cola. Fernandes said a 'swadeshi' substitute drink called Double Seven or 77 was ready and would be marketed in a few weeks. The name of the drink had a political undertone as well, since 1977 marked the end of the Emergency imposed by Indira Gandhi, her defeat in the elections, and Janata Party's ascension to power.\nThe government asked the Central Food Technological Research Institute (CFTRI) at Mysore to develop the formula for Double Seven, to fill the void left by Coke, according to a report by India Times. With this, the government provided employment to those who worked with Coca-Cola.\nDouble Seven, marketed by a government-owned company Modern Food Industries, wasn't a success. The drink faced tough competition from Campa Cola, Thums Up, Duke's, McDowell's Crush and Double Cola.\nAs the Morarji Desai government collapsed in mid-1979, Double Seven lost major market share. The Indira Gandhi-led government which returned to power in 1980 was indifferent to Modern Food Industries. The company soon started incurring losses and stopped manufacturing the product.\nWhile George Fernandes was the Industries Minister in 1977, to say that he booted out Coca-Cola would be giving him too much credit. The provisions in FERA had already put the cola maker on sticky wicket. Fernandes merely ensured that it did not get any wriggle room.", "url": "https://www.moneycontrol.com/news/business/did-george-fernandes-drive-coca-cola-out-from-india-in-the-70s-3447791.html", "label": 2}