{"authors": [], "date_download": "2019-03-27 14:00:07", "date_modify": "2019-03-27 14:00:07", "date_publish": "2017-08-07 00:00:00", "description": "Chhatrapati, the editor of a Haryana daily Poora Sach, was shot at point blank range after he published the letter sent by the woman disciples to then Prime Minister Atal Bihari Vajpayee.", "filename": "news_india_son-of-journalist-who-was-shot-dead-for-exposing-dera-rapes-still-awaits-justice-1501537_1553695207.html", "image_url": "https://images.news18.com/ibnlive/uploads/2017/08/740.jpg", "language": null, "localpath": "/home/raj/news-please-repo//data/2019/03/27/news18.com/news_india_son-of-journalist-who-was-shot-dead-for-exposing-dera-rapes-still-awaits-justice-1501537_1553695207.html", "title": "Son of Journalist Who Was Killed For Exposing Dera Rapes Awaits Justice", "title_page": "Son of Journalist Who Was Killed For Exposing Dera Rapes Awaits Justice - News18", "title_rss": "NULL", "source_domain": "news18.com", "text": "Dera Sacha Sauda chief Gurmeet Ram Rahim Singh was convicted in a rape case on Thursday after a wait of 15 years, but for the bereaved son of Ram Chander Chhatrapati, the man who exposed the self-styled godman, the judgment day is still to come.Chhatrapati, who was the editor of a Haryana daily Poora Sach, was shot at point blank range after he published the explosive letter sent to then Prime Minister Atal Bihari Vajpayee in his newspaper in 2002. The letter written by the women disciples of the Dera chief contained details of the rape, and more.In September that year, the Punjab and Haryana High Court took suo motu cognizance of the letter, which had caught enough attention by now.On October 24, the 53-year-old editor was shot four times by two men on a bike, and battled for his life in Apollo hospital, New Delhi for 28 days. The men were alleged to be Dera followers. Before he died on November 21, Chhatrapati named Singh behind the act.His son Anshul, told the press that the cops left the godman's name out of the FIR. Anshul, a key witness, petitioned the High Court for a CBI probe, in early 2003. “I was 21 then, and did not know where to go for justice after the police did not include the name of the Dera chief in the FIR,” he said.Chhatrapati, along with other senior journalists in the region had received threats soon after the letter made news and, and had asked the Sirsa Superintendent of Police for protection. Chhatrpati had been known as a crusader among local journalists and had exposed several wrongdoings by the sect and its chief.Though Singh has been convicted of rape on Friday, Chhatrapati's murder case is still being heard at the same CBI court in Panchkula. The current status of the case is that the presentation of the evidence has been concluded. Anshul, who has made several rounds of the court, hopes for a quick verdict.", "url": "https://www.news18.com/news/india/son-of-journalist-who-was-shot-dead-for-exposing-dera-rapes-still-awaits-justice-1501537.html", "label": 2}