{"authors": [], "date_download": "2019-03-27 14:00:02", "date_modify": "2019-03-27 14:00:02", "date_publish": "2016-10-13 08:15:27", "description": null, "filename": "news__1553695202.html", "image_url": "http://www.siasat.com/wp-content/uploads/2016/10/keralabandhoct13-600x330.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/archive.siasat.com/news__1553695202.html", "title": "BJP calls for shutdown in Kerala post murder of its worker", "title_page": "BJP calls for shutdown in Kerala post murder of its worker | The Siasat Daily", "title_rss": "NULL", "source_domain": "archive.siasat.com", "text": "The shadow of a protester is seen beside a burning tyre of a vehicle during a demonstration in the southern Indian city of Hyderabad January 20, 2010. At least a dozen students were injured as they clashed with police in southern India during a shutdown of the IT hub Hyderabad on Wednesday, in a fresh burst of protests over the creation of a new state, police said. REUTERS/Krishnendu Halder (INDIA)\nThiruvananthapuram (Kerala) [India]: Following the recent murder of one of its activists in Kerala’s Kannur district, the Bharatiya Janata Party (BJP) has called for a state-wide shutdown on Thursday to protest against the Left Democratic Front (LDF) Government.\nBlaming the Communist Party of India (Marxist) for the killing, the BJP alleged that people not following Left ideologies are being murdered.\nNoting that it was the seventh politically motivated murder in the district this year, BJP spokesperson Siddharth Nath Singh told ANI, “The CPI-M or the Left ideology has been violent and if you don’t stand with their ideology, they would like to differ with you by silencing you through murder, and that’s what is exactly happening in Kerala,” Singh said.\n“It is highly condemnable, but certainly the BJP will raise this issue in a democratic manner and respond to the violence of the Left,” he added.\nAnother BJP leader Sambit Patra said, “A government that cannot protect lives cannot be called a government in fact. We have seen almost every day someone is hacked to death in Kerala. The Kerala Government has to investigate and has to punish those people who are responsible for this.”\nBoth the CPI-M and the BJP are now blaming each other for the death of their respective party workers.\nPolice has deployed personnel in large numbers in the district to maintain law and order. (ANI)", "url": "https://archive.siasat.com/news/bjp-calls-shutdown-kerala-post-murder-worker-1039847/", "label": 2}