{"authors": ["Until Now", "This Procedure Had Been Reserved For Old Patients Who Might Not Survive Open Heart Surgery"], "date_download": "2019-03-27 14:00:09", "date_modify": "2019-03-27 14:00:09", "date_publish": "2015-01-02 08:09:50", "description": "The hosts were serving liquor without obtaining licence", "filename": "news_cities_Delhi_raid-at-farmhouse_article6747452_1553695209.html", "image_url": "https://www.thehindu.com/static/theme/default/base/img/og-image.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/thehindu.com/news_cities_Delhi_raid-at-farmhouse_article6747452_1553695209.html", "title": "Raid at farmhouse", "title_page": "\nRaid at farmhouse - The Hindu\n", "title_rss": "NULL", "source_domain": "thehindu.com", "text": "The Delhi Police on Thursday raided a South Delhi farmhouse where alcohol was allegedly being served to a large gathering without permission.\nAccording to the police, the property is owned by a famous fashion designer. They, however, added that the owner was not present during the party.\nThe manager of the property in Fatehpur Beri, who has been named as the organiser, has been booked for violation of Delhi Excise Act.\nIt is alleged that alcohol was served without obtaining licence. Delhi Police spokesperson Rajan Bhagat added that excise for premium brand liquor being served to the guests had not been paid.\n“We received information that around 70 people were present in the party and consuming alcohol without the hosts obtaining liquor licence,” said Mr. Bhagat.\nWhen a police team reached the spot, it found several cars parked outside the farmhouse. Upon entering, the policemen found the party taking place in the open ground in the farmhouse.\nThe FIR registered in connection with the incident states that there was a bar counter in the party. When the police team asked the attendant there to produce the licence for the same, he failed to do so.\nAs many as 21 bottles of alcohol were seized from the venue some of which were meant to be sold in Haryana, said the police.", "url": "https://www.thehindu.com/news/cities/Delhi/raid-at-farmhouse/article6747452.ece", "label": 2}