{"authors": [], "date_download": "2019-03-27 14:00:05", "date_modify": "2019-03-27 14:00:05", "date_publish": "2019-02-12 00:00:00", "description": "A deep-sea port is to be constructed in Tajpur and eight more jetties are to come up in an already industrialised Haldia, but no official has visited either of these regions", "filename": "news_governance_tajpur-and-haldia-how-coastal-development-is-impacting-fishing-in-west-bengal-63212_1553695205.html", "image_url": "https://cdn.downtoearth.org.in/library/large/2019-02-12/0.05070600_1549972027_20190113_143023.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/downtoearth.org.in/news_governance_tajpur-and-haldia-how-coastal-development-is-impacting-fishing-in-west-bengal-63212_1553695205.html", "title": "Tajpur and Haldia: How coastal development is impacting fishing in West Bengal", "title_page": "Tajpur and Haldia: How coastal development is impacting fishing in West Bengal", "title_rss": "NULL", "source_domain": "downtoearth.org.in", "text": "A deep-sea port is to be constructed in Tajpur and eight more jetties are to come up in an already industrialised Haldia, but no official has visited either of these regions\nWest Bengal Chief Minister Mamata Banerjee recently took back control of the proposed deep-sea port in Tajpur in East Midnapur district, saying the state will develop the project without the Centre. But, what about the livelihood of the stakeholders?\nThe local fishing community has not been apprised about the port project or told how their lives will be affected by it. Down To Earth visited a few of the areas the port would cover and found that not one official has visited these places up till now.\n“I have heard of the project, but so far have not officially informed by the government about it. The fishermen there have not received any official intimation yet. The details of the port are still unknown and also how it will affect the 6,000 registered fishermen and labourers,” says Apurba Kar, an assistant at Tajpur Jaladha Matsya Khoti, one of the two matsya khotis in Tajpur where fishermen come and dry the fishes they catch before dispatching them to the market.\nSince the fishing community has received no guidance on what they should do to sustain themselves, they have come to believe that for the sake of development they should abandon their traditional source of livelihood.\n“I have heard that a port will be built here but that will be in the deep sea and won’t affect our work. In fact, our sons will get jobs,” says Anil Kumar Borai, secretary of Jaladha Ma Bansholi Matsya Khoti, the other matsya khoti of the region. “We are concerned because we may have to leave our homes. Will we get the right price for that?” he adds.\nThere are others who think the port will keep them afloat. “If the government builds a port, it will secure us from washing away in the sea. We have seen sand dams being washed away and mechanised trawlers also affect our business. A port will affect affected fishing though, but we have to think of a better future,” says Sukumar Bera, a fisherman in Tajpur.\nMoreover, the women of the region find the port project threatening them existentially. “What will we do if the fishing stops? We come from different places and are very poor. We earn whatever we can to support our husbands. The men can go for other jobs on to the port, but we can’t. Our families will suffer a lot,” says a group of fishing women in the region.\nEven if the fishing community manages to keep their work going, the port could give way to a technical issue. “The port can either increase the speed of waves or decrease it. We cast nets on wooden rods. If the waves increase, it will uproot the rods and the nets will be ripped apart and if it decreases, the fish will not reach the net. Both ways we’ll suffer,” says Pabitra Pradhan, member of Jaladha Ma Bansholi Matsya Khoti.\nHaldia: An industrialised fishing town\nWest Bengal already has one example of what rapid industrialisation does to ports — Haldia. The fishing community in the port city says their income has reduced by one-third since industrialisation started in the region two decades ago.\nFew people in the community have thought about that side of the story. Bhabani Barui, a fisherwoman in a Tajpur village, says, “I’ve heard that we may have to leave our homes and it can be true because Haldia villagers also had to. Near-port villages never remain intact. But, fishing is all we know. What else will we do if we are asked to leave and earn through different means? It will be very painful for us.”\nAnd now that eight jetties are being planned under the ambitious Sagarmala programme, the fishing community is being threatened even more. Angshuman Midya, president of Rupnarayan Chawk Matsya Obotaran Kendra, says, “A water way between Haldia and Varanasi may be made under this project. This will massively impact small-scale fishing business. And, setting up jetties is definitely a threat to us.”\nAlready the youngsters there are migrating to other states and countries. The matsya kothi members say while earlier 80 per cent of fishing labourers were from the village, the number has come down to just 10 per cent now. Saibul Ali, a fisherman busy repairing a boat on the banks of Rupnarayan river, says, “We have to pay at least Rs 3 lakh to get a job. Plus, there hasn’t been any development in the area at all.”\nAlthough Tajpur’s port story is just about to begin, it’s not much different from what’s still happening to Haldia’s fishing community. They too haven’t been visited by a single official yet to inform them about the jetties. Manju Dolui, a fisherwoman in Haldia, says, “We don’t know about jetties but if it affects our livelihood we don’t want it. But no higher official has ever come to visit us and heard our problems. If this continues, we will be forced to leave our profession”\nThe fishing communities in both coastal regions are suffering from the effects of industrialisation without proper planning, pollution control methods, or the government offering them any way out to a sustainable livelihood.\nDonate Now We are a voice to you; you have been a support to us. Together we build journalism that is independent, credible and fearless. You can further help us by making a donation. This will mean a lot for our ability to bring you news, perspectives and analysis from the ground so that we can make change together.\nIndia Environment Portal Resources :", "url": "https://www.downtoearth.org.in/news/governance/tajpur-and-haldia-how-coastal-development-is-impacting-fishing-in-west-bengal-63212", "label": 2}