{"authors": ["Until Now", "This Procedure Had Been Reserved For Old Patients Who Might Not Survive Open Heart Surgery"], "date_download": "2019-03-27 14:00:20", "date_modify": "2019-03-27 14:00:20", "date_publish": "2016-07-15 00:00:00", "description": "Were part of the team that shot the gangster", "filename": "news_cities_Delhi_Gadoli-en_0bc0006677023b247626d790bb4bf583_article14489589_1553695220.html", "image_url": "https://www.thehindu.com/static/theme/default/base/img/og-image.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/thehindu.com/news_cities_Delhi_Gadoli-en_0bc0006677023b247626d790bb4bf583_article14489589_1553695220.html", "title": "Gadoli encounter: Two Haryana cops in custody", "title_page": "\nGadoli encounter: Two Haryana cops in custody - The Hindu\n", "title_rss": "NULL", "source_domain": "thehindu.com", "text": "Jitendra Yadav and Vikram Singh, the two Haryana constables arrested in connection with gangster Sandeep Gadoli’s encounter, have been sent to police custody till July 20.\nOn July 12, the Crime Branch of the Mumbai Police had arrested two suspended Haryana constables who were part of the team that shot dead gangster Sandeep Singh alias Sandeep Gadoli in an alleged encounter at the Airport Metro Hotel in Andheri on February 7 this year.\nAfter the family of Gadoli, a history-sheeter from Haryana, went to court, the Crime Branch formed a Special Investigation Team which booked the five-member Haryana police team for murder. All the five policemen were subsequently suspended by the Haryana police. Last Wednesday, the SIT arrested Sub-Inspector Pradhuman Yadav, head of the team that shot Gadoli. He is in police custody till July 16 and his interrogation is under way.\nOn May 28, the Maharashtra police had informed the Supreme Court that it had invoked murder charges against five Haryana police personnel involved in an allegedly staged shootout. Gadoli’s body is still lying in the mortuary as his family is refusing to perform the last rites till a judicial probe is conducted.\nOn June 30, the SIT, formed to look into the murder, filed an application at the Esplanade court seeking a non-bailable warrant against five Haryana policemen.", "url": "https://www.thehindu.com/news/cities/Delhi/Gadoli-encounter-Two-Haryana-cops-in-custody/article14489589.ece", "label": 2}