{"authors": [], "date_download": "2019-03-27 14:00:26", "date_modify": "2019-03-27 14:00:26", "date_publish": "2015-10-27 18:46:01", "description": "Indian police rush to a Kerala state government building after being told that its canteen was serving beef - angering the Kerala government.", "filename": "news_world-asia-india-34645240_1553695226.html", "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/2F66/production/_86343121_86343118.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/bbc.co.uk/news_world-asia-india-34645240_1553695226.html", "title": "Delhi 'beef raid' on Kerala government canteen causes outrage", "title_page": "Delhi 'beef raid' on Kerala government canteen causes outrage - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "text": "Image copyright AP Image caption Beef consumption has become a topic of discussion after the lynching of a 50-year-old Muslim man over allegations that he had eaten beef\nThe canteen of a Delhi guesthouse belonging to the southern Indian state of Kerala was visited by police after a rightwing Hindu group complained it had beef on its menu.\nStaff told police that beef items on their menu were buffalo, not cow, meat.\nPolice said they only went to Kerala House as a \"preventive measure\", not to investigate the complaint or take meat samples.\nAn angry Kerala government has complained to the police.\nKerala is one of the few Indian states in which cow slaughter is legal.\nMost states, including Delhi, most states, including Delhi, ban the slaughter of cows, because the cow is considered sacred by India's majority Hindus.\nIndian media report that Kerala Chief Minister Oommen Chandy wrote to Prime Minister Narendra Modi accusing the police of overstepping their authority.\n\"I would like to inform you that the Kerala House staff canteen serves authentic vegetarian and non-vegetarian Kerala cuisine and the items in the menu are entirely within law,\" the letter is reported to have said.\nThe confusion likely stemmed from the fact that in India, buffalo meat is often called \"beef\", the BBC's South Asia Editor Charles Haviland reports.\nAfter the police action, the institution removed the buffalo meat from its kitchens - but has since, defiantly, restored it, our correspondent says.\nFollowing Monday evening's incident, the police picked up the caller from the Hindu Sena group for further questioning.\n\"We dealt with the matter with necessary alertness and took our position. The objective was to ensure that law and order is not disrupted,\" Jatin Narwal, a senior police officer, told the NDTV news site.\nMedia playback is unsupported on your device Media caption What’s India’s beef with beef? (VIDEO FROM 2015)\nHowever, Kerala Chief Minister Oomen Chandy condemned the police for visiting Kerala House at all.\n\"The Delhi police should have shown restraint and consulted officials concerned before checking the premises for beef dishes,\" Mr Chandy told Indian television channels.\n'Stuck in the throat'\nThe incident has led to outrage on both social and mainstream media.\n\"Kerala's famed beef curry has been an annoying bone that got stuck in the throat of the Sangh parivar [Hindu hardline group], especially because many Hindus in the state relish the dish,\" an editorial in the Telegraph newspaper said.\nArun Shourie, who was a minister in the former BJP government, also criticised the government, saying its policies were identical to those of the previous Congress government - except for its preoccupation with cows.\n\"People have started recalling the days of [former prime minister] Manmohan Singh. The way to characterise the policies of the government is - Congress plus a cow. The policies are the same,\" he said at a function in Delhi.\n\"Kerala House\" was one of the top trends on Twitter India, with many criticising the government as well as what they saw as overzealous police action.\nImage copyright Twitter\nImage copyright Twitter\nThe issue of beef consumption has become highly political since a 50-year-old Muslim man was lynched in north India over allegations that he had consumed beef.\nGovernment ministers from the Hindu nationalist BJP said the incident was a \"spontaneous expression of anger\", while the chief minister of the northern state of Haryana said the cow \"is an article of faith\" in India.\nThe beef ban has provoked outrage, with many questioning the government's right to decide what is on their plate.\nIt has also been criticised by many as beef is cheaper than chicken and fish and is a staple for the poorer Muslim, tribal and Dalit (formerly untouchable) communities.", "url": "https://www.bbc.co.uk/news/world-asia-india-34645240", "label": 2}