{"authors": [], "date_download": "2019-03-27 13:59:53", "date_modify": "2019-03-27 13:59:53", "date_publish": "2018-06-12 00:00:00", "description": null, "filename": "news_2018_June_12.06.2018_dr-kafeels-brother-shifted-to-lucknow_1553695193.html", "image_url": "http://www.ummid.com/favicon.ico", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/ummid.com/news_2018_June_12.06.2018_dr-kafeels-brother-shifted-to-lucknow_1553695193.html", "title": "Condition of Dr Kafeel Khan’s brother deteriorates, referred to Lucknow hospital", "title_page": "Condition of Dr Kafeel Khan’s brother deteriorates, referred to Lucknow hospital | ummid.com", "title_rss": "NULL", "source_domain": "ummid.com", "text": "Lucknow: Dr Kafeel Khan’s brother, who was shot at by unidentified assailants on Sunday, was referred to KGMC hospital in Lucknow today after his condition deteriorated.\nAccording to the hospital, 35-year-old Kashif Jameel’s surgery was done by Dr R V Dubey and the bullets were removed. He has been referred to trauma centre at KGMC. Kashif Jameel is an engineer by profession, and married just a year ago.\nKashif Jameel, younger brother of Dr Kafeel Khan who was first hailed as hero but later booked as an accused in the BRD medical college tragedy, was on Sunday night shot at in Gorakhpur by unknown miscreants.\n\"We don't know who tried to kill my bother. He has received bullet injuries on his arm, shoulder and neck. He has been admitted to a private hospital and is in critical condition,\" Adeel Khan, Jameel's elder brother, said.\nJameel was shot at in Durgabadi area by two unidentified bike-borne assailants at around 10:30 pm Sunday night. He was on his scooty when the incident happened. He is admitted to Star Hospital in Gorakhpur.\nDr Kafeel hit the media headlines after he single-handedly saved dozens of children at BRD Medical College Hospital by personally buying and ferrying oxygen cylinders to the hospital. More than 300 children were killed due to non-supply of oxygen in the incident.\nHailed as a hero initially, Dr Kafeel was however later booked as an accused in the case and was sent to jail. He got bail only after being in prison for seven months.\nIn an open letter written from the jail, Dr. Kafeel - the head of the encephalitis ward and a paediatrician, described in detail how he managed to save many lives and the parents in the hospital. Some of the eyewitnesses also said that had it not been for Khan’s work, the number of deaths could have been higher.\n“While other doctors gave up hope, Dr Khan managed the situation well by arranging oxygen cylinders from private nursing homes. He saved many lives by his efforts and presence of mind,” said Gaurav Tripathi, an eyewitness.\nHowever, this did not make Kafeel Khan a hero in the eyes of the administration. Khan was booked for criminal conspiracy, attempt to commit culpable homicide and criminal breach of trust by public servant, among others. The police filed the chargesheet in November 2017.\n“The guilty are DM Gorakhpur, DGME (director general of medical education), Principal Secretary Health Education for not taking any action against 14 reminders sent by Pushpa Sales for its Rs 68 lakh dues. It was a total administrative failure at higher level, they did not realise the gravity and just to save themselves, they made us scapegoat and put us behind the bars\", Dr. Kafeel claimed in his letter.\nHe also claimed that his life “turned upside down” when UP Chief Minister Yogi Adityanath visited him the following day. “He asked, ‘so you are Dr Kafeel? You arranged cylinders?’ I was…yes sir. He got angry — ‘so you think by arranging cylinders, you became hero, I will see it’,” Khan wrote. “Yogi-ji was angry because…how this incident came into the media.”\nFor all the latest News, Opinions and Views, download ummid.com App\nSelect Langauge To Read in Urdu, Hindi, Marathi or Arabic", "url": "http://www.ummid.com/news/2018/June/12.06.2018/dr-kafeels-brother-shifted-to-lucknow.html", "label": 2}