{"authors": ["India.Com News Desk"], "date_download": "2019-03-27 14:00:24", "date_modify": "2019-03-27 14:00:24", "date_publish": "2015-11-21 11:08:34", "description": "Government and non-Muslims are benefiting the most from animal slaughter. - Hindu beef traders: Why all the fuss over Justice Rajinder Sachar's remark?", "filename": "news_india__1553695224.html", "image_url": "https://www.india.com/wp-content/uploads/2015/11/FotorCreated190.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/india.com/news_india__1553695224.html", "title": "Hindu beef traders: Why all the fuss over Justice Rajinder Sachar's remark?", "title_page": "Hindu beef traders: Why all the fuss over Justice Rajinder Sachar's remark? | India News, India.com", "title_rss": "NULL", "source_domain": "india.com", "text": "Agra, November 21: Justice Rajinder Sachar, former chief justice of Delhi high court on Friday stoked a controversy when he said that more Hindus are involved in the beef trade in the country than Muslims. As Justice Rajinder Sachar made the statement on the beef row at the three-day ‘International Conference on Radical Islam’, where many of the teachers and participants walked out of the venue.\nOn the last day of ‘International Conference on Radical Islam’ held at RC Degree College in Mathura, Justice Rajinder Sachar said that among all the beef traders in India, 95% are from the Hindu community. “Almost 95% beef traders are Hindus. Still, a man was lynched in Dadri because he ate beef. This is the death of mankind and humanity. Eating habits have nothing to do with religion. Even I can eat beef,” said Justice Sachar, who headed the committee that recommended quota for Muslims in 2006.\nWithout taking the name of BJP’s Sardhana MLA Sangeet Som, who was recently in the news over allegations about owning a beef trading company, Justice Sachar said, “MPs and MLAs, too, own beef companies. Then why is only the common man being targeted by right-wing groups?” (ALSO READ: Beef ban enthusiast Sangeet Som owns meat processing unit)\nAs soon as Justice Sachar made his remark, scholars and teachers present at the conference walked out of the hall in protest. A few of them also switched off the fans and lights in the hall, demanding Sachar to stop his address. “The guests, scholars and intellectuals present at the auditorium got furious when Justice Sachar turned a ‘pro-Muslim’ topic into an ‘anti-Hindu’ one. We all have freedom of speech, but one should carefully choose words while addressing a public gathering,” Shiv Ram Bharadwaj, a teacher who was present at the venue, was quoted by Times of India as saying.\nWas Justice Sachar right in his claims? Are Muslims unnecessarily targeted for animal slaughtering? Muslims are harassed and targeted as beef or meat eaters while, in recent cases, they were even beaten to death because they were suspected to have consumed beef. Communal tension prevails due to this blame game. The right-wing activists become more active during Eid ul Azha festival only to communalise the atmosphere.\nAccording to a study conducted by a web portal called Ummid.com, the government and non-Muslims are benefiting the most from animal slaughter. The study also revealed that the majority of meat exporters and owners of modern abattoirs, and those associated with other related industries like bone, leather, horn, farmers, transporters, animal blood and other raw materials are mainly non-Muslims, except for Allana Sons, a 1969 company which has a major share in frozen meat export from India, and few other smaller players who are Muslims.\n“Except for direct consumption, where non-Muslims also eat beef, in rest all associated business including meat export, bone crushing and powder industry, leather industry, horn processing industry, blood processing, animal fat and soap industry, except for few exceptions, each one is dominated entirely by non-Muslims. Some prominent names are the Arabian Export of Deepak Tijori, Al Kabeer Exports now run by Atul Subberwal, Al-Noor Export of Ajay Sud, Mahesh Jagadale and Co, Sujata Bones of MK Deore, Dode Industries, Fine Exports, SK Leather, Ramesh Juneja & Sons, Bharat Leather, Woodland, Raymonds, Datta Soap, BS International, Sixth Sense, Natural Craft, Bounty Fashion Export, Kochhar Brothers, Ravi Exports, Kalia International, and Hindustan Unilever Ltd. – all engaged in beef and the business of associated raw materials and products,” said the report.\nIn India, cow is considered as sacred, and its slaughter is banned since 1976. However, bulls, bullocks and calves slaughter were allowed in most of the Indian states including Maharashtra and Haryana. But, Maharashtra and Haryana government recently passed an amended legislation banning cow slaughter this month; also banning bulls, bullocks and calves slaughter. Despite these bans, Buffalo meat is treated in India as beef, and its export is flourishing under the government patronage.\nHindu sentiments are attached with cow. Hence, cow slaughter should be banned. But targeting Muslims saying that they only consume beef or meat for eating, and other purposes seems way off the mark.", "url": "https://www.india.com/news/india/hindu-beef-traders-why-all-the-fuss-over-justice-rajinder-sachars-remark-723206/", "label": 2}