{"authors": ["Sandhya Dangwal"], "date_download": "2019-03-27 13:59:54", "date_modify": "2019-03-27 13:59:54", "date_publish": "2017-03-20 08:14:33", "description": "Bahujan Samaj Party leader Mohammed Shami has been shot dead by bike-borne assailants in Allahabad early on Monday morning. - Uttar Pradesh: BSP leader Mohammed Shami shot dead by bike-borne assailants in Allahabad", "filename": "news_india__1553695194.html", "image_url": "https://www.india.com/wp-content/uploads/2017/02/murder2_647_061016084500.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/india.com/news_india__1553695194.html", "title": "Uttar Pradesh: BSP leader Mohammed Shami shot dead by bike-borne assailants in Allahabad", "title_page": "Uttar Pradesh: BSP leader Mohammed Shami shot dead by bike-borne assailants in Allahabad | India News, India.com", "title_rss": "NULL", "source_domain": "india.com", "text": "Allahabad, March 20: Bahujan Samaj Party (BSP) leader Mohammed Shami has been shot dead by bike-borne assailants in Allahabad early on Monday morning. The incident comes a day after Uttar Pradesh got its new Bharatiya Janata Party (BJP) Chief Minister, Yogi Adityanath. Earlier this week, a report stated that son of Bahujan Samaj Party MLA Lalji Verma attempted suicide shooting his own self. The incident took place at his house in Akabarpur police station area of Ambedkar Nagar district. Reports stated that Vikas Verma who is 38 years old, is suffering from some disease and is bed ridden for a long time back.\nUP: BSP Leader Mohd Shami shot dead by bike borne assailants in Allahabad pic.twitter.com/0hpitOPwjl — ANI UP (@ANINewsUP) March 20, 2017\nAs per reports by The Pioneer, Vikas posted a message on his facebook account while self-pitying on him for being bed ridden and unable to associate his friends around 2 pm. Soon after the brutal suicide took place, he was rushed to Lucknow and undergoing treatment in KGMU’s trauma center. (ALSO READ: Uttar Pradesh: Railway official, wife and daughter allegedly murdered in Auraiya district, probe underway)\nIn October 2016, another similar incident was reported from Meerut where a Bahujan Samaj Party leader Nasir Khan was shot dead by a motorcycle-borne assailant. The incident took place on a street in the Khair Nagar area. Following the murder of the BSP leader, his family members and supporters attacked and vandalized the home of Samajwadi Party leader Rehman Safi, who was arrested for having involved in the murder. Rehman Safi and Khan had a long-standing rivalry which may probably have led to such a heinous crime.\nBSP leaders have been attacked a number of times in Uttar Pradesh. Another incident was reported from Jewar area of Bulandshahr district where unidentified criminals shot dead a Bahujan Samaj Party (BSP) leader known as Israel. The deceased was the former chairman of the Jahangirpur Nagarpalika. The incident is believed to have triggered by a political rivalry. A person travelling with him in the car and the driver were also injured in the incident.", "url": "https://www.india.com/news/india/uttar-pradesh-bsp-leader-mohammed-shami-shot-dead-by-bike-borne-assailants-in-allahabad-1941881/", "label": 2}