{"authors": ["Jasjeet Singh"], "date_download": "2019-03-27 14:00:22", "date_modify": "2019-03-27 14:00:22", "date_publish": "2016-12-29 00:00:00", "description": null, "filename": "news_chandigarh__1553695222.html", "image_url": "https://dailypost.in/wp-content/uploads/2016/12/29220.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/dailypost.in/news_chandigarh__1553695222.html", "title": "Snatching incidents toughest thing to deal with: UT SSP", "title_page": "\nSnatching incidents toughest thing to deal with: UT SSP - Latest Punjab News, Breaking News Punjab, India News | Daily Post\n", "title_rss": "NULL", "source_domain": "dailypost.in", "text": "Chandigarh: Senior Superintendent of Police (SSP), UT Dr Sukhchain Singh Gill while interacting with media before his farewell, stated that snatching incidents as toughest to deal with.\nGill said, “We cannot claim snatchings in Chandigarh to be on spurt. It is a period when snatchings take place especially in August and September every year. The cops acted swiftly and solved several cases but the crime of snatching is not preventable”.\nThe outgoing SSP also stated that kidnapping cases are toughest to crack. He added, “In kidnapping cases, we need to save the victim alive and get back the ransom, so such cases are difficult to solve.”\nThe 2003 batch, IPS officer, Gill joined Chandigarh Police as Senior Superintendent of Police (SSP) on December 11, 2013 and now has been transferred back to his parent cadre Punjab after completion of his tenure.\nPraising Chandigarh Police, Gill affirmed the functioning of Police Control Room (PCR) as the ‘best’. I think there is a PCR in every corner which is the best thing here in Chandigarh,” said Sukhchain Singh Gill.\nWhen questioned about the corruption among city policemen who were caught by CBI or Vigilance while accepting bribes, Gill said, “It is not about the cops it is about the corruption. Whatever corruption someone do, he has to pay it back.”\n“Happy I am moving back to Punjab”\nWhen asked about the leaving Chandigarh and moving back to Punjab, Gill added, “I am happy to go back to my parent cadre. It feels good coming and serving in Chandigarh and it equally feels good going back to Punjab.”\nRobbery and Murder case remain unsolved in Gill’s tenure\nThe SSP didn’t spoke much on the Sippy Sidhu murder case and said, “Only a murder case and a robbery case at Karan jewelers remained unsolved, rest most of the cases have been solved”.\nAccording to reports, it is in the tenure of SSP Gill, that Sukhmanpreet Singh Sidhu is son of late I P S Sidhu, senior advocate of Punjab and Haryana High Court and grandson of S S Sidhu, former Punjab and Haryana High Court Justice was murdered at Sector 27 park in 2015.\nMeanwhile, a robbery at Karan Jewellers Sector 22, which also took place in the tenure of SSP Gill also remained unsolved. A youth managed to escape after looting away three jewellery boxes and shoot the manager of jewellery shop. Police had CCTV footage of the incident and even announced cash prize money of Rs 50,000, if anyone informs about the accused, but till date no clues have been obtained.\nFor more news updates Follow and Like us on Facebook", "url": "https://dailypost.in/news/chandigarh/snatching-incidents-toughest-thing-deal-ut-ssp/", "label": 2}