{"authors": [], "date_download": "2019-03-27 13:59:49", "date_modify": "2019-03-27 13:59:49", "date_publish": "2016-09-27 10:46:36", "description": "Two Naxals were today killed in a gunbattle with security forces in Chhattisgarh's Sukma district.", "filename": "news_chhattisgarh_two-naxals-killed-in-gunbattle-in-sukma_1933909_1553695189.html", "image_url": "https://english.cdn.zeenews.com/sites/default/files/default_images/placeholder_image_8.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/zeenews.india.com/news_chhattisgarh_two-naxals-killed-in-gunbattle-in-sukma_1933909_1553695189.html", "title": "Two Naxals killed in gunbattle in Sukma", "title_page": "Two Naxals killed in gunbattle in Sukma | Chhattisgarh News", "title_rss": "NULL", "source_domain": "zeenews.india.com", "text": "Raipur: Two Naxals were today killed in a gunbattle with security forces in Chhattisgarh's Sukma district.\n\"The encounter took place early this morning in the dense forest of Fulbadgi Police Station area while a joint team of security forces was out on an anti-Maoist operation,\" Sukma Superintendent of Police Indira Kalyan Elesela told PTI.\nComposite squad of District Reserve Group (DRG), Chhattisgarh Armed Force (CAF) and local police had launched the operation in the interiors of Fulbagdi, located around 450 kms away from here, based on specific inputs, he said.\nAbout 8 kms away from the police station, an exchange of fire broke out between both the sides after ultras opened fire on security forces, the SP said, adding, rebels soon managed to flee the spot taking the cover of dense forest.\n\"During search of the area, bodies of two male Maoists, beside a muzzle loading gun and one 315 bore gun were recovered from the spot,\" he added.\nThe identity of the ultras will be ascertained once the patrol party will return to its camp, the SP said.\nYesterday, three Naxals, including two hardcore commander rank cadres, were gunned down by security forces at separate places in Bastar division.\nWith today's encounter, the number of Maoists having been?killed?in separate encounters in Bastar this year has reached to 99.", "url": "https://zeenews.india.com/news/chhattisgarh/two-naxals-killed-in-gunbattle-in-sukma_1933909.html", "label": 2}