{"authors": ["India.Com News Desk"], "date_download": "2019-03-27 14:00:00", "date_modify": "2019-03-27 14:00:00", "date_publish": "2016-09-20 14:24:59", "description": "The Intelligence Bureau (IB) had shared specific information about the presence of militant near Army camp in Uri. Did Indian Army ignore the intelligence inputs about Uri terror attack? - Uri attack would have been averted, if Army had taken intelligence inputs 'seriously'", "filename": "news_india__1553695200.html", "image_url": "https://www.india.com/wp-content/uploads/2016/09/Uri-attack-12.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/india.com/news_india__1553695200.html", "title": "Uri attack would have been averted, if Army had taken intelligence inputs 'seriously'", "title_page": "Uri attack would have been averted, if Army had taken intelligence inputs 'seriously' | India News, India.com", "title_rss": "NULL", "source_domain": "india.com", "text": "New Delhi, Sep 20: Since the ghastly attack on Army camp in Kashmir’s Uri by Pakistani terrorists in which 18 soldiers sacrificed their life, questions are being raised about Indian Army’s preparation about the possible terror strike. Intelligence Bureau (IB) had shared specific information about the presence of militant near Army camp in Uri. Despite specific information regarding possible militant attack, Indian Army failed to stop it. Did Indian Army ignore the intelligence inputs about Uri terror attack? Defense experts have also warned the Army about the possible infiltration of militant in Kashmir because of the 73-day long unrest.\nAccording to media reports, specific information about possible terror strike at the Uri installation was shared with army official of the Uri brigade. “We had reports of militant presence in the area and same was shared with army,” an officer was quoted as saying by the Hindustan Times. Moreover the IB, while sharing specific information about attack on Uri camp, warned the army of a infiltration bid too. An increase in the infiltration bid across the Line Of Control was reported in last two months because of the unrest in the valley. The spike in infiltration bids also increased the presence of militant in Kashmir.\nIt was reported by Gen Syed Ata Hasnain, former Corp commander of Srinagar-based Chinar Corp that he had also warned the Army against the attack. He said preventing the attack was not possible but some measures could have been taken in order to avoid such a deadly attack that claimed lives of 18 jawans. (ALSO READ: Uri terror attack: National Investigation Agency registers case to probe the terror attack)\nHasnain in his tweet mentioned, “Uri attack, this is my old HQ. Warned the Cdr specifically on 8 Sep. Happened in 10 days. Done to remove pressure from hinterland Army move,”. “Preventing suicide attack is difficult, damage control is always possible. Main danger is of suicide bombing not witnessed since 2004’’, he mentioned in another tweet.\nThe HQ is 6km from LoC. Trts have struck parliament, also Twin Towers. This warfare is different. https://t.co/vArhXqqUCq — Syed Ata Hasnain (@atahasnain53) September 18, 2016\nPreventing suicide attack is difficult, damage control always possible. Main danger is of suicide bombing not witnessed since 2004. — Syed Ata Hasnain (@atahasnain53) September 18, 2016\nThe Indian Army recovered a map from slain terrorists on which markings were made in ‘Pashto’ language. Pashto is the second-largest language and one of the provincial languages of Pakistan. The map had several markings which made it clear that they were trained in Pakistan and sent across the LoC to launch suicide attack in Jammu and Kashmir.(ALSO READ: Uri terror attack: AMU expels Kashmiri students for posting ‘objectionable’ comment about martyrs)\nAs per reports, it was stated by locals reported that concertina wires at a certain patch were not intact and they could venture to the other side to arrange grass for cattle. Director General Military Operations (DGMO) Lt General Ranbir Singh said the reports indicate that the slain terrorists belonged to Jaish-e-Mohammed outfit in Pakistan. On Monday, Singh reported that four AK 47 rifles and four Under Barrel Grenade Launchers along with other war-like equipment were recovered from the terrorist.", "url": "https://www.india.com/news/india/uri-attack-would-have-been-averted-if-army-had-taken-intelligence-inputs-seriously-1500022/", "label": 2}