{"authors": ["Tribune News Service"], "date_download": "2019-03-27 14:00:12", "date_modify": "2019-03-27 14:00:12", "date_publish": "2015-04-19 01:25:00", "description": "TheTribune: CHANDIGARH: Less than two years after a 22-year-old youth was shot by the police in Amritsar, the Punjab and Haryana High Court has directed the registration of a case against “erring officials”.", "filename": "news_punjab_youth-s-killing_26216b7070321db9f107b6fd9697a659_69334_1553695212.html", "image_url": "https://www.tribuneindia.com/images/default_image.jpg", "language": null, "localpath": "/home/raj/news-please-repo//data/2019/03/27/tribuneindia.com/news_punjab_youth-s-killing_26216b7070321db9f107b6fd9697a659_69334_1553695212.html", "title": "Youth’s killing: HC orders FIR against Amritsar cops", "title_page": "\r\n\tYouth’s killing: HC orders FIR against Amritsar cops\r\n", "title_rss": "NULL", "source_domain": "tribuneindia.com", "text": "Saurabh Malik\nTribune News Service\nChandigarh, April 18\nLess than two years after a 22-year-old youth was shot by the police in Amritsar, the Punjab and Haryana High Court has directed the registration of a case against “erring officials”. Keeping in view the “peculiar facts of the case”, Justice Lisa Gill also directed the handing over of the investigation to the Crime Branch.\n“An officer not less than the rank of Superintendent of Police shall carry out the investigation,” Justice Gill asserted. For the purpose, Justice Gill also set three-month deadline and called for a compliance report.\nThe direction came on a petition filed by victim Arvinder Pal Singh’s mother Daljit Kaur. She was seeking directions for handing over the investigation of an FIR against her son to an independent agency like the CBI after claiming that it was a cover-up of his murder at the hands of police officials.\nThe FIR for attempt to murder and other offences was registered at the cantonment police station on May 23, 2013. Head constables Sandeep Singh and Prem Singh claimed they proceeded towards a saloon for apprehending him on the basis of some secret information. Wanted in several other cases, he, however, attacked them with an intention to kill.\nSandeep Singh then fired in self-defence, the prosecution claimed.\nJustice Gill said prima facie there appeared to be an attempt to cover up the acts of the police officials. “An extremely glaring aspect of this case is that no medical evidence has been forthcoming in respect to the injuries allegedly sustained by Sandeep Singh….\n“Registration of an FIR against the petitioner’s son Arvinder Pal Singh is indicative of anxiety and turbulence being faced by the police officials. They registered the FIR against Arvinder Pal Singh, who apparently died at the spot….\n“Amritsar SDM, in his report dated October 7, 2014, has concluded that the police officials fired in self-defence and the killing was not intentional. In my considered opinion, this by itself cannot be a ground for not registering an FIR against the police officials…. Whether Arvinder Pal Singh was in fact killed in self-defence or not would necessarily be a matter of investigation…\n“The matter has to be investigated thoroughly especially in view of the serious allegations against police personnel. The mandate of law cannot be scuttled in the manner adopted by the state.”\nJustice Gill said that the investigation into the FIR against Arvindpal Pal Singh would also be handed over to the Crime Branch and investigated by the same officer.", "url": "https://www.tribuneindia.com/news/punjab/youth-s-killing-hc-orders-fir-against-amritsar-cops/69334.html", "label": 2}