{"authors": ["Dp Online"], "date_download": "2019-03-27 14:00:23", "date_modify": "2019-03-27 14:00:23", "date_publish": "2016-09-20 08:35:36", "description": null, "filename": "news_editor-s-picks__1553695223.html", "image_url": "https://dailypost.in/wp-content/uploads/2016/09/CBI-AFP.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/dailypost.in/news_editor-s-picks__1553695223.html", "title": "Haryana Govt hands over Mewat double murder case to CBI", "title_page": "\nHaryana Govt hands over Mewat double murder case to CBI - Latest Punjab News, Breaking News Punjab, India News | Daily Post\n", "title_rss": "NULL", "source_domain": "dailypost.in", "text": "Chandigarh: The Haryana government today handed over to CBI the double-murder case of a couple and alleged gangrape of two girls in which their kin had alleged the role of cow vigilantes in Mewat district.\nThe probe in the incident has been transferred to the CBI, official sources said here.\nAfter the incident last month, Haryana Police had formed a Special Investigation Team (SIT) to probe the case.\nThe Haryana Police had come under criticism and public outrage, following the brutal incident that took place in a house located near Manesar-Palwal expressway in a village in Mewat last month.\nOn August 28, Haryana Police had arrested four youths in connection with murder of a couple and gang-rape of two girls after the accused had barged into the family’s house in the wee hours on August 25 in a village in Mewat district.\nOn the fateful night, the assailants had first killed the couple, who were 40 years of age, with sharp edged weapons and then injured six other members of the family, all of whom were sleeping in the house, located near the fields in the village.\nThey had also ransacked the house, an isolated structure located in the middle of farmland, and fled with some valuables including cash, police had said earlier.\nAmong the injured included two women, aged 18 and 22 years, who were sexually assaulted by the assailants. They were relatives of the couple, according to police.\nAfter committing the crime, the accused had tied the injured with ropes and escaped from the spot. Some residents living nearby found the injured after which the police had been informed about the incident.\nThe family of the victims had alleged that they had informed the police personnel about the cow vigilantes but they chose to ignore it.\n“They (attackers) asked us ‘you eat cow meat’. We said ‘no’. They then said ‘you eat cow meat’. They said ‘we are killing you because you eat cow’.\n“We told this to the police but they are not doing anything,” one of the two victims had claimed.\nYesterday, BSP president Mayawati had lashed out at Haryana Chief Minister Manohar Lal Khattar for terming the Mewat gang-rape and double-murder case a “small issue” and asked Prime Minister Narendra Modi to take note of “anti- woman” mentality of a “person occupying such a high post”. PTI\nFor more news updates Follow and Like us on Facebook", "url": "https://dailypost.in/news/editor-s-picks/haryana-govt-hands-mewat-double-murder-case-cbi/", "label": 2}