{"authors": ["Known As The Poor Man S Cocaine", "Mephedrone Is Cheaper", "More Easily Available", "Therefore More In Demand", "Say Police"], "date_download": "2019-03-27 14:00:27", "date_modify": "2019-03-27 14:00:27", "date_publish": "2016-07-13 07:57:08", "description": "The Crime Branch of the Mumbai Police on Tuesday arrested two suspended Haryana constables who were part of the team which shot dead gangster Sandeep Singh alias Sandeep Gadoli in an alleged encounter", "filename": "news_cities_mumbai_Gadoli-e_d13a1fffb8f9925054539f275a522872_article14486616_1553695227.html", "image_url": "https://www.thehindu.com/static/theme/default/base/img/og-image.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/thehindu.com/news_cities_mumbai_Gadoli-e_d13a1fffb8f9925054539f275a522872_article14486616_1553695227.html", "title": "Gadoli encounter: two former cops surrender", "title_page": "\nGadoli encounter: two former cops surrender - The Hindu\n", "title_rss": "NULL", "source_domain": "thehindu.com", "text": "The Crime Branch of the Mumbai Police on Tuesday arrested two suspended Haryana constables who were part of the team which shot dead gangster Sandeep Singh alias Sandeep Gadoli in an alleged encounter at the Airport Metro Hotel in Andheri on February 7 this year.\nAfter the family of Gadoli, a history-sheeter from Haryana, went to court, the Crime Branch formed a Special Investigation Team which booked the five-member Haryana police team for murder. All the five policemen were suspended by the Haryana police subsequently. On Wednesday last week, the SIT arrested Sub-Inspector Pradhuman Yadav, head of the team that shot Gadoli.\nAccording to police sources, constables Jitendra Yadav and Vikram Singh, surrendered before the SIT on Tuesday afternoon.\n“We had teams in Haryana constantly visiting the residences of both the constables as well as other possible places where they could be hiding. They fled Haryana and came to Mumbai late last week. On Tuesday, they contacted us and said they wished to surrender,” a senior police officer said.\nBoth constables were placed under arrest on Tuesday evening and will be produced in the Esplanade Court on Wednesday.", "url": "https://www.thehindu.com/news/cities/mumbai/Gadoli-encounter-two-former-cops-surrender/article14486616.ece", "label": 2}