{"authors": ["Jasjeet Singh"], "date_download": "2019-03-27 13:59:49", "date_modify": "2019-03-27 13:59:49", "date_publish": "2016-12-29 00:00:00", "description": null, "filename": "news_chandigarh__1553695189.html", "image_url": "https://dailypost.in/wp-content/uploads/2016/12/29653-1.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/dailypost.in/news_chandigarh__1553695189.html", "title": "Better than AK 47 City cops now laced with FNF 2000 17 Glock gun", "title_page": "\nBetter than AK 47 City cops now laced with FNF 2000 17 Glock gun - Latest Punjab News, Breaking News Punjab, India News | Daily Post\n", "title_rss": "NULL", "source_domain": "dailypost.in", "text": "Chandigarh: Aiming to combat any major attack, the Chandigarh Police is finally laced with high performance FNF 2000 17 Glock gun. The guns have been distributed among the special commando teams of Operation Cell and other cops in the Police force.\nAccording to officials from Chandigarh Police, a total hundred FNF 2000 17 Glock gun have been purchased by the Chandigarh Police. Police official said that a proposal for the purchase of 200 Glock 17 guns was sent to the MHA (Ministry of Home Affairs) and after the proposal was agreed, 100 guns have been bought. NSG had recommended to Chandigarh Police to purchase Glock 17 According to sources, the recommendation to purchase the Glock 17 gun was made by the NSG (National Security Guards) department. The IG of NSG had sent a proclamation to the Chandigarh Police to buy the Glock 17 gun for the commandos of UT Police.\nThe commandos of UT police who head for training at the NSG, are trained with Glock 17 gun along with the AK 47 and other guns which are already with Chandigarh Police. However, at that time the Chandigarh Police was occupied with other guns including the AK 47.\nFinding Chandigarh Police commandos training at NSG going futile after being trained with Glock 17 as it was not in possession with the Chandigarh Police, the Inspector General of NSG wrote to the Chandigarh Police then Inspector General RP Upadhya for the same.\nThe former IG Upadhya then sent a proposal to the MHA for buying the Glock 17 guns in order to prepare the Chandigarh Police commandos ready for any emergency.\nFor more news updates Follow and Like us on Facebook", "url": "https://dailypost.in/news/chandigarh/better-ak-47-city-cops-now-laced-fnf-2000-17-glock-gun/", "label": 2}