{"authors": [], "date_download": "2019-03-27 13:59:46", "date_modify": "2019-03-27 13:59:46", "date_publish": "2016-05-15 18:54:57", "description": "42-year-old Ranjan was allegedly shot dead by criminals near the Siwan railway station earlier on Friday.", "filename": "news_bihar_bihar-journalist-murder-family-demands-cbi-probe-siwan-mp-hints-at-sahabuddin_1885311_1553695186.html", "image_url": "https://english.cdn.zeenews.com/sites/default/files/default_images/placeholder_image_8.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/zeenews.india.com/news_bihar_bihar-journalist-murder-family-demands-cbi-probe-siwan-mp-hints-at-sahabuddin_1885311_1553695186.html", "title": "Bihar journalist murder: Family demands CBI probe, Siwan MP hints at Sahabuddin", "title_page": "Bihar journalist murder: Family demands CBI probe, Siwan MP hints at Sahabuddin | Bihar News", "title_rss": "NULL", "source_domain": "zeenews.india.com", "text": "Siwan: The wife of slain journalist Rajdeo Ranjan on Sunday demanded a Central Bureau of Investigation (CBI) probe into his murder to ensure that the culprits get stringent punishment.\nAsha, the bereaved wife of the journalist, said that she had no expectation from the Nitish Kumar-led government as even Home Secretary Amir Subhani's hometown Siwan is so insecure.\n\"I demand from the government a CBI probe and a secured future for my children and me. The culprit must be given stringent punishment,\" she said.\nWhen asked if her husband had ever mentioned about any threat to his life, Asha said that she did not have any knowledge about it as her husband never talked about it.\nShe, however, told ANI: \"He only mentioned once about receiving threat regarding his profession after BJP leader Shrikant Bharti's murder.\"\nWhen informed that Upendra Singh's name has figured in connection with this case and the police have detained him, she said, \"I have seen Upendra calling on his mobile that's how I know about him.\"\nMeanwhile, Siwan MP Om Prakash Yadav also demanded a CBI probe into the murder and hinted at the alleged involvement of former Rashtriya Janata Dal (RJD) MP Mohammad Shahabuddin in the case.\n\"I understand former parliamentarian Sahabuddin's goons have killed him and the incident should be probed by the CBI. The Bihar Government should provide a compensation of Rs. 50 lakh,\" he said.\nThe Siwan MP further said Ranjan was a fearless and impartial journalist, adding that is why he was on Shahabuddin's radar.\n\"Goons of the former MP had attacked and misbehaved with him earlier too. They used to threaten him,\" Yadav told ANI.\n\"He (Ranjan) had written a news on the Bihar's sleuth department's report, since then he was on the former MP's radar. He was also warned of a danger to his life by the sleuth department in 2007,\" he added.\nYadav also used this case to take potshots at Chief Minister Nitish Kumar, saying the latter should have visited the bereaved family to express his condolences instead of addressing rallies.\nCommenting on the progress of the probe, the sitting MP said, \"I have spoken to the district administration; the probe is going on in the right direction thus far. But if it is deviated from here, the result won't be out. That is why I am asking for a CBI probe.\"\n42-year-old Ranjan was allegedly shot dead by criminals near the Siwan railway station earlier on Friday.\nTwo bullets were fired at the Siwan bureau chief of Hindi daily Hindustan that hit on his head and neck. He was shifted to a hospital, where the doctors declared him brought dead.\nDirector General of Police (DGP) PK Thakur on Saturday said special teams of the Bihar Police have collected evidences from the crime scene and detained two suspects in this connection.\n\"Our special teams comprising a team of forensic science, Special Task Force (STF) and Criminal Investigation Department (CID) officials were dispatched to Siwan last night. They have collected all possible evidences from the crime scene, besides the police have apprehended two suspected accused and interrogation is going on,\" he said.", "url": "https://zeenews.india.com/news/bihar/bihar-journalist-murder-family-demands-cbi-probe-siwan-mp-hints-at-sahabuddin_1885311.html", "label": 2}