{"authors": ["Aman Sharma"], "date_download": "2019-03-27 14:00:38", "date_modify": "2019-03-27 14:00:38", "date_publish": "2015-07-21 05:11:00", "description": "Home ministry data shows that 287 incidents of communal violence were reported between January and May this year compared to 232 in the first five months of 2014.", "filename": "news_politics-and-nation_co_3d8675c44f1fef45115ad323cff2e782_48152776_1553695238.html", "image_url": "https://img.etimg.com/thumb/msid-48152800,width-1070,height-580,imgsize-66608,overlay-economictimes/photo.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/economictimes.indiatimes.com/news_politics-and-nation_co_3d8675c44f1fef45115ad323cff2e782_48152776_1553695238.html", "title": "Communal violence in the country up by 25% in first five months of 2015", "title_page": "Communal violence in the country up by 25% in first five months of 2015 - The Economic Times", "title_rss": "NULL", "source_domain": "economictimes.indiatimes.com", "text": "NEW DELHI: India has seen a near 25% increase in incidents of communal violence in the first five months of 2015 under the NDA government led by Prime Minister Narendra Modi , compared to the corresponding period of the previous year when the Congress-led United Progressive Alliance was in power.Home ministry data accessed by ET shows that 287 incidents of communal violence were reported between January and May this year compared to 232 in the first five months of 2014. Deaths in communal incidents also saw a spike to 43 from 26 last year while the number of those injured in such clashes increased to 961 from 701, the figures show.Home ministry officials blamed state governments of Uttar Pradesh Maharashtra and West Bengal for not keeping such clashes from increasing. The figures nonetheless reflect poorly on the Centre too ahead of the Parliament session beginning on Tuesday.The home ministry had last year patted its back for a reduction of more than a fifth in incidents of communal violence over that in 2013 as the number dropped to 644 in 2014 from 823 in the previous year while the deaths fell to 95 from 133. The number of those injured in communal clashes in 2014 also dropped to 1921 from 2,269, the ministry had said earlier.The spike in figures in 2013 was however largely attributable to two major riots that led to many casualties – in Muzaffarnagar in Uttar Pradesh and Dhule in Maharashtra. Last year saw a major riot in Saharanpur in UP. The ministry claims that there was no major communal riot in the country till May this year. However, serious communal clashes were reported from Atali village in Haryana.", "url": "https://economictimes.indiatimes.com/news/politics-and-nation/communal-violence-in-the-country-up-by-25-in-first-five-months-of-2015/articleshow/48152776.cms", "label": 2}