{"authors": ["Anupa Kujur"], "date_download": "2019-03-27 14:00:10", "date_modify": "2019-03-27 14:00:10", "date_publish": "2018-06-04 00:00:00", "description": "Police suspect that Tata Steel's former employee Vishwash Pandey was behind the crime", "filename": "news_business_former-employee-shoots-tata-steel-senior-manager-in-faridabad-3145901_1553695210.html", "image_url": "https://static-news.moneycontrol.com/static-mcnews/2018/06/4-Mexico-gun-bullet-murder-770x433.jpg", "language": null, "localpath": "/home/raj/news-please-repo//data/2019/03/27/moneycontrol.com/news_business_former-employee-shoots-tata-steel-senior-manager-in-faridabad-3145901_1553695210.html", "title": "Former employee shoots Tata Steel senior manager in Faridabad", "title_page": "Former employee shoots Tata Steel senior manager in Faridabad - Moneycontrol.com", "title_rss": "NULL", "source_domain": "moneycontrol.com", "text": "A senior manager of the Tata Steel Processing and Distribution (TSPDL) office at Faridabad was shot dead reportedly by a former employee on November 9, ANI reported.\nThe 35-year-old senior manager, Arindam Pal, was rushed to Fortis Escorts Hospital in NIT but he died on the way. Doctors say that he was shot with five bullets.\n#Haryana: Senior Manager of Tata Steel shot dead by former employee in Faridabad. Mujesar SHO says,“Bullets were shot at senior manager by a former employee.He died on the way to the hospital. In initial reports,doctors say he was shot with 5 bullets. Post-mortem reports awaited” pic.twitter.com/CNWhngKhAJ\n— ANI (@ANI) November 9, 2018\nPolice suspect that Tata Steel's former employee Vishwash Pandey was behind the crime. Pandey, who worked with TSPDL from 2015-2018, is said to have been fired from his post as 'executive' in August 2018.\n\"At around 1:10 pm today, an unfortunate incident took place at Faridabad office of Tata Steel Processing & Distribution Ltd (TSPDL), wherein Mr Arindam Pal, Senior Manager was shot dead with a firearm by Mr Vishwash Pandey, an ex-employee of the company,\" Tata Steel said in a statement released on November 9.\nThe accused fled the scene after the incident, and police have initiated efforts to nab him.\n\"The company had started an inquiry against Pandey and relieved him of his services four to five months ago, on grounds of indiscipline. The report of the inquiry, on the basis of which he was sacked, was submitted by the deceased,\" Sube Singh, PRO of Faridabad police told The Indian Express.\nSingh added that other employees who were on the premises during the incident have identified Pandey, and that an FIR has been registered against him.\nAccording to the report, the accused entered the premises through the main gate and went into Pal's cabin, where he allegedly opened fire and shot him \"five times in the stomach\" before escaping through another gate at the yard.\n\"As of now, it is unclear how long the victim and the accused had been employed with the company. We intend to access company records to get a clearer picture of this. We hope to nab the accused soon,\" Ashok Kumar, station house officer (SHO) of Mujesar police station, where an FIR has been registered, told the paper.", "url": "https://www.moneycontrol.com/news/business/former-employee-shoots-tata-steel-senior-manager-in-faridabad-3145901.html", "label": 2}