{"authors": [], "date_download": "2019-03-27 14:00:00", "date_modify": "2019-03-27 14:00:00", "date_publish": "2016-02-11 20:49:11", "description": "Union Home minister Rajnath Singh on Thursday asked the Congress, Left and other opposition parties if they were prepared to apologise to the nation.", "filename": "politics_david-headley-testimony-rajnath-asks-opposition-to-apologise-to-bjp-2622356_1553695200.html", "image_url": "https://images.firstpost.com/wp-content/uploads/2016/02/rajnath-singh-reuters1.jpg", "language": null, "localpath": "/home/raj/news-please-repo//data/2019/03/27/firstpost.com/politics_david-headley-testimony-rajnath-asks-opposition-to-apologise-to-bjp-2622356_1553695200.html", "title": "David Headley testimony: Rajnath asks Opposition to apologise to BJP", "title_page": "David Headley testimony: Rajnath asks Opposition to apologise to BJP - Firstpost", "title_rss": "NULL", "source_domain": "firstpost.com", "text": "Thiruvananthapuram: Union Home minister Rajnath Singh on Thursday asked the Congress, Left and other opposition parties if they were prepared to apologise to the nation for their \"malicious campaign\" against Prime Minister Narendra Modi over the killing of Ishrat Jehan in an encounter in Gujarat in 2004.\nAddressing a huge rally in Thiruvananthapuram, he said Pakistani American terrorist David Headley in his deposition on Thursday had clearly admitted that Ishrat Jehan had links with Lashkar-e-Taiba.\n\"You must have heard what Headley has said in his deposition. Using Ishrat Jehan's name, various allegations were made against our party leaders. On that matter, Headley has clearly stated that she (Ishrat) had links with LeT,\" he said.\n\"I want to ask Congress, Communists and other parties who had continuously launched a malicious campaign to mislead the people on this issue, whether they are prepared to tender apology to the people of the country,\" he said.\nEarlier, he had told reporters at the airport that Headley's testimony had exposed Pakistan but made it clear India wanted to maintain cordial relations with that country.\n\"David Headley deposition has exposed Pakistan but we still want to maintain cordial relationship with the neighbouring country\", he had said.\nSingh is here to attend the concluding function of the state-wide Vimochana Yatra undertaken by BJP state President Kummanan Rajasekharan.\nPakistani-American terrorist David Coleman Headley on Thursday told a special court in Mumbai that Ishrat Jahan — who was killed in an alleged fake encounter in 2004 in Gujarat — was an operative of terror outfit Lashkar-e-Taiba (LeT).\nHeadley, who testified via video-link from US, had picked up her name when questioned by Special Public Prosecutor Ujjwal Nikam about a \"botched-up operation\" mentioned to him (Headley) by LeT commander Zaki-ur Rehman Lakhvi.\nPTI\nFirstpost is now on WhatsApp. For the latest analysis, commentary and news updates, sign up for our WhatsApp services. Just go to Firstpost.com/Whatsapp and hit the Subscribe button.", "url": "https://www.firstpost.com/politics/david-headley-testimony-rajnath-asks-opposition-to-apologise-to-bjp-2622356.html", "label": 2}