{"authors": [], "date_download": "2019-03-27 14:00:03", "date_modify": "2019-03-27 14:00:03", "date_publish": "2018-11-21 23:38:00", "description": "During his deposition before the special court CIO Sandeep Tamgade said he did not have any documented evidence to prove his claim in the charge sheet filed by him.", "filename": "politics_story_amit-shah-among-main-conspirators-in-sohrabuddin-fake-encounters-chief-investigating-officer-tells-cbi-court-1393641-2018-11-21_1553695203.html", "image_url": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/201811/Amit_shah-647x363.jpeg?exDsEjAjK3gd50ecyrty4OXxISwuPyyb", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/indiatoday.in/politics_story_amit-shah-among-main-conspirators-in-sohrabuddin-fake-encounters-chief-investigating-officer-tells-cbi-court-1393641-2018-11-21_1553695203.html", "title": "Amit Shah among main conspirators in Sohrabuddin fake encounters, chief investigating officer tells CBI court", "title_page": "Amit Shah among main conspirators in Sohrabuddin fake encounters, chief investigating officer tells CBI court - Politics News", "title_rss": "NULL", "source_domain": "indiatoday.in", "text": "Tamgade said he had evidence to conclude that Sohrabuddin Shaikh and his partner Prajapati were \"used\" by Amit Shah. (Photo: Reuters)\nThe chief investigation officer (CIO) in the alleged fake encounters of Sohrabuddin Shaikh today claimed before a CI court that the main conspirators were BJP chief Amit Shah and three IPS officers.\nDuring his deposition before the special court CIO Sandeep Tamgade said he did not have any documented evidence to prove his claim in the charge sheet filed by him.\n\"From the investigation done by us, we found the principal conspirators were Amit Shah, DG Vanzara (former Deputy Inspector-General Gujarat Police), Rajkumar Pandian (SP, Intelligence Bureau) and MN Dinesh (IPS officer, Rajasthan Police),\" Tamgade said.\nAll four have been discharged by the trial court in the case.\nTamgade claimed he was not naming Shah and others without evidence, but admitted that the claim was not supported by any documentary evidence in the supplementary charge sheet filed in the case, he said.\nTamgade, then Superintendent of Police (CBI), had prepared a supplementary charge sheet in the Sohrabuddin case and the main charge sheet in the Tulsiram case. Both cases are being tried together before special CBI judge S J Sharma here.\nTo a question by the defence lawyer, Tamgade said he also had evidence to conclude that Sohrabuddin Shaikh and his partner Prajapati were \"used\" by Amit Shah, then Minister of State for Home in Gujarat, for firing at the office of an Ahmedabad-based builder.\nHe had interrogated Shah, a marble trader from Rajasthan Vimal Patni, and Rajasthan minister Gulabchandra Kataria in the case, he said.\n\"There was some incriminating material against the trio. But those statements were not filed in the charge sheet,\" he said.\nThe defence then moved an application, saying the CBI should produce these statements in the court. The court will hear the application Thursday.\nShaikh, a suspected gangster with terror links, was shot dead on November 26, 2005 while he was in custody of Gujarat Police in an alleged fake encounter. His wife Kausar Bi was also allegedly killed later.\nPrajapati, an aide of Shaikh who was said to be a witness to the encounter, was allegedly killed by police forces of Gujarat and Rajasthan at Chapri in Gujarat's Banaskantha district in December 2006.\nOf the 38 persons charged by the CBI for the alleged fake encounters, 15 have been discharged.\n(With PTI inputs)\nAlso read: Sohrabuddin Sheikh killed with dual motive of political, monetary gains: Probe officer\nAlso read: Opposition suffering from Modi-phobia, they just want to remove PM, says Amit Shah\nWatch: Sabarimala stir political debate; Ex-DMK MP detained at airport with gun; more", "url": "https://www.indiatoday.in/politics/story/amit-shah-among-main-conspirators-in-sohrabuddin-fake-encounters-chief-investigating-officer-tells-cbi-court-1393641-2018-11-21", "label": 2}