{"authors": [], "date_download": "2019-03-27 13:59:52", "date_modify": "2019-03-27 13:59:52", "date_publish": "2017-04-25 22:20:18", "description": "Israel condoles Sukma attack, says anti-terror co-op should", "filename": "pti-feed_story_israel-condoles-sukma-attack-says-anti-terror-co-op-should-914984-2017-04-25_1553695192.html", "image_url": "https://www.indiatoday.in/sites/all/themes/itg/favicon.ico", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/indiatoday.in/pti-feed_story_israel-condoles-sukma-attack-says-anti-terror-co-op-should-914984-2017-04-25_1553695192.html", "title": "Israel condoles Sukma attack, says anti-terror co-op should", "title_page": "Israel condoles Sukma attack, says anti-terror co-op should - PTI feed News", "title_rss": "NULL", "source_domain": "indiatoday.in", "text": "deepen\nNew Delhi, Apr 25 (PTI) In the backdrop of the Naxalite attack on security forces in Chhattisgarhs Sukma, Israel today emphasised on deepening cooperation with India to combat \"terrorism\", as it conveyed condolences to the government.\nDaniel Carmon, Israels envoy to India, said there is a \"new battlefield, an asymmetric warfare\" which the security forces have to face.\n\"Terrorism is one of the challenges India and Israel face. It is an opportunity to reconvene our condolences to what happened in Chhattisgarh, but there are different facets to this.\n\"Every life lost due to the terrible attacks by terrorists is really very, very sad and also brings us to be more engaged in fighting terrorism,\" Carmon said, adding that the two countries signed an agreement on Homeland Security and Anti-Terrorism agreement in 2014.\nHe was delivering a lecture on India-Israel- Enduring Partnership at the Nehru Memorial Museum here.\nTwenty-five CRPF personnel were killed in a Naxalite attack in Chhattisgarhs Sukma district yesterday.\n\"Very saddened and concerned. We have conveyed our condolences to the Indian government,\" Carmon later told reporters.\nHe rued that there is no unanimity on the definition of the word terrorism.\nHe said security forces have to maintain a balance between human rights and the governments obligation towards ensuring its peoples security.\n\"There is a fine line between how do we as governments, armies, paramilitaries, police forces or security forces maintain the very high important values of human rights which are predominant in the policies of democracies and how do we safeguard our citizens, which is the most important obligation of government and security forces,\" Carmon said.\nHe also attacked Iran for \"encouraging terrorism\".\nThe Israeli envoy said the upcoming visit of Prime Minister Narendra Modi to the Jewish nation has \"enormous\" significance.\nHe said earlier there were problems of \"visibility\" in the ties between the two countries, but with the new dispensation in New Delhi there has been a change.\n\"Things have evolved. It took an effort and now we are at a stage where an Indian President visits Israel and an Israeli President (Reuven Rivlin) visits India for eight consecutive days,\" Carmon said.\nRivlin visited India in February last year while Indian President Pranab Mukherjee visited Israel in October 2015.\nCarmon said also Israel is looking for a \"strategic partnership\" in the field of water during Modis visit.\nThe Israeli envoy said the Jewish community has never suffered from any persecution or racism in India.\nIndia has a very small population of Jews, with a majority of them residing in Mumbai and Pune. PTI PR BSA", "url": "https://www.indiatoday.in/pti-feed/story/israel-condoles-sukma-attack-says-anti-terror-co-op-should-914984-2017-04-25", "label": 2}