{"authors": [], "date_download": "2019-03-27 13:59:45", "date_modify": "2019-03-27 13:59:45", "date_publish": "2016-11-26 17:45:28", "description": "Tributes paid to 26/11 martyrs, survivors recall harrowing", "filename": "pti-feed_story_tributes-paid-to-26-11-martyrs-survivors-recall-harrowing-653445-2016-11-26_1553695185.html", "image_url": "https://www.indiatoday.in/sites/all/themes/itg/favicon.ico", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/indiatoday.in/pti-feed_story_tributes-paid-to-26-11-martyrs-survivors-recall-harrowing-653445-2016-11-26_1553695185.html", "title": "Tributes paid to 26/11 martyrs, survivors recall harrowing", "title_page": "Tributes paid to 26/11 martyrs, survivors recall harrowing - PTI feed News", "title_rss": "NULL", "source_domain": "indiatoday.in", "text": "moments\nMumbai, Nov 26 (PTI) Rich tributes were today paid to the martyrs who laid down their lives eight years ago on this day during the terrorist attack on Mumbai in which 166 people were killed, with Maharashtra Chief Minister Devendra Fadnavis leading the commemoration.\nFamily members of the martyred personnel and survivors of the daring strike recalled the harrowing moments and pledged support to efforts to root out terrorism.\n\"I pay homage to the brave policemen who fought for Mumbais safety and laid down their lives for us on 26/11. We are proud of them and we will strive hard for safety and security of our state,\" Fadnavis said paying homage at the 26/11 police memorial at the Mumbai Police Gymkhana.\nGovernor Ch Vidyasagar Rao, Shiv Sena president Uddhav Thackeray, former Mumbai police commissioners Julio Ribeiro, M N Singh and several senior present and former police officers were present.\nOn November 26, 2008, ten Pakistani terrorists arrived by sea route and opened fire indiscriminately at people killing 166, including 18 security personnel, and injuring several others, besides damaging property worth crores.\nThe then ATS chief Hemant Karkare, Army Major Sandeep Unnikrishnan, Mumbais Additional Police Commissioner Ashok Kamte and Senior Police Inspector Vijay Salaskar were among those killed in the attack.\nThe attack had begun on November 26 and lasted until November 29. Chhatrapati Shivaji Terminus, the Oberoi Trident, the Taj Mahal Palace and Tower, Leopold Cafe, Cama Hospital, the Jewish community centre were some of the places targeted by the terrorists.\nAjmal Kasab was the lone militant who was captured alive. He was hanged four years later on November 21, 2012.\nAt a video exhibition titled 26/11: Stories of Strength, showcased by The Indian Express in association with Facebook and Instagram, Fadnavis called for leveraging manpower with technology for security purposes.\nHe said the 2008 Mumbai attacks were an insult to India, wherein ten terrorists held an entire nation to ransom.\nHe said the whole world should be proud of the resilience shown by the city to cope with the terror attacks.\nKia Scherr, who lost her family in the ghastly attacks, said she and her family in Florida could only watch the news and wait to hear from her relatives who were in the city then.\n\"I have forgiven those who killed my family because I want to be relieved from the burden of anger. Since the attacks, I have been reborn in Mumbai again. I have received so much of love, generosity from people here,\" she said. More PTI DC MM NM NP AAR", "url": "https://www.indiatoday.in/pti-feed/story/tributes-paid-to-26-11-martyrs-survivors-recall-harrowing-653445-2016-11-26", "label": 2}