{"authors": ["Outlook Web Bureau"], "date_download": "2019-03-27 13:59:57", "date_modify": "2019-03-27 13:59:57", "date_publish": "2017-10-16 00:00:00", "description": "According to psychologists, more than 70% of the police personnel working on field are either suffering from depression or anxiety.", "filename": "website_story_every-month-d_361a55d68ef429ee0924dcb56736730c_303113_1553695197.html", "image_url": "https://www.outlookindia.com/public/upload_share/website/delhi_police_303113.jpg", "language": null, "localpath": "/home/raj/news-please-repo//data/2019/03/27/outlookindia.com/website_story_every-month-d_361a55d68ef429ee0924dcb56736730c_303113_1553695197.html", "title": "Every Month, Delhi Police Lose One Cop Due To Depression, Erratic Working Hours, Financial Issues", "title_page": "Every Month, Delhi Police Lose One Cop Due To Depression, Erratic Working Hours, Financial Issues ", "title_rss": "NULL", "source_domain": "outlookindia.com", "text": "On Sunday, a Delhi police constable committed suicide in the Sabzi Mandi area by jumping in front of a train.\nIn August, 46-year-old Pramod Kumar, a Delhi police head constable, allegedly committed suicide by shooting himself with his service revolver at the Delhi Cantonment police station. In the same month, 29-year-old Amit Khokhar, a Delhi police constable, allegedly committed suicide by shooting himself dead with his service pistol inside the barracks at central Delhi's Daryaganj police station.\nThese incidents have once again raised questions on the work pressure on Delhi personnel.\nAccording to Mail Today, a recent report submitted to the department heads of the Delhi police reveal that one cop kills himself every month.\nIn fact, in the past two and a half months, five police personnel have committed suicide, and in almost 95% of the suicide cases, the police personnel have turned their service pistol on themselves, adds the tabloid.\nAccording to psychologists, more than 70% of the police personnel working on field are either suffering from depression or anxiety.\nThey say high stress levels, erratic working hours, financial problems, family issues and the thankless nature of the job are some of the reasons behind such an extreme step.\n“On paper, it's an eight-hour duty but the police officers have to be active 24x7. They are not paid for extra hours. Also, they have no social life as they spend maximum hours on duty, which adds to their frustration. It further leads to depression and then they tend to commit suicide,” Rajiv Mehta, a consultant psychiatrist at Sir Ganga Ram Hospital, told Mail Today.\nA report by The Indian Express claimed that as many as 43 Delhi police personnel — all men — committed suicide between January 2012 and July this year.\n“You deal with cases of death on a daily basis and it emotionally disturbs you. And if you ever become depressed, you start thinking about how to get over it. At the same time, you have a weapon, so the possibility of killing yourself increases,” deputy commissioner of police (headquarter) Vikramjit Singh told the newspaper.\nAccording to The Pioneer, in a bid to improve efficiency and alertness among cops, the Delhi police have decided to introduce eight-hour duty shifts for its personnel at two police stations — Sangam Vihar and Dabri — on a trial basis. The move has been initiated taking into consideration increasing number of depression and suicide cases among cops in the national Capital.", "url": "https://www.outlookindia.com/website/story/every-month-delhi-police-lose-one-cop-due-to-depression-erratic-working-hours-fi/303113", "label": 2}