{"authors": ["Monitoring Desk"], "date_download": "2019-03-27 14:40:42", "date_modify": "2019-03-27 14:40:42", "date_publish": "2016-03-16 05:56:40", "description": "UTTARAKHAND - Police in India have lodged a case against a politician from the ruling BJP for allegedly attacking a police horse during a protest in the northern state", "filename": "16-Mar-2016_outrage-after-india-politician-assaults-police-horse_1553697642.html", "image_url": "https://nation.com.pk/print_images/large/2016-03-16/outrage-after-india-politician-assaults-police-horse-1458089797-5154.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/nation.com.pk/16-Mar-2016_outrage-after-india-politician-assaults-police-horse_1553697642.html", "title": "Outrage after India politician 'assaults' police horse", "title_page": "Outrage after India politician 'assaults' police horse", "title_rss": "NULL", "source_domain": "nation.com.pk", "text": "Share:\nUTTARAKHAND - Police in India have lodged a case against a politician from the ruling BJP for allegedly attacking a police horse during a protest in the northern state of Uttarakhand, BBC reported on Tuesday.\nGanesh Joshi, a legislator from the hill town of Mussoorie, allegedly assaulted the animal with a stick. The horse, named Shaktimaan, suffered multiple fractures and some reports said it might require a leg amputation.\nMr Joshi said the charge against him was politically motivated. \"The footage which the electronic media is showing by linking with an old clip - in which I am lifting a stick in front of the horse - has no connection at all [to the incident],\" Mr Joshi told the BBC. \"The horse fell down when someone pulled its saddle and the animal sustained a fracture on its leg,\" he added.\nThe incident took place near the legislative assembly in the state capital, Dehradun, on Monday when the BJP was holding a protest against the Congress party-led state government. The horse is being treated by veterinary officers and reports say it is in a serious condition.\nThe incident has caused outrage in India with many taking to social media to express their anger.On Twitter, the hashtag #IsHorseAntiNational, prompted by a tongue in cheek newspaper headline that read, \"BJP MLA beats up a horse.\nNo confirmation whether the horse was anti-national\", has been trending since Tuesday morning.\nThe term \"anti-national\" is being used in reference to the recent arrest of several students of a top university for allegedly shouting \"anti-India\" slogans. The government defended the arrests by saying the students were \"anti-national\".", "url": "https://nation.com.pk/16-Mar-2016/outrage-after-india-politician-assaults-police-horse", "label": 1}