{"authors": [], "date_download": "2019-03-27 14:34:55", "date_modify": "2019-03-27 14:34:55", "date_publish": "2015-08-09 21:06:34", "description": null, "filename": "2015aug10_1439154394_1553697295.html", "image_url": "http://twocircles.net/wp-content/uploads/2018/03/cropped-square-profile--300x300.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/twocircles.net/2015aug10_1439154394_1553697295.html", "title": "Protest in Delhi demanding enquiry into death of anti-liquor activist in Tamil Nadu", "title_page": "Protest in Delhi demanding enquiry into death of anti-liquor activist in Tamil Nadu | TwoCircles.net", "title_rss": "NULL", "source_domain": "twocircles.net", "text": "By TCN News,\nNew Delhi: Members of civil society groups staged a protest outside the Tamil Nadu House in the national capital on August 8 in the afternoon, demanding enquiry into the death of Gandhian activist Sasi Perumal, who was actively campaigning demanding liquor ban in the southern state.\ncaption\nThe demonstration was jointly organized by People Movements Against Liquor and Drugs PMALD, Khudai Khidmatgar, National Alliance of Peoples Movement (NAPM), Sarvodaya Mandal and other civil society members.\nDemand for complete ban of liquor in Tamil Nadu has increased in last few years. Sasi Perumal had been protesting for the enforcement of prohibition in Tamil Nadu for over four decades.\nSupport TwoCircles\nSasi Perumal from Salem district in Tamil Nadu died on July 31 near Marthandam in Kanyakumari after staging a demonstration atop a BSNL tower for the removal of a TASMAC outlet near a church at Unnamalaikkadai.\nEven after a week the state government has failed to take any initiative or response on this issue. While expressing their solidarity, civil society groups also put forward the following demands:\n1. Implement total prohibition in Tamil Nadu in favour of protecting the people, particularly women, children and aged persons.\n2. To set up enquiry commission to prove into the death of Sasi Perumal and take necessary actions against the police officials who were present on the spot during this incidence.\n3. Stop atrocities on women, students and handicapped who are involving in protest against the government, since it is the right to expression of each and every citizen.", "url": "http://twocircles.net/2015aug10/1439154394.html", "label": 1}