{"authors": ["Imphal Free Press Is A Leading Newspaper In Manipur Published Daily In English.", "Please Enter Your Name Here"], "date_download": "2019-03-27 14:40:55", "date_modify": "2019-03-27 14:40:55", "date_publish": "2015-03-24 22:09:46", "description": null, "filename": "2015_03__1553697655.html", "image_url": "http://kanglaonline.com/wp-content/uploads/2014/01/ko_fevicon.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/kanglaonline.com/2015_03__1553697655.html", "title": "MPP to demand withdrawal of Visitors` Bill", "title_page": "MPP to demand withdrawal of Visitors` Bill\r\n | KanglaOnline", "title_rss": "NULL", "source_domain": "kanglaonline.com", "text": "IMPHAL, March 24: Manipur People`s Party held a sit in protest today at party office gate against the “The Manipur Regulation of Visitors, Tenants and Migrant Workers Bill 2015, passed on the floor of Manipur State Assembly on March 16.\nMPP President N Sovakiran Singh said the sit in protest is to demand withdrawal of the bill as it is not designed to protect the indigenous peoples of Manipur.\nHe said the the MPP is going to submitted a memorandum to the Governor of Manipur in the regard.\nHe further said that the human civilization has two major instincts. One is to protect the self and community, and the other to conquer weaker neighbours.\nHe charged that the Government of India was playing the latter game and threatening the North East People with draconian legislations such as AFSPA.\nHe also said that the present government led by O Ibobi Singh is not friendly to the people and is not a protector of the indigenous peoples.\nSovakiran also said that demanding implementation of the ILP system is for the protection of indigenous peoples of Manipur which included the major and the minor communities, however if there are no laws to protect the indigenous peoples in the State, after a few years the real original of Manipur will vanish.\nThe said Bill passed on March 16 is quiet misleading and instead of seeking to protect the indigenous peoples, it tries to consociated the position of illegal immigrants and migrants who started pouring into the State since the 1950s.\nLastly, he said the said Bill was not thoroughly discussed or debated amongst the members present in the House and hastily pushed through in the Assembly by the ruling party.", "url": "http://kanglaonline.com/2015/03/mpp-to-demand-withdrawal-of-visitors-bill/", "label": 1}