{"authors": [], "date_download": "2019-03-27 14:35:35", "date_modify": "2019-03-27 14:35:35", "date_publish": "2015-03-20 03:00:05", "description": null, "filename": "2015_03_20__1553697335.html", "image_url": "http://www.theshillongtimes.com/wp-content/uploads/2017/04/tstess.png", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/theshillongtimes.com/2015_03_20__1553697335.html", "title": "National Nuggets", "title_page": "National Nuggets – The Shillong Times", "title_rss": "NULL", "source_domain": "theshillongtimes.com", "text": "Madhya Pradesh minister, wife looted at gunpoint onboard train\nNew Delhi: Madhya Pradesh Finance Minister Jayant Malaiya and his wife were looted at gunpoint by unidentified people onboard a train in Uttar Pradesh in the wee hours on Thursday.”We were sleeping, when we heard a knock at our door. I thought it to be the ticket collector or some Railway person, and went to attend. As soon as I opened the door, around half a dozen men barged into our cabin. “They asked us to hand over whatever valuables we have and when we resisted, they took out a knife and threatened us and took away my mangalsutra, cash and other valuables.”The robbers ran away with the stolen items as soon as the RPF arrived at the spot,” Sudha Malaiya, wife of the Minister, told reporters. The robbery took place at around 0400 hrs near Kosi Kalan station near Mathura on board 22181 Jabalpur-Hazrat Nizamuddin Express on its way to Delhi.Malaiya informed about the loot to Railway Minister Suresh Prabhu at Parliament complex.Talking to reporters, the Madhya Pradesh Minister claimed that five youths, in their 20s and 30s, forcefully entered AC-I compartment of the train and looted about Rs 25,000 in cash, his wife’s gold chain, and rings at gunpoint. The miscreants fled from the spot after threatening the couple with dire consequences.The Minister lodged a complaint with the GRP at Hazrat Nizamuddin railway station.BJP MP Prahlad Patel raised the incident in the Lok Sabha during zero hour.Delhi police has filed a Zero FIR in the case. (UNI)\nSwine flu toll inches towards 1,900\nNew Delhi: The swine flu toll inched towards the 1,900-mark as the disease claimed 32 more lives while the number of cases in the country today crossed 31,000. According to the Union Health Ministry, as on March 18, 1,841 people have succumbed to the disease while the number of people affected by the H1N1 virus stood at 31,156. Six more deaths in the last 24 hours took the toll in Rajathan to 397, just behind Gujarat, which has reported 400 casualties. The ministry said that the number of affected persons was 6,271 in Gujarat. The death toll in Maharashtra is 322 with 3,788 people having contracted the H1N1 virus. In Madhya Pradesh, 266 people have perished with 1,999 persons affected. The toll in Telangana is 74 while in Karnataka, following the death of another person, it has risen to 77. Fifty-two swine flu deaths have been reported in Punjab. The toll in West Bengal is 23 while Uttar Pradesh has witnessed 35 deaths. Jammu and Kashmir has seen 16 swine flu fatalities. In Delhi, following the death of a 24-year-old woman due to the disease, the toll has risen to 12 with the number of affected persons at 4,084. Meanwhile, as per a ministry study, 34 per cent of the 723 swine flu deaths that were analysed had occurred in the age group 30-45 years followed closely by those in the 45-60 bracket, who accounted for 32 per cent of the fatalities. (PTI)\n6 doctors and 16 other government officials suspended\nSrinagar: Twenty two officials, including six doctors, from different government departments were suspended after they were found absent from their duties in Kashmir valley.An official spokesperson here today said the District Development Commissioner (DDC) Budgam inspected many administrative units, including hospitals and education institutions, to ensure proper functioning of these departments in the district.Inspecting Sub District Hospital Chrar-i-Sharief, 10 officials, including six doctors, were found absent from duty. Taking strong note of their absence, the DDC suspended all the officials.To ensure proper functioning of government offices in the district, the Deputy Commissioner, Anantnag took surprise visit of Tehsil office, Block Veterinary Office, District Veterinary Office, artificial Breeding Station and Poultry Development Office.During the visit, 12 officials were found absent from duty, he said, adding the Deputy Commissioner placed the absentees under suspension with immediate effect. (UNI)\nMild tremor felt in Gujarat\nAhmedabad: An earthquake measuring 3.9 on the Richter scale was felt in various parts of North Gujarat’s Mehsana, Sabarkantha and Banaskantha districts. “A tremor measuring 3.9 on the Richter scale was felt this afternoon in Sabarkantha, Banaskantha and Mehsana districts of Northern Gujarat today,” Institute of Seismological Research (ISR) Director General Gujarat B K Rastogi told PTI. “Mild tremors were felt for a couple of seconds mainly in Khedbrahma town of Banaskantha district and in neighbouring district of Sabarkantha also,” Rastogi said. The epicentre of the tremor was some 15 km west-south-west from the ISR’s station at Dharoi village in Mehsana district, he said, adding that no damage was reported due to the tremor. There is no probability of big damage in such a mild tremor, besides there is no big faultline in this (northern) part of the state. Hence there are least chances of a big earthquake in North Gujarat, Rastogi said. (PTI)", "url": "http://www.theshillongtimes.com/2015/03/20/national-nuggets-610/", "label": 1}