{"authors": [], "date_download": "2019-03-27 14:18:24", "date_modify": "2019-03-27 14:18:24", "date_publish": "2017-03-01 00:00:00", "description": null, "filename": "2017_03_01__1553696304.html", "image_url": "https://cache.pakistantoday.com.pk/indian-muslim.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/pakistantoday.com.pk/2017_03_01__1553696304.html", "title": "Indian Muslim community protest against dowry", "title_page": "Indian Muslim community protest against dowry | Pakistan Today", "title_rss": "NULL", "source_domain": "pakistantoday.com.pk", "text": "The Muslim community in Jharkhand’s Palamu region, in India, is silently protesting against dowry, with hundreds of families returning dowry they had taken during their sons’ weddings, Hindustan Times reported.\nThe campaign against dowry was launched last year in April when Mumtaz Ali – a Pokhari village resident spoke out against the custom and garnered support from community elders who collectively waged a war against dowry exchange. The drive has been endorsed by local Muftis who refuse to solemnise ‘nikkah’ if the families practice the tradition.\nApproximately 800 families have returned dowry money to the bride’s family, with an accumulating total of over US$900, 000 in the last one year alone.\n“The war against dowry will eat up poor families like cancer till it is completely wiped out. There are still a few families who are yet to give up the evil practice. Earlier, the Muslim community did not pay dowry, but of late, dowry has become a part of marriages, in the process badly hampering the sanctity of this sacred bond,” Ali said. “We will also devise a strategy during the next meeting to tackle such families.”\nSalim Ansari, who returned dowry said: “I feel proud to declare that what I had done earlier was wrong. To make things correct, I am returning the money. I will never demand or offer dowry in future.”\nCourtesy: Hindustan Times", "url": "https://www.pakistantoday.com.pk/2017/03/01/indian-muslim-community-protest-against-dowry/", "label": 1}