{"authors": ["Please Enter Your Name Here"], "date_download": "2019-03-27 14:29:01", "date_modify": "2019-03-27 14:29:01", "date_publish": "2017-05-26 11:54:29", "description": null, "filename": "2017_05__1553696941.html", "image_url": "https://i2.wp.com/indianewengland.com/wp-content/uploads/2016/12/Lalu-Prasad-Yadav.jpeg?fit=240%2C240&ssl=1", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/indianewengland.com/2017_05__1553696941.html", "title": "After Bihar, Lalu out to play grand alliance card in Delhi", "title_page": "After Bihar, Lalu out to play grand alliance card in Delhi | INDIA New England News", "title_rss": "NULL", "source_domain": "indianewengland.com", "text": "By Imran Khan\nPatna–Lalu Prasad Yadav — a mass leader with rustic charm and a convict in the multi-million fodder scam — is all set to embark on a rather difficult political mission: Bringing the non-BJP parties on one platform ahead of 2019 general elections.\nLalu, also Rashtriya Janata Dal (RJD) supremo, is scheduled to visit Delhi later this week to meet Congress President Sonia Gandhi and others to start the process of forging a grand alliance of non-Bharatiya Janata Party (BJP) political outfits.\nThe exercise is aimed at forging an alliance on the lines of one in Bihar that succeeded in defeating the BJP in state assembly polls in 2015.\nFully aware of the challenges involved in the arduous task of bringing together parties of all hues and views to counter the BJP, Lalu will call on Sonia Gandhi in Delhi on May 26 or 27 and personally extend her an invitation to join his party’s rally here on August 27.\nAccording to insiders, he will request her to attend the rally to show off the “grand unity” of the opposition parties. The rally is likely to witness the attendance of the who’s who of a number of non-BJP parties.\n“Laluji has been busy for last few days with his coterie at 10, Circular Road — his official residence — to prepare a strategy for a grand alliance of non-BJP parties.\n“Since his proximity to Sonia Gandhi is well known and the Congress is still the second-most powerful national political party after the BJP, Laluji has decided to work for the unity of non-BJP parties by meeting her and taking her party along to ensure that the idea translates into reality,” an RJD leader close to the party chief told IANS here.\nThis is Lalu’s first move to personally call on a top leader of a non-BJP party after the ruling party’s massive victory in neighbouring Uttar Pradesh, which has led to panic among regional parties as well as the Congress.\nLast week, Lalu had a telephonic interaction with Sonia Gandhi in connection with the unity plan. After that he had said the Congress was a national party and it should come forward to unite and lead non-BJP parties.\nLalu has already called up West Bengal Chief Minister and Trinamool Congress chief Mamata Banerjee and invited her to his party’s rally, apart from Bahujan SamajParty (BSP) supremo Mayawati and Samajwadi Party chief Akhilesh Yadav — both former Chief Ministers of Uttar Pradesh.\n“Laluji is also in touch with DMK in Tamil Nadu, Odisha Chief Minister Naveen Patnaik and the leaders of Left parties to ensure unity of non-BJP parties,” another RJD leader said.\nWhen asked about his proposed rally in Patna and his bid to exhibit opposition unity, Lalu said: “I have invited top leaders of all non-BJP parties for my rally in August. All of them will attend it.”\nKeeping the 2019 Lok Sabha elections in focus, he has been appealing to all non-BJP parties to come together to counter the “aggressive Hindutva agenda” of the BJP under the leadership of Prime Minister Narendra Modi and the party’s President Amit Shah.\nSensing a tough challenge, Lalu has also cautioned the non-BJP parties that a united opposition would be the only option to take on the BJP and Narendra Modi in the next general elections.\n“Unity among non-BJP parties is the only mantra now to defeat the BJP. If non-BJP parties remain divided and fail to unite as a political force, they will be finished,” he said.\nLalu’s major ally and Bihar Chief Minister Nitish Kumar has already said that a “Mahagathbandhan” (grand alliance) of non-BJP parties was needed at the national level to defeat the BJP in the next parliamentary polls.\nAt a time when Lalu and his family, including his two sons and elder daughter, are under attack for benami property worth Rs 1,000 crore by the IT Department, Lalu appears to be playing it cool.\nRefuting media reports about his and his family’s involvement in the alleged benami property deals, he also vowed recently to “uproot” the National Democratic Alliance (NDA) government at the Centre before it completes its five-year term.\n“Listen, you BJP and RSS people, Lalu will drag you off the seat of power in Delhi, no matter what happens to me. Get it straight… Don’t you dare threaten me,” he said.\nDoes Lalu, a man known for pulling off surprises in the past, including enthroning his wife Rabri Devi as proxy Chief Minister of Bihar when he faced the fodder scam, have something up his sleeves again? Political watchers in the state don’t rule out the possibility.", "url": "http://indianewengland.com/2017/05/bihar-lalu-play-grand-alliance-card-delhi/", "label": 1}