{"authors": ["Binu Mathew", "Rene Wadlow", "Farooque Chowdhury", "Gurpreet Singh", "John Scales Avery", "Dr Binoy Kampmark", "Eric Zuesse", "Jelena Rakocevic", "Feroze Mithiborwala", "Countercurrents Staff"], "date_download": "2019-03-27 14:40:30", "date_modify": "2019-03-27 14:40:30", "date_publish": "2017-06-07 12:47:50", "description": null, "filename": "2017_06_07__1553697630.html", "image_url": "https://countercurrents.org/wp-content/uploads/2017/06/farmers-protest1.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/countercurrents.org/2017_06_07__1553697630.html", "title": "As Farmers Fight Back In India, Where Are We Headed?", "title_page": "As Farmers Fight Back In India, Where Are We Headed? – Countercurrents", "title_rss": "NULL", "source_domain": "countercurrents.org", "text": "I have a facebook group. It is called “Life in India is cheap, Damn cheap”. I started the group after seeing the death stunts of a circus group without any protection gears in a local festival. Yes, hundreds of thousands of lives in India are lost which could have been prevented if government took proper measures to tackle it.\nAs a community, it seems the lives of the farming community are the cheapest in India. An estimated 300,000 farmers have committed suicide in India in the last 20 years. When farmers decided, enough is enough, and decided to take what’s rightfully theirs, they are being shot down like mad dogs, like it happened in Mandsaur , Madhya Pradesh in Central India yesterday.\nFive farmers were shot dead by police yesterday in Mandsaur, 325 km from state capital, Bhopal. The number of deaths vary from 5-8. According to Shiv Kumar Sharma, President of the Kisan Union 8 people have been killed. “The government has lied to us on all counts. As a matter of fact, eight, not six, people have died in police firing. We will take the farmer stir to national level in the coming days,” Sharma said in a press conference in Indore.\nIn Mandsaur farmers were protesting, among other things, for a Minimum Support Price (MSP) for their produce. MSP is the price fixed by the government to protect farmers against fluctuations in prices of crops. In a way it is a guaranteed price for farmers’ produce by the government. They were also demanding loan waivers and that recommendations of Swaminathan Committee be implemented. MS Swaminathan, an agricultural scientist, had released a report back in 2006, recommending that MSP for crops should be at least 50 per cent more than their cost of production. BJP had included this recommendation in its 2014 general election manifesto. But in an interview to PTI last month, on the occasion of Modi government completing three years in office, BJP president Amit Shah had claimed that no government can meet the Swaminathan formula for calculating the cost of production.\nAfter the November 2016 ‘demonetisation’ farmers were getting paid in cheques for their produce. It created undue delay in getting their money. The government had promised the farmers that half their dues at market will be paid in cash and the remaining via electronic transfer to their bank accounts.\nAccording to information submitted to the Madhya Pradesh Assembly, 1695 farmers and farm labourers committed suicide between November and mid-November last year. The information available with state Assembly and state crime bureau shows that nearly 20,000 farmers have killed themselves in the state in the past 15 years.\nThe relatives of the deceased in Mandsaur have refused to bury their dead and have blocked a road, refusing to cremate the dead till the Chief Minister comes and apologises in person.\nIn the neighboring state of Maharashtra also farmers were protesting, raising the same demands from June 1st onwards. After the killing of farmers in Madhya Pradesh, farmers’ protest has spilled over into the state of Rajasthan also. It must be noted that all these are ruled by Prime Minister Narendra Modi’s right wing Bharatiya Janata Party(BJP).\nFarmers’ protest found its first expression in the BJP ruled state of Gujarat in July 2015. It was mainly a protest by ‘Patidar’ community for reservation in government jobs. Then the ‘Jats’ in Haryana rose up in anger in the state of Haryana. They were also demanding job reservation. Although they were demanding a pie in the elite government sector jobs, the underlying cause was the distress of these mainly farming communities. Once dominant communities, Patidars and Jats found themselves at the wrong end of the social spectrum with the rapidly changing social and economic scenario in India. Their lands were divided, profit from the land dwindled, many of them found themselves in deep debt and even finding it hard to find brides for the young farmers! It must be noted that these two states also are ruled by BJP.\nAs the lives of farmers in India become cheaper and cheaper and as the community decides not to take things lying down, India is moving into unchartered territories. Erring monsoon rains due to climate change, frequent droughts, falling prices have become a regular feature in India’s agriculture sector. With 70 % of of its 1.3 billion population engaged in agriculture, the farming crisis has put India into a severe social distress.\nApart from climate change, the Peak Oil crisis has brought the debt crisis. (To know more about the issue read these articles by energy expert Gail Tverberg 1. How Our Energy Problem Leads To A Debt Collapse Problem 2. Debt: The Key Factor Connecting Energy And The Economy 3. Limits We are Reaching – Oil, Debt, And Others) The debt crisis has made production costlier and costlier, but the price the consumers are paying is far cheaper than the production cost. Big industries leverage this by borrowing from banks or other financial institutions. Poor farmers are unable to borrow from banks and even if they borrow from banks they are unable to pay back as their profit from agriculture is almost negative. They fall into debt trap by borrowing from local money lenders at exorbitant rates. Many of the farmers have no other choice than to take their own lives.\nThe cattle slaughter ban is only going to worsen the situation of millions of farmers. Livestock controls close to a quarter of the agriculture gross domestic product (GDP). In 2010-11, it generated outputs worth Rs 3, 40,500 crore (at current prices). This was 28 per cent of the agriculture GDP and about 5 per cent of the country’s GDP. It will impoverish the lowest of the low in Indian economic ladder and push millions of farmers into suicide\nSo it seems we are reaching the limits. Pushed to the corner Indian farmers are fighting back. Where will it lead? We have two ways lying ahead of us. One way leads to Revolution and the other way leads to Collapse. In the event of catastrophic social collapse it will be a Hobbesian war of all against all. Which path will we take?\nBinu Mathew is the editor of www.countercurrents.org . He can be reached at editor@countercurrents.org", "url": "https://countercurrents.org/2017/06/07/as-farmers-fight-back-in-india-where-are-we-headed/", "label": 1}