{"authors": [], "date_download": "2019-03-27 14:40:58", "date_modify": "2019-03-27 14:40:58", "date_publish": "2018-03-15 20:11:17", "description": null, "filename": "2018_03_15__1553697658.html", "image_url": "http://www.theshillongtimes.com/wp-content/uploads/2017/04/tstess.png", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/theshillongtimes.com/2018_03_15__1553697658.html", "title": "PM to inaugurate 105th ISC at Manipur University on Friday", "title_page": "PM to inaugurate 105th ISC at Manipur University on Friday – The Shillong Times", "title_rss": "NULL", "source_domain": "theshillongtimes.com", "text": "GUWAHATI: Prime Minister, Narendra Modi will inaugurate the 105TH Indian Science Congress on March 16 at 10:00 A.M. in Manipur University. This was informed by the Vice Chancellor of Manipur University, Prof Adya Prasad Pandey.\nApart from Inauguration the next programme, there will be Plenary Session at 2:00 P.M. which will be addressed by Dr. R. Chidambaram, Principal scientific adviser government of India, as keynote Speaker.\nChildren Science Congress will be held on March 17 on the 2nd day of the 105th Indian Science Congress at Academic Building, MIT, North of A-Block, Manipur University. Padmanabha Balakrishna Acharya, Governor of Nagaland, is inaugurating the function as the Chief Guest.\nWomen’s Science Congress -2018 will be held on March 18, at Centenary Hall of Manipur University which will be inaugurated by Keshari Nath Tripathi, Governor of West Bengal. The function will kick off with the arrival of dignitaries from 11:00 A.M. and will conclude with National Anthem at 12:30 P.M.\n11th Science Communicators’ Meet will be held on March19 at the Court Hall, Administrative Block of Manipur University. Y. Joykumar Singh, Deputy Chief Minister of Manipur; will grace the function as Chief Guest.", "url": "http://www.theshillongtimes.com/2018/03/15/pm-to-inaugurate-105th-isc-at-manipur-university-on-friday/", "label": 1}