{"authors": ["The Pioneer"], "date_download": "2019-03-27 14:29:09", "date_modify": "2019-03-27 14:29:09", "date_publish": "2018-09-11 00:00:00", "description": "n Supporting the Bharat Bandh call given by the party, Haryana Congress MLAs on Monday reached the Vidhan Sabha on a horse cart to protest against the fuel price hike.\nCarrying placards and raising slogans, the MLAs, including Congress Legislature Party leader Kiran Choudhry and former Speaker", "filename": "2018_state-editions_haryana-cong-mlas-come-to-vidhan-sabha-on-horse-cart_1553696949.html", "image_url": "https://www.dailypioneer.com/images/logo.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/dailypioneer.com/2018_state-editions_haryana-cong-mlas-come-to-vidhan-sabha-on-horse-cart_1553696949.html", "title": "Haryana Cong MLAs come to Vidhan Sabha on horse cart", "title_page": "Haryana Cong MLAs come to Vidhan Sabha on horse cart", "title_rss": "NULL", "source_domain": "dailypioneer.com", "text": "n Supporting the Bharat Bandh call given by the party, Haryana Congress MLAs on Monday reached the Vidhan Sabha on a horse cart to protest against the fuel price hike.\nCarrying placards and raising slogans, the MLAs, including Congress Legislature Party leader Kiran Choudhry and former Speaker Kuldeep Sharma, blamed the BJP at the Centre and in the state for hike in fuel price and other essential items.\nFormer Chief Minister Bhupinder Singh Hooda said that the common man is suffering due to the hike in fuel prices. The party MLAs will move an adjournment motion on the issue in the State Assembly, he said.\nMLA Shakuntala Khatak, holding the reins of the horse as she and other leaders marched alongside, said that fuel prices had gone beyond the reach of the common man.\nHowever, the Congress MLAs were stopped by the Chandigarh Police on the way and were forced to walk down in a procession to the State Assembly where Congress MLAs, just before the question hour began, raised the issue of the Chandigarh Police ill-treating the MLAs.\nCongress MLA Karan Singh Dalal while speaking in the State Assembly alleged that Chandigarh Police has misbehaved with the MLAs during the protest. This is unfortunate that the police is acting in this manner with the MLAs, he said.\nCLP Leader Kiran Choudhry alongwith other party MLAs also demanded that they should be allowed to move an adjournment motion on rising price of fuel in the House. The request was however turned down by the Speaker.", "url": "https://www.dailypioneer.com/2018/state-editions/haryana-cong-mlas-come-to-vidhan-sabha-on-horse-cart.html", "label": 1}