{"authors": [], "date_download": "2019-03-27 14:29:14", "date_modify": "2019-03-27 14:29:14", "date_publish": "2019-02-14 17:31:02", "description": null, "filename": "2019_02_14__1553696954.html", "image_url": "http://www.theshillongtimes.com/wp-content/uploads/2019/02/Lal-Thanhawla.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/theshillongtimes.com/2019_02_14__1553696954.html", "title": "Mizoram Cong defends ex-CM’s ‘banner’ protest", "title_page": "Mizoram Cong defends ex-CM’s ‘banner’ protest – The Shillong Times", "title_rss": "NULL", "source_domain": "theshillongtimes.com", "text": "GUWAHATI: The Mizoram Congress has defended party veteran and former chief minister, Lal Thanhawla’s recent ‘banner’ protest against the Citizenship (Amendment) Bill 2016, saying that it showed his “seriousness” against a contentious legislation.\nPictures of Lal Thanhawla holding a black banner saying, “Hello Independent Republic of Mizoram” during a rally organised by the NGO Coordination Committee in Aizawl on Tuesday, went viral on social media and other platforms, also sparking a debate of sorts.\n“Yes, former chief minister, Lal Thanhawla was holding the banner but he has always been very serious against CAB, which would have been harmful to the interests of our people. The Bill had re-ignited Mizo nationalism and brought to the fore an anti-India feeling which was seen in the protest rally,” Mizoram Pradesh Congress Committee spokesperson Lallianchhunga, told The Shillong Times on Thursday.\nFurther underlining the Congress leader’s seriousness when in power, the PCC spokesperson said, “In fact, on June 12, 2018, his council of ministers passed a resolution against the Bill while the Mizoram Legislative Assembly under his leadership passed another resolution against the legislation later that month.”\nLast month, posters reading “Hello China, Bye Bye India”, were carried by anti-CAB protesters in Aizawl.\n“We (Mizoram people) were always ready for a do-or-die battle if CAB was passed as it was a question of life and death. But luckily, the Bill has lapsed now after the Centre failed to table it in Rajya Sabha yesterday,” Lallianchhunga said.\nReflecting on history, he said, “We still remember what happened in 1966 when Aizawl was bombed. The government of India never apologised for it unlike its apology to the Sikh community in 1984-85 (after the riots).”\nOn the role of Mizoram chief minister, Zoramthanga in opposing the Bill, Lallianchhunga said the ruling Mizo National Front had opposed the Bill “only in words” and “never threatened to come out of the NEDA or break ties with NDA over the legislation.”\n“Unlike Meghalaya chief minister, Conrad Sangma who was not only very vocal and active against CAB but maintained a clear stand throughout, our chief minister (Zoramthanga) only opposed the Bill in words and defended his position,” the Mizoram PCC spokesperson alleged.", "url": "http://www.theshillongtimes.com/2019/02/14/mizoram-cong-defends-ex-cms-banner-protest/", "label": 1}