{"authors": [], "date_download": "2019-03-27 14:40:47", "date_modify": "2019-03-27 14:40:47", "date_publish": "2019-02-11 11:24:32", "description": "Chandra Babu Naidu's Dharma Porata Deeksha Updates: Chandra Babu Naidu is protesting in New Delhi against the Centre for special status.", "filename": "378-telugu-headlines-top-stories_63253-chandra-babu-naidu-s-dharma-porata-deeksha-updates_1553697647.html", "image_url": "http://www.andhrawishesh.com/logo.png", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/andhrawishesh.com/378-telugu-headlines-top-stories_63253-chandra-babu-naidu-s-dharma-porata-deeksha-updates_1553697647.html", "title": "Chandra Babu Naidu's Dharma Porata Deeksha Updates", "title_page": "Chandra Babu Naidu's Dharma Porata Deeksha Updates", "title_rss": "NULL", "source_domain": "andhrawishesh.com", "text": "(Image source from: Twitter.com/JaiTDP)\nChandra Babu Naidu's Dharma Porata Deeksha Updates:- Andhra Pradesh Chief Minister Chandra Babu Naidu started a day long fast in New Delhi protesting against the Centre which ignored granting special status for Andhra Pradesh. Chandra Babu Naidu paid tributes to Mahatma Gandhi at Raj Ghat after which he headed to AP Bhavan to observe fast. All the TDP leaders, MLAs and MPs participated in the protest. Several national leaders paid their visit to Chandra Babu Naidu to support his protest.\nA large number of supporters from Andhra Pradesh reached the national capital already through two special trains from the state. Several people have been protesting against the Centre from the state. Narendra Modi visited AP yesterday and made several comments on Chandra Babu Naidu. Babu after his fast will meet various crucial leaders to discuss about the future plans. Chandra Babu Naidu is in plans to build a strong platform for anti-BJP leaders in the upcoming Parliament polls that are scheduled this year.", "url": "http://www.andhrawishesh.com/378-telugu-headlines-top-stories/63253-chandra-babu-naidu-s-dharma-porata-deeksha-updates.html", "label": 1}