{"authors": [], "date_download": "2019-03-27 14:40:57", "date_modify": "2019-03-27 14:40:57", "date_publish": "2017-12-29 07:24:05", "description": "NEW DELHI, Dec 28:The 2018 edition of the historic Indian Science Congress will be held at Manipur University, Imphal, in March.", "filename": "__1553697657.html", "image_url": "http://www.thesangaiexpress.com/wp-content/uploads/2017/12/MU.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/thesangaiexpress.com/__1553697657.html", "title": "MU set to host Indian Science Congress", "title_page": "MU set to host Indian Science Congress - The Sangai Express", "title_rss": "NULL", "source_domain": "thesangaiexpress.com", "text": "NEW DELHI, Dec 28:The 2018 edition of the historic Indian Science Congress will be held at Manipur University, Imphal, in March.\nThe event was scheduled at the Osmania University (OU), Hyderabad, in the first week of January but had to be moved out due to “security problems.” This was the first time the 106-year-old ISC — the largest congregation of scientists in India — had to be postponed at the last minute.\n“We’ve got confirmation from the Governor as well as the Chief Minister’s invitation to host the event at Manipur University,” Prof. Gangadhar, general secretary (Membership Affairs), Indian Science Congress Association (ISCA), told The Hindu. They would soon be writing to the Prime Minister’s Office about the dates. The congress sees several students, Nobel Laureates and scientists from India’s science academies in attendance. Fresh registrations would now be required, Mr. Gangadhar said.\nSince the days of Jawaharlal Nehru, the ISC was traditionally the first public function the Prime Minister addressed in the calendar year.\nStudent unrest has rattled the OU since December 3 last year, after the suicide of a student and this was among the key reasons that led to its withdrawal as a venue.\nMoreover, funds allotted by the ISCA to the OU to spruce up the campus and prepare for the event were mostly unspent, sources said.\nThe choice of venue is usually decided a year in advance and the massive logistical exercise involves coordinating the visit of several Nobel Laureates, heads of Indian science academies and thousands of students. “We’ll be writing to the Laureates again and I hope they can come,” Mr. Gangadhar said.\nIn recent years, the Science Congress has also got flak for being a forum that promoted pseudo science, such as in 2014, when a session on mythology and Vedic-era airplanes was a highlight.\nIndia-born Chemistry Laureate Venkatraman Ramakrishnan had castigated the congress as a “circus.”\nCourtesy The Hindu", "url": "http://www.thesangaiexpress.com/mu-set-host-indian-science-congress/", "label": 1}