{"authors": ["Apoorva Mandhani"], "date_download": "2019-03-27 14:18:16", "date_modify": "2019-03-27 14:18:16", "date_publish": "2018-02-17 10:09:21", "description": "The frustration of various stakeholders over judicial vacancies has reached the city of Calcutta now, with the Calcutta High Court Bar Association, on Friday, announcing a five-day long cease work...", "filename": "__1553696296.html", "image_url": "https://www.livelaw.in/cms/wp-content/uploads/2016/08/Calcutta-High-Court-1.jpg?width=500&height=300", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/livelaw.in/__1553696296.html", "title": "Calcutta Lawyers Announce 5-Day Cease Work To Protest Against Judicial Vacancies", "title_page": "Calcutta Lawyers Announce 5-Day Cease Work To Protest Against Judicial Vacancies", "title_rss": "NULL", "source_domain": "livelaw.in", "text": "The frustration of various stakeholders over judicial vacancies has reached the city of Calcutta now, with the Calcutta High Court Bar Association, on Friday, announcing a five-day long cease work starting Monday.\nIn an urgent General Body meeting held on Friday, the members decided to abstain from work till Friday next week, \"as a mark of protest against the authority for not taking any appropriate and effective steps to fill up the vacancy of the Judges of this Hon'ble Court since long\". The members further requested the Acting Chief Justice and other Judges to not pass any adverse orders in the absence of any of the parties.\nOther lawyers’ bodies in the High Court — the Incorporated Law Society and the Bar Library Club — have also reportedly supported the strike. However, the Trinamool Congress lawyers’ cell, which concluded its relay hunger strike on the same issue on Friday, has chosen not to join, saying that it was \"not consulted\" before making the decision.\nThe Calcutta High Court is currently functioning at less than half its strength, with only 33 Judges as opposed to a sanctioned strength of 72 Judges. The shortage is only going to contribute further to the 2.2 lakh pendency of cases at the Court.\nThe situation isn't very different at other High Courts as well. In fact, it was just recently that several Bangalore lawyers went on a hunger strike to protest against the ever-growing judicial vacancies at the Karnataka High Court. This was followed by a resolution to cease-work by the Orissa High Court Bar Association, in order to express its \"anxiety\" regarding non-appointment of Judges.", "url": "https://www.livelaw.in/calcutta-lawyers-announce-5-day-cease-work-protest-judicial-vacancies/", "label": 1}