{"authors": [], "date_download": "2019-03-27 14:40:49", "date_modify": "2019-03-27 14:40:49", "date_publish": "2016-02-26 06:18:10", "description": null, "filename": "__1553697649.html", "image_url": "http://www.thefridaytimes.com/wp-content/uploads/2016/02/tft-3-p-1-k.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/thefridaytimes.com/__1553697649.html", "title": "Silver lining", "title_page": "Silver lining – The Friday Times", "title_rss": "NULL", "source_domain": "thefridaytimes.com", "text": "The ongoing debate on free speech sparked by police raids at the prestigious Jawaharlal Nehru University (JNU) in New Delhi has been good for the institution of journalism in India. It has also exposed the news channels that held the entire country hostage with their jingoism.\nA number of television channels aired a doctored video without verifying its authenticity, making a student event at the university controversial. That video helped legitimize the Indian government’s action against freedom of speech, and led to a frenzy that has dangerous consequences for the country. The overzealous news anchors eventually had to face the truth. Other news organizations carried out investigations into how the videos were modified to help the prosecution charge JNU Student Union leader Kanhaiya Kumar and his associates with sedition.\nIn trying to improve their ratings, they became tools in the hands of police, but blacked out for two days an attack by rightwing lawyers on journalists and students in the Patiala House court.\nWhen sanity eventually prevailed, and a large number of journalists in Delhi came out on the streets to protest against the hooliganism, those channels did not side with their colleagues.\nHe was clenching his fists and overstretching his vocal chords\nFor a long time, such television channels had claimed the “sole proprietorship of nationalism”. But then, the stalwarts of Indian journalism, such as Rajdeep Sardesai and Barkha Dutt, came out to lead the protests and to show to the Indian people that most Indian journalists are still sane.\nA day later, Arnab Goswami was clenching his fists and overstretching his vocal chords – a sign that he had lost the battle.\nThe first obligation of a journalist is to be loyal to the citizens. India is a celebrated democracy and diversity has been its biggest strength. Nationalism had never been under threat in India until the right-wing politics began to thrive. The advent of this new “nationalistic” journalism coincides with that. Dissent is the soul of democracy, even if it is questioning the government’s sovereignty. Even the Supreme Court of India has refused to call this kind of sloganeering sedition.\nIn their book “The Elements of Journalism”, Bill Kovach and Tom Rosenstiel lay down certain principles for getting to “journalistic truth”. They say it “is a process that begins with the professional discipline of assembling and verifying facts. Then journalists try to convey a fair and reliable account of their meaning, subject to further investigation.”\nThey question assumptions. “The publisher of journalism – whether a media corporation answering to advertisers and shareholders or a blogger with his own personal beliefs and priorities — must show an ultimate allegiance to citizens. They must strive to put the public interest – and the truth – above their own self-interest or assumptions,” they write.\nBut some television channels aired the video with a vigour, encouraging the assumption that it is true.\nThe BJP government was already concerned about the left leaning Student Union, and was looking for an excuse to go after them. The doctored video in which Kanhaya Kumar was allegedly calling for the liberation of Kashmir instigated the public against a community and a faith.\nToday, Indian journalism and the Indian society at large stare in the face of series threats to tolerance and civility. For a long time, groups of “nationalists” have been blaming Pakistan for violence in India. But what is seen in India today is much worse. Democracy does function, elections do take place, and governments do come to power. But then, they only stifle rival opinions.\nThe government in power aims to make India a Hindu Rashtra, and they even have cohorts in the media. Indian has seen crisis after crisis under Prime Minister Narendra Modi’s leadership.\nBut the recent crackdown on freedom of speech is a cloud with a silver lining. A majority of the media has mustered the courage to challenge them.\nThe BJP government may give an impression that all is well, but its challenges are increasing, especially with no signs of good governance. It is likely to revert to its agenda of Hindutva to stay in power. But people will realize that this seduction is dangerous for them and their country.\nThe author is a veteran journalist from Srinagar and the editor-in-chief of\nThe Rising Kashmir", "url": "http://www.thefridaytimes.com/silver-lining/", "label": 1}