{"authors": ["Indian Awaaz"], "date_download": "2019-03-27 14:40:37", "date_modify": "2019-03-27 14:40:37", "date_publish": "2015-10-31 00:00:00", "description": null, "filename": "__1553697637.html", "image_url": "http://www.iloveindia.com/indian-heroes/pics/narayana-murthy.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/theindianawaaz.com/__1553697637.html", "title": "Considerable fear in minds of minorities: Narayana Murthy", "title_page": "Considerable fear in minds of minorities: Narayana Murthy | The Indian Awaaz", "title_rss": "NULL", "source_domain": "theindianawaaz.com", "text": "AMN /\nNEW DELHI: Infosys founder NR Narayana Murthy has joined the chourous of protest over the growing intolerance in the country. Murthy said that there is considerable fear in the minds of minority in India and said the governments should bring back the sense of confidence in them.\n“I am not a politician, I am not interested in politics, therefore, I don’t want to comment on that but the reality today is that there is considerable fear in the minds of minority in India,” Murthy told NDTV.\nHe said there was also “considerable fear” in the minds of people of one region living in another region.\nCiting the Shiv Sena campaign against the South Indians living in Mumbai in 1960s, he said, “Today there is a lot of that worry. I get lots of emails, I get a lot of people talking to me even though I stay at home because of my leg.”\n“The first priority of this government, or for that matter any government, both at the central level and the state level, is to bring back the confidence, the energy, the enthusiasm, the trust in the minds of every Indian that this is our country, I have all the rights here, I am very safe here and therefore I will work towards the betterment of India,” Murthy said.\nThe IT veteran said,that no country, has ever made steady economic progress unless “there is no distrust, there is no fear, unless the majority community doesn’t oppress the minority community, doesn’t want the minority community to do what it wants etc.”", "url": "http://theindianawaaz.com/considerable-fear-in-minds-of-minorities-narayana-murthy/", "label": 1}