{"authors": ["Livelaw News Network"], "date_download": "2019-03-27 14:35:23", "date_modify": "2019-03-27 14:35:23", "date_publish": "2017-01-31 18:35:54", "description": "SC allowed the plea filed by the Centre seeking to withdraw its 2016 notification permitting Jallikattu in Tamil Nadu in view of the fresh legislation passed by the state assembly on the issue....", "filename": "__1553697323.html", "image_url": "https://www.livelaw.in/cms/wp-content/uploads/2017/01/Jallikattu-LiveLaw.jpg?width=500&height=300", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/livelaw.in/__1553697323.html", "title": "Jallikattu: SC Refuses To stay New TN Ordinance, Slams Govt. For Violation Of SC Judgment", "title_page": "Jallikattu: SC Refuses To stay New TN Ordinance, Slams Govt. For Violation Of SC Judgment", "title_rss": "NULL", "source_domain": "livelaw.in", "text": "SC allowed the plea filed by the Centre seeking to withdraw its 2016 notification permitting Jallikattu in Tamil Nadu in view of the fresh legislation passed by the state assembly on the issue.\nBench also issued notice to Tamil Nadu on petitions filed by animal rights organization challenging the new law.\nJallikattu can go on in Tamil Nadu for the time being.\nAfter an hour-long stormy hearing, the Supreme Court today did not stay the new law brought in by the Tamil Nadu government to allow the bull taming sport but slammed the state government for failing to maintain law and order during the protests and also allowing “willful violation” of the apex court orders.\nA bench of Justices Dipak Misra and Rohinton Nariman allowed the plea filed by the Centre seeking to withdraw its 2016 notification allowing Jallikattu in Tamil Nadu in view of the fresh legislation passed by the state assembly on the issue.\nHearing petitions filed by several animal rights organizations- Compassion Unlimited Plus Action, Federation of Indian Animal Protection Organisation and Animal Equality challenging the new law and questioning the validity of the ordinance, the bench issued notice to the State and sought their response within six weeks.\n“Is this the way to react when the matter is sub-judice ? Why was there law and order problem? you have an obligation to tell us. Tell your government that law and order is primacy in civilized society and we can't tolerate such incidents. we said the same thing to Karnataka government in the Cauvery matter. When the final arbitrer of the constitution is seized off the issue a complete silence has to be maintained on the issue. You are entitled to come up with an ordinance, an act but we are not on that. We are governed by a concept of rule of law. In rule of law such kind of things shall not happen. Tell your state to take control of law and order. Convey it to the state executive”, Justice Misra told senior advocates K Parasaran, C Vaidyanathan and Rakesh Dwivedi who represented the state of Tamil Nadu.\nWhen Parasaran said the 2014 judgment was being complied with, the bench asked “if judgment is being complied with, how can there be protests...to openly come out in protests on the streets and violate SC order, this is not permissible...we are only concerned with preserving the court’s order and dignity.\nThe animal rights organizations in the petitions contended that the new law passed by Tamil Nadu Assembly to allow Jallikattu has over-reached the earlier verdict of apex court. The court had already reserved its verdict on a batch of petitions challenging the 2016 notification. They said things were being done “through the backdoor to circumvent the apex court’s earlier directions and it struck at the very basis of the 2014 judgment which banned jallikattu”.\nFollowing public pressure and rising protests against the ban, the Tamil Nadu Legislative Assembly has passed the Jallikattu Bill, 2017. Tamil Nadu Governor C Vidyasagar Rao has forwarded the Bill to President Pranab Mukherjee who gave his assent.\nWHAT WAS THE AMENDMENT\nAnimal Husbandry, Dairying and Fisheries Department of Tamil Nadu Government had framed Tamil Nadu Prevention of Cruelty to Animals (Conduct of Jallikattu) Rules, 2017 by making certain amendments in the Prevention of Cruelty to Animals Act, 1960. It removes bulls used for jallikattu from under the ambit of ‘performing animals’ In simple words, as per the amended TN law, the rule and restrictions on ‘performing animals’ will not apply to the conduct of jallikattu.\nOn January 20, acting on a submission by Rohatgi, SC had agreed not to pass the judgement for a week on the contentious issue. The bench had taken into account the Centre's submission that they were in talks with Tamil Nadu to find a way out in the matter.\nDuring an urgent mentioning, Rohatgi had said “ people of Tamil Nadu are passionate about Jallikattu and the Central government and the state are trying to resolve the issue. The Centre and the state are in talks to find a way out in the matter and our request is that the court should not deliver the judgement for at least a week”\nThousands of students gathered on the sands of Marina Beach in Chennai as protests demanding lifting of the ban on bull-taming sport 'jallikattu' snowballed across Tamil Nadu. Faced with mounting anger on the streets, the top brass of the state government got into a huddle as Chief Minister O Panneerselvam decided met Prime Minister Narendra Modi seeking an ordinance for conduct of the age-old sport. He was accompanied by 51 MPs of AIADMK. He appealed to the students to give up their protests even as IT sector employees and several more actors joined the chorus for allowing 'jallikattu'. Meanwhile several celebrities also supported Jallikattu and had urged the SC to lift the ban.\nThis article has been made possible because of financial support from Independent and Public-Spirited Media Foundation.", "url": "https://www.livelaw.in/jallikattu-sc-refuses-stay-new-tn-ordinance-slams-govt-violation-sc-judgment/", "label": 1}