{"authors": [], "date_download": "2019-03-27 14:29:21", "date_modify": "2019-03-27 14:29:21", "date_publish": "2017-12-20 13:08:01", "description": "Cuttack MP Bhartruhari Mahtab today sought an adjournment motion during the zero hour of the Lok Sabha on Mahanadi river water sharing dispute.", "filename": "__1553696961.html", "image_url": "http://www.pragativadi.com/wp-content/uploads/2017/12/mahtab1.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/pragativadi.com/__1553696961.html", "title": "Mahanadi issue: BJD MPs seek adjournment motion in Lok Sabha", "title_page": "Mahanadi issue: BJD MPs seek adjournment motion in Lok Sabha - Pragativadi: Leading Odia Dailly", "title_rss": "NULL", "source_domain": "pragativadi.com", "text": "New Delhi: After BJD MPs staged a protest near the Mahatma Gandhi statue in Parliament premises outside the Central Hall, Cuttack MP Bhartruhari Mahtab today sought an adjournment motion during the zero hour of the Lok Sabha on Mahanadi river water sharing dispute between Odisha and Chhattisgarh.\nSpeaking at the lower house, Mahtab said that Mahanadi water dispute between two states is an issue of national concern and the row needs to be discussed during sitting of the House to resolve it.\nAccusing the Centre for showing apathetic attitude towards resolving the issue, the BJD Parliamentarian said that the Union Government has failed to fulfill its promise for constituting a tribunal to adjudicate the matter and had submitted false information at the Supreme Court in this regard.\nHowever, Speaker Sumitra Mahajan did not accept the motion by saying that the issue is important but can be discussed later.\n“We had moved an adjournment motion today for the third time. However, the Speaker did not accept the motion following which we stood beside our seats and staged a protest”, BJD’s Parliamentary Party spokesperson Kalikesh Singhdeo said while speaking to media persons outside the Parliament.\n“Mahanadi is the lifeline of Odisha. We will continue our protest against the illegal construction of barrages over Mahanadi in the upper catchment areas by the Chhattisgarh Government”, he added.", "url": "http://www.pragativadi.com/mahanadi-issue-bjd-mps-seek-adjournment-motion-lok-sabha/", "label": 1}