{"authors": [], "date_download": "2019-03-27 14:35:03", "date_modify": "2019-03-27 14:35:03", "date_publish": "2017-04-23 00:00:00", "description": null, "filename": "__1553697303.html", "image_url": "https://www.nmtv.tv/wp-content/uploads/2017/04/tamil-nadu-farmers.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/nmtv.tv/__1553697303.html", "title": "Tamil Nadu farmers drink their own urine in protest for drought relief", "title_page": "Tamil Nadu farmers drink their own urine in protest for drought relief – NMTV", "title_rss": "NULL", "source_domain": "nmtv.tv", "text": "Tamil Nadu farmers stage a protest at New Delhi’s Jantar Mantar for drought relief, drank their own urine on Saturday in another desperate bid to draw the government’s attention to their plight.\nThe severe drought in Tamil Nadu last year and the scuffle with Karnataka that broke over the sharing of the waters, of the River Cauvery left many Tamil Nadu farmers in the lurch.\nThe Centre has provided relief to the state government, but it has been acutely less than what was initially demanded. The protesting farmers have, in addition to drinking their own urine, worn sarees, eaten dead rats, stripped nude and have worn the skulls of deceased farmers.\nReports say that, P. Ayyakkannu, who is leading the protest, said: “The government is not giving us water. So, we are consuming urine.”\nThe protesters had on Friday said they would drink urine if the Centre failed to offer a solution to their problems within a day.\nOn April 10, they had stripped in front of the prime minister’s office here to press for their demands Over the last 39 days, they have shaved half of their moustaches and tonsured heads, their kept mice and snakes in their mouth, conducted mock funerals, flogged themselves and carried skulls of other farmers who committed suicide due to debt pressure.–ANI", "url": "https://www.nmtv.tv/tamil-nadu-farmers-drink-their-own-urine-in-protest-for-drought-relief/", "label": 1}