{"authors": [], "date_download": "2019-03-27 14:40:34", "date_modify": "2019-03-27 14:40:34", "date_publish": "2019-02-03 11:54:24", "description": "Shiv Sena President Uddhav Thackeray on Sunday has appealed to Maharashtra government to intervene in Anna Hazare’s hunger strike.", "filename": "__1553697634.html", "image_url": "http://www.pragativadi.com/wp-content/uploads/2019/02/UddhavPK28.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/pragativadi.com/__1553697634.html", "title": "Anna Hazare hunger strike: Uddhav Thackeray appeals Maharashtra government to intervene", "title_page": "Anna Hazare hunger strike: Uddhav Thackeray appeals Maharashtra government to intervene - Pragativadi: Leading Odia Dailly", "title_rss": "NULL", "source_domain": "pragativadi.com", "text": "Mumbai: Shiv Sena President Uddhav Thackeray on Sunday has appealed to Maharashtra government to intervene in Anna Hazare’s hunger strike.\nThackeray has warned the government not to “play” with the life of social activist.\nThackeray’s statement comes at a time when Hazare’s indefinite fast over demand for immediate appointment of anti-corruption watchdogs at the Centre and in Maharashtra enters the fifth day.\nReports said that the supporters of Hazare had claimed that the Gandhian had received a “cold response” from the Prime Minister’s Office (PMO) in response to a letter sent by the activist.\nThackeray advised Hazare to take to the streets to create an awakening among people instead of giving up his life by fasting.\nHazare should don the role of freedom activist Jayaprakash Narayan to usher in a new revolution, he said.\nOn the fifth day of Hazare’s fast, his supporters blocked the Ahmednagar-Pune state highway at Supa village in Maharashtra, causing huge traffic jams there.", "url": "http://www.pragativadi.com/anna-hazare-hunger-strike-uddhav-thackeray-appeals-maharashtra-government-to-intervene/", "label": 1}