{"authors": [], "date_download": "2019-03-27 14:40:56", "date_modify": "2019-03-27 14:40:56", "date_publish": "2015-10-13 16:47:41", "description": "Related", "filename": "__1553697656.html", "image_url": "http://www.easternmirrornagaland.com/wp-content/uploads/2016/10/cropped-WebLogoNew-1.png", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/easternmirrornagaland.com/__1553697656.html", "title": "Manipur bandh on October 14", "title_page": "Manipur bandh on October 14", "title_rss": "NULL", "source_domain": "easternmirrornagaland.com", "text": "Our Correspondent\nIMPHAL,October 13\nThe Co-ordination Committee (CorCom),an umbrella body of insurgent groups in Manipur announced for an 18-hour state wide general strike with effect from October 14 midnight till 6 pm of October 15 to protest against the ‘forced merger’ of Manipur into the Indian Union.\nThe CorCom has been observing October 15 as “National Black Day” since years to protest the Manipur Merger Agreement signed between Maharaja Bodhachandra of Manipur and Government of India at Shillong on October 15, 1949.The publicity committee of CorCom in a release here however said that emergencies, media, religious and medical activities will be kept out of the purview of the proposed strike. It sought cooperation from the public in enforcing the general strike.\nIt said 66 years have completed since Manipur was annexed by India under duress. It said ‘colonial’ India annexed Manipur and that the entire political process was not a merger.\nIt also said that there has been a clear common voice of the people of Manipur that they want the right to national self-determination.\nBefore India got its independence, Manipur Constitution Act, 1947 was implemented and a democratic election was held in 1948, it said. It further added black laws like Armed Forces (Special Powers) Act was enforced in Manipur and there is no let-up in torturing the people.\nLike this: Like Loading...", "url": "http://www.easternmirrornagaland.com/manipur-bandh-on-october-14/", "label": 1}