{"authors": ["Prarthana Mitra"], "date_download": "2019-03-27 14:29:08", "date_modify": "2019-03-27 14:29:08", "date_publish": "2018-12-16 01:30:55", "description": "A statue of Mahatma Gandhi was recently removed from the University of Ghana, following complaints about his offensive remarks about the South African community.", "filename": "__1553696948.html", "image_url": "https://qrius.com/wp-content/uploads/2018/10/Mahatma_Gandhi_laughing-4.jpeg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/qrius.com/__1553696948.html", "title": "After Malawi, Ghana University removes Gandhi statue for his racism", "title_page": "After Malawi, Ghana University removes Gandhi statue for his racism", "title_rss": "NULL", "source_domain": "qrius.com", "text": "A statue of Mahatma Gandhi was recently removed from the University of Ghana, following complaints about his offensive remarks about the South African community.\nThe racism that Mahatma Gandhi faced and witnessed in South Africa has been cited, at least in Indian textbooks, as a formative period in his career as a freedom fighter and anti-colonialist against the British. But for most Africans, it is anything but an exemplary tale, which is why a statue of the Indian independence leader was recently removed from the University of Ghana, following complaints about his offensive remarks about the South African community.\nThe petition, submitted by students and faculty, cited his writings, where he called Indians “infinitely superior” to black Africans. Several such writings which came to light only recently prove that Gandhi, who had practised law in the continent early in his career, and is renowned for having fought against the apartheid, was, in fact, racist.\nThe statue was located in the country’s capital, Accra.\nHere’s what the petition said\nAfter relentless protests at the prestigious Legon campus, the statue was removed overnight on Tuesday, two years after former president Pranab Mukherjee unveiled it to consolidate diplomatic ties between both nations.\nThe petition quoted extensively from his letters and journals, where he repeatedly used a racist diminutive “kafir” to address Africans. One particular excerpt read thus\nOurs is one continual struggle against a degradation sought to be inflicted upon us by the Europeans, who desire to degrade us to the level of the raw Kaffir whose occupation is hunting, and whose sole ambition is to collect a certain number of cattle to buy a wife with and, then, pass his life in indolence and nakedness.\nA 2015 book highlighted other instances of deeply internalised and systemic racism that Gandhi subscribed to, while working on civil rights issues in South Africa for more than two decades. According to the book, Gandhi complained that Indians were being forced to use the same separate entrances as Africans, meaning “their civilised habits … would be degraded to the habits of aboriginal natives”, suggesting that presumed Indians to be socially superior to native communities in South Africa.\nHis ignorance and prejudice has perhaps taken this long to be regarded seriously because Gandhi’s theories of civil resistance, ahimsa and austerity are still revered all over the world, and he has inspired generations of activists including Martin Luther King Jr.\nHere’s what the agitators and authorities said\nThe controversy had begun almost immediately after the unveiling, prompting a statement from Ghana’s Ministry of Foreign Affairs which claimed, “While acknowledging that human as he was, Mahatma Gandhi may have had his flaws, we must remember that people evolve. He inspired movements for civil rights and freedom across the world.”\nGhana’s former government had apparently promised to relocate the statue so that the outcry and controversy around it didn’t pose a distraction to Ghana’s “strong ties of friendship” with India, while also protecting the artwork itself. But it remained in place until this week.\nThe head of language, literature and drama at the Institute of African Studies, Obadele Kambon, told the press the removal had become a matter of “self-respect”.\nThe petition also demanded commemoration of Africa’s own heroes. “If we show that we have no respect for ourselves and look down on our own heroes and praise others who had no respect for us, then there is an issue,” Obadele said, asking, “If we indeed don’t show any self-respect for our heroes, how can the world respect us?”\n“This is a victory for black dignity and self-respect. The campaign has paid off,” he said, as a student Benjamin Mensah, chimed in, saying, “It’s a massive win for all Ghanaians because it was constantly reminding us of how inferior we are.”\nAlthough the university told the BBC that Ghana’s Ministry of Foreign Affairs and Regional Integration was responsible for the statue’s removal, an official from the ministry refused to comment saying the removal was “an internal decision by the university”.\nA recurrence\nThis is not the first instance in the continent when people have protested the glorification of Gandhi. Earlier this year, a proposed statue of Mahatma Gandhi stirred up a similar controversy in Blantyre, the commercial capital of Malawi. Around 3,000 petitioners from the town forged a front known as Gandhi Must Fall (GMF), and wrote to the government opposing the project, saying, “He never did anything for us.”\nThe agitators also claimed that the statue was being forced upon the people of Malawi and “is the work of a foreign power aiming at promoting its image and dominion on the unsuspecting people of Malawi”.\nWhile history knows Gandhi as a fervent champion of South Africans, and for fighting segregation laws in the country during the apartheid era, Wonderful Mkutche, a member of GMF told AFP on Saturday, “We are not comfortable with imperialistic and neo-colonial ideologies that seek to impose … foreign influence which deprives us of honour.”\n“Now more than ever, our nation must rise above pettiness and weakness in international deals,” he said. “This must mean that we should only accept investments, partnerships … that are responsible, fair, equal, honourable, sustainable, efficient and transparent,” Mkutche further added.\nMeanwhile, controversy over Gandhi’s views about Africans has seen rallying on both sides. A spokesperson for the Malawai foreign ministry defended the project, saying, “It should be recognised that Mahatma Gandhi promoted values of simplicity, fight against social evils, promoting human and civil rights as well as uplifting of social well-being of people.”\nMunlo insisted, “It is also worth noting that all African freedom fighters that fought against colonialism and oppression and thus demanded independence were influenced by what Mahatma Gandhi fought for. In other ways, Mahatma Gandhi is a role model of a human rights campaigner for both Africa and India.”\nPrarthana Mitra is a staff writer at Qrius.", "url": "https://qrius.com/after-malawi-ghana-university-removes-gandhi-statue-for-his-racism/", "label": 1}