{"authors": [], "date_download": "2019-03-27 14:35:55", "date_modify": "2019-03-27 14:35:55", "date_publish": "2016-03-22 15:15:49", "description": "Dimapur, March 22 (MExN): A three day residential workshop for science teachers of government and private schools of Nagaland was successfully held from March 19 to 21 at the Development Association of Nagaland", "filename": "__1553697355.html", "image_url": "http://morungexpress.com/wp-content/uploads/2019/03/logo-new-3.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/morungexpress.com/__1553697355.html", "title": "Workshop for science teachers conducted", "title_page": "Workshop for science teachers conducted The Morung Express", "title_rss": "NULL", "source_domain": "morungexpress.com", "text": "Dimapur, March 22 (MExN): A three day residential workshop for science teachers of government and private schools of Nagaland was successfully held from March 19 to 21 at the Development Association of Nagaland, Dimapur.\nThe workshop was organized by the Nagaland Institute of Health, Environment & Social Welfare, Kohima with support from Vigyan Prasar, Department of Science & Technology, Government of India, Noida (UP). The Directorate of School Education deputed science teachers from all the districts of Nagaland to attend the programme.\nThe main resource person for the workshop was the renowned science activist Dr. BN Das of Presidency University, Kolkata. The seventy two years old Dr Das regaled and mesmerized the participants with his astonishing magic like demonstrations on the principles, laws and theories of light, magnetism, electricity etc using cheap, easily and locally available materials. He showed how a serious subject like physics could be taught as a subject full of fun and excitement for students. He told the teachers that experimental demonstrations help students to understand theories that are difficult to explain with words. He also added that friendliness, jokes and little bit of play while teaching are essential to draw the interest of students.\nDuring the feedback session, the teachers stated that it was the most interesting and educative workshop that they had ever attended and requested the organizers to conduct similar workshops with the same resource person in the future too.\nVigyan Prasar also supplied demonstration kits free of cost to all the participants to help them conduct similar demonstrations in their schools.", "url": "http://morungexpress.com/workshop-for-science-teachers-conducted/", "label": 1}