{"authors": [], "date_download": "2019-03-27 14:35:27", "date_modify": "2019-03-27 14:35:27", "date_publish": "2016-01-24 11:47:25", "description": "Press Council of India (PCI) on Friday said the Assam Rifles has decided to withdraw its notice to the media in Nagaland asking them not to publish news pe", "filename": "__1553697327.html", "image_url": "https://www.northeasttoday.in/assets/resources/2016/01/AR1.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/northeasttoday.in/__1553697327.html", "title": "Assam Rifles Withdraws Notice to Nagaland Media Houses", "title_page": "\nAssam Rifles Withdraws Notice to Nagaland Media Houses  » Northeast Today", "title_rss": "NULL", "source_domain": "northeasttoday.in", "text": "Press Council of India (PCI) on Friday said the Assam Rifles has decided to withdraw its notice to the media in Nagaland asking them not to publish news pertaining to banned organisations. PCI Chairman Justice CK Prasad, while expressing concern over the “apathy” of Nagaland Government over the issue, also said that the Council is planning to evolve guidelines for the media and security forces on reporting in conflict situations.\nThe newspapers in Nagaland had left editorial space blank on November 16, the National Press Day, last year to protest against the diktat of the Assam Rifles impinging on the editorial judgment of the media.\nIn a statement issued, the PCI Chairman said on the direction of the Council, the editors of the media organisations in Nagaland and top officers of Assam Rifles met in Dimapur on January 14 and decided to resolve issues keeping in view the freedom of the press, security concerns and national interest. The Council held a special suo-motu inquiry at Guwahati on December 11 last year on the notice given by the Assam Rifles, a para-military force, last October asking them not to publish any news on the activities of the banned organisations in the State, the statement said.\n“I am happy that the officials of Assam Rifles and the editors discussed the matter in a cordial atmosphere and came to an understanding under which the Assam Rifles withdrew its notice to the media while the editors agreed to keep security concerns in mind while reporting on activities of the banned outfits,” Prasad said.\nThe PCI statement also said the Council would soon evolve guidelines for the media and security forces on reporting in conflict situations, particularly in North East, where the media is working under pressure from militants and security forces, after holding wide ranging consultations with all stakeholders.\n“I am concerned over the apathy of the Nagaland Government over the issue and hope it would take positive steps to maintain a fine balance between the freedom of the press and security concerns,” Justice Prasad said.\n– PTI", "url": "http://www.northeasttoday.in/assam-rifles-withdraws-notice-to-nagaland-media-houses/", "label": 1}