{"authors": [], "date_download": "2019-03-27 14:40:45", "date_modify": "2019-03-27 14:40:45", "date_publish": "2016-07-01 11:31:10", "description": "Tamil Nadu protests Andhra's plan to raise check dam height Chennai, July 1 (IANS) Tamil Nadu Chief Minister J.Jayalalithaa on Friday lodged a strong", "filename": "__1553697645.html", "image_url": "http://www.mangalorean.com/wp-content/uploads/2016/04/jayalalithaa.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/mangalorean.com/__1553697645.html", "title": "Tamil Nadu protests Andhra's plan to raise check dam height", "title_page": "Tamil Nadu protests Andhra's plan to raise check dam height - Mangalorean.com", "title_rss": "NULL", "source_domain": "mangalorean.com", "text": "Spread the love\nTamil Nadu protests Andhra’s plan to raise check dam height\nChennai, July 1 (IANS) Tamil Nadu Chief Minister J.Jayalalithaa on Friday lodged a strong protest with her Andhra Pradesh counterpart N. Chandrababu Naidu for raising the height of a check dam across Palar river in his state’s Chittoor district.\nIn a letter to Naidu on Friday, the text of which was released to the media here, Jayalalithaa said: “As you are aware, Palar is an inter-state river and this unilateral action of the authorities in Andhra Pradesh has caused great alarm and apprehension in Tamil Nadu.”\nShe said the Andhra Pradesh government’s irrigation department is increasing the height of the check dam from the current five feet to 12 feet across Palar river in Chittoor, but as Palar is an inter-state river, the upstream state should not, without the prior consent of the downstream state build any cut or any structure obstructing/diverting/storing of the river water.\nJayalalithaa also said the Tamil Nadu government has filed a suit in the Supreme Court seeking to restrain Andhra Pradesh from constructing any structure/works across the Palar or at any other place through which the river and its tributaries flow or impounding/diverting water therein in violation of the Madras-Mysore Agreement, 1892.\n“In the circumstances, the government of Tamil Nadu lodges its strong protest against the action of the government of Andhra Pradesh in having unilaterally increased the height of the existing check dam at Perumballam village, Kuppam Revenue Mandal in Chittoor District, in violation of the Madras-Mysore Agreement, 1892,” she said.", "url": "http://www.mangalorean.com/239137-2/", "label": 1}