{"authors": [], "date_download": "2019-03-27 14:35:26", "date_modify": "2019-03-27 14:35:26", "date_publish": "2015-12-01 15:25:01", "description": "Related", "filename": "__1553697326.html", "image_url": "http://www.easternmirrornagaland.com/wp-content/uploads/2016/10/cropped-WebLogoNew-1.png", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/easternmirrornagaland.com/__1553697326.html", "title": "Don’t turn media into PR agency", "title_page": "Don’t turn media into PR agency", "title_rss": "NULL", "source_domain": "easternmirrornagaland.com", "text": "Guest Editorial\nRaymond Ronamai\nAnnie Gowen, India Bureau Chief for The Washington Post, has shamed the BJP-led NDA government by claiming that PR (public relations) companies representing India Government officials have contacted them twice in recent weeks. This has led to allegation by many that government is trying to gag foreign media after managing to silence Indian media. Whether or not the government has gagged Indian media, the fact that hashtags #ModiMediaGate and #SelfieJournalism were trending on social media for hours spoke volumes on how the public look at today’s media.\nThe less said about the amount of money political parties spend on publicity, especially during elections the better. But we know dark days are here when media, which considered as the fourth estate of democracy and watchdog of the society, fall prey to their PR tactics. Even common man starts questioning the integrity and fairness of journalism. The pictures of Indian scribes jostling to take selfies with Prime Minister Narendra Modi at his recent ‘Diwali Milan’ programme at BJP headquarters in Delhi were certainly not what public and journalists with principle would want to see and it is fit to be included in the syllabus of Journalism to enlighten future scribes on why they shouldn’t be star-struck under any circumstances. This kind of attitude is why it took a BBC reporter to ask Modi: “India is becoming an increasingly intolerant place. Why?” Indian media may soon look up to foreign media to know their leaders’ opinion on the country’s burning issues if they choose to remind star-struck or stay too close to them. The bigger problem is credibility will take a beating if the very institution that is supposed to watch every step of the government, be it centre or state, throw itself as a carpet for it to walk on.\nA few newspapers in Nagaland recently carried blank editorial as a mark of protest against the Assam Rifles’ dictate not to publish statements made by militant groups. Public should support media during such trying times because suppressing freedom of expression and press freedom is unacceptable in a democracy. In the meantime, fair and fearless journalism should take precedence at all times and media should not act as a PR agency to ruling government, political parties or organizations.\nLike this: Like Loading...", "url": "http://www.easternmirrornagaland.com/dont-turn-media-into-pr-agency/", "label": 1}