{"authors": [], "date_download": "2019-03-27 14:35:54", "date_modify": "2019-03-27 14:35:54", "date_publish": "2018-03-22 18:16:20", "description": "Gen (Retd) Viyalie Metha, Kedahge, FGN speaking during the 63rd Nagaland Republic Day at Transit Peace Camp, Kohima on March 22. (Morung Photo)", "filename": "__1553697354.html", "image_url": "http://morungexpress.com/wp-content/uploads/2018/03/Gen-Rtd-Viyalie-Metha.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/morungexpress.com/__1553697354.html", "title": "FGN commemorates Nagaland Republic Day", "title_page": "FGN commemorates Nagaland Republic Day The Morung Express", "title_rss": "NULL", "source_domain": "morungexpress.com", "text": "Gen (Retd) Viyalie Metha, Kedahge, FGN speaking during the 63rd Nagaland Republic Day at Transit Peace Camp, Kohima on March 22. (Morung Photo)\nMorung Express News\nKohima | March 22\nThe 63rd Nagaland Republic Day of the Federal Government of Nagaland (FGN) was held on March 22 at the Transit Peace Camp, Kohima.\nThe unfurling of the flag and address to the Nation was delivered by Gen (Retd) Viyalie Metha, Kedahge, FGN while a short speech was addressed by Thepfulhouvi Solo.\nProviding a brief history of the emergence of Naga nationalism, Metha said, “On this occasion of historic national day, it is important for all citizens to recollect and be refreshed as to how history of the Nation began.” At all events of history the British and Indians, Metha posited that the statements were clear that Nagaland does not belong to India. “We can tell the records are clear. And it stands to prove that Nagas were not subjugated by the British, only they were allowed to stay in parts of Nagaland; No part of Naga territory had taken part in the treaty of Yandabo between the British and Burma… All the historical facts stand clear and proofed that Nagaland is not part of India and Nagas are not demanding anything from India or other Nation,” stated Metha.\nTerming the military atrocities as the ‘unlawful activities of India’ the FGN President noted that India committed many crimes in an attempt to annex Nagaland. India promulgated and enforced its “black laws” in Nagaland such as Assam Maintenance of Public Order 1952 and Armed forces Special Powers Act 1958.\nMetha pointed out some of the atrocities committed by the armed forces as well as setting up the Secret Code SAMPAT coordinating Armed Forces and Civil Administration to wipe out the Naga National Council (NNC), the Federal Governemnt of Nagaland (FGN) and the Naga Army (1972).\n“Today Nagaland stands where we stood in the beginning that is ‘URRA UVIE’ (our land belongs to us). We want India to withdraw her occupational Armed Forces from our land peacefully because India has not right to occupy Nagaland,” said Metha, adding that the FGN maintains peace and continues to honor the Indo-Naga Ceasefire Agreement of 1964, hoping India will come to terms with rational and honorable settlement of Indo Naga conflict without delay.", "url": "http://morungexpress.com/fgn-commemorates-nagaland-republic-day/", "label": 1}