{"authors": [], "date_download": "2019-03-27 14:40:42", "date_modify": "2019-03-27 14:40:42", "date_publish": "2019-02-11 05:25:39", "description": "Andhra Pradesh Chief Minister N Chandrababu Naidu on Monday has started hunger strike in Delhi demanding special status for Andhra Pradesh.", "filename": "__1553697642.html", "image_url": "http://www.pragativadi.com/wp-content/uploads/2019/02/5c60f18120000059016dd26e.jpeg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/pragativadi.com/__1553697642.html", "title": "Andhra CM on hunger strike in Delhi demanding special status for state", "title_page": "Andhra CM on hunger strike in Delhi demanding special status for state - Pragativadi: Leading Odia Dailly", "title_rss": "NULL", "source_domain": "pragativadi.com", "text": "New Delhi: Andhra Pradesh Chief Minister N Chandrababu Naidu on Monday has started hunger strike in Delhi demanding special status for Andhra Pradesh.\nAccording to reports a number of Opposition party leaders, including Congress president Rahul Gandhi, National Conference president Farooq Abdullah and Delhi Chief Minister Arvind Kejriwal, are expected to extend their support to the Telugu Desam Party (TDP) supremo at the Andhra Pradesh Bhavan here.\nThe Andhra chief minister offered tributes to the father of the nation, Mahatma Gandhi, at Raj Ghat and to B R Ambedkar at Andhra Bhavan before sitting on hunger strike.\nIt is expected that a TDP delegation headed by Naidu will submit a memorandum to President Ram Nath Kovind on Tuesday in this connection.\nThe TDP supreme has been trying his best to unite the opposition parties to take on the saffron party in the upcoming Lok Sabha polls.\nHe has been holding a number of parleys in this connection with the opposition on formation of an anti-BJP front much before the general elections.\nThe TDP had pulled out of the NDA government over its refusal to grant a special status to Andhra Pradesh in March last year.\nEver since then the party has been accusing the Narendra Modi government of not releasing enough funds for the Polavaram irrigation project, the Kadapa steel plant and Amravati, the under-construction ultra-modern state capital.\nAndhra Pradesh was bifurcated into two on June 2, 2014 and Hyderabad became the capital of the new state Telangana.", "url": "http://www.pragativadi.com/andhra-cm-on-hunger-strike-in-delhi-demanding-special-status-for-state/", "label": 1}