{"authors": ["Author", "Canindia New Wire Service"], "date_download": "2019-03-27 14:40:47", "date_modify": "2019-03-27 14:40:47", "date_publish": "2019-03-22 00:00:00", "description": null, "filename": "__1553697647.html", "image_url": "http://www.canindia.com/wp-content/uploads/2017/11/cropped-CINEWS-ICON1-32x32.png", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/canindia.com/__1553697647.html", "title": "DMK, PMK demand rollback of bus fare hike", "title_page": "DMK, PMK demand rollback of bus fare hike – Canindia News", "title_rss": "NULL", "source_domain": "canindia.com", "text": "Chennai, Jan 27 (IANS) Opposition parties in Tamil Nadu on Saturday protested against the drastic hike in bus fares and demanded its rollback, with the DMK holding demonstrations against the State Transport Corporations.\nPMK founder S. Ramadoss demanded a rollback, saying the fare hike has resulted in people opting for alternate travel modes defeating the purpose of the hike – which was for increasing the revenue for the State Transport Corporations.\nDMK leader M.K. Stalin led the protest here and termed the bus fare hike as a “merciless act” of the government affecting the common man.\nHe said the government, without consulting anyone, has jacked up the bus fares by 66 per cent to rake in additional revenue.\nStalin’s son and actor Udayanidhi Stalin participated in the party’s protest at Tambaram near here.\nThe alliance parties of DMK, including the Congress, IUML, MDMK and others, participated in the agitation denouncing the AIADMK government in the state.\nRamadoss, in a statement, said the State Transport Corporations are losing around Rs 10 crore daily after the hike.\nHe said, around 22,000 government buses used to carry around 2.10 crore passengers a day in the state, and following the fare hike around 25 lakh passengers have switched over to other modes of transport like railways, private buses, shared cabs and others, resulting in a loss of around Rs 10 crore per day for State Transport Corporations.\nOfficials of government-owned transport corporations had earlier said around Rs 38 crore would be the fare collections per day following the hike, he said. But now the per day fare collections is around Rs 28 crore and hence the fare hike should be rolled back, Ramadoss added.\n–IANS\nvj/nks/rn", "url": "http://www.canindia.com/dmk-pmk-demand-rollback-of-bus-fare-hike/", "label": 1}