{"authors": [], "date_download": "2019-03-27 14:40:46", "date_modify": "2019-03-27 14:40:46", "date_publish": "2016-02-08 08:28:23", "description": "New Delhi, Feb 8 (IANS) The employees of three civic bodies here on Monday agreed to call off their strike and resume work following the intervention of", "filename": "__1553697646.html", "image_url": "https://www.mangalorean.com/wp-content/uploads/2016/03/mangalorean-favi-icon-1.png", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/mangalorean.com/__1553697646.html", "title": "Delhi sanitation workers agree to end strike", "title_page": "Delhi sanitation workers agree to end strike  - Mangalorean.com", "title_rss": "NULL", "source_domain": "mangalorean.com", "text": "Spread the love\nNew Delhi, Feb 8 (IANS) The employees of three civic bodies here on Monday agreed to call off their strike and resume work following the intervention of the Delhi High Court.\nA division bench of Chief Justice G. Rohini and Justice Jayant Nath asked the civic workers to call off their strike as they had been paid the January salary. The issue of arrears will be taken up on Wednesday.\nThe joint front of sanitation workers assured the bench that they would end the strike immediately and resume work.\n“All the safai karamchaaris are now calling off the strike and resuming the work immediately.AWe will monitor this petition (for further hearing on arrears issue),” the bench said, taking into note the submissions of union of safai karamcharis.\nHowever, in an indication of the divided opinion of civic bodies’ unions on the issue, some sanitation workers told reporters outside the court that they are not ending their strike until all arrears are cleared.\nThe civic bodies told the bench that salaries up to January have been paid to the workers.\nThe high court on Friday sought responses from 38 unions of safai karamcharis, saying sanitation workers cannot hold the city to ransom by going on indefinite strike if they have been paid their salaries.\nEast, South and North municipal corporations told the bench that salaries to the sanitation workers were due only for the month of January, 2016 and this had been released to the concerned headquarters.\n“There is no impediment to the release of salary. If anyone has not received salary, it will be paid by Wednesday,” the counsel of the civic bodies said.\nEmployees of Delhi’s three main civic bodies have been protesting over the non-payment of salaries for the past few months, directing their ire at both the Delhi and the central governments for the last 13 days.", "url": "http://www.mangalorean.com/delhi-sanitation-workers-agree-end-strike/", "label": 1}