{"authors": ["Tvp Editorial"], "date_download": "2019-03-27 14:34:52", "date_modify": "2019-03-27 14:34:52", "date_publish": null, "description": null, "filename": "__1553697292.html", "image_url": "http://theviewspaper.net/wp-content/uploads/FightForWater.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/theviewspaper.net/__1553697292.html", "title": "History Repeats Itself, This Time For Water", "title_page": "  History Repeats Itself, This Time For Water", "title_rss": "NULL", "source_domain": "theviewspaper.net", "text": "Supreme Court is making a lot of noise these day, for good and bad both. Recently, Supreme Court made a groundbreaking judgement, wherein criticizing a government or its’ policies does not amount to sedition. Many people than required are getting afflicted with charges of sedition because of being ‘anti-national’ in nature.\nNow, the Supreme Court has ruled that Karnataka must release 15,000 cusecs of water daily for the next 10 days to Tamil Nadu, which has invited more protests, and public demolishing than the help it was supposed to do. The Cauvery River, which flows through southern Karnataka and then into Tamil Nadu, has been a point of conflict for decades. Its water was originally divided according to nearly century-old agreements.\nIt was in 1990 that the central government created a tribunal to examine the conflict. And in 2007, they delivered a verdict on how water must be shared between Tamil Nadu, Karnataka, Puducherry and Kerala, the verdict was challenged and argued upon. So, with this new Supreme Court judgment, old wars have come back again to haunt the civilians and the authorities.\nAs per the state rivalry is concerned, Tamil Nadu says its farmers are in desperate need of the water for the samba or second seasonal crop of the year. Karnataka says Tamil Nadu has already completed one crop cycle, and is now unfairly seeking water for another, whereas its own farmers are struggling. Karnataka Chief Minister Siddaramaiah has invited floor leaders of all political parties in the state legislature, central ministers from the state and members of parliament to an all-party meeting to discuss the apex court order and decide on the next course of action.\nCauvery water issue: Farmers protest in Shrirangapattana taluk of Mandya, block road #Karnataka pic.twitter.com/pVM2UBuQQR — ANI (@ANI_news) September 6, 2016\nAgitated farmers and activists belonging to pro-Kannada outfits have blocked Bengaluru-Mysuru highway as protests intensified in the wake of the Supreme Court directive to the state to release Cauvery water to Tamil Nadu. Mandya district, the nucleus of Cauvery politics, saw a bandh with protesters holding road blockades and dharnas at several places, as hundreds of security personnel, including Central forces, were deployed in the Cauvery belt to maintain law and order. People are protesting all over the state of Karnataka and are burning effigies of Jayalaithaa, Chief Minister of Tamil Nadu.\nKarnataka says that this year, there has been not enough rain, thus they are in remote shortage and inability to deliver the required amount. As per the state government says there isn’t enough supply in these dams for the drinking water needs of cities like Bengaluru and Mysuru.\nShould Tamil Nadu adjust themselves with the current situation in Karnataka, or does Karnataka really have to present a strong case to thwart such a release?\nFor all that is going on, one thing is for sure, we have reached a stance wherein we are quarrelling amongst ourselves for the resources, resources we never tried to save or conserve in the first place, and the depletion of which will set forth a series of wars and protests we aren’t capable of controlling or avoiding.\nYugansha Malhotra\nImage Sources:\nhttp://bit.ly/2c7Itmv\nThe Viewspaper", "url": "http://theviewspaper.net/history-repeats-itself-this-time-for-water/", "label": 1}