{"authors": [], "date_download": "2019-03-27 14:18:11", "date_modify": "2019-03-27 14:18:11", "date_publish": null, "description": "Null", "filename": "_article.asp_ArticleId=2407647&CategoryId=12396_1553696291.html", "image_url": "http://laht.com/favicon.ico", "language": null, "localpath": "/home/raj/news-please-repo//data/2019/03/27/laht.com/_article.asp_ArticleId=2407647&CategoryId=12396_1553696291.html", "title": "Latin American Herald Tribune", "title_page": "Latin American Herald Tribune - Jewelers in India Stage Nationwide Protests against Excise Duty", "title_rss": "NULL", "source_domain": "laht.com", "text": "Jewelers in India Stage Nationwide Protests against Excise Duty\nCALCUTTA, India \u0096 Jewelers across the country are on Sunday staging the 12th day of protest strikes against the government\u0092s imposition of a 1-percent excise duty on gold and diamond jewelry, the Tribune newspaper reported.\nIn Ludhiana city, in the northern Indian state of Punjab, jewelers on Saturday wore masks of Prime Minister Narendra Modi as they rallied in the city and broke pots in protest against the duty.\nAnand Sekri, president of the Ludhiana Jewelers\u0092 Association, said the duty, introduced by finance minister Arun Jaitley in the 2016-2017 state budget plan, causes huge financial losses to jewelers.\n\u0093We too are adamant on our stand. The strike and protests will continue until the government decides to roll back the decision on excise duty on jewelers,\u0094 he said.\nAlso in Punjab on Saturday, protesters in Amritsar marched against the duty, shouting slogans criticizing Jaitley, with 10 jewelers staging a hunger strike at the Nehru shopping center, according to the Hindustan Times newspaper.\nThe strikes show few signs of letting up, and Sarafa jewelers association spokesperson Trilokchand Bardiya in central India\u0092s Chhattisgarh has called for statewide strikes on March 17, adding that five association members will go on hunger strikes, the Rajasthan Patrika newspaper reported.\nThe strikes in Chhattisgarh are causing economic hardship for 40,000 workers and artisans linked with the jewelry industry, traders claim, but the Chhattisgarh government is doing little to help.\nTwitter users are also denouncing the jewelry duty, with criticism trending under the hashtag #RollBackExciseOnJewellery.\nThe user @Rapaport tweeted Sunday that \u0093Imposing excise duty on jewellery is like forcing flights to land without constructing airport.#rollbackexciseonjewellery\u0094 and @RNKothari wrote, \u0093We jewelers are on strike from 12days, yet no response from govt. @arunjaitley @narendramodi @PMOIndia #RollBackExciseOnJewellery.\u0094", "url": "http://laht.com/article.asp?ArticleId=2407647&CategoryId=12396", "label": 1}