{"authors": ["Tamilnet Tamilnet.Com"], "date_download": "2019-03-27 14:34:50", "date_modify": "2019-03-27 14:34:50", "date_publish": null, "description": "Rajapaksa visits India amid wide-scale protests in Tamil Nadu", "filename": "_art.html_catid=13&artid=31928_1553697290.html", "image_url": "https://www.tamilnet.com/:/favicon.ico", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/tamilnet.com/_art.html_catid=13&artid=31928_1553697290.html", "title": "Rajapaksa visits India amid wide-scale protests in Tamil Nadu", "title_page": "TamilNet: 08.06.10 Rajapaksa visits India amid wide-scale protests in Tamil Nadu", "title_rss": "NULL", "source_domain": "tamilnet.com", "text": "2ND LEAD (Adds photos)\nRajapaksa visits India amid wide-scale protests in Tamil Nadu [TamilNet, Tuesday, 08 June 2010, 11:33 GMT]\nAll the district capitals and major cities of Tamil Nadu state Tuesday noon reported wide-scale protests against Mahinda Rajapaksa's visit to India. All the prominent leaders of political parties and movements, Vaiko, Pazha Nedumaran, Thirumavalavan, Seeman, Nallakannu, Mahendran, T. Rajendar, Thiyagu were arrested by Tamil Nadu police with thousands of other activists after they concluded their speeches and protests. The protests, including black flag demonstrations in front of Indian Central Government Institutions in Tamil Nadu, blocking railway and burning effigies of Sri Lankan President, have brought many Tamil parties and movements together in support of Eezham Tamils. All major media outlets operating from India have given coverage to the protests.\nA cartoon by Naam Thamilar activists in Karnataka state in Bengalore An effigy of Rajapaksa being burnt by Tamil activists Vaiko addressing the protesters ITPI activists burning the effigy of Rajapaksa VCK leader Thol Thirumavalavan at a protest rally in Chennai\nLTTE leader V. Pirapaharan's photos were being carried by the protesters in more than 100 protests reported throughout Tamil Nadu.\nTamil diaspora circles, commenting on the uprising in Tamil Nadu, said the momentum which has been created by the re-awakening in Tamil Nadu and the attention gained in other states in the wake of controversial IIFA move, needs to be translated into a wider political alliance, by bringing the activists from various parties and movements in forging an alternative front for Tamil politics.\nFive major protests were reported in the capital of Tamil Nadu state.\nIlangkai Thamizhar Paathukaappu Iyakkam (ITPI) led by Pazha Nedumaran of Thamizhar Theasiya Iyakkam and consisting of several leaders including Vaiko from MDMK, CPI leaders R. Nallakannu and C. Mahendran, Thamizh Theasiya Viduthalai Munnani representative Thiyagu, LDMK representative Vijaya D. Rajendar, Tamil Desa Podhuvudamai Kadchi President Maniarasan went in a protest procession from Mayilai Nageswara Rao Park towards the Sri Lankan Deputy High Commission situated in T.T.K Road in Chennai.\nMr. Vaiko blamed the Central Government of India for its abetment of Colombo's genocidal war against Tamils and blamed New Delhi for continuing to collaborate with Rajapaksa regime which is widely blamed for war crimes and Tamil genocide. India was entertaining an International Criminal, Vaiko charged. He also accused the Tamil Nadu Chief Minister Muthuvel Karunanidhi for entertaining New Delhi's collaboration with Colombo instead of demanding International investigations, which he called treachery. Mr. Karunanidhi on Monday had written a letter to Indian Prime Minister Manmohan Singh urging Indian pressure on Sri Lankan President to resettle uprooted Tamils.\nThe protestors burned effigies of Rajapaksa. More than 500 of the protestors were arrested by the Police when they attempted to move forward the Sri Lankan Deputy High Commission.\nSeeman led another protest in front of the Regional Passport Office at the Indian government owned Shastri Bhavan premises at Nungampakkam. Sri Lankan flag was put on fire by Naam Thamilar activists. Mr. Seeman and Professor Theeran were among the arrested leaders together with hundreds of Naam Thamilar activists.\nAnother protest led by VCK leader Thol Thriumavalavan MP, took place in front of the Memorial Hall. Mr. Thirumavalavan blamed New Delhi for rolling out red carpet welcome for Sri Lankan President while Tamil civilians are struggling for resettlement in the jungles. He said the Indian aid to help the Tamil civilians, channeled through the Sri Lankan state, had not fully reached the victims and said a Joint Action Committee should be formed by the Indian Government to insruct the Sri Lankan state on proper Tamil resettlement. Mr. Thirumavalavan was arrested with more than 500 activists.\nMore than 200 VCK activists were arrested after blocking railway in Coimbatore.\nPuthiya Thamizhakam activists led by Dr. Krishnasamy staged a protest in front of Red Cross office in Kovai.\nActor Sarathkumar's Akila Indhiya Samthuva Makkal Katchi also staged protest against Rajapaksa in Kovai.\nAt Sivakangkai, CPI MLA Gunasekaran was arrested after a protest.\nVelmurugan MLA of Pattali Makkal Kadchi (PMK) who staged a protest in Chennai was also arrested by Tamil Nadu police.\nThousands of activists and their leaders were held in collective custody throughout Tamil Nadu till Tuesday evening.\nVaiko addressing the protesters Tamil activist and Director Seeman and Prof. Theeran of Naam Thamilar in front of Shastri Bhavan premises at Nungampakkam VCK activists with Thirumavalavan\nChronology:\n09.06.10 Exert pressure on Colombo to declare detained LTTE.. 08.06.10 Rajapaksa visits India amid wide-scale protests in.. [TamilNet, Tuesday, 08 June 2010, 11:33 GMT]Mahinda Rajapaksa, who is on a 3-day visit is scheduled to discuss final details of a bilateral trade agreement, post-war resettlement, constitutional amendments and ''counter-insurgency' cooperation between the countries. Mr. Rajapaksa will be meeting Indian Prime Minister Manmohan Singh, Congress president Sonia Gandhi and President Pratibha Patil, media reports in India said.LTTE leader V. Pirapaharan's photos were being carried by the protesters in more than 100 protests reported throughout Tamil Nadu.Tamil diaspora circles, commenting on the uprising in Tamil Nadu, said the momentum which has been created by the re-awakening in Tamil Nadu and the attention gained in other states in the wake of controversial IIFA move, needs to be translated into a wider political alliance, by bringing the activists from various parties and movements in forging an alternative front for Tamil politics.Five major protests were reported in the capital of Tamil Nadu state.Ilangkai Thamizhar Paathukaappu Iyakkam (ITPI) led by Pazha Nedumaran of Thamizhar Theasiya Iyakkam and consisting of several leaders including Vaiko from MDMK, CPI leaders R. Nallakannu and C. Mahendran, Thamizh Theasiya Viduthalai Munnani representative Thiyagu, LDMK representative Vijaya D. Rajendar, Tamil Desa Podhuvudamai Kadchi President Maniarasan went in a protest procession from Mayilai Nageswara Rao Park towards the Sri Lankan Deputy High Commission situated in T.T.K Road in Chennai.Mr. Vaiko blamed the Central Government of India for its abetment of Colombo's genocidal war against Tamils and blamed New Delhi for continuing to collaborate with Rajapaksa regime which is widely blamed for war crimes and Tamil genocide. India was entertaining an International Criminal, Vaiko charged. He also accused the Tamil Nadu Chief Minister Muthuvel Karunanidhi for entertaining New Delhi's collaboration with Colombo instead of demanding International investigations, which he called treachery. Mr. Karunanidhi on Monday had written a letter to Indian Prime Minister Manmohan Singh urging Indian pressure on Sri Lankan President to resettle uprooted Tamils.The protestors burned effigies of Rajapaksa. More than 500 of the protestors were arrested by the Police when they attempted to move forward the Sri Lankan Deputy High Commission.Seeman led another protest in front of the Regional Passport Office at the Indian government owned Shastri Bhavan premises at Nungampakkam. Sri Lankan flag was put on fire by Naam Thamilar activists. Mr. Seeman and Professor Theeran were among the arrested leaders together with hundreds of Naam Thamilar activists.Another protest led by VCK leader Thol Thriumavalavan MP, took place in front of the Memorial Hall. Mr. Thirumavalavan blamed New Delhi for rolling out red carpet welcome for Sri Lankan President while Tamil civilians are struggling for resettlement in the jungles. He said the Indian aid to help the Tamil civilians, channeled through the Sri Lankan state, had not fully reached the victims and said a Joint Action Committee should be formed by the Indian Government to insruct the Sri Lankan state on proper Tamil resettlement. Mr. Thirumavalavan was arrested with more than 500 activists.More than 200 VCK activists were arrested after blocking railway in Coimbatore.Puthiya Thamizhakam activists led by Dr. Krishnasamy staged a protest in front of Red Cross office in Kovai.Actor Sarathkumar's Akila Indhiya Samthuva Makkal Katchi also staged protest against Rajapaksa in Kovai.At Sivakangkai, CPI MLA Gunasekaran was arrested after a protest.Velmurugan MLA of Pattali Makkal Kadchi (PMK) who staged a protest in Chennai was also arrested by Tamil Nadu police.Thousands of activists and their leaders were held in collective custody throughout Tamil Nadu till Tuesday evening.", "url": "https://www.tamilnet.com/art.html?catid=13&artid=31928", "label": 1}