{"authors": ["Raymond Ronamai"], "date_download": "2019-03-27 14:41:04", "date_modify": "2019-03-27 14:41:04", "date_publish": "2016-09-27 18:21:54", "description": "Karnataka says it is not in the position to comply with the order until December as it doesn't have enough water.", "filename": "_cauvery-row-karnataka-farmers-protest-against-sc-direction-release-water-tamil-nadu-695527_1553697664.html", "image_url": "https://data1.ibtimes.co.in/en/full/618402/cauvery-water-row.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/ibtimes.co.in/_cauvery-row-karnataka-farmers-protest-against-sc-direction-release-water-tamil-nadu-695527_1553697664.html", "title": "Cauvery row: Karnataka farmers protest against SC direction to release water to Tamil Nadu", "title_page": "Cauvery row: Karnataka farmers protest against SC direction to release water to Tamil Nadu - IBTimes India", "title_rss": "NULL", "source_domain": "ibtimes.co.in", "text": "Farmers in Karnataka's Mandya district staged a protest on Tuesday soon after the Supreme Court directed the state government to release 6,000 cusecs of Cauvery River water to Tamil Nadu for the next three days.\nThe Karnataka government had moved the apex court on Monday seeking modification of the September 20 order to release 6,000 cusecs of water to Tamil Nadu till September 27. The state government said it is not in the position to comply with the order until December on the grounds that it doesn't have enough water to supply drinking water to major cities in the state.\nThe Supreme Court ruling on Tuesday has upset people in Karnataka. Farmers in Mandya took to the streets to protests the order. GM Gowda, President of Cauvery Hitarakshana Samithi told ANI that Tamil Nadu wants Cauvery water as it's a matter of pride to have it.\nThe dispute over Cauvery water had led to violence in Karnataka earlier this month. Violence erupted in Bangalore, forcing police to clamp section 144 of the Criminal Procedure Code (CrPC) prohibiting assembly of more than four people in an area and curfew under 16 police stations. Frequent bandhs not only disrupted daily lives of the people, but also cost dear to the state exchequer.\nIronically, members of Karnataka Rajya Raitha Sangha (KRRS) staged a demonstration outside the taluk office in Maddur, Mandya district, on Monday demanding the release of water from Krishnaraja Sagar Reservoir (KRS) to Visvesvaraya canal as their vegetations and crops have been badly affected due to water scarcity. They withdrew the protest after the authorities promised to look into their demands.", "url": "https://www.ibtimes.co.in/cauvery-row-karnataka-farmers-protest-against-sc-direction-release-water-tamil-nadu-695527", "label": 1}