{"authors": ["Indo Asian News Service"], "date_download": "2019-03-27 14:18:18", "date_modify": "2019-03-27 14:18:18", "date_publish": "2016-08-19 11:22:03", "description": "Chennai, Aug 19 (IANS) Suspended DMK legislators on Friday held a mock assembly session outside the Tamil Nadu secretariat building, even as the state legislature was in session, to protest against the suspension of 80 of its 89 lawmakers from the house for a week. The opposition party has filed a court", "filename": "_dmk-holds-mock-assembly-session-approaches-court-112203769_1553696298.html", "image_url": "https://s.yimg.com/os/mit/media/p/common/images/favicon_new-7483e38.svg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/in.news.yahoo.com/_dmk-holds-mock-assembly-session-approaches-court-112203769_1553696298.html", "title": "DMK holds mock assembly session, approaches court", "title_page": "DMK holds mock assembly session, approaches court", "title_rss": "NULL", "source_domain": "in.news.yahoo.com", "text": "Chennai, Aug 19 (IANS) Suspended DMK legislators on Friday held a mock assembly session outside the Tamil Nadu secretariat building, even as the state legislature was in session, to protest against the suspension of 80 of its 89 lawmakers from the house for a week.\nThe opposition party has filed a court case against the suspension and it will come up for hearing on Monday, Leader of Opposition and DMK Treasurer M.K. Stalin said while speaking at the mock session.\nDuring the mock session held for nearly an hour, Deputy Leader of Opposition and DMK leader Duraimurugan acted as the Speaker.\nTamil Nadu Assembly Speaker P. Dhanapal on Wednesday suspended for a week the DMK lawmakers for unruly behaviour in the house.\nSpeaking to the media later, Stalin said the aim of the mock assembly session was to show the happenings inside the house.\nHe said the government should call an all-party meeting to discuss neighbouring Karnataka's plan to build a new dam across the Cauvery river at Mekedatu.\n--IANS\nvj/tsb/bg", "url": "https://in.news.yahoo.com/dmk-holds-mock-assembly-session-approaches-court-112203769.html", "label": 1}