{"authors": [], "date_download": "2019-03-27 14:40:24", "date_modify": "2019-03-27 14:40:24", "date_publish": null, "description": "Patel said that he intend to organise a mega rally in Lucknow, at Jantar Mantar in Delhi.", "filename": "_hardik-patel-delhi-says-protest-taken-other-states-18277229_1553697624.html", "image_url": "https://newshub.org/img/article/600/hardik-patel-delhi-says-protest-taken-other-states-18277229.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/in.newshub.org/_hardik-patel-delhi-says-protest-taken-other-states-18277229_1553697624.html", "title": "Hardik Patel in Delhi, says protest will be taken to other states", "title_page": "Hardik Patel in Delhi, says protest will be taken to other states - NewsHub", "title_rss": "NULL", "source_domain": "in.newshub.org", "text": "Patel said that he intend to organise a mega rally in Lucknow, at Jantar Mantar in Delhi.\nHardik Patel, who has hogged national limelight through his aggressive stance on OBC quota for the Patel community, said he will expand his protest across the country. \"Whatever has happened in Gujarat, we want to take it to the national level and there are (people of) around 12 states who are connected to us,\" Hardik (22), who has emerged as the leader of the upper caste Patidar community, said in a press conference in the Capital.\nThe two-month old agitation had reached a flashpoint recently when it plunged Gujarat into violence after police lathicharged the protesters. The massive Patel rally in Ahmedabad on August 25 led to Hardik's detention and was followed by widespread violence which claimed 10 lives, including that of a police constable, forcing the authorities to stage Army flag march.\nHardik said the agitation for OBC quota for Patels in government jobs and educational institutions will be expanded to other states and include castes like Kurmis and Gujjars. Patel met some leaders of the Kurmi, Koeri and Gujjar communities among others with whom he said the Patidars of Gujarat had kinship. \"I intend to bring 27 crore people of our community together who are in different states. I want to take our movement all over the nation. Wherever the Patel community needs me, I will go.\nDuring this time, if we feel there is the need to show muscle power, we will do it. Whenever required, they (these communities) will block the highways,\" Hardik said.\n\"We intend to organise a mega rally in Lucknow, at Jantar Mantar in Delhi... we will give a call to the Patels of India (to join the movement),\" he said. According to him, the poor from all communities should get reservation as quotas have taken the country back.\n\"The country has gone back 60 years because of reservations and this has hindered its prospects of becoming a super power. Those who score good marks but are still unable to get admission require reservation. The day there is a proper blueprint on reservation, we can strengthen our country and take it to a new level,\" he said.\nLashing out at the Gujarat Police, Patel said he will be holding a mega-rally in Madhya Pradesh on Monday against it. He also questioned the much-touted Gujarat model of development, saying no such thing existed.\n\"As many as 8,900 farmers, all Patels, have committed suicide. Reservations have been given to 182 castes of which only 4-5 castes are in Gujarat. In 1984, there was opposition from the Patel community (before the Mandal Commission) to reservations. Today, the system has become weak and the youth are not getting employment,\" he said.\n\"We have no fight with anyone. We are not opposed to SC, ST and OBC and we are also not opposed to BJP, SP or AAP. If we did not get our right, no matter who rules us, Modi or Kejriwal, we will continue our fight,\" he said.\nSource: indiatoday.intoday.in", "url": "https://in.newshub.org/hardik-patel-delhi-says-protest-taken-other-states-18277229.html", "label": 1}