{"authors": [], "date_download": "2019-03-27 14:35:02", "date_modify": "2019-03-27 14:35:02", "date_publish": null, "description": "The Tamil Nadu police has been accused of indiscriminate and arbitrary arrests of people and activists protesting against the Chennai-Salem project.", "filename": "_kamal-haasan-hits-out-tamil-nadu-government-expressway-arrests-28696933_1553697302.html", "image_url": "http://newshub.org/img/article/600/kamal-haasan-hits-out-tamil-nadu-government-expressway-arrests-28696933.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/in.newshub.org/_kamal-haasan-hits-out-tamil-nadu-government-expressway-arrests-28696933_1553697302.html", "title": "Kamal Haasan Hits Out At Tamil Nadu Government On Expressway Arrests", "title_page": "Kamal Haasan Hits Out At Tamil Nadu Government On Expressway Arrests - NewsHub", "title_rss": "NULL", "source_domain": "in.newshub.org", "text": "The Tamil Nadu police has been accused of indiscriminate and arbitrary arrests of people and activists protesting against the Chennai-Salem project.\nNew Delhi: Actor Kamal Haasan on Wednesday slammed the Tamil Nadu government for arresting people protesting against the eight-lane green corridor between Chennai and Salem.\n\"To treat anyone talking about environment as a crime is not acceptable. This concern should be there among all,\" he told reporters when asked about his views on the raging controversy over the proposed expressway connecting the two cities.\nThe Tamil Nadu police has been accused of indiscriminate and arbitrary arrests of people and activists protesting against the project on the ground that thousands of hectares of land of agriculturists and others would be acquired, leaving them in the lurch.\n(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)\nSource: ndtv.com", "url": "http://in.newshub.org/kamal-haasan-hits-out-tamil-nadu-government-expressway-arrests-28696933.html", "label": 1}