{"authors": [], "date_download": "2019-03-27 14:40:33", "date_modify": "2019-03-27 14:40:33", "date_publish": "2015-03-02 05:47:42", "description": "New Delhi, Mar. 2 (ANI): Bihar Chief Minister Nitish Kumar has announced a one-day fast in protest against the Land Acquisition Amendment Bill, urging people across the state to join him. \"I agree to the statement of Nitish Kumar to keep fast for one day. What BJP leaders say inside the Parliament", "filename": "_land-acquisition-amendment-bill-nitish-kumar-protest-days-054742787_1553697633.html", "image_url": "https://s.yimg.com/os/mit/media/p/common/images/favicon_new-7483e38.svg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/in.news.yahoo.com/_land-acquisition-amendment-bill-nitish-kumar-protest-days-054742787_1553697633.html", "title": "Land Acquisition Amendment Bill: Nitish Kumar to protest with day's fast", "title_page": "Land Acquisition Amendment Bill: Nitish Kumar to protest with day's fast", "title_rss": "NULL", "source_domain": "in.news.yahoo.com", "text": "New Delhi, Mar. 2 (ANI): Bihar Chief Minister Nitish Kumar has announced a one-day fast in protest against the Land Acquisition Amendment Bill, urging people across the state to join him.\nHowever, no date has been announced for the fast.\n\"I agree to the statement of Nitish Kumar to keep fast for one day. What BJP leaders say inside the Parliament, the opposite is done outside it,\" said Janata Dal (United) General Secretary K.C. Tyagi.\nThe government also came in for criticism from the Nationalist Congress Party (NCP) over the bill.\n\"The disappointment among the farmers is observed due to this land acquisition bill. They are thinking that their land will be snatched away. The Central government is only showing inclination towards industrialists and corporate,\" NCP leader Tariq Anwar said.\nThe Land Acquisition Act, brought as an ordinance, amends the existing law passed by the former UPA regime in 2013. In the new version, the BJP-led NDA Government has removed the need for obtaining the consent of land-owners and carrying out Social Economic Assessment (SIA) for acquiring land under certain categories.\nThe government had earlier said that it was ready to deliberate on opposition suggestions and go the extra mile to prevent any injustice to farmers and to strengthen their hands.\nSeveral other political parties including the Trinamool Congress (TMC), Shiv Sena and Lok Janshakti Party are opposed to the Land Acquisition Ordinance. (ANI)", "url": "https://in.news.yahoo.com/land-acquisition-amendment-bill-nitish-kumar-protest-days-054742787.html", "label": 1}