{"authors": ["Indo Asian News Service"], "date_download": "2019-03-27 14:29:04", "date_modify": "2019-03-27 14:29:04", "date_publish": "2016-07-15 11:24:03", "description": "Lucknow, July 15 (IANS) Former Uttar Pradesh minister R.K. Chowdhary, who quit the Bahujan Samaj Party (BSP) recently, said on Friday that he will be holding a rally in which Bihar Chief Minister Nitish Kumar would be the chief guest. Chowdhary would be holding a rally of his supporters here on July", "filename": "_nitish-share-dais-says-former-bsp-leader-112403720_1553696944.html", "image_url": "https://s.yimg.com/os/mit/media/p/common/images/favicon_new-7483e38.svg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/in.news.yahoo.com/_nitish-share-dais-says-former-bsp-leader-112403720_1553696944.html", "title": "Nitish to share dais with me, says former BSP leader", "title_page": "Nitish to share dais with me, says former BSP leader", "title_rss": "NULL", "source_domain": "in.news.yahoo.com", "text": "Lucknow, July 15 (IANS) Former Uttar Pradesh minister R.K. Chowdhary, who quit the Bahujan Samaj Party (BSP) recently, said on Friday that he will be holding a rally in which Bihar Chief Minister Nitish Kumar would be the chief guest.\nChowdhary would be holding a rally of his supporters here on July 26.\nHe added that Kumar has given his consent to attend the 'Samajik Parivartan' public rally being held to mark the birth anniversary of Dalit icon Chhatrapati Shahu ji Maharaj.\nChowdhary, a long-standing BSP leader, quit the party recently accusing the party chief and former Uttar Pradesh Chief Minister Mayawati of turning greedy for money and converting the Dalit movement into a chit fund company.\nRecalling the role of Shahu ji Maharaj in getting the Dalits reservation, Chowdhary said in a statement that B.R. Ambedkar and Kanshi Ram had taken the movement forward but in Uttar Pradesh it had been arrested by Mayawati's greed.\nHe added that now the BSP stands for 'Brahman Samaj Party' and accused the BSP chief of playing into the hands of the 'Manuvadi' forces.\nChowdhary further stated that he will discuss the future strategy with his supporters on July 17 and take an appropriate view so that the cause of the Dalits and the oppressed can be furthered.\n--IANS\nmd/pgh/bg", "url": "https://in.news.yahoo.com/nitish-share-dais-says-former-bsp-leader-112403720.html", "label": 1}