{"authors": ["Indo Asian News Service"], "date_download": "2019-03-27 14:29:06", "date_modify": "2019-03-27 14:29:06", "date_publish": "2016-12-30 15:44:04", "description": "New Delhi, Dec 30 (IANS) The ordinance on old notes, that was approved by President Pranab Mukherjee on Friday, calls for a penalty of Rs 10,000 or five times the amount of the demonetised notes held, whichever is higher, after March 31. \"To prevent any continued parallel transactions with the", "filename": "_ordinance-calls-penalty-holding-old-notes-march-31-154404450_1553696946.html", "image_url": "https://s.yimg.com/os/mit/media/p/common/images/favicon_new-7483e38.svg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/in.news.yahoo.com/_ordinance-calls-penalty-holding-old-notes-march-31-154404450_1553696946.html", "title": "Ordinance calls for penalty for holding old notes after March 31", "title_page": "Ordinance calls for penalty for holding old notes after March 31", "title_rss": "NULL", "source_domain": "in.news.yahoo.com", "text": "New Delhi, Dec 30 (IANS) The ordinance on old notes, that was approved by President Pranab Mukherjee on Friday, calls for a penalty of Rs 10,000 or five times the amount of the demonetised notes held, whichever is higher, after March 31.\n\"To prevent any continued parallel transactions with the specified bank notes by unscrupulous elements, after this period (March 31), holding, transferring and receiving them will attract a fine of Rs 10,000 or five times the amount of the face value of the old notes involved in the contravention, whichever is higher,\" the Finance Ministry said in a statement here on Friday.\nThe ordinance was approved by the Union Cabinet on December 28.\n\"The President of India has approved the promulgation of the Specified Bank Notes (Cessation of Liabilities) Ordinance, 2016 today i.e. on December, 30,\" the statement added.\nThe provision of depositing old high denomination currency with the Reserve Bank of India (RBI) would continue till March 31.\nThe person seeking to deposit old notes with the RBI after December 30 will have to give an explanation as to why he or she could not deposit them earlier.\nThe details of the declaration and statements that are required to be submitted along with the old notes at the time of deposit in RBI offices will be separately announced. Any false declaration will invite a fine of Rs 50,000 or five times the amount of the face value of the old notes, whichever is higher, the statement noted.\nIndian citizens who were outside India from November 9 to December 30 can deposit old notes at specified RBI offices till March 31, it said.\n\"For those citizens of India who are not resident in India, this facility would be available till June 30, in order to allow them adequate time to plan a visit as per their convenience.\n\"The facility would be subject to the regulations of Foreign Exchange Management (Export and Import of Currency) Regulations, 2015,\" the statement said.\nAs per these regulations bringing back such currency into the country is restricted to Rs 25,000 per person. Separate FEMA provisions are applicable to persons in Nepal and Bhutan which would continue to apply.\nAt the time of return to India, the number and denominations of the old notes will need to be declared to the customs authorities at the airports and other entry points. Necessary form for such declaration will be given out by the Central Bureau of Excise and Customs.\n\"After the period of exchange is over, the liabilities of the Reserve Bank and the guarantee of the central government towards the old notes will stand extinguished,\" the statement said.\nThe ordinance is a follow-up to the decision to cancel the legal tender after demonetisation of Rs 500 and Rs 1,000 notes on November 8.\n--IANS\nmm/vd", "url": "https://in.news.yahoo.com/ordinance-calls-penalty-holding-old-notes-march-31-154404450.html", "label": 1}