{"authors": ["Asmita Sarkar"], "date_download": "2019-03-27 14:40:53", "date_modify": "2019-03-27 14:40:53", "date_publish": "2017-01-04 11:23:46", "description": "Two TMC MPs were arrested in the Rose Valley chit fund scam.", "filename": "_rose-valley-chit-fund-case-live-710894_1553697653.html", "image_url": "https://data1.ibtimes.co.in/en/full/631350/tapas-pal.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/ibtimes.co.in/_rose-valley-chit-fund-case-live-710894_1553697653.html", "title": "Rose Valley chit fund case: Alleged TMC workers set BJP's Hooghly office on fire", "title_page": "Rose Valley chit fund case: Alleged TMC workers set BJP's Hooghly office on fire - IBTimes India", "title_rss": "NULL", "source_domain": "ibtimes.co.in", "text": "5:28 pm IST: Alleged TMC workers set BJP office in Hooghly on fire.\n4:43 pm IST:\nSaying with heavy heart that I walked out of the pre budget meet after my presentation, country's growth being sacrificed: Amit Mitra,WB FM pic.twitter.com/L67JUG4bR2 — ANI (@ANI_news) January 4, 2017\n4:40 pm IST:\n4:30 pm IST: TMC leaders including Kalyan Banerjee and Saugata Roy protest after being detained at Tughlaq Road police station.\n3:34 pm IST: TMC MPs wants Union Minister Babul Supriyo to be arrested.\n3:33 pm IST: Trinamool MPs marched to the Prime Minister's office to protest against TMC MLAs' arrests.\n1:40 pm IST: TMC supporters stage a rail-roko protest in Cooch Behar over arrest of MP Sudip Bandyopadhyay.\n11:36 am IST: TMC's Chandrima Bhattacharya files a complaint in Anandpur PS (WB) against CBI over Sudip Bandyopadhyay's arrest.\n11:35 am IST: \"Sudip Bandyopadhyay'll be produced in court after 12 and we will seek bail. He has some health-related issues so will produce medical documents,\" said Sudip Bandyopadhyay's lawyer. \"Allegations are totally baseless. This is political vendetta. So far as Mr Bandyopadhyay is concerned, there's no evidence,\" he added.\n11:29 am IST: TMC MP Sudip Bandyopadhyay's wife registers a complaint in Bidhan Nagar (WB) against CBI alleging that she was not informed of his arrest. In her complaint, Sudip Bandyopadhyay's wife also alleged that none of family members were informed as to where Bandyopadhyay is being taken.\nAlso read: Mamata Banerjee to protest against demonetisation in 10 states, starting Jan 9\n11:14 am IST: TMC workers blocked NH-2 near Asansol in protest against the arrest of TMC MP Sudip Bandyopadhyay. Vehicles are lying stranded there.\n11:10 am IST: \"Let Mamata Banerjee say anything on Sudip Bandyopadhyay's arrest; The law will take its own course,\" said Siddharth Nath Singh, BJP. \"If Mamata Banerjee wants to say it's going to be Trinamool-bandi, let me assure her that BJP is determined and we will remove their 'bhrashtachar-bandi' and 'gunda-bandi' from Bengal,\" he added.\n11:00 am IST: TMC Legislative Assembly members will meet governor today at 12 pm over Sudip Bandyopadhyay's arrest and other issues.\n10:55 am IST: BJP leader Krishna Bhattacharya's house in Uttarpara was allegedly attacked by TMC workers last night. A case has been registered.\nWest Bengal Chief Minister Mamata Banerjee said that she would launching protests against demonetisation in the country. She also said that PM Modi and Amit Shah should be arrested.\nShe blamed them for creating an \"emergency\" situation by clamping down on political parties for speaking against them.\nTapas Pal and Sudip Bandyopadhyay were arrested after the CBI called them in for questioning regarding the Rose Valley chit fund scam. After their arrests, the BJP office in Kolkata was attacked on Tuesday.", "url": "https://www.ibtimes.co.in/rose-valley-chit-fund-case-live-710894", "label": 1}