{"authors": [], "date_download": "2019-03-27 14:34:46", "date_modify": "2019-03-27 14:34:46", "date_publish": "2015-03-15 14:09:44", "description": "Chennai, Mar. 15 (ANI): Hundreds of visually impaired students on Sunday staged a protest against the Tamil Nadu government in Chennai, demanding the filling up of vacancies in the state-run schools and colleges. We want to meet Chief Minister and present nine-point agenda to him,\" said Raja, visually-impaired", "filename": "_tamil-nadu-visually-impaired-students-demand-filling-govt-140944646_1553697286.html", "image_url": "https://s.yimg.com/os/mit/media/p/common/images/favicon_new-7483e38.svg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/in.news.yahoo.com/_tamil-nadu-visually-impaired-students-demand-filling-govt-140944646_1553697286.html", "title": "Tamil Nadu: Visually impaired students demand filling of Govt. posts", "title_page": "Tamil Nadu: Visually impaired students demand filling of Govt. posts", "title_rss": "NULL", "source_domain": "in.news.yahoo.com", "text": "Chennai, Mar. 15 (ANI): Hundreds of visually impaired students on Sunday staged a protest against the Tamil Nadu government in Chennai, demanding the filling up of vacancies in the state-run schools and colleges.\nAccording to reports, there are more than 1,000 vacancies in institutions across Chennai.\nThe protesters also demanded higher unemployment and transport allowances, the doubling of scholarships, and a standard fee for scribes to write exams for them.\n\"We all are graduates and want to be self-dependent. We are similar to any normal human being and we want to avail the job opportunities, for which we are protesting. We are also human beings. We want to meet Chief Minister and present nine-point agenda to him,\" said Raja, visually-impaired protester.\nThe students had cleared the Teacher Eligibility Test (TEE) conducted by the government.\nAs per reports, a 40 percent disability is enough to get assistance in other parts of the country, but the Tamil Nadu government stipulates 60 percent to provide assistance.\nA similar protest took place last year for 12 consecutive days, after which a meet was called by the government. However, it failed to fulfil the demands.\nLast year, the Supreme Court had cleared the three-percent reservation for differently-abled persons to government jobs. (ANI)", "url": "https://in.news.yahoo.com/tamil-nadu-visually-impaired-students-demand-filling-govt-140944646.html", "label": 1}