{"authors": [], "date_download": "2019-03-27 14:35:41", "date_modify": "2019-03-27 14:35:41", "date_publish": "2015-07-05 11:17:24", "description": "Bhopal, July 5 (ANI): The Youth Congress on Sunday staged a protest against the Madhya Pradesh Government over the unusual deaths of witnesses and accused in the VYAPAM scam. The protestors shouted slogans against Chief Minister Shivraj Singh Chouhan calling him a murderer. \"Shivraj Shivraj Singh", "filename": "_vyapam-scam-youth-congress-stage-protest-against-mp-111724683_1553697341.html", "image_url": "https://s.yimg.com/os/mit/media/p/common/images/favicon_new-7483e38.svg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/in.news.yahoo.com/_vyapam-scam-youth-congress-stage-protest-against-mp-111724683_1553697341.html", "title": "VYAPAM scam: Youth Congress stage protest against MP Govt.", "title_page": "VYAPAM scam: Youth Congress stage protest against MP Govt.", "title_rss": "NULL", "source_domain": "in.news.yahoo.com", "text": "Bhopal, July 5 (ANI): The Youth Congress on Sunday staged a protest against the Madhya Pradesh Government over the unusual deaths of witnesses and accused in the VYAPAM scam.\nThe protestors shouted slogans against Chief Minister Shivraj Singh Chouhan calling him a murderer.\n\"Shivraj Shivraj Singh come back to your senses. Shivraj Singh is a murderer\" the protestors said.\n\"Today a journalist has died, More than 45 deaths have taken place in the VYAPAM scam, we will keep on fighting till the time each and every deceased is served justice\" they added.\nChouhan had earlier said that he was writing a letter to the SIT to probe into the journalist's death.\nTalking to the media in Bhopal, Chouhan said the state government has full sympathy with the family of deceased scribe.\nOn Saturday, Akshay Singh, a journalist working for a leading Delhi-based news channel, suddenly took ill and died after having interviewed parents of a girl who had been found dead near railway tracks, after her name figured in the Vyapam scam.\nThe incident took place in Meghnagar near Jhabua town.\nThe journalist was rushed to the civil hospital and later to a private hospital, but doctors failed to revive him. From there he was taken to another hospital in nearby Dahod in Gujarat, where he was declared brought dead. (ANI)", "url": "https://in.news.yahoo.com/vyapam-scam-youth-congress-stage-protest-against-mp-111724683.html", "label": 1}