{"authors": ["Devyani Sultania"], "date_download": "2019-03-27 14:40:38", "date_modify": "2019-03-27 14:40:38", "date_publish": "2016-11-16 11:00:26", "description": "Congress leader Anand Sharma also blamed the government for being insensitive to the problems of the common man.", "filename": "_winter-session-live-we-are-ready-discuss-all-issues-says-pm-modi-outside-parliament-704176_1553697638.html", "image_url": "https://data1.ibtimes.co.in/en/full/614603/gst-bill-parliament-rajya-sabha-india-foreign-media-govt-modi-discussion-debate-bills-legislation.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/ibtimes.co.in/_winter-session-live-we-are-ready-discuss-all-issues-says-pm-modi-outside-parliament-704176_1553697638.html", "title": "Opposition accuses govt of unleashing 'economic anarchy' on demonetisation", "title_page": "Opposition accuses govt of unleashing 'economic anarchy' on demonetisation - IBTimes India", "title_rss": "NULL", "source_domain": "ibtimes.co.in", "text": "Opposition parties attacked Prime Minister Narendra Modi on the first day of the winter session of Parliament on Wednesday accusing him of having selectively leaked the decision to demonetise currency notes of Rs 500 and Rs 1,000 to their \"friends in BJP\". They also demanded that the Centre make public the names of those who had bought gold and foreign exchange costing over Rs 1 crore since April 2016.\nThe debate, first started by Congress leader Anand Sharma, was taken up after debates on other businesses were suspended to discuss the demonetisation issue and its impact on the common man.\nSharma accused Modi of being insensitive to the problems of the general public of the country and demanded that the PM disclose the sources from where he received Rs 23,000-24,000 crore (estimate by the International Money Watch Group) for the Lok Sabha elections. He also raised questions as to why the list of people who have stashed away their black money abroad was not disclosed and whether money for his rally in Uttar Pradesh's Ghazipur came from cheque and credit card payments.\nSharma also asked Modi not to tarnish the image of the country in his resolve to end black money and that a warning should have been given to the public before taking such a big step.\n\"Eighty-six percent of the currency in the markets was 500/1000 notes. It was scrapped by just one announcement. Was it all black? The world got a message that India runs on black money. This is sad. Take a decision, but don't insult the nation... You have made the entire country criminals overnight,\" Sharma said.\nHe also raised questions as to how giving a warning to the public about demonetisation would have helped terrorists, counterfeiters and black money holders.\n\"We are a constitutional democracy. Without any notice or warning, the government implemented the rule and made everyone criminal. They say if we would have announced earlier, it would have helped terrorists, counterfeiters and those with black money... It is a fact that our economy runs on agriculture. Does the farmer, who puts food on our table, bring home black money? It's a strange logic. Earlier, when notes were recalled, people were given time. Which terrorist would go to the RBI with cash in sacks to get it exchanged?\" Sharma asked.\nSharma added that the decision to demonetise the currency notes has unleashed \"economic anarchy\" in the country with people standing in long queues outside banks and ATMs to meet their daily requirements. He compared the Rs 2,000 note released by the government to the paper on which 'churan' is sold.\nHe also asked the prime minister to name the forces trying to eliminate him, referring to Modi's speech in Goa a few days ago where he said that there were certain groups that wanted him eliminated.\nSharma said that Modi had kept banks and ATMs shut to make arrangements for new notes to be dispersed to the public. But that didn't happen with long queues being formed outside banks and ATMs and several people dying due to the move as well. Several ATMs were out of cash very soon.\n\"If you are trying to give the impression that it is this government who has taken all actions to fight black money then you are wrong. The PM does not have the grace to admit that it was the previous government, and you are just continuing. Today, you have created an environment where you cannot ask questions because if you do, then questions are raised on your patriotism,\" Sharma said.\n\"Which law gives you the right to stop us from withdrawing our money from our own bank account?\" Sharma added.\nSharma said that farmers, daily wagers and workers do not carry credit cards, cheque books or card swipe machines and that even the most developed countries had not achieved the objective of a cashless economy. If they had, US and European banks would have stopped printing money.\nReferring to Finance Minister Arun Jaitley's statement in Parliament that fake currency was 0.02 percent of the total currency in circulation, Sharma said: \"If 0.02 percent by government admission is counterfeit currency, how can that be made the base to remove 86 percent of currency in circulation?\" He added that the move had caused the unemployment of several farmers and labourers, a statement that was echoed by other speakers as well.\nAfter Sharma had finished speaking, BSF Chief Mayawati and Leader of Opposition in the Rajya Sabha demanded that PM Modi be present in the House to hear the arguments and questions of the Opposition parties and address them. Mayawati even said that Jaitley looked a little \"dukhi.\"\nAzad demanded that the PM should at least \"hear out the feelings of six-seven main parties, otherwise there is a mismatch. The feelings of opposition members should be heard by PM. I demand that at least he hears them out and sit in the House at least today. We can wait for him to come.\"\nRam Gopal Yadav (expelled SP leader) joined Sharma to accuse the PM of having selectively leaked the information on demonetisation and termed it as a scam while demanding a thorough probe into it.\n\"A BJP leader in Punjab had tweeted on November 5 about the new Rs 2000 note. How did this happen? This is an issue of concern. There is a scam in this. This should definitely be probed,\" he said. He added that a committee should be set up to investigate the suspicious \"leak\" of information from the government's side as everyone in India is suffering to meet their daily requirements.\n\"Elections are not fought with money power. You cannot win elections through money power. No one can win elections like that. Elections are won only by winning the hearts of people... Do not hold elections now. If you meet and ask for votes from housewives in villages, they will beat you up with 'belan' and you will have to embalm your back with turmeric,\" Yadav said adding that the BJP might lose elections if they held early polls.\nYadav also demanded that the Centre allow farmers to use old currency notes to buy fertilisers and seeds since the prices of pulses had gone down to Rs 1,000 from Rs 1,500 per quintal.\nYadav also said that forces trying to harm the prime minister must be found out and all precautionary steps be taken. He also alleged that several abusive and hateful messages were being shared on social media against Modi which is extremely shameful.\n\"People have been abusing the Prime Minister of this country on social media... No one should be allowed to speak against the prime minister in such a manner... The cyber cell of this country needs to be strong enough to investigate where these messages are coming from,\" Yadav said.\nJD(U) leader Sharad Yadav, who spoke next, alleged that a loan of Rs 7,200 crore by Vijay Mallya was also written off by the bank due to the government's decision of allowing banks to write off loans taken by people.\nCPI(M) leader Sitaram Yechury said that only 2.6 crore people out of the 130 crore population have credit cards.\n\"What is called demonetisation is 86 percent of our cash transactions. The country today is living on cash transactions of 14 percent... No one wants black money. We all want to eliminate it. The World Bank is saying that around 21 percent of our economy is black money. This is more than one-fifth of our economy... How will demonetisation stop the production of counterfeit notes? We already saw one in Bengaluru. Monitor your electronic transfers to stop terror-funding,\" Yechury said.\nHe also took a dig at Modi and narrated the famous quote by Queen Marie Antoinette during the French revolution in which she had said that people can eat cakes when they don't have bread. \"We have Modi Antoinette who says 'If you don't have paper, use plastic'\".\nYechury also demanded that \"the government must allow the use of old notes till alternative measures are ready. Facilities to nationalised banks should be immediately extended to corporate banks in rural areas. The suspicious \"leak\" must also be investigated.\"", "url": "https://www.ibtimes.co.in/winter-session-live-we-are-ready-discuss-all-issues-says-pm-modi-outside-parliament-704176", "label": 1}