{"authors": ["Kamlendra Kanwar"], "date_download": "2019-03-27 14:29:05", "date_modify": "2019-03-27 14:29:05", "date_publish": "2019-02-06 09:23:58", "description": "There are few people to match the stormy petrel of West Bengal politics Mamata Banerjee in political theatrics.", "filename": "analysis_apex-court-can-exercise-a-sobering-influence_1453045_1553696945.html", "image_url": "https://www.freepressjournal.in/wp-content/uploads/2019/02/Mamata-Banerjee.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/freepressjournal.in/analysis_apex-court-can-exercise-a-sobering-influence_1453045_1553696945.html", "title": "Apex Court can exercise a sobering influence", "title_page": "Apex Court can exercise a sobering influence", "title_rss": "NULL", "source_domain": "freepressjournal.in", "text": "There are few people to match the stormy petrel of West Bengal politics Mamata Banerjee in political theatrics. Her latest dharna to ‘safeguard the complete breakdown of constitutional framework’ when she blocked the CBI from interrogating Kolkata police commissioner Rajeev Kumar in the Saradha chit fund case was no flash in the pan.\nConfronted by a Supreme Court order on Tuesday which directed Rajeev Kumar to appear before the CBI and join the investigations, Mamata, true to her style, interpreted the order to suit herself, describing it as her ‘moral victory’ which was preposterous but not unexpected from one who juggles facts routinely to falsely claim vindication. The CBI had stated that it had issued three notices to Rajeev Kumar on October 18, 2017, October 23, 2017 and August 18, 2018. However, despite these notices, Kumar didn’t join the investigation.\nSignificantly, Rajeev Kumar has been told to appear before the CBI in Shillong, apparently to ensure that there are no untoward incidents inside or outside the court room in the seat of power of the Trinamool. The apex court, however, shielded Rajeev Kumar from arrest until the next date of hearing on a contempt petition against him — February 20 — which can be interpreted as a small victory for Mamata who has been defending the West Bengal police chief vociferously.\nIn one of the sensational allegations against Rajeev Kumar, the CBI told the court that “crucial evidence such as laptops, mobile phones, etc were handed over to the main accused in Saradha scam case by the investigating officer of West Bengal police working under direct supervision of Police Commissioner Rajeev Kumar.”\nThis is a serious charge on which Kumar’s defence would be crucial in staving off his arrest. If, as the CBI claims, Kumar was a party to destruction of evidence in the chit fund case, it would lend gravity to the charges against him. Reacting on the top court’s order, Mamata said that, “I am not pleading for Rajeev Kumar alone, I am pleading for millions of people.”\nGiven to talking in hyperboles she said, “It’s a victory of the common man of the country.” Evidently, this was a step designed to steer clear of a negative fallout of the commissioner being found to have done irregular things which the BJP is alleging. Nearly three decades ago, Mamata had been hit with a stick by a young CPM activist when that party was in power which led to skull fracture and had caused her month-long hospitalisation.\nIt was the sympathy wave that she drummed up that helped catapult her to the centre of West Bengal politics and triggered the eclipse of the CPM in the State. At that point, Mamata was in the Congress which she later left to set up her own party, the Trinamool Congress. Systematically, the clever rabble-rouser that she is, Mamata virtually decimated the Left Front which had ruled West Bengal for nearly three decades. Then, she set her eyes on the Congress, reducing it to a virtual also-ran.\nBut the wily Mamata had not reckoned with the BJP and its leader Narendra Modi who has been increasing the vote share of his party with rare skill and shrewdness. This time around, Mamata has sought to position herself as the victim again, contending that Prime Minister Modi, BJP President Amit Shah and National Security Adviser Ajit Doval were in conspiracy to influence the outcome of the general elections in West Bengal.\nBy getting various opposition parties to rally to her support, she is, apparently, building herself up for challenging Modi at the Centre after the upcoming general elections. The flashpoint in the current imbroglio came when a 42-member CBI team descended on the official residence of the police commissioner and sought to grill him on his alleged involvement in the chit fund scam.\nMamata swung into action and prevented the CBI team from confronting the police commissioner. In fact, the CBI team was whisked away to the nearest police station where they were detained for some time. Even as Mamata sat on dharna for the third day and the supporting Opposition leaders called on her at the site, came the Supreme Court order deprecating such tactics. Her counterpart in New Delhi, Arvind Kejriwal, had adopted the same tactic soon after he came to power and had been ticked off by the apex court.\nWith the apex court having deliberated on the alleged defiance by Rajeev Kumar under Mamata’s shield, it seems unlikely that Mamata would precipitate things further and risk incurring the wrath of the court. While keeping up a show of bravado against the Centre, she would predictably shy away from confronting the court.\nWhen, a few months ago, Andhra chief minister Chandrababu Naidu defied the CBI and sought to make political capital of it, the Centre should have put its foot down but it reckoned that it was on slippery ground. It was surmised that without the permission of the State government, the CBI could not take up an investigation on its soil. The more the Centre delays this issue the more emboldened the states would become.\nThe highest court needs to spell out the constitutional position more clearly. Evidently, the next flashpoint would be the denial of permission to Uttar Pradesh chief minister Yogi Adityanath by the West Bengal government to hold rallies in that state and to allow his helicopter to land there. Until the elections, the malice and rancour on both sides would continue. Only the apex court can exercise a sobering influence.\nKamlendra Kanwar is a political commentator and columnist. He has authored four books.", "url": "https://www.freepressjournal.in/analysis/apex-court-can-exercise-a-sobering-influence/1453045", "label": 1}