{"authors": [], "date_download": "2019-03-27 14:29:08", "date_modify": "2019-03-27 14:29:08", "date_publish": "2019-02-04 00:00:00", "description": "DNA Edit: Citizenship Bill – There is little point in pushing an unpopular legislation - In this case, while the Bill has been passed in the Lok Sabha, it is awaiting clearance in the Rajya Sabha, where the ruling party does not have the numbers", "filename": "analysis_editorial-dna-edit-citizenship-bill-there-is-little-point-in-pushing-an-unpopular-legislation-2716076_1553696948.html", "image_url": "https://cdn.dnaindia.com/sites/default/files/styles/full/public/2019/02/04/786850-singhrajnath-pti-092518.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/dnaindia.com/analysis_editorial-dna-edit-citizenship-bill-there-is-little-point-in-pushing-an-unpopular-legislation-2716076_1553696948.html", "title": "DNA Edit: Citizenship Bill - There is little point in pushing an unpopular legislation", "title_page": "DNA Edit: Citizenship Bill – There is little point in pushing an unpopular legislation", "title_rss": "NULL", "source_domain": "dnaindia.com", "text": "It is good that the central government has decided not to push through the Citizenship Bill against all odds. Prudence demands that when a proposed legislation is leading to huge public outrage, it should be subjected to another round of dialogue and discussion. That is the way of democracies. So, the government has designated Union Home Minister Rajnath Singh to talk to different political parties, but even more significant, to parties in the North East, who are directly going to bear the brunt of any illogical legislation. All stakeholders have been encouraged to put their points across to the Home Minister and these consultations will help the government in arriving at a decision on the future of the Bill.\nThe Bill, which has led to widespread protests, among others by BJP’s own allies in the North East, provides for according Indian citizenship to Hindus, Jains, Christians, Sikhs, Buddhists and Parsis from Bangladesh, Pakistan and Afghanistan after six years of residence in this country. India’s system of checks and balances is so foolproof that there is virtually no chance of pushing through this or any other legislation unless all round political consent has been secured. In this case, while the Bill has been passed in the Lok Sabha, it is awaiting clearance in the Rajya Sabha, where the ruling party does not have the numbers.\nWhile that in itself may not have been a deterrent against introducing the Bill in the Upper House, the prospect of it facing resistance from allies in an election year is too daunting a proposition even for the BJP. Former Assam chief minister Prafulla Kumar Mahanta, a former BJP ally, has warned that the situation in Assam would turn volatile if the Bill were to get Rajya Sabha clearance. The ball, clearly, is in the ruling party’s court.", "url": "https://www.dnaindia.com/analysis/editorial-dna-edit-citizenship-bill-there-is-little-point-in-pushing-an-unpopular-legislation-2716076", "label": 1}