{"authors": [], "date_download": "2019-03-27 14:29:07", "date_modify": "2019-03-27 14:29:07", "date_publish": "2017-01-07 04:54:01", "description": "As part of its nationwide campaign against demonetisation, the Congress held a demonstration at the Deputy Commissioner office in Sector 17.", "filename": "article_cities_chandigarh__1553696947.html", "image_url": "https://images.indianexpress.com/2017/01/congress-protest-rally-punjab1.jpg?w=480", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/indianexpress.com/article_cities_chandigarh__1553696947.html", "title": "Five injured, 250 detained during Congress protest", "title_page": "\n\t\t\t\tFive injured, 250 detained during Congress protest | Cities News, The Indian Express\t\t\t", "title_rss": "NULL", "source_domain": "indianexpress.com", "text": "Five Congress members got injured while 250 others were detained when they were holding a protest against demonetisation on Friday. As part of its nationwide campaign against demonetisation, the Congress held a demonstration at the Deputy Commissioner office in Sector 17. The police had to use water cannons. The leaders demanded an inquiry against Prime Minister Narendra Modi.\nWatch What Else Is Making News?\nAdvertising\nAddressing the workers, former railway minister Pawan Kumar Bansal said the Prime Minister wanted 50 days’ time post-demonetisation for the situation to stabilise but nothing improved so far. The poor, farmers, labourers, shopkeepers and the entire unorganised sector had been severely affected by the move.\n“By declaring 86 per cent of India’s currency illegal, PM Modi had hit 99 per cent of the honest and hard-working people of the country while claiming to target 1 per cent of the black money hoarders. He has brought development to a standstill while plunging the nation into a state of financial anarchy,” Bansal added.\nThe Congress members pressed for making public information on how much black money had been unearthed since November 8, 2016, the total economic loss to the nation on account of demonetisation, the number of jobs and lives lost and why the government had not paid compensation to the families of the deceased.\nBesides, the protesters said that the government should mention the names of all the people, institutions and entities that deposited Rs 25 lakh or more in bank accounts in the six months preceding November 8.", "url": "https://indianexpress.com/article/cities/chandigarh/five-injured-250-detained-during-congress-protest/", "label": 1}