{"authors": [], "date_download": "2019-03-27 14:35:06", "date_modify": "2019-03-27 14:35:06", "date_publish": "2017-07-19 14:12:00", "description": "Farmers from Tamil Nadu have once again gathered at the Jantar Mantar demanding drought relief package and farm loan waiver from the government. Congress leader Mani Shankar Aiyar joined the farmers at Jantar Mantar to support them in their cause.", "filename": "article_india__1553697306.html", "image_url": "https://images.indianexpress.com/2017/04/tamil-nadu-farmer-protest759.jpg?w=759", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/indianexpress.com/article_india__1553697306.html", "title": "Mani Shankar Aiyar joins protesting Tamil Nadu farmers at Jantar Mantar", "title_page": "\n\t\t\t\tMani Shankar Aiyar joins protesting Tamil Nadu farmers at Jantar Mantar | India News, The Indian Express\t\t\t", "title_rss": "NULL", "source_domain": "indianexpress.com", "text": "Senior Congress leader Mani Shankar Aiyar met with the farmers from Tamil Nadu who are protesting at Jantar Mantar in Delhi demanding farm loan waiver and a drought relief package from the government among other demands. After a 41-day protest in the national capital in April, the farmers whose demands are yet to be met, have returned to Jantar Mantar again. The veteran Congress leader, after meeting with the farmers, said, “These poor people are wandering between Delhi and Chennai but not getting any decent answer, so they have again come here.”\nAdvertising\nThe farmers, who arrived in Delhi over the weekend, were earlier detained by the police after they tried to stage a demonstration near Prime Minister Narendra Modi’s residence at Lok Kalyan Marg. They were later taken to Parliament Street police station.\nIn the first phase of their protest in April, the farmers had resorted to a unique way of registering their anger and demands by shaving their heads, holding mice and snakes in their mouths, partially shaving their mustaches and even flogged themselves. The farmers are demanding a Rs 40,000 crore drought relief package, farm loan waiver and setting up of the Cauvery Management Board after Tamil Nadu faced one of the worst droughts in over a century with 60 per cent deficit in annual rainfall.\nFarmers told the media that they resumed their protests in the national capital as they felt cheated by the state and central government which had assured them that their jewelleries and assets will not be sold by banks. They said the banks have not started selling their jewelleries and are even planning to sell their lands now. Earlier this month, the Supreme Court had stayed an order by the Madras High Court that had in April extended the loan waiver to all farmers even though the scheme intended to help only small and marginal farmers with 5 acres of land.", "url": "https://indianexpress.com/article/india/mani-shankar-aiyar-joins-tamil-nadu-farmers-demanding-drought-relief-package-at-jantar-mantar-4757630/", "label": 1}