{"authors": ["Pradeep Kaushal"], "date_download": "2019-03-27 14:18:17", "date_modify": "2019-03-27 14:18:17", "date_publish": "2016-03-09 01:06:43", "description": "'It is cosmetic and the problems still persist,' NCP member Tariq Anwar said.", "filename": "article_india_india-news-india__1553696297.html", "image_url": "https://images.indianexpress.com/2016/02/prabhu-480.jpg?w=480", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/indianexpress.com/article_india_india-news-india__1553696297.html", "title": "Promised changes in Railways are cosmetic: Opposition MPs", "title_page": "\n\t\t\t\tPromised changes in Railways are cosmetic: Opposition MPs | India News, The Indian Express\t\t\t", "title_rss": "NULL", "source_domain": "indianexpress.com", "text": "The Opposition attacked the railway budget in the Lok Sabha, dismissing the changes mooted by the government as cosmetic and saying the grand plans it has floated lack financial backing.\nAdvertising\n“It is cosmetic and the problems still persist,” NCP member Tariq Anwar said. The government had increased fares in November, well before the railway budget, he pointed out. He recalled that Narendra Modi as Gujarat chief minister had protested to then PM Manmohan Singh when the UPA government had hiked fares in the middle of the year.\nJayprakash Narayan Yadav of the RJD said problems like security and food quality had not been addressed yet. Former minister K H Muniyappa of the Congress said Railways Minister Suresh Prabhu had not enlightened people on how he plans to execute the announcements, or on funding.\nDarshana Jardosh of the BJP said there had been tremendous work in the railways during the last two years. Ranjanben Bhatt of the BJP demanded the introduction of a new train to connect Vadodara with Varanasi, the two constituencies Narendra Modi had contested from.\nC Mahendran of the AIADMK demanded a new train, Annamalai Express in, Tamil Nadu. Tapas Mandal of the Trinamool Congress said the rail budget had favoured a few states but West Bengal had been overlooked. And former prime minister H D Deve Gowda said, “When I was in office, I had approved 14 new lines (in Karnataka). They are not yet completed”.\nMany members tabled their speeches.", "url": "https://indianexpress.com/article/india/india-news-india/promised-changes-in-railways-are-cosmetic-opposition-mps/", "label": 1}