{"authors": [], "date_download": "2019-03-27 14:41:01", "date_modify": "2019-03-27 14:41:01", "date_publish": "2017-05-29 11:53:04", "description": "Following the Centre's new rules with regard to the buying and selling of cattle, a number of protests have sprung up across many states. After Kerala hosted beef festivals across the state, IIT Madras too conducted a beef festival on Sunday night as a mark of protest.  A student from IIT Madras confirmed that a beef festival was conducted in the campus around 7:30 pm. In a", "filename": "article_after-kerala-now-tn-iit-madras-students-hold-beef-fest-protest-new-cattle-trade-rules-62778_1553697661.html", "image_url": "https://www.thenewsminute.com/sites/default/files/beef%20fest1.jpg", "language": null, "localpath": "/home/raj/news-please-repo//data/2019/03/27/thenewsminute.com/article_after-kerala-now-tn-iit-madras-students-hold-beef-fest-protest-new-cattle-trade-rules-62778_1553697661.html", "title": "After Kerala, now TN: IIT Madras students hold beef fest to protest new cattle trade rules", "title_page": "After Kerala, now TN: IIT Madras students hold beef fest to protest new cattle trade rules | The News Minute", "title_rss": "NULL", "source_domain": "thenewsminute.com", "text": "Beef fest\nThere were speculations that the students were arrested for celebrating the beef festival.\nFollowing the Centre's new rules with regard to the buying and selling of cattle, a number of protests have sprung up across many states. After Kerala hosted beef festivals across the state, IIT Madras too conducted a beef festival on Sunday night as a mark of protest.\nA student from IIT Madras confirmed that a beef festival was conducted in the campus around 7:30 pm. In a video doing the rounds on social media, students can be seen eating beef curry with bread.\nThe new rules under the Prevention of Cruelty to Animals Act ban the sale of cattle for slaughter in animal markets.\nA spokesperson from the IIT Madras however, said that the institute has been closed for the last one week including the administrative section and they do not have any information about it.\nThere were speculations that the students were arrested for celebrating the beef festival. However, when The News Minute contacted the Kotturpuram police, they said that there have been no arrests and they also have no information about the incident.\nOn Saturday, there were various beef fests in different parts of Kerala including Thiruvananthapuram, Kollam, Malappuram and Ernakulam. The Students’ Federation of India (SFI) had organised beef festivals in all districts of their different units.\nRead: Beef fests held across Kerala in protest, people turn out in large numbers", "url": "https://www.thenewsminute.com/article/after-kerala-now-tn-iit-madras-students-hold-beef-fest-protest-new-cattle-trade-rules-62778", "label": 1}