{"authors": [], "date_download": "2019-03-27 14:35:07", "date_modify": "2019-03-27 14:35:07", "date_publish": null, "description": null, "filename": "article_jagan-mohan-reddys-_66e3c9c6f12fcecb1dd7d4ab79bde592_15909928_1553697307.html", "image_url": "http://www.merinews.com/upload/thumbimage/1443190626177.jpeg", "language": null, "localpath": "/home/raj/news-please-repo//data/2019/03/27/merinews.com/article_jagan-mohan-reddys-_66e3c9c6f12fcecb1dd7d4ab79bde592_15909928_1553697307.html", "title": "Jagan Mohan Reddy's fast for special status to Andhra postponed", "title_page": "Jagan Mohan Reddy's fast for special status to Andhra postponed", "title_rss": "NULL", "source_domain": "merinews.com", "text": "YSR Congress party said that the proposed indefinite fast of its leader YS Jagan Mohan Reddy on September 26 to demand special status for Andhra Pradesh has to be postponed as the TDP Government has denied permission.\nParty leader Peddi Reddy, according to a statement posted over party's official website, said that YSRCP President, YS Jagan had to postpone his plan due to the conspiracies and plans made by Chandrababu Naidu government..\nHe added that in relation to the strike they would approach High court. After approval from the High Court, the hunger strike will be planned. The new dates will be announced for YS Jagan's fast, said Reddy.\nHe said that the Chief Minister Chandrababu Naidu remarks on their leader's fast are highly objectionable, \"It shows that the Government is not inclined towards getting the special status for its own reasons and wants to scuttle any move by anyone in that direction.\"\nHe reminded that Chandrababu Naidu himself has gone on fast at Delhi and also at MLA quarters and Tamil Nadu Chief Minister J Jayalalithaa went on a hunger strike on the Cauvery water issue. He asserted that they have full faith in judiciary and the fast will be taken up once we get a clearance from the court. Till such a date, the indefinite fast stands postponed.\nHe accused that denying permission to the indefinite fast is an act of irresponsibility as people have the right to express their dissent and TDP has been cold-shouldering the special status issue and the central aid which was announced yesterday is a pittance.", "url": "http://www.merinews.com/article/jagan-mohan-reddys-fast-for-special-status-to-andhra-postponed/15909928.shtml", "label": 1}