{"authors": [], "date_download": "2019-03-27 14:40:27", "date_modify": "2019-03-27 14:40:27", "date_publish": "2016-04-23 14:43:04", "description": "256 districts across 12 states in India have been hit by drought this year, affecting a staggering 330 million people in the country. Even as temperatures continue to soar and the situation of water-scarcity intensifies, several of our ministers seem either oblivious to or are simply unaffected by the situation.", "filename": "article_india-facing-water-crisis-these-politicians-waste-water-because-they-cant-take-dusty-roads_1553697627.html", "image_url": "https://www.thenewsminute.com/sites/default/files/water%20tanker%20pti%20600x400.jpg", "language": null, "localpath": "/home/raj/news-please-repo//data/2019/03/27/thenewsminute.com/article_india-facing-water-crisis-these-politicians-waste-water-because-they-cant-take-dusty-roads_1553697627.html", "title": "India is facing a water crisis, but these politicians waste water because they can't take dusty roads", "title_page": "India is facing a water crisis, but these politicians waste water because they can't take dusty roads | The News Minute", "title_rss": "NULL", "source_domain": "thenewsminute.com", "text": "Several of our ministers seem either oblivious to or are simply unaffected by the severe situation of water scarcity in the country.\nPeople collect water from a water tanker at on the outskirts of Mumbai; PTI Photo\n256 districts across 12 states in India have been hit by drought this year, affecting a staggering 330 million people in the country.\nEven as temperatures continue to soar and the situation of water-scarcity intensifies, several of our ministers seem either oblivious to or are simply unaffected by the situation.\nHere’s a look at some recent incidents where thousands of litres of water were wasted on helipads and roads prior to the ministers’ visit in the drought-affected areas.\nChandrababu Naidu\nRecent to join the bandwagon is Andhra Pradesh Chief Minister Chandrababu Naidu whose rally at Anantpur on Thursday was preceded by a water wash of the helipad where he and other VIPs landed.\nAccording to NDTV, nearly 20,000 litres of water were poured in the area to avoid a dust storm from rising when choppers landed.\nIronically, Naidu was in Anantpur, one of the driest regions in the country, to attend a public meeting where he encouraged people to take a pledge to conserve water.\nManohar Lal Khattar\nHaryana Chief Minister Manohar Lal Khattar came under fire after a thousand litres of water was reportedly used to prepare a helipad- at a time when the state is facing severe water shortage- for Khattar's chopper in Yamunanagar on Wednesday.\nHowever, Deputy Commissioner Yamunanagar, S S Phulia, said there was no \"wastage of water, as was being potrayed by a section of media.\"\n\"There is no wastage of water in preparing the helipad. Only that much water was used as was required for smooth landing of the chopper,\" Phulia said.\nSiddaramiah\nVarious sections of the media as well as social media platforms went into a state of uproar, when on Monday Karnataka Chief Minister reportedly drove through roads, in the drought-hit state, on which water had been sprinkled.\nThe CM was visiting Bagalkot district as a part of his tour inspecting drought-hit districts.\nAccording to several reports, the road to the village was sprinkled with water before the chief minister’s arrival in order to prevent dust from rising up as his convoy zoomed past.\nAkhilesh Yadav\nLocal officials of Lalitpur emptied thousands of litres of water to ensure a dust-free makeshift helipad on Tuesday at a time when this area of Bundelkhand is witnessing drought, according to PTI.\nYadav visited Lalitpur to review the drought situation and provide relief measures. Lalitpur is part of the Bundelkhand region, which is half in Uttar Pradesh and half in Madhya Pradesh and is reeling under severe water crisis.\nEknath Khadse\nLast week, Maharashtra Revenue Minister Eknath Khadse was embroiled in a controversy after 10,000 litres of water were used to prepare a helipad for his visit to drought-hit Latur district.\nLatur has been in news of late for its severe water shortage and water is being sent into the district via water-trains.\nAlso read: Photo essay: The severe water crisis haunting Maharashtra's Marathwada\nNews, views and interviews- Follow our election coverage.\nClick TN Election Special\nClick Kerala Election Special", "url": "https://www.thenewsminute.com/article/india-facing-water-crisis-these-politicians-waste-water-because-they-cant-take-dusty-roads", "label": 1}