{"authors": ["Press Trust Of India"], "date_download": "2019-03-27 14:29:17", "date_modify": "2019-03-27 14:29:17", "date_publish": "2015-04-07 15:22:13", "description": "Read more about Protest against frequent change in governors in Mizoram on Business Standard. Mizoram students body Mizo Zirlai Pawl (MZP) today picketed in front of central government offices to protest against the frequent change of governors in the state, which it called 'gubernatorial dumping ground of unwanted governors'.\tExcept All", "filename": "article_pti-stories_protest-against-frequent-change-in-governors-in-mizoram-115040700574_1_1553696957.html", "image_url": "https://bsmedia.business-standard.com/_media/bs/img/article/default/1150407/full-115040700574.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/business-standard.com/article_pti-stories_protest-against-frequent-change-in-governors-in-mizoram-115040700574_1_1553696957.html", "title": "Protest against frequent change in governors in Mizoram", "title_page": "Protest against frequent change in governors in Mizoram | Business Standard News", "title_rss": "NULL", "source_domain": "business-standard.com", "text": "students body Mizo Zirlai Pawl (MZP) today picketed in front of central government offices to protest against the frequent change of governors in the state, which it called 'gubernatorial dumping ground of unwanted governors'.\nExcept All Radio and Doordarshan, which were exempted, all central government offices here remained closed for the day and black flags were hoisted in their premises by MZP volunteers.\nMZP had staged a protest demonstration in front of here on April 4 just before Governor Keshari Nath Tripathi, given additional charge of Mizoram, was sworn-in.\nIt is scheduled to stage another protest demonstration on the issue during President Pranab Mukherjee's visit to the state on April 9 and April 10 to attend University convocation.\nMZP President Lalhmachhuana told PTI that a memorandum would be submitted to the President protesting against the frequent change of governor of the state.\n\"If the Centre is going to continue to use as a gubernatorial dumping ground of unwanted governors, we demand that the Constitution be amended to make a special provision which would enable governing of the state without a governor,\" Lalhmachhuana said.\nCentral Committee of Young Mizo Association issued a press statement during the day condemning frequent change of governors and urged the Centre to immediately appoint a regular one for the state.\nMizoram has had seven governors during the last nine months with many of them being sacked just a few days after being transferred to the state.", "url": "https://www.business-standard.com/article/pti-stories/protest-against-frequent-change-in-governors-in-mizoram-115040700574_1.html", "label": 1}