{"authors": ["Press Trust Of India"], "date_download": "2019-03-27 14:41:03", "date_modify": "2019-03-27 14:41:03", "date_publish": "2018-01-25 17:15:24", "description": "Read more about Following are PTI's top/expected on Business Standard. Following are PTI's top/expected stories at 5pm:STORIES IN THE PIPELINENew Delhi - Stories on ASEAN-India Commemorative Summit.STORIES ON THE WIRE:NATION:DEL17 PREZ-ASEANIndia stands with ASEAN for rules-based regional architecture: PrezNew", "filename": "article_pti-stories_following-are-pti-s-top-expected-118012501047_1_1553697663.html", "image_url": "https://bsmedia.business-standard.com/_media/bs/img/article/default/1180125/full-118012501047.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/business-standard.com/article_pti-stories_following-are-pti-s-top-expected-118012501047_1_1553697663.html", "title": "Following are PTI's top/expected", "title_page": "Following are PTI's top/expected | Business Standard News", "title_rss": "NULL", "source_domain": "business-standard.com", "text": "Following are PTI's top/expected stories at 5pm:\n- Stories on ASEAN- Commemorative Summit.\nSTORIES ON THE WIRE:\nNATION:\nDEL17 PREZ-ASEAN\nstands with ASEAN for rules-based regional architecture: Prez\nNew Delhi: stands \"shoulder-to-shoulder\" with ASEAN in pursuit of a rules-based regional architecture that is open, inclusive and equitable, said today.\nDEL10 POL-CHIDAMBARAM-\nChidambaram hits out at after mob violence, moral policing\nNew Delhi: today took a swipe at for his attempts to woo investors at Davos, saying on the day the invited world business to India, Ahmedabad was hit by mob violence and moral policing was witnessed in\nDEL 9 DL-KEJRIWAL-CHILDREN-\nDalits done, 'they' are entering our homes, targeting our children, says Kejriwal\nNew Delhi: The forces that \"killed Muslims and burnt Dalits\" are now \"intruding into our homes, coming after our children\", Chief Minister said today, condemning the attack on a school bus by a mob protesting the release of 'Padmaavat' in Gurgaon.\nDEL7 PADMAAVAT-UP\nUP on alert as cinemas screen 'Padmaavat'\nLucknow: Tension was palpable across cinema halls in where the controversial film \"Padmaavat\" opened today with armed policemen stationed at vantage points and fire tenders waiting in readiness in case of trouble.\nDEL6 PADMAAVAT-PROTEST-RJ\nNo 'Padmaavat' show in Rajasthan, protests continue\nJaipur: Arterial roads were blocked, shops vandalised and bike rallies taken out today as protests against \"Padmaavat\" continued in parts of Rajasthan, where theatre owners refused to screen the film in view of the law and order situation.\nDEL5 ASEAN-PM-BILATERALS\nModi holds talks with Thai counterpart Gen Prayut\nNew Delhi: Ahead of the India-ASEAN summit, Prime Minister today held bilateral talks with his counterpart from Thailand Gen Prayut Chan-o-cha on strengthening cooperation in strategic areas of trade, defence and security.\nDEL4 PM-VOTERS DAY\nPM Modi urges people to register themselves as voters\nNew Delhi: today urged the people eligible to vote to register themselves as voters in large numbers to strengthen the Indian democracy.\nBOM5 GJ-PADMAAVAT-BANDH\nKarni Sena's bandh evokes tepid response in\nAhmedabad: The nationwide bandh call given by Karni Sena against the release of film \"Padmaavat\" today failed to make any major impact in Gujarat, as educational institutions, offices and markets remained open in most parts of the state.\nBOM1 MH-PADMAAVAT-SECURITY\nPadmaavat: Tight security outside theatres in\nMumbai: The Police is maintaining a strict vigil outside theatres in the wake of protests against the film \"Padmaavat\" which is set tot hit the screens today.\nCAL1 WB-PADMAAVAT-SECURITY\nSecurity tightened in Kolkata as 'Padmaavat' hits theatres\nKolkata: The said today that it has made elaborate security arrangements across the city, especially around malls and multiplexes, to ensure no violence happens after the release of controversial film 'Padmaavat'.\nDES 7 UP-IIT-KANPUR RAPE\nIIT-K girl student alleges rape by IAF\nKanpur: An IIT-Kanpur girl student has accused an Indian Air Force of raping her repeatedly after promising marriage.\nDES6 UP-CASES-WITHDRAWAL-MINISTER\nNot all cases agnst politicians will be withdrawn: UP Min\nLucknow: Seeking to clear the confusion over the proposed withdrawal of 20,000 \"politically-motivated\" cases in Uttar Pradesh, has said that not all cases filed against politicians will be dropped. By Arunav Sinha.\nKamal names political tour after MGR film\nChennai: Borrowing the legacy of yesteryear superstar and late Tamil MG Ramachandran, Kamal Haasan has named his state-wide political tour starting February 21 as 'Naalai Namathey' after the title of the film starring MGR.\nLEGAL:\nLGD8 DL-HC-LAWYERS STRIKE\nHC advocates abstain from work, protesting attack\nNew Delhi: The lawyers today abstained from work protesting the recent attack on the properties of two senior advocates.\nLGD7 DL-HC-\nPlea agst 'Padmaavat' declined by HC, petitioner asked to move SC\nNew Delhi: A plea was today moved in the seeking quashing of the certification granted to controversial Bollywood film 'Padmaavat', the release of which was permitted by the\nLGD6 SC-\nSC to hear plea against 4 states, Karni Sena for violence over 'Padmaavat'\nNew Delhi: The today agreed to hear on Monday two separate petitions seeking contempt action against four state governments and the Shree Rashtriya Rajput Karni Sena for violating its order allowing the all-India release of controversial Bollywood movie 'Padmaavat'.\nLGM1 TN-HC-PRISONER\nTN prisoner gets leave to 'procreate'\nMadurai: The has allowed a 40-year-old convict serving life imprisonment in the central prison in district to go on a two-week leave for the \"purpose of procreation\".\nFOREIGN:\nFGN17 CHINA-INDIA-DOKALAM\nDraw lessons to avoid another Dokalam: PLA to India\nBeijing: The today criticised Army Chief General Bipin Rawat's recent remarks that Dokalam is a disputed territory, asserting that it is very much part of China, and India should draw lessons from the 73-day standoff to avoid similar incidents in the future. By\nFGN19 LANKA-LD FISHERMEN\narrests 8 Indian fishermen\nColombo/Rameswaram: Eight Indian fishermen were arrested today by the for allegedly fishing near Neduntheevu in the country's northern territorial waters, the said in Colombo.\nFGN11 AFGHAN-ATTACK-LD TOLL\nKabul hotel attack killed 40 people: official\nKabul: At least 40 people were killed in the attack on Kabul's luxury at the weekend, official figures showed today - almost double the earlier toll released by Afghan authorities.\nTies with US under stress: Pak acknowledges\nWashington: Acknowledging that Pakistan's relationship with the US is \"under stress\", the country's here has urged not to look at with a \"very narrow approach\" through one lens or the other. By\nFGN7 UK-INDIA-REPORT\nIndia leads world in FinTech investment returns: UK report\nLondon: India is a dominant force in the financial technology sector globally with 29 per cent annual returns on investments, a report released by the City of London Corporation said today. By\nSPORTS:\nSPO-U19-IND-PREVIEW\nUnbeaten, untested India take on in quarters\nQueenstown: An unbeaten India will start overwhelming favourites but will have to guard against complacency against a tricky in the quarterfinals of the ICC U-19 World Cup here tomorrow.\n(This story has not been edited by Business Standard staff and is auto-generated from a syndicated feed.)", "url": "https://www.business-standard.com/article/pti-stories/following-are-pti-s-top-expected-118012501047_1.html", "label": 1}