{"authors": [], "date_download": "2019-03-27 14:28:59", "date_modify": "2019-03-27 14:28:59", "date_publish": "2017-01-28 20:52:07", "description": "Read more about Will hold rally against note ban after UP polls: Lalu on Business Standard. RJD chief Lalu Prasad on Saturday said his party will organise a rally against demonetisation in the Bihar capital after the Uttar Pradesh assembly polls.", "filename": "article_news-ians_will-hold-rally-against-note-ban-after-up-polls-lalu-117012800754_1_1553696939.html", "image_url": "https://bsmedia.business-standard.com/_media/bs/img/article/default/1170128/full-117012800754.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/business-standard.com/article_news-ians_will-hold-rally-against-note-ban-after-up-polls-lalu-117012800754_1_1553696939.html", "title": "Will hold rally against note ban after UP polls: Lalu", "title_page": "\nWill hold rally against note ban after UP polls: Lalu\n | Business Standard News", "title_rss": "NULL", "source_domain": "business-standard.com", "text": "RJD chief on Saturday said his party will organise a rally against in the capital after the assembly polls.\nHe also said that he would rope in like-minded political leaders for the proposed rally.\n\"We will hold a massive rally against the November 8 after the elections,\" the former Chief Minister told the media here.\nThe President of Rashtriya Janata Dal -- while is in power in along with Janata Dal-United and the Congress -- denied reports that the RJD will not organise the rally against the note ban in view of the pro- stand of ally JD-U led by\n\"I will talk to Congress President Sonia Gandhi, its Vice-President Rahul Gandhi, Trinamool Congress chief Mamata Banerjee and other like-minded leaders to join the proposed rally,\" Lalu said.\nHe said his party proposed to hold the rally early this year but decided to postpone it due to seven-phase assembly polls in Uttar Pradesh, scheduled to be held between February 11 and March 8.\nLast December, RJD organised sit-ins at Patna and all district headquarters against demonetisation. Lalu participated in the 'maha dharna' in Patna.\n--IANS\nik/tsb/vm\n(This story has not been edited by Business Standard staff and is auto-generated from a syndicated feed.)", "url": "https://www.business-standard.com/article/news-ians/will-hold-rally-against-note-ban-after-up-polls-lalu-117012800754_1.html", "label": 1}