{"authors": ["Anand Mishra"], "date_download": "2019-03-27 14:28:58", "date_modify": "2019-03-27 14:28:58", "date_publish": "2016-12-29 12:16:33", "description": "Yadavs, Jatavs, upper castes have shown fairly stable political loyalties in recent times, and Muslims have largely gone with the party most likely to defeat BJP. But successive elections have shown that the road to Lucknow passes through successful social coalitions", "filename": "article_explained__1553696938.html", "image_url": "https://images.indianexpress.com/2016/12/akhilesh-aadhar-480.jpg?w=480", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/indianexpress.com/article_explained__1553696938.html", "title": "UP elections 2017: Why smaller castes could hold the key to power", "title_page": "\n\t\t\t\tUP elections 2017: Why smaller castes could hold the key to power | Explained News, The Indian Express\t\t\t", "title_rss": "NULL", "source_domain": "indianexpress.com", "text": "Small is big when it comes to deciding electoral outcomes in Uttar Pradesh where every vote counts in a highly-divided polity. So when the Akhilesh Yadav government cleared the inclusion of 17 Other Backward Castes in the Scheduled Castes (SC) list last week, the caste-ridden landscape of UP politics was abuzz again.\nAdvertising\nBSP chief Mayawati assailed the SP government over the “election stunt”, but also claimed that “it was the BSP government that had sent this recommendation to the Centre earlier”.\nWatch: UP Elections: Mulayam Singh Yadav Ruled Out Alliance, Announces Candidates For 325 Seats\nThe 17 sub-castes which the government wants included in the SC category are Kahar, Kashyap, Kewat, Nishad, Bind, Bhar, Prajapati, Rajbhar, Batham, Gauriya, Turha, Majhi, Mallah, Kumhar, Dheemar, Dheewar and Machhua. By itself, each has a very small voteshare, but together, they make up a significant chunk of votes. How can they affect electoral outcomes?\n***\nAdvertising\nBroadly speaking, the political loyalties of the dominant and more populous caste groups are by and large fixed — which means that extremely backward castes (who are non-Yadav) and non-Jatav Dalits often hold the key to power.\nOBCs are roughly 44% of UP’s electorate, Dalits 21%, Muslims 19%, and upper castes 16%. Yadavs, the core of the SP’s base, are numerically and socially dominant among OBCs. However, the 200-odd non-Yadav OBCs make up more than double the Yadav population. They include Kurmis (Bihar Chief Minister Nitish Kumar’s community), Koeris, Lodhs, Jats, Sunars, etc. Among the Dalits, Pasis and Valmikis are the large non-Jatav communities.\nIn the Bihar Assembly elections of October 2005, upper castes and non-Yadav OBCs had helped the then allies JD(U) and BJP snatch power from Lalu Prasad’s RJD. Twelve years on, the BJP will be looking at a repeat in UP — it already has considerable upper caste support, and it has been promoting non-Yadav OBCs like its UP state chief Keshav Prasad Maurya, and MoS Health Anupriya Patel of the Apna Dal.\nIn a quadrangular contest among the SP, BSP, BJP and Congress, a voteshare of 30%-35% will be enough for any party to form the next government. In the 2007 Assembly polls, the BSP got 30.40% votes and formed the government. In 2012, the SP got the largest share (29.15%), followed by the BSP (25.91%). The BJP got just 15%, and the Congress around 11.5%.\nThe BJP’s hopes this time are riding on its spectacular Lok Sabha performance in 2014, in which it got 42.3% votes, almost double the SP’s 22.2% and BSP’s 20%. In Assembly elections, however, the BJP’s performance has got successively worse on every occasion since 1996, when it peaked at 32.51%. It got 20.12% votes in 2002, 16.97% in 2007, and 15% in 2012.\nShould 2017 be a triangular contest — which presumes that the Congress will not be a player of significance — the winning party will need about 40% of the vote. And it is here that the votes of the numerically smaller communities will come into play.\n***\nYadavs vote by and large for the SP, and Jatavs for Mayawati. For the last many elections, Muslims have been voting for the party that is seen as capable of defeating the BJP, and switching between the SP and BSP. Upper castes have mainly backed the BJP in recent elections. These four social groups make up around 65% of the electorate.\nAll eyes, therefore, are on the remaining 35% — EBC and non-Jatav Dalit — vote. Which explains why, in March 2013, a year before the Lok Sabha polls, the UP Assembly had passed a resolution asking the Centre to include these 17 castes in the state list of SCs. Or, for that matter, why the government of Mulayam Singh Yadav had, in February 2004, passed a similar resolution.\nIn 2014, the BSP failed to win a single Lok Sabha seat despite getting its core Jatav vote. In the 2012 Assembly elections, again, its core Jatav base could not prevent defeat to the SP. And similarly, the SP lost in 2012 even after getting the almost entire Yadav vote as Mayawati reached out to various smaller communities through ‘Bhaichara’ meetings.\n***\nKurmis, who have surnames like Verma, Patel and Gangwar; Nishads, who have 27 sub-castes; and weavers are the most aggressively wooed communities in this election. These three castes are the biggest among the smaller castes in the state.\nThe BJP has deployed Union Minister Anupriya Patel to woo Kurmi voters. Patel is the daughter of Sonelal Patel who, as general secretary of the BSP back in 1994, had organised a ‘Kurmi Rajnitik Chetna Maha Rally’ in Lucknow against the Yadav domination of OBC politics.\nSonelal Patel founded the Apna Dal in 1995. Anupriya Patel, who is the Lok Sabha MP from Mirzapur, was made Minister in the last Cabinet reshuffle with an eye on the UP elections.\nAlso, the BJP has recently inducted the former BSP national secretary Swamy Prasad Maurya in the party, and made another Maurya leader, Keshav Prasad Maurya, its state unit chief. Mauryas, also called Kachhis, Kushwahas, Sainis and Shakyas, are Koeris, and numerically significant in Eastern UP. In adjacent Bihar, Kurmis and Koeris are known as “Lav-Kush” communities.\nIn UP, the communities have been supportive of the BJP — this is the reason that Prime Minister Narendra Modi’s detractor, Bihar Chief Minister Nitish Kumar, has been holding rallies in UP.\nThe ruling SP is not oblivious of the need to reach out to non-Yadavs. SP chief Mulayam Singh Yadav brought back his friend-turned-foe and prominent Kurmi leader, Beni Prasad Verma, in May, and made him a Rajya Sabha MP. Verma had moved to the Congress before the 2009 Lok Sabha election, was nominated to the Rajya Sabha, and made a Cabinet Minister. He has influence in areas in and around Barabanki.\n***\nGiving expression to their political aspiration, the Mallah community, which makes up around 4.5% votes, recently organised a protest meeting in Delhi to seek proper representation for itself. Divided into 27 sub-castes, the community has a good presence in roughly 125 constituencies along the rivers in UP, where they contribute to the victory and defeat of candidates.\nIn the first week of May this year, Prime Minister Modi reached out to the community, launching 11 solar-powered “e-boats” in Varanasi. He said India’s new satellite had been named NAVIC (Navigation with Indian Constellation) to honour the contribution of the “courageous boatmen (naavik)” to the nation.\nThe BSP has deployed five leaders from different backward castes to reach out to their respective caste groups. Party MLC Suresh Kashyap has, for example, been asked to work on the Kashyap-Nishad caste group.\nThe Congress, which had organised an “ati-pichchra (most backward) rally in UP in the run-up to the 2012 Assembly polls and highlighted the contribution of Nishad icons of the freedom struggle like Lochan Mallah and Samadhan Nishad, is exploring pre-poll arrangements with outfits and leaders of the community this time as well.\n‘Bandit Queen’ Phoolan Devi had become a prominent leader of the community after becoming a Samajwadi Party MP, and had formed the Eklavya Sena to fight for the rights of the community. After she was killed in July 2001, leaders from the community, wielding influence in their own pockets, have emerged in various parties.\n***\nAdvertising\nWeavers — both Hindus and Muslims — too have caught the attention of political parties ahead of the elections. This caste group is spread across UP, with a sizeable concentration around Varanasi. Momins are Muslim weavers; Taanti and Tantuwe are Hindus. The PM had last year launched the “Ustad” scheme in his constituency Varanasi to help weavers.", "url": "https://indianexpress.com/article/explained/why-smaller-castes-could-hold-the-key-to-power-in-2017-uttar-pradesh-assembly-polls-4447802/", "label": 1}