{"authors": [], "date_download": "2019-03-27 14:40:39", "date_modify": "2019-03-27 14:40:39", "date_publish": "2016-04-23 02:12:20", "description": "Karat’s absence from the West Bengal campaign scene had triggered some amount of curiosity in the political circles.", "filename": "article_india_india-news-india__1553697639.html", "image_url": "https://images.indianexpress.com/2016/04/prakash-karat-480.jpg?w=480", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/indianexpress.com/article_india_india-news-india__1553697639.html", "title": "Delhi confidential: Falling In Line", "title_page": "\n\t\t\t\tDelhi confidential: Falling In Line | India News, The Indian Express\t\t\t", "title_rss": "NULL", "source_domain": "indianexpress.com", "text": "Former CPM general secretary Prakash Karat will travel to West Bengal on a two-day campaign trip from April 26. This is his first visit to the state since campaigning began. Karat’s absence from the West Bengal campaign scene had triggered some amount of curiosity in the political circles, primarily because he was among Politburo members who were against any electoral understanding with the Congress. But the scene on the ground changed after the campaign began and the so-called tacit understanding between the Left and Congress became an open one with local leaders and cadres even campaigning jointly and sharing stage. Karat’s visit and his campaign speeches hence will be keenly noticed.\nHiring On\nAdvertising\nAnalysis of technical intelligence, coupled with human intelligence, being vital for a probe agency, the National Investigation Agency is looking to hire the services of 37 IT professionals for the management of its IT infrastructure and data. The IT professionals will be hired as senior system analysts, network administrators, programmers or data entry operators. The agency has been looking to expand its infrastructure in Lucknow, Guwahati and Jammu.\nAt Loggerheads\nAll is not well at the National Book Trust. There seems to be a full-blown war between NBT chairman Baldeo Bhai Sharma and its director, Rita Chowdhury. The two don’t agree on practically anything. Apparently, they don’t even attend functions together. The feud has put the government in a spot as both Sharma and Chowdhury are important in their own right. While Chowdhury is married to BJP leader Chandra Mohan Patowary, who quit Asom Gana Parishad last year to join the saffron party, Sharma was the editor of RSS mouthpiece Panchjanya. A miffed HRD Minister has asked them to sort out their differences soon.\nOpportunity Knocks\nThe national versus anti-national binary narrative set by the BJP had put the Congress in a spot of bother. The party has been trying to either change the narrative or argue that the BJP has double standards on nationalism. And the NIT-Srinagar issue has come as an opportunity. The Congress has decided to support a show of strength by the non-Kashmiri NIT students, who were baton-charged by police on their campus, at Jantar Mantar in Delhi. Sources said senior party leaders will be at Jantar Mantar on Sunday in a show of solidarity. The Congress, however, does not support demands of the non-Kashmiri students to shift NIT out of Srinagar. The party wants action against those harassing these students and punishment to the policemen. With the Parliament session beginning Monday, the party will also hold a major protest action — to be led by the Gandhis themselves — on the issue of toppling of its governments in Arunachal Pradesh and Uttarakhand.\nSpecial Guest\nAdvertising\nNepal’s first woman President Bidhya Devi Bhandari will visit India next month. What is interesting is she will stay at the Rashtrapati Bhawan, making her the second Nepal leader to be hosted by the President. In February this year, after the strained relationship with Nepal eased, Nepal Prime Minister K P Sharma Oli had also been hosted there. In the past few years, some top leaders, especially from the neighbourhood, have been hosted there — Bhutan King and Afghanistan’s President are among them.\nWATCH THE INDIAN EXPRESS NEWS PLAY LIST", "url": "https://indianexpress.com/article/india/india-news-india/prakash-karat-cpm-west-bengal-nia-uttarakhand-nepal-president-2766337/", "label": 1}