{"authors": [], "date_download": "2019-03-27 14:35:43", "date_modify": "2019-03-27 14:35:43", "date_publish": "2018-12-19 01:56:59", "description": "Read more about Delhi: BJP workers protest against Kamal Nath's UP, Bihar migrants remark on Business Standard. The workers of BJP Purvanchal Morcha on Tuesday staged a protest against Chief Minister Kamal Nath, for accusing people from neighboring Uttar Pradesh and Bihar of migrating to Madhya Pradesh and stealing local jobs.Nath, soon after taking oath as", "filename": "article_news-ani_delhi-bjp-workers-protest-against-kamal-nath-s-up-bihar-migrants-remark-118121900056_1_1553697343.html", "image_url": "https://bsmedia.business-standard.com/_media/bs/img/article/default/1181219/full-118121900056.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/business-standard.com/article_news-ani_delhi-bjp-workers-protest-against-kamal-nath-s-up-bihar-migrants-remark-118121900056_1_1553697343.html", "title": "Delhi: BJP workers protest against Kamal Nath's UP, Bihar migrants remark", "title_page": "Delhi: BJP workers protest against Kamal Nath's UP, Bihar migrants remark | Business Standard News", "title_rss": "NULL", "source_domain": "business-standard.com", "text": "The workers of BJP Morcha on Tuesday staged a protest against Kamal Nath, for accusing people from neighboring and of migrating to and stealing local jobs.\nNath, soon after taking oath as the of on Monday, had said that priority would be given to the natives of in terms of employment. \"Our schemes of providing incentives of investment will only be imposed after 70 per cent people from Madhya Pradesh get jobs. I've signed file for this. People from states like Bihar, UP come here and locals don't get jobs,\" the newly elected Madhya Pradesh had said.\nThe BJP Morcha organised the protest outside Nath's residence in the capital.\nThe angry protesters blackened the nameplate at Nath's residence and also raised slogans demanding an apology.\nNath's statement also drew flak from and former Chief Minister Akhilesh Yadav, who slammed the former for insulting people of and\n\"He (Kamal Nath) had insulted north Indians by his comment that people from states like Uttar Pradesh and were responsible for unemployment in Madhya Pradesh,\" Akhilesh said.\n(This story has not been edited by Business Standard staff and is auto-generated from a syndicated feed.)", "url": "https://www.business-standard.com/article/news-ani/delhi-bjp-workers-protest-against-kamal-nath-s-up-bihar-migrants-remark-118121900056_1.html", "label": 1}