{"authors": [], "date_download": "2019-03-27 14:25:38", "date_modify": "2019-03-27 14:25:38", "date_publish": "2016-11-28 10:30:22", "description": "However, with most parties opting out of the protests, it is likely to be a flop show today, except maybe in Kerala and Bengal.", "filename": "article_india_india-news-india__1553696738.html", "image_url": "https://images.indianexpress.com/2016/11/parliament-opposition-480.jpg?w=480", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/indianexpress.com/article_india_india-news-india__1553696738.html", "title": "Bharat Bandh today: India braces for large scale protests, shutdown", "title_page": "\n\t\t\t\tBharat Bandh today: India braces for large scale protests, shutdown | India News, The Indian Express\t\t\t", "title_rss": "NULL", "source_domain": "indianexpress.com", "text": "As people continue to face hardship standing in lines outside ATMs and banks, opposition parties have called for a nationwide protest against the demonetisation drive on Monday. Though many are expecting it to be a complete lockdown, Congress has clarified that it is not a ‘Bharat bandh’ or a countrywide shutdown but ‘Jan Aakrosh Diwas’ to hold protests over demonetisation. However, with most parties opting out of the protests, it is likely to be a flop show today, except maybe in Kerala and Bengal.\nBharat bandh LIVE UPDATES\nWhich parties are part of the protests?\nAdvertising\nCongress was the first to give the call for the protest on November 28. It will be joined by five Left parties that stage separate demonstrations across Odisha and West Bengal today. CPI state secretary Dibakar Naik said activists and leaders of the CPI, CPI-M, CPI-ML, SUCI and Forward Bloc would stage demonstrations in front of the RBI building here and SBI branches at all the district headquarters. In Kerala, there’s a high chance the Left government may join the strike. Odisha Congress chief Prasad Harichandan said the party would organise ‘Jana Akrosh’ rallies across the state. He said demonstrations and rallies would be held in all the 314 blocks and 30 districts of the state.\nWhich party has boycotted Bharat Bandh?\nWest Bengal chief minister Mamata Banerjee who has been in the forefront of protests against demonetisation, is not supporting the bandh calling it another inconvenience to people. The Janata Dal (United) also has said that it would not be a part of the nationwide stir. Party president Nitish Kumar said that he doesn’t oppose the demonetisation drive, but wants the government to end the inconvenience caused to the public. Even the Congress government in Karnataka has decided not to participate in the strike. In Haryana, Indian National Lok Dal president Ashok Arora has also announced that the party, instead of supporting the ‘Bandh’, will highlight the problems being faced by the people due to demonetisation and hold demonstrations before submitting memorandums to the administration. Telangana Rashtra Samithihas also said it will not be a part of the protest.\nWhat will be affected the most?\nThere is no confirmation so far from the trade and transport unions whether they will be joning the strike or not. Since Left and TMC have a different stand on the band, West Bengal is expected to be most affected today. Private schools across the country have not declared a holiday today. However, the Bangalore University has postponed exams that were scheduled on Monday to another date citing Bharath Bandh. Reportedly, some of the universities in Kerala have even postponed admission processes as the state is expected to face a complete shutdown. Railways will function normally.\nWill the banks remain open?\nAdvertising\nPublic and private banks will remain open at this moment of cash crunch. The banks will open at their regular timings. However, in view of the fear of protests turning violent, the queue may be shorter today.\nWhen does the bandh start?\nIt is expected to be 12-hour shut down beginning at 6 AM and continue till 6 PM.", "url": "https://indianexpress.com/article/india/india-news-india/bharat-bandh-tomorrow-india-braces-for-large-scale-protests-shutdown-demonetisation/", "label": 1}