{"authors": ["Press Trust Of India"], "date_download": "2019-03-27 14:40:24", "date_modify": "2019-03-27 14:40:24", "date_publish": "2018-12-17 16:25:16", "description": "Read more about Delhi BJP activists protest near Cong headquarters against Kamal Nath's nomination as MP CM on Business Standard. Delhi BJP activists Monday staged a protest near the Congress headquarters here against Kamal Nath being nominated as the Madhya Pradesh chief minister, who they alleged was involved in the 1984 anti-Sikh riots.The protesters, including many riot", "filename": "article_pti-stories_delhi-bjp-activists-protest-near-cong-headquarters-against-kamal-nath-s-nomination-as-mp-cm-118121700602_1_1553697624.html", "image_url": "https://bsmedia.business-standard.com/_media/bs/img/article/default/1181217/full-118121700602.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/business-standard.com/article_pti-stories_delhi-bjp-activists-protest-near-cong-headquarters-against-kamal-nath-s-nomination-as-mp-cm-118121700602_1_1553697624.html", "title": "Delhi BJP activists protest near Cong headquarters against Kamal Nath's nomination as MP CM", "title_page": "Delhi BJP activists protest near Cong headquarters against Kamal Nath's nomination as MP CM | Business Standard News", "title_rss": "NULL", "source_domain": "business-standard.com", "text": "activists Monday staged a protest near the headquarters here against being nominated as the chief minister, who they alleged was involved in the 1984 riots.\nThe protesters, including many riot victims and their family members, tried to march from towards the headquarters on Akbar Road but were stopped enroute by the police.\nThe protesters raised slogans against the and its leaders and demanded Nath's replacement in the Hindi heartland state.\n\"There are witnesses against Nath who led the mob in riots. Still (party chief) chose to make him the chief minister, thereby opening the old wounds of the victims and their families,\" alleged who led the the protest.\nThe protesters also torched an effigy of Nath during the demonstration.\n(This story has not been edited by Business Standard staff and is auto-generated from a syndicated feed.)", "url": "https://www.business-standard.com/article/pti-stories/delhi-bjp-activists-protest-near-cong-headquarters-against-kamal-nath-s-nomination-as-mp-cm-118121700602_1.html", "label": 1}