{"authors": [], "date_download": "2019-03-27 14:25:38", "date_modify": "2019-03-27 14:25:38", "date_publish": "2016-11-18 23:16:04", "description": "Read more about Kerala CM, ministers protest outside RBI over demonetisation on Business Standard. In an unprecedented action, Kerala Chief Minister Pinarayi Vijayan led a daylong protest outside the RBI office here along with 17 Cabinet ministers and CPI-M General Secretary Sitaram Yechury.", "filename": "article_news-ians_kerala-cm-ministers-protest-outside-rbi-over-demonetisation-116111801540_1_1553696738.html", "image_url": "https://bsmedia.business-standard.com/_media/bs/img/article/default/1161118/full-116111801540.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/business-standard.com/article_news-ians_kerala-cm-ministers-protest-outside-rbi-over-demonetisation-116111801540_1_1553696738.html", "title": "Kerala CM, ministers protest outside RBI over demonetisation", "title_page": "\nKerala CM, ministers protest outside RBI over demonetisation\n | Business Standard News", "title_rss": "NULL", "source_domain": "business-standard.com", "text": "In an unprecedented action, Chief Minister led a daylong protest outside the RBI office here along with 17 Cabinet ministers and General Secretary\nAt the end of the protest, they held a special cabinet meeting and decided to convene a special one-day assembly session on Tuesday to discuss the issue.\nVijayan and senior leaders from the ruling Left Democratic Front walked from the Martyr's Column and reached the Reserve Bank of India office to denounce the Narendra Modi government's decision to what they said was \"sideline the cooperative banks\" following the on November 8.\nThe Congress-led United Democratic Front leaders, who met Vijayan on Thursday, had requested for the special assembly session to discuss the grave issue.\nThe state government views the central government's move as an \"injustice\" that would wreck the very existence of cooperative banks in Kerala, said Vijayan.\nHe said the cooperative banking sector was the \"livewire\" of the rural economy in as it functions well within the rules but does not have the frills of commercial banks.\nThe leader said the cooperative bank was a friend of the common man as it extends credit to him without any fuss.\n\"The deposit base in these cooperative banks is in excess of Rs 1 lakh crore and this banking system rises to the occasion to address the need of our ordinary people,\" the Chief Minister said.\nReferring to the Bharatiya Janata Party, he said some people claimed that these banks were flush with black money.\n\"The people standing in front of me... does anyone of you have black money deposited in these banks?\" Vijayan asked the crowd.\nThe Reserve Bank of India has withdrawn the facility given to the cooperative banks the right to accept or exchange the spiked 500 and 1,000 rupee notes.\nThe cooperative banking sector in is a three-tier system, with about 1,600 primary cooperative banks attached to the 14 district banks, which are further linked to the apex Kerala State Cooperative Bank (KSCB).\nVijayan said he and his Finance Minister Thomas Issac explained the situation to Union Finance Minister Arun Jaitley who \"we felt that understood what we said\".\n\"But as soon as this happened, the state BJP spread canards that these banks were flush with black money and after that came the decision of the RBI withdrawing the facility that was given to these banks,\" he said.\n\"This is nothing but a big rooted political conspiracy,\" said Vijayan.\nFormer Chief Minister Oommen Chandy welcomed the protest of the Kerala government.\n\"We will support any move that comes to protect the cooperative banks and we are with them on this issue,\" he said.\nThe BJP says that these primary societies do not follow RBI guidelines while accepting deposits.\nYechury said: \"We will have to take this protest forward to the rest of the country to end the anarchic policies of Prime Minister Narendra Modi.\"\nFormer Chief Minister V.S.Achuthanandan termed Modi's decision to ignore the cooperative sector as one that will wreck the state economy.\n--IANS\nsg/tsb/vd\n(This story has not been edited by Business Standard staff and is auto-generated from a syndicated feed.)", "url": "https://www.business-standard.com/article/news-ians/kerala-cm-ministers-protest-outside-rbi-over-demonetisation-116111801540_1.html", "label": 1}