{"authors": [], "date_download": "2019-03-27 14:25:37", "date_modify": "2019-03-27 14:25:37", "date_publish": "2017-10-08 14:42:07", "description": "Read more about Delhi: Amit Shah carries out 'Jan Raksha Yatra' against CPM on Business Standard. Bharatiya Janata Party (BJP) chief Amit Shah on Sunday protested against the alleged killings of his party activists in Kerala with a 'Jan Raksha Yatra' (people's protection march) here.The BJP president, while addressing the public, said that the", "filename": "article_news-ani_delhi-amit-shah-carries-out-jan-raksha-yatra-against-cpm-117100800305_1_1553696737.html", "image_url": "https://bsmedia.business-standard.com/_media/bs/img/article/default/1171008/full-117100800305.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/business-standard.com/article_news-ani_delhi-amit-shah-carries-out-jan-raksha-yatra-against-cpm-117100800305_1_1553696737.html", "title": "Delhi: Amit Shah carries out 'Jan Raksha Yatra' against CPM", "title_page": "Delhi: Amit Shah carries out 'Jan Raksha Yatra' against CPM | Business Standard News", "title_rss": "NULL", "source_domain": "business-standard.com", "text": "(BJP) chief on Sunday protested against the alleged killings of his party activists in with a 'Jan Raksha Yatra' (people's protection march) here.\nThe president, while addressing the public, said that the party members are being threatened and lynched since the of (Marxist) (CPM) has come into power in\n\"Since the CPM formed its in Kerala, more than 12 workers of the and the Rashtriya Swayamsevak Sangh (RSS) have been mercilessly murdered. Life can be taken with a bullet, but the bodies of our workers were chopped to pieces to instill fear, even then we aren't scared of sacrifice. We won't revert with violence unlike the We do not believe in the politics of violence,\" Shah added.\nShah alleged that at least 120 workers have been killed since the communists came to power in\n\"The chief minister of Kerala, Pinarayi Vijayan, should be ashamed of himself, because maximum political killings have taken place in his own home district,\" he added.\nShah further questioned all the human rights activists asking, \"Where did they go when 12 BJP workers were brutally killed? If they are against violence, why don't they carry out a candle march for our workers?\"\nHe asserted that the BJP would challenge the left and the communists, wherever they are.\n\"We will begin a Satyagraha. We will not resort to violence. I urge you all to join our fight against the brutal regime of the left,\" Shah asserted.\nEarlier this week, Shah had kicked off the Jan Raksha Yatra (people's protection march) from Payyannur in Kerala.\nAccording to the party, he skipped the march in Pinarayi -- the hometown of Chief Minister -- as he had to attend a meeting with Prime Minister Narendra Modi.\nShah, after leaving his party's march against the CPM in Kerala midway, embarked upon another yatra against the left party here today.\nHowever, the president is expected to go back to Kerala on October 15, the day party's yatra ends.\nThe party will take out the Jan Raksha Yatra every day from every state capital till October 16.\n(This story has not been edited by Business Standard staff and is auto-generated from a syndicated feed.)", "url": "https://www.business-standard.com/article/news-ani/delhi-amit-shah-carries-out-jan-raksha-yatra-against-cpm-117100800305_1.html", "label": 1}