{"authors": [], "date_download": "2019-03-27 14:40:46", "date_modify": "2019-03-27 14:40:46", "date_publish": "2018-07-25 19:47:52", "description": "Around a week after parents began to protest against the Srimathi Sundravalli Memorial (SSM) group of schools in Chennai over their demand of exorbitant caution deposits, the city police on Wednesday detained the school’s correspondent K Santhanam. This move comes after he allegedly addressed students and made some derogatory statements on Tuesday over their parents refusing", "filename": "article_chennai-school-extorting-parents-goes-drama-mode-threatens-withdraw-facilities-85424_1553697646.html", "image_url": "https://www.thenewsminute.com/sites/default/files/ssm%20school_0.jpg", "language": null, "localpath": "/home/raj/news-please-repo//data/2019/03/27/thenewsminute.com/article_chennai-school-extorting-parents-goes-drama-mode-threatens-withdraw-facilities-85424_1553697646.html", "title": "Chennai school extorting parents goes on drama mode, threatens to withdraw facilities", "title_page": "Chennai school extorting parents goes on drama mode, threatens to withdraw facilities | The News Minute", "title_rss": "NULL", "source_domain": "thenewsminute.com", "text": "Education\nWhile the school has withdrawn the controversial Rs 2 lakh caution money, it warned parents that their wards will lose access to infrastructure and facilities.\nAround a week after parents began to protest against the Srimathi Sundravalli Memorial (SSM) group of schools in Chennai over their demand of exorbitant caution deposits, the city police on Wednesday detained the school’s correspondent K Santhanam.\nThis move comes after he allegedly addressed students and made some derogatory statements on Tuesday over their parents refusing to pay the Rs 2 lakh deposit.\nSanthanam has been booked under the Tamil Nadu Schools (Regulation of Collection of Fee) Act 2009 and was produced at a court in Tambaram.\nThe Correspondent had said that parents would have to either agree to pay the caution deposit by July 31 or remove their wards from the school. Despite the school education department intervening, he refused to withdraw the circular.\nFollowing this, the state government issued a stern warning to all private schools, including those affiliated to CBSE and ICSE boards, that demanding excess fees could attract imprisonment and de-recognition. On Tuesday, however, matters escalated.\nThe Correspondent’s speech\nOn Tuesday, the correspondent used the public system to address the students from Pre-KG to the 12th standard, parents state.\n\"He questioned why parents conceived them if they cannot even pay this deposit. He told students to go home, question us, and demand that we either pay the money or leave the school. The Correspondent told them to tear the circular and throw it at our faces,” a parent shares.\n“My daughter is very young and fond of the correspondent, she actually came home and questioned me angrily. She knows I protested and is asking me why I am fighting unnecessarily,\" she adds.\nThe police told TNM that the Correspondent compared the children to beggars and insulted their families.\nCircular withdrawn\nMeanwhile, after facing massive backlash, the school has withdrawn the controversial circular. Correspondent K Santhanam has shot off a letter to the parents of the students announcing the withdrawal of the caution deposit.\nHowever, the letter warned parents that the infrastructure and facilities available at the school will suffer as a result of their refusal to pay this illegal fee.\nRight from cutting down on basic amenities such as number of fans and lights to cancelling field trips, the school makes it clear that it will not maintain that standards that it has in the past. Even the quality of education is likely to deteriorate.\n\"The School Management will reduce the staff strength by 75% and will try to manage with 25%. All other expenses will be brought down to the required minimal level. In this context, enforcement of values, ethics and discipline will be at zero level, not intentionally but out of sheer compulsion, which is also the expectation of today’s Society,\" reads a fresh circular.\n\"There will be one Computer Centre for the whole School –without Air Conditioning and many students will work with a single computer and the lessons will be imparted,\" it warns.\nIf parents are not on board with decision, the school asks them to withdraw their pupils from the school.\nDespite the clear illegality in its action, the management says, \"The SSME Trust has clearly understood and realized that there is no place for Honesty and Integrity and only the unscrupulous can survive. The Trust may also resort to such a culture when driven to such an extent by the Society.\"", "url": "https://www.thenewsminute.com/article/chennai-school-extorting-parents-goes-drama-mode-threatens-withdraw-facilities-85424", "label": 1}