{"authors": ["Radhika Iyengar"], "date_download": "2019-03-27 14:25:38", "date_modify": "2019-03-27 14:25:38", "date_publish": "2016-11-24 19:19:26", "description": "This is not the first time cruelty against animals has been reported in India.", "filename": "article_opinion_web-edits__1553696738.html", "image_url": "https://images.indianexpress.com/2016/11/animal-cruelty-vellore-medical-students-480.jpg?w=480", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/indianexpress.com/article_opinion_web-edits__1553696738.html", "title": "Two more innocent animals killed, the law clearly has no bite", "title_page": "\n\t\t\t\tTwo more innocent animals killed, the law clearly has no bite | The Indian Express\t\t\t", "title_rss": "NULL", "source_domain": "indianexpress.com", "text": "The act of torturing an animal stems from a need to express anger. It’s done by the offender to gain a sense of power or control over someone else. He/she chooses an animal, because an animal is a defenseless and voiceless creature. If you mistreat, torture or kill an animal in India, unless it’s the holy cow, chances are you’ll rarely be prosecuted.\nAdvertising\nTwo cases of cruelty against animals have left animal lovers fuming. The first incident was reported from Tamil Nadu where a monkey was allegedly killed by students of Medicine at Christian Medical College in Vellore. The students reportedly tied the limbs of the monkey, thrashed it and fractured its legs. Another student at the institute, who wished to remain anonymous, learned about the incident and reported it to the authorities at PETA India who decided to take subsequent action. Now an FIR has been filed against the perpetrators under the IPC’s Section 429 and the Wildlife Protection Act. In another case in Gurgaon, a leopard was brutally killed by villagers. The leopard had reportedly strayed into the village mauling nine people.\nCruelty towards animals is idiosyncratic of a sociopath. On PETA’s blog, Dawn Drucker, a child psychologist, notes that sociopaths have a tendency to torture animals, which later metamorphoses into torturing other people. He wrote, “serial killers such as Ted Bundy, Jeffrey Dahmer and Richard Ramirez as well as countless other serial killers, murderers, and rapists all abused animals as children, and that behavior escalated into harming humans.” Clearly, the students who have been allegedly accused of killing the monkey exhibit sociopath tendencies.\nThis is not the first time cruelty against animals has been reported in India. Earlier this year in March, BJP MLA Ganesh Joshi thrashed a policeman’s horse with a stick. The horse had to get one of its limbs amputated. Although arrested, the MLA was granted bail in less than a week by paying two bonds worth Rs. 25,000 each. In the same month, in Bengaluru a woman flung eight puppies at a pile of boulders, killing them in order to “teach the mother of the pups a lesson”. In September, the news of locals in Kottayam, Kerala killing eight dogs in ‘protest’ against Maneka Gandhi made headlines. The youth wing of the Kerala Congress (Mani) brazenly tied four corpses of those dogs to a pole and paraded them in public. Apart from these incidents, there have been numerous and undocumented road kills, where vehicles have run over crossing animals, many of which are stray dogs and cats.\nAdvertising\nOf course there are laws in place to protect animals. The Prevention of Cruelty to Animals Act of 1960 was established to prosecute those who caused pain or mistreated animals. An offender is liable under this act if he “beats, kicks, over-rides, over-drives, over-loads, tortures or otherwise treats any animal so as to subject [the animal] to unnecessary pain or suffering” and/or “mutilates any animal or kills any animal (including stray dogs) by using the method of strychnine injections, in the heart or in any other unnecessarily cruel manner”, among other descriptions. Astonishingly, the penalty that a offender needs to pay is a minuscule sum of Rs. 50 – an amount which anyone can pay and walk off scot-free. Of course, there are also Sections 428 and 429 in the Indian Penal Code which make it “illegal of main or cause injury to any animal”. If you do injure the animal, you’re expected to pay a fine of Rs. 10. For road-kills, the punishment is a fine of Rs. 2000 and/or a jail term of up to five years. It’s deeply important that an animal’s life is given more consideration; an offense against it should have graver repercussions.\nThese punishments/penalties are insignificant. It’s a clear indicator of how animals are perceived in the country. It also gives a long leash to perpetrators to traumatize animals.", "url": "https://indianexpress.com/article/opinion/web-edits/leopard-killed-villagers-gurgaon-monkey-tortured-tamil-nadu-4393295/", "label": 1}