{"authors": [], "date_download": "2019-03-27 14:18:25", "date_modify": "2019-03-27 14:18:25", "date_publish": "2016-12-16 00:00:00", "description": "Read more about TMC slams BJP for launching 'political vendetta' on opposing parties on Business Standard. Continuing their fight against demonetisation the Trinamool Congress on Wednesday asserted that the currency swap has adversely affected the nation, asserting that the ruling party has been carrying out a 'political vendetta' against all parties", "filename": "article_current-affairs_tmc-slams-bjp-for-launching-political-vendetta-on-opposing-parties-117011100225_1_1553696305.html", "image_url": "http://bsmedia.business-standard.com/_media/bs/img/article/2016-12/16/full/1481911968-1867.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/business-standard.com/article_current-affairs_tmc-slams-bjp-for-launching-political-vendetta-on-opposing-parties-117011100225_1_1553696305.html", "title": "TMC slams BJP for launching 'political vendetta' on opposing parties", "title_page": "TMC slams BJP for launching 'political vendetta' on opposing parties | Business Standard News", "title_rss": "NULL", "source_domain": "business-standard.com", "text": "Continuing their fight against the Trinamool Congress on Wednesday asserted that the currency swap has adversely affected the nation, asserting that the ruling party has been carrying out a 'political vendetta' against all parties opposing\nTaking their agitation against banning of high denomination notes forward, leader Derek O' Brien said that 45 MP's of West Bengal Chief Minister will meet President Pranab Mukherjee later today to discuss the ill effect of on the nation.\n\"The Trinamool Congress has been holding protests across the country, in fact in nine states, today is the third day in Delhi. The state of the nation is not good,\" said Brien.\n\"Our 45 mps will go and talk to the President today and we are very thankful for him to give us time at 2 pm today. We will also give him a memorandum,\" he added.\nThe MP also slammed the Bharatiya Janata party (BJP) for launching political vendetta against their movement opposing demonetisation and said, \"The political vendetta launched by on our party or any other opposing its demonetization move is not right.\"\nThe earlier this week launched countrywide protest demanding removal of Prime Minister to \"save the country\".\nTerming as \"flop show\" Prime Minister Modi's 8 November decision of spiking Rs 1,000 and Rs 500 notes, Trinamool supremo and West Bengal chief minister Banerjee said the party will hold demonstrations in Odisha, Punjab, Bihar, Manipur, Tripura, Assam and Jharkhand, besides West Bengal and the capital.", "url": "https://www.business-standard.com/article/current-affairs/tmc-slams-bjp-for-launching-political-vendetta-on-opposing-parties-117011100225_1.html", "label": 1}