{"authors": [], "date_download": "2019-03-27 14:29:06", "date_modify": "2019-03-27 14:29:06", "date_publish": "2019-02-04 11:11:24", "description": "Alleging that a \"misinformation campaign\" over the bill has been launched by groups with \"vested interests,\" the chief minister \"urged all people to stand united to thwart the evil design of divisive forces.\"", "filename": "article_north-east-india_assam__1553696946.html", "image_url": "https://images.indianexpress.com/2019/01/sarbananda-sonowal-1.jpg?w=759", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/indianexpress.com/article_north-east-india_assam__1553696946.html", "title": "Assam CM Sonowal dubs Citizenship Bill protests as ‘motivated campaign’ to derail development agenda", "title_page": "\n\t\t\t\tAssam CM Sonowal dubs Citizenship Bill protests as ‘motivated campaign’ to derail development agenda | North East India News, The Indian Express\t\t\t", "title_rss": "NULL", "source_domain": "indianexpress.com", "text": "Amid the ongoing protests over the Citizenship Amendment Bill in Assam, Chief Minister Sarbananda Sonowal called it a “motivated campaign” to derail the development process in the state. Addressing the Asha and National Health Mission convention here, Sonowal assured the people that the land, culture, language of the indigenous people are fully safe in the hands of the present government, reported PTI.\nAdvertising\nThe Citizenship (Amendment) Bill, which was passed by the Lok Sabha on January 8, seeks to provide Indian citizenship to Hindus, Jains, Christians, Sikhs, Buddhists and Parsis from Bangladesh, Pakistan and Afghanistan after six years of residence in India even if they do not possess any document. The passage of the bill has triggered protests across the Northeast, particularly Assam, where people expressed fears of mass migration from Bangladesh.\nAlleging that a “misinformation campaign” over the bill has been launched by groups with “vested interests,” the chief minister “urged all people to stand united to thwart the evil design of divisive forces.”\n“It is a national policy that the people belonging to six religions seeking domicile in India from the neighbouring countries due to religious persecution would be shared by the whole country. But misinformation and rumours have been spread by various agencies that foreigners in hordes will flock the state after the Citizenship (Amendment) Bill, 2019 becomes an Act,” he had said earlier.\nAdvertising\nThe “false picture” must not be allowed to persist as the state government comprises indigenous people and is committed to uphold the interests of the local population, Sonowal had said.\nFor over a month now, the BJP government in Assam has faced stiff opposition over the Bill which has become a contentious issue across the North East. Amid the escalating protests, state Chief Secretary Alok Kumar said the “situation is challenging” and appealed for “peaceful and democratic” protests.\n“On a scale from one to ten, it is slowly progressing,” he said. He also appealed for “peaceful and dignified” and asked if the situation was progressing for “the worse or the better”, Kumar said, “That is for you to decide.”", "url": "https://indianexpress.com/article/north-east-india/assam/assam-cm-sarbananda-sonowal-dubs-citizenship-bill-protests-as-motivated-campaign-to-derail-development-5567829/", "label": 1}