{"authors": ["Vandana Kalra"], "date_download": "2019-03-27 14:40:26", "date_modify": "2019-03-27 14:40:26", "date_publish": "2017-02-15 00:05:34", "description": "The latest exhibition at Delhi’s Khoj Studios brings together artists and communities to mull over ways of preserving the local ecology", "filename": "article_lifestyle_art-and-culture__1553697626.html", "image_url": "https://images.indianexpress.com/2017/02/lake-480.jpg?w=480", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/indianexpress.com/article_lifestyle_art-and-culture__1553697626.html", "title": "An Alternate Course", "title_page": "\n\t\t\t\tAn Alternate Course | Lifestyle News, The Indian Express\t\t\t", "title_rss": "NULL", "source_domain": "indianexpress.com", "text": "IN HER seventies now, Sudesha Devi still remembers the first time she saw Gandhian activist Sarla Behen. A young girl, she found the proactive female political leader and her call for self-sustenance inspiring. Years later, when women in her village in Uttarakhand’s Rampur were protesting the felling of trees, it was time for Sudesha Devi to lead them. It was an act of defiance against her own family, but she recalls that it was essential to protect the forests that their livelihood depended on.\nAdvertising\nIn her house, near the Hemal river valley, Sudesha Devi shared her experiences and inhibitions with artist Sunandita Mehrotra. In the summer of 2013, the Delhi-based visual artist spent over a month with one of the first Chipko movement activists, following her as she grazed cows and discussed baranaja or the practice of mixed cropping that Sudesha Devi learnt from her father. The notes that she drafted have now turned into a 12-page graphic comic book, in the shape of an accordion. Spread on a table at Khoj Studios in Delhi, this introduces Sudesha Devi and her struggles and aspirations — through Mehrotra’s journey from Delhi to Rampur and back. “I realised the angst women had about their role not being recognised in this movement,” says Mehrotra.\nShe was part of a group of 14 artists who received grants from Khoj for its ongoing public arts initiative, “Negotiating Routes”. Their desire was to create an alternate roadmap where artists and communities come together and are involved in discussions on the regeneration of the local ecology. “Through photographs, videos, sculptural work and textual documentation, visitors get to see the alternative road map for sustainable development in our country,” says curator Mario D’Souza. The expanse of the display stretches from Chamba in Uttarakhand to Chungthang in Sikkim, Wadhwana wetlands in Gujarat, Jakkur Lake in Bengaluru, Chilika Lake in Odisha and Najibabad in Uttar Pradesh.\nIf textile artist Priya Ravish Mehra has documented the rafoogars in Najibabad in Uttar Pradesh, in an installation that uses textile patches done using rafoogari, Santiniketan postgraduate Surekha documents the death and rebirth of 200-year-old Jakkur Lake on the outskirts of Bengaluru. Through videos and photographs, she showcases its metamorphosis from a “restructured” to an “artificial” lake. “The recreative element replacing the functional and domestic aspect of the lake is also a reflection on the manmade alternatives offered as a choice at the cost of the notion of farming, and how the latter is of least priority to the governance,” says Surekha.\nAdvertising\nInteracting with the local communities is intrinsic to the project. So Shilpa Joglekar brings to the fore poems and drawings by children from the Adivasi Padas near Khopoli in Maharashtra, whereas Alex White Mazzarella, Namrata Mehta and Soaib Grewal have photographs of an akhara in Gurugram’s Tigra village to represent the disappearing cultural heritage and traditions. Odisha-based Jyotiranjan Jena involved fishermen near Chilika Lake, the second largest brackish water lagoon in the world, to utilise Ravan Chaya or shadow puppetry dance to conceptualise a video of floating shadow theatre in the lake. At Khoj, he has created a prototype of a wooden boat projecting similar shadows.\nAnd even as they discuss the ecological challenges, the artists present solutions too. Delhi-based Aastha Chauhan, for instance, trekked across Chamba region to film clips that have the locals talking about the importance of traditional medicinal plants that were once grown in their backyards. Chauhan presents that as an alternative to modern medicines. Shweta Bhattad and Aditi Bhattad, on the other hand, share small replicas of portable makeshift toilets for women that they have created in Paradsinga village in Madhya Pradesh. “Sanitation was an issue. These machan toilets also protect against pig bites that was a common problem faced by people going for open defecation,” says Bhattad, 32. By bringing the replicas to Khoj, she hopes that the simple design will appeal to other villages who might replicate them in their own surrounding.", "url": "https://indianexpress.com/article/lifestyle/art-and-culture/an-alternate-course-4525181/", "label": 1}