{"authors": ["Dilip Kumar Jha"], "date_download": "2019-03-27 14:40:49", "date_modify": "2019-03-27 14:40:49", "date_publish": "2018-05-18 00:00:00", "description": "Read more about Adivasis, farmers in Maharashtra planning to march from Nashik to Mumbai on Business Standard. The march will commence on Wednesday from Mumbai Naka in central Nashik and reach Mumbai on February 27", "filename": "article_current-affairs_adivasis-farmers-in-maharashtra-planning-to-march-from-nashik-to-mumbai-119021900995_1_1553697649.html", "image_url": "https://bsmedia.business-standard.com/_media/bs/img/article/2018-05/18/full/1526658602-4704.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/business-standard.com/article_current-affairs_adivasis-farmers-in-maharashtra-planning-to-march-from-nashik-to-mumbai-119021900995_1_1553697649.html", "title": "Adivasis, farmers in Maharashtra planning to march from Nashik to Mumbai", "title_page": "Adivasis, farmers in Maharashtra planning to march from Nashik to Mumbai | Business Standard News", "title_rss": "NULL", "source_domain": "business-standard.com", "text": "Afraid of being left out under government’s relief schemes, around 80,000 and farmers in Maharashtra are planning to begin a long march from to to press upon their demands.\nThe march will commence on Wednesday from Naka in central and reach on February 27. The police, however, said that it was expecting a gathering of around 25,000 farmers from all across the state for which all necessary precautions have been taken.\nA similar protest march, organized in March 2018, ended with promises from the state government to ensure farmers’ returns on agricultural commodities were 50 per cent higher than their cost of production, apart from loan waivers and other promises.\n“Half of Maharashtra is facing drought this year due to uneven distribution of rainfall in the last monsoon season. To weed out farmers' problems, therefore, we have listed five immediate demands which include: regular work under MGNREGA (Mahatma Gandhi Rural Employment Guarantee Act), cattle camps to look after animals in the state, compensation for crops damaged in the drought, payment of school and tuition fees of aggrieved farmers’ kids and provision of drinking water,” said Ashok Dhawale, President, All India Kisan Sabha (AIKS), the organiser of the long march.\nThese farmers have also demanded regularisation of their landholding. In fact, in 2006, the Centre passed the Forest Rights Act, also known as the Scheduled Tribes and Other Traditional Forest Dwellers (Recognition of Forest Rights) Act, 2006. The Act recognises and vests forest rights in forest dwellers. Scheduled tribes and other traditional forest dwellers are expected to benefit from this Act.\nApart from the immediate relief, farmers have also presented some long term demands.\n“The government had made dams in the state that are yet to be connected with canals. Some of them are half complete, but there are others on which work is yet to begin. The government must complete these projects on war footing to prevent droughts. Under the lift irrigation project, the government should divert 1 lakh million cubic feet (TMC) from the water flowing into the Arabian Sea to the Godavari river or some connecting dams for the benefit of farmers,” Dhawale added.\nAIKS alleged that while the government had promised to meet all demands, including 50 per cent higher realisation to farmers for their cost of agri cultivation as per the Swaminathan Committee recommendations, none of these demands has been met so far. AIKS officials noted that a few days ago, farmers were selling onion at Re 0.50 a kg in Nashik.\nIn the interim Union Budget 2019, the government announced Rs 6,000 per annum to be paid to farmers with less than five acres of land which, according to Dhawale, is not going to benefit farmers in the drought-prone Marathwada and Vidarbha regions.\n“Almost all farmers in these regions have more than five acres of land (dry land) which is of no use during droughts. Hence, these farmers would not get any benefit under this relief scheme despite being the worst affected by the drought. We want the government to relax the norms for these farmers. Also, the pension for landless farmers should be increased to Rs 3,000 from the current Rs 900 per month. We want farmers to benefit from both state and central schemes,” added Dhawale.\nSeveral such protests have been organised in the past and have prompted the state government to fix the minimum milk procurement price of Rs 25 a litre (with Rs 5 a lite incentive for value addition). Cane farmers' protests over arrears have yielded Rs 29 a kg of minimum selling price of sugar across the country which was later raised to Rs 31 a kg.", "url": "https://www.business-standard.com/article/current-affairs/adivasis-farmers-in-maharashtra-planning-to-march-from-nashik-to-mumbai-119021900995_1.html", "label": 1}