{"authors": [], "date_download": "2019-03-27 14:35:10", "date_modify": "2019-03-27 14:35:10", "date_publish": "2019-01-18 12:53:01", "description": "The actor began his career with a Tamil film Apoorva Raagangal (1975). The film went on to win three national awards.", "filename": "article_parenting_learning__1553697310.html", "image_url": "https://images.indianexpress.com/2018/12/rajinikanth.jpg?w=759", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/indianexpress.com/article_parenting_learning__1553697310.html", "title": "Happy birthday, Rajinikanth: 10 facts on the superstar to share with kids", "title_page": "\n\t\t\t\tHappy birthday, Rajinikanth: 10 facts on the superstar to share with kids | Parenting News, The Indian Express\t\t\t", "title_rss": "NULL", "source_domain": "indianexpress.com", "text": "Who knew Rajinikanth, a young boy, who worked as a bus conductor, would one day become the greatest superstars, revered by the people of India? On the occasion of the Thalaiva’s 68th birthday, share with your kids the actor’s inspiring rags-to-riches story through these facts.\nAdvertising\n1. Born on December 12, 1950, in Karnataka, Rajinikanth was the fourth child to his Marathi parents Jijabai and Ramoji Rao Gaekwad. He lost his mother at a very young age.\n2. The superstar was originally named Shivaji Rao Gaekwad.\n3. After completing his school education, Rajinikanth performed several odd jobs like that of a coolie and carpenter and later, a bus conductor.\n4. Around that time, Rajinikanth came across an advertisment by the newly established Madras Film Institute that offered acting courses. Despite much opposition from the family, he enrolled in the institute, where he met filmmaker K Balachander, who advised him to learn Tamil. And Rajinikanth quickly agreed.\nAdvertising\n5. The actor began his career with a Tamil film Apoorva Raagangal (1975). The film went on to win three national awards. Releasing one hit film after another, he kissed success to become one the biggest superstars that the country had known.\n6. Rajinikanth’s film Muthu became the first Tamil film to be dubbed into Japanese as Mutu: Odoru Maharaja, which eventually created a fan-base for the star in the country.\n7. Rajinikanth is also reportedly the only Indian actor to be featured in the Central Board of Secondary Education (CBSE) syllabus, in a lesson titled From Bus Conductor to Superstar.\n8. Not just an actor, Rajinikanth has also been actively involved social movements. In 2002, for instance, he observed a day-long fast to protest against Karnataka government’s decision to not release Kaveri water into Tamil Nadu. In 2011, he also announced his support for the anti-corruption movement led by Anna Hazare.\n9. Rajinikanth was awarded the Padma Bhushan and Padma Vibhushan in 2000 and 2016 respectively.\n10. Talking about Rajinikanth as a father, his daughter Aishwaryaa R Dhanush once told Indian Express, “We never realized who our dad was because he was as simple and as real as any man when he came home…My father never came with that aura of a superstar or at least my mother filtered it.”", "url": "https://indianexpress.com/article/parenting/learning/happy-birthday-rajinikanth-facts-5489807/", "label": 1}