{"authors": ["Press Trust Of India"], "date_download": "2019-03-27 14:29:06", "date_modify": "2019-03-27 14:29:06", "date_publish": "2018-10-12 20:30:43", "description": "Read more about AAP takes out rally against attack on Hindi-speaking migrants in Gujarat on Business Standard. AAP volunteers took out a rally in northeast Delhi Friday, protesting the violence against Hindi-speaking migrants in Gujarat earlier this month.The rally, titled Uttar Bhartiya Swabhiman Yatra, was taken out from Burari and it concluded in Karawal", "filename": "article_pti-stories_aap-takes-out-rally-against-attack-on-hindi-speaking-migrants-in-gujarat-118101201098_1_1553696946.html", "image_url": "https://bsmedia.business-standard.com/_media/bs/img/article/default/1181012/full-118101201098.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/business-standard.com/article_pti-stories_aap-takes-out-rally-against-attack-on-hindi-speaking-migrants-in-gujarat-118101201098_1_1553696946.html", "title": "AAP takes out rally against attack on Hindi-speaking migrants in Gujarat", "title_page": "AAP takes out rally against attack on Hindi-speaking migrants in Gujarat | Business Standard News", "title_rss": "NULL", "source_domain": "business-standard.com", "text": "volunteers took out a rally in northeast Friday, protesting the violence against Hindi-speaking migrants in earlier this month.\nThe rally, titled Uttar Bhartiya Swabhiman Yatra, was taken out from Burari and it concluded in Karawal Nagar falling under North East parliamentary constituency.\n\"People from Purvanchal will take revenge for the violence (unleashed) against their brethren in by voting against the BJP and in the coming Lok Sabha election,\" said senior leader and in-charge of North East constituency Dilip Pandey.\nPeople from and have played a major role in developing and other parts of the country, he said.\nHindi-speaking migrants, largely from and Bihar, were threatened and attacked in Gujarat in the aftermath of the rape of a 14-month-old girl in Sabarkantha district of the state on September 28 allegedly by a labourer from\nThe North East Delhi seat has a large concentration of people from Purvanchal and is held by\n(This story has not been edited by Business Standard staff and is auto-generated from a syndicated feed.)", "url": "https://www.business-standard.com/article/pti-stories/aap-takes-out-rally-against-attack-on-hindi-speaking-migrants-in-gujarat-118101201098_1.html", "label": 1}