{"authors": ["Vinita Govindarajan"], "date_download": "2019-03-27 14:35:02", "date_modify": "2019-03-27 14:35:02", "date_publish": "2018-01-14 09:00:00", "description": "Young professionals who participated in the Marina Beach protests last January have taken up cattle rearing, social work, politics.", "filename": "article_864404_we-work-in-it-firms-deliver-milk-every-morning-how-chennai-jallikattu-stir-changed-young-people_1553697302.html", "image_url": "https://d1u4oo4rb13yy8.cloudfront.net/facebook/49640-zoknvippsm-1484756705.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/scroll.in/article_864404_we-work-in-it-firms-deliver-milk-every-morning-how-chennai-jallikattu-stir-changed-young-people_1553697302.html", "title": "Young Chennai residents take up bull-rearing, farming", "title_page": "Jallikattu protests impact a year on: Young Chennai residents take up bull-rearing, farming", "title_rss": "NULL", "source_domain": "scroll.in", "text": "In January of last year, Tamil Nadu residents gathered in the thousands on Chennai’s Marina Beach to protest a Supreme Court ban on the state’s traditional bull-taming sport, jallikattu. “Preserve our tradition,” they cried in support of a sport many of them had not even witnessed.\nThe top court had banned the sport – traditionally held during the harvest festival of Pongal – in 2014, citing a constitutional obligation to show compassion to animals. It had upheld the ban in 2016.\nThe demonstration at Marina Beach, which was largely organised on social media and lasted a week, soon turned into a celebration of Tamil pride with people from various professions – information technology workers, lawyers and students among others – professing their love for their Tamil identity. “Tamilians have been bending for so many years, we have to stand up now,” declared one 25-year-old who worked in a garment store.\nSome likened the jallikattu movement to the 1965 anti-Hindi agitation in Tamil Nadu, when students had taken to the streets to oppose the imposition of Hindi as the state’s official language. Others compared it with Arab Spring, a series of anti-government movements in West Asia in 2010 that toppled several prominent regimes.\nThe Marina Beach protests went on to become a turning point in the lives of many participants. Several young professionals who were part of the swelling crowds are now rearing native bulls as a hobby while others have taken up farming and other socio-environmental initiatives. Where does the movement stand a year later?\nBull rearing as a hobby\nUnder a row of tents in an open area in South Chennai last weekend, a hundred-odd farm animals native to Tamil Nadu – including 30 breeds of bulls, goats, sheep and even dogs – were showcased to a curious audience. They had gathered there for the Sempulam livestock festival, organised by the Dhenu Cattle Conservation Foundation and South Indian Organic Producers and Retailers Association to celebrate the first day of the Marina Beach protests.\n“Even if I am offered Rs 5 lakhs, I will not sell my bull,” declared M Durai, a farmer and proud owner of an Umbalachery bull that he claimed was undefeated at jallikattu events. “Nobody dares step in front of him,” he laughed, standing a few steps away from the animal, who solemnly chewed its feed.\nRaja Marthandan, one of the organisers of the event, said, “The history and significance of our native livestock has faded from the minds of the people.” He added that this festival was an attempt at re-establishing the connection between the urban population and sustainable agriculture and livestock.\nA poster for the Sempulam livestock festival in Chennai. (Credit: Sempulam via Facebook)\nHimakiran, an advisor for the event, said, “One year after the movement, we decided that people should come and see what we were supporting. People think we were supporting the sport just for Tamil pride, but it is not like that. Everything is linked to our livelihoods and landscape.”\nHimakaran, who is joint secretary of the Senaapathy Kangayam Cattle Research Foundation, said the jallikattu movement sparked interest in native cattle breeds and that many engineers and information technology workers are now rearing bulls as a hobby. “We often joke that after the protests, there has been little need to spread awareness about native breeds of cattle,” he said.\nHe added that many more people are also involved in socio-environmental initiatives since the protests a year ago. “It [the protests] moved the collective conscience of society towards thinking about where we are headed in our lifestyle,” he said. “After the movement, society is no longer laughing at city people who want to get back to farming.”\nOrganisers of the livestock event in Chennai this January. (Credit: Sempulam via Facebook)\nSupport for farmers\nAt this time last year, software engineer Vetrivel was busy distributing pamphlets on Marina Beach, recruiting people for an organisation he wanted to launch – Vivasaayanadu, or Farmer’s Nation. “I realised that at Marina Beach, everyone was supporting jallikattu but people had forgotten about our farmers,” he said. At around the same time, reports had started to emerge of farmer suicides in drought-hit Tamil Nadu.\nHe received over 500 registrations on his website, following which he made a WhatsApp group to coordinate the team’s activities, which includes cleaning ponds and lakes used for irrigation, funding village schools and planting trees.\nAnother initiative born out of the jallikattu movement was the Farmer Friendly Initiative, under which over 150 volunteers are engaged in helping farmers make the transition to organic farming, manage their water resources and reduce their costs.\nThe Vivasaayanadu farmers' initiative was born out of the jallikattu protests in January 2017. (Credit: Vivasaayanadu via Facebook)\nVetrivel and his team did not stop with the Vivasaayanadu initiative. They soon spotted another problem they felt required their immediate attention. “We conducted a research on milk adulteration and found that at various stages, milk was adulterated since it passed through several middlemen,” he said. “We were shocked that this is the milk that thousands of children drink.”\nVetrivel selected a group of farmers who were rearing native cattle breeds for milk near his neighbourhood in the outskirts of West Chennai and sent the milk for chemical testing to check for adulteration. Under his new project, Uzhavar Bhoomi, the team started buying milk from the farmers and delivering it to 30 households in the area. “We wanted to break the middleman concept and create a direct connection between farmers and housholds,” he said. He added, “We all work in IT companies but at the same time deliver milk every morning.”\nUnder the project, farmers who were usually paid Rs 22 for a litre of milk now received around Rs 28. The business model was designed in such a way that the profit could be shared with the farmers. But the initiative has not made a profit so far. “We are planning to register this as a separate enterprise and expand our business to cope with financial losses,” Vetrivel said.\nIn just four months, the team has expanded its operations, buying milk from around 200 farmers and supplying to 350 households in 21 neighbourhoods across the city. “We have a lot more demand but we are not able to meet it,” said Vetrivel.\nThe organisation helps farmers through various initiatives, including a milk scheme that cuts out middlemen. (Credit: Vivasaayanadu via Facebook)\nPolitical mobilisation\nThe jallikattu protests have had a political fallout too. According to commentators, the movement was in many ways a display of frustration at the lack of leadership in Tamil Nadu in the wake of former Chief Minister J Jayalalithaa’s death in December 2016.\nThe protests prompted 36-year-old Pradeep Vishwanathan, who previously worked in a software company in Sweden, to form the Tamil Nadu Youth Party. Vishwanathan had quit his job in Sweden to move back to India and join the Aam Aadmi Party. A few years later, he realised the Aam Aadmi Party was not making much headway in Tamil Nadu and moved on to other political campaigns. When the jallikattu protests happened in January 2017, he saw an opportunity to galvanise the enthusiasm of the young people who had come out on Marina Beach “to come inside the system and cleanse it”.\nToday, his Tamil Nadu Youth Party has more than 2 lakh registered members. In December, it contested the high-profile RK Nagar Assembly bye-election that was necessitated by Jayalalithaa’s death. Its candidate, 25-year-old Dr Rajasekaran, won close to a thousand votes. The main feature of the party’s manifesto was self-governance at a hyperlocal level: it promised an athimandram or a place where residents could meet and discuss the needs of their neighbourhood.\nThe party is largely made up of young people and Vishwanathan and his team travel to various districts every month to conduct leadership workshops for young people. “More than 80% of our members are below 35 years of age,” he said.\nAccording to Vishwanathan, it was not easy to form a party and win the acceptance of the people, since the jallikattu movement was largely leaderless. “A protest is different from running a political party,” he said. “Over the past year, many got out of the race and went back to their regular work. But we are the Tamil Nadu Youth Party and we are still sustaining, growing stronger every day.”", "url": "https://scroll.in/article/864404/we-work-in-it-firms-deliver-milk-every-morning-how-chennai-jallikattu-stir-changed-young-people", "label": 1}