{"authors": ["Angellica Aribam"], "date_download": "2019-03-27 14:29:13", "date_modify": "2019-03-27 14:29:13", "date_publish": "2017-03-04 11:32:50", "description": "Ideally, our universities ought to be free spaces to ideate, debate, and deliberate in order to nurture critical thinking.", "filename": "article_blogs__1553696953.html", "image_url": "https://images.indianexpress.com/2017/02/abvp-480.jpg?w=480", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/indianexpress.com/article_blogs__1553696953.html", "title": "Ramjas violence: Authoritarian regimes across the world have always shown tendency to gag universities", "title_page": "\n\t\t\t\tRamjas violence: Authoritarian regimes across the world have always shown tendency to gag universities | Blogs News, The Indian Express\t\t\t", "title_rss": "NULL", "source_domain": "indianexpress.com", "text": "Delhi University has turned into a battlefield of extreme political ideologies in the last few days, with students of different political leanings taking out marches and counter-marches, some distributing roses in the name of peace while others putting up massive banners that could incite violence and further deteriorate the already vitiated atmosphere of the University. It can be said that in all the years of its existence, Delhi University has never seen the kind of violence that occurred outside Ramjas College on February 22nd wherein innocent students, teachers, and journalists became victims of the clash between the ABVP and left organizations. The situation would not have escalated to such a level if only the Delhi Police, who were there to ensure that law and order was maintained, didn’t allow the ABVP to carry on with the rampage with implied impunity as they looked away.\nAdvertising\nUnsurprisingly, such impunity has been the norm in every other university wherein ABVP activists have created havoc in the last few years, ever since this government came to power, indicating the fact that all of it is a concerted plan to crush any contrarian thinking in the pretext of their version of nationalism.\nIdeally, our universities ought to be free spaces to ideate, debate, and deliberate in order to nurture critical thinking but the discourse in the society bears its semblance to it. The growing tendency to threaten and ban with the apparent sanction of the government induces a certain fear of being labeled as ‘anti-nationals’ in the minds of students as well. Added to it is the regular disruptions caused by ABVP to events and seminars if it is unpalatable to their political beliefs, without initiating any dialogue that could lead to an amicable solution. This has led to crippling of the young minds’ fundamental nature to think and question. One could argue that the ABVP has always indulged in violence and murder, stemming back to the days when this government wasn’t even in power, but those incidents were sporadic. Now, it functions with immunity as Cabinet ministers come out with statements that tilt in their favor no matter the nature of the incident.\nDespite all its hypocrisy, in universities where the Left is introducing itself as an alternative, it pretends to indulge in debate than disruption although the condescension towards anyone they consider non-intellectual is palpable. The Left organizations’ bouts of violence in areas of its stronghold is a regular phenomenon, but the Right claiming victimhood by using that as a justification of what transpired at Ramjas comes across as puerile. The Right-wing nationalists also consistently accuse the Left of normalizing the call to breakup India in the garb of freedom of expression, which interestingly falls flat in this case because the Honorable Supreme Court in its landmark judgment in Arup Bhuyan vs State of Assam had observed that speech “becomes illegal only if it incites to imminent lawless action”. And no speech was allowed to be made at Ramjas, leave alone a call for “imminent lawless action”, which explains that the ABVP’s contention to the speech that could have been, was a masquerade to curb liberty and objectivity of individuals it deems as opponents.\nThe Sangh Parivar, of which the ABVP and the ruling party are offsprings, has always been intolerant of rational thinking and objectivity. There are several incidents in the past when activists of the Sangh Parivar have physically attacked progressive writers, academicians, thinkers, and artists. Authoritarian regimes across the world, be it the Left or the Right, have always shown a tendency to gag universities as the first step towards establishing the state they desire. It is, therefore, no surprise that all the attempts of the Sangh, be it systematically infiltrating into universities with proxies of mediocre credentials in positions that require excellence, interfering in the autonomy of institutions, distorting history into mythology and presenting historical incidents in a biased and partisan light, and normalizing a social order that is based on disparity and conservative hierarchy are a part of the plan to ensure that there is no freedom to think. And, the ABVP with its physical aggression is just a cog in the wheel in the grander scheme of things to subjugate the thinking populace. In such a scenario, retaliating with violence won’t be the solution to resist their agenda but the Gandhian way of persisted efforts encouraging them to indulge in conversations will immerse successful in the long run.", "url": "https://indianexpress.com/article/blogs/ramjas-violence-authoritarian-regimes-across-the-world-have-always-shown-tendency-to-gag-universities-abvp-sangh-parivar-du-4553733/", "label": 1}