{"authors": [], "date_download": "2019-03-27 14:40:57", "date_modify": "2019-03-27 14:40:57", "date_publish": "2027-01-19 00:00:00", "description": "Read more about Manipur to hold all-party meet on Citizenship (Amendment) Bill on Business Standard. Manipur Chief Minister N. Biren has convened an all-party meeting on Monday on the contentious Citizenship (Amendment) Bill, 2016.", "filename": "article_news-ians_manipur-to-hold-all-party-meet-on-citizenship-amendment-bill-119012700604_1_1553697657.html", "image_url": "https://bsmedia.business-standard.com/_media/bs/img/article/default/1190127/full-119012700604.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/business-standard.com/article_news-ians_manipur-to-hold-all-party-meet-on-citizenship-amendment-bill-119012700604_1_1553697657.html", "title": "Manipur to hold all-party meet on Citizenship (Amendment) Bill", "title_page": "\nManipur to hold all-party meet on Citizenship (Amendment) Bill\n | Business Standard News", "title_rss": "NULL", "source_domain": "business-standard.com", "text": "N. has convened an all-party meeting on Monday on the contentious Citizenship (Amendment) Bill, 2016.\nis one of the northeastern states which has been seeing various agitations in protest against the passing of this Bill on January 8 by the Lok Sabha.\nThe (United) has already announced that it will not take part in the meeting.\nJD (U) state said the had refused to summon an emergency session of the state assembly to hold a threadbare discussion on the bill.\n\"We fail to understand that anything useful will emerge from the all parties' meeting.\"\nOn Sunday, the People's Party also announced that it will refrain from participating in the meeting on Monday.\nA statement from the MPP said that it had made its position on the issue clear to the public and there is nothing to be discussed now.\n\"The BJP led government should have summoned the emergency session. We shall not participate in the meeting since the is whimsically sweeping the people in any direction\", it said.\nA sit-in protest were staged in many parts of the state on Sunday. An effigy of was burned at a market in Khetriga in district.\nThe North East Development Party launched a signature campaign from Sunday. Functionaries of the party said that the campaign which will cover the entire state will continue till the Bill is scrapped.\nChief Minister N. said: \"Now that the has assured that the interest of the indigenous peoples of the NE region shall be protected people should call off the agitations.\"\n--IANS\nil/pgh/bg\n(This story has not been edited by Business Standard staff and is auto-generated from a syndicated feed.)", "url": "https://www.business-standard.com/article/news-ians/manipur-to-hold-all-party-meet-on-citizenship-amendment-bill-119012700604_1.html", "label": 1}