{"authors": ["Press Trust Of India"], "date_download": "2019-03-27 14:40:38", "date_modify": "2019-03-27 14:40:38", "date_publish": "2018-09-10 21:05:19", "description": "Read more about 'Bharat Bandh': Maha Cong says stir '100 per cent successful' on Business Standard. The Maharashtra Congress Monday claimed that its 'Bharat Bandh' to protest against rising fuel prices was \"100 per cent successful and largely peaceful\" with all sections of the society, including traders, participating voluntarily.The party", "filename": "article_pti-stories_bharat-bandh-maha-cong-says-stir-100-per-cent-successful-118091001177_1_1553697638.html", "image_url": "https://bsmedia.business-standard.com/_media/bs/img/article/default/1180910/full-118091001177.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/business-standard.com/article_pti-stories_bharat-bandh-maha-cong-says-stir-100-per-cent-successful-118091001177_1_1553697638.html", "title": "'Bharat Bandh': Maha Cong says stir '100 per cent successful'", "title_page": "'Bharat Bandh': Maha Cong says stir '100 per cent successful' | Business Standard News", "title_rss": "NULL", "source_domain": "business-standard.com", "text": "The Monday claimed that its 'Bharat Bandh' to protest against rising fuel prices was \"100 per cent successful and largely peaceful\" with all sections of the society, including traders, participating voluntarily.\nThe party further said the ruling BJP was \"afraid\" of the protest and accused the government of trying to suppress the demonstration in the state.\nAddressing a press briefing in the evening, lashed out at the Shiv Sena, an ally in the BJP-led governments at the state and the Centre, saying it was equally to blame for the price rise.\nHe said Sena was \"helpless for power\" and that its \"real face stood exposed\".\nChavan said the Sena has \"stopped roaring and is instead barking\" after it chose to refrain from supporting the protest in\n\"Their leader said we woke up late on the people's issue. At least we woke up. There are posts on the that the has stopped roaring and is instead barking,\" he said.\nThe Sena had taken a swipe at the Congress' call in an editorial published in the former's mouthpiece Saamana Monday.\nChavan thanked the Maharashtra Navnirman Sena (MNS) for backing the agitation, but ruled out possibility of the Raj Thackeray-led party being a constituent of the grand-alliance of opposition parties the is stitching together to take on the BJP.\n\"The fuel price rise is unjust. Hence, we staged protest, which was 100 per cent successful. We got support from all sections of the people, including traders, voluntarily. The government tried to suppress the protest, but failed,\" he claimed.\nChavan denied that the caused trouble to people, adding that the government had failed to keep its promises and hence \"had to go\".\nCongress Sanjay Nirupam, who accompanied Chavan during the briefing, said the protest showed could be shutdown without the Shiv Sena's support.\n\"I want the to withdraw banners it hoisted in the city criticising the fuel price rise,\" he demanded.\nNirupam also asked the Sena to walk out of the government if it intended to do something for the people.\n(This story has not been edited by Business Standard staff and is auto-generated from a syndicated feed.)", "url": "https://www.business-standard.com/article/pti-stories/bharat-bandh-maha-cong-says-stir-100-per-cent-successful-118091001177_1.html", "label": 1}