{"authors": [], "date_download": "2019-03-27 14:18:28", "date_modify": "2019-03-27 14:18:28", "date_publish": "2018-12-31 18:08:05", "description": "Read more about Navy divers find wooden structure, rat-hole with coal sans trapped miners on Business Standard. Indian naval divers on Monday found wooden structure, coal and a rat-hole coal inside the 370-feet flooded coal mine with the help of an underwater remotely-operated vehicle (UROV) machine where 15 miners are trapped for the last 19 days in this", "filename": "article_news-ians_navy-divers-find-wooden-structure-rat-hole-with-coal-sans-trapped-miners-118123100668_1_1553696308.html", "image_url": "https://bsmedia.business-standard.com/_media/bs/img/article/default/1181231/full-118123100668.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/business-standard.com/article_news-ians_navy-divers-find-wooden-structure-rat-hole-with-coal-sans-trapped-miners-118123100668_1_1553696308.html", "title": "Navy divers find wooden structure, rat-hole with coal sans trapped miners", "title_page": "\nNavy divers find wooden structure, rat-hole with coal sans trapped miners\n | Business Standard News", "title_rss": "NULL", "source_domain": "business-standard.com", "text": "Indian naval divers on Monday found wooden structure, and a rat-hole inside the 370-feet flooded mine with the help of an underwater remotely-operated vehicle (UROV) machine where 15 miners are trapped for the last 19 days in this remote village.\n\"Two divers dived beneath the surface of the coal mine with UROV and found that there are some wooden structure, coal lying beneath and one rat-hole with coal at its mouth after spending three hours inside the flooded mine,\" said a for the rescue operations, R. Susngi.\nHe said none of trapped miners were located inside the coal mine. Susngi said that visibility was very poor.\n\"The divers said that if the level of the water could be drained out further, the search for the trapped miners will be feasible,\" the said.\n\"At present the site is cleared for the Odisha firefighters to start draining out the water from the main shaft where the miners are trapped. The firefighters are setting the high-capacity 100 horsepower pumps in nearby abandoned mines to enable to operate the pumps,\" Susngi said.\nMore than 200 rescuers, including 14 members of the Indian Navy, 72 NDRF rescuers, 21 Odisha firefighters, 35 officials besides a team of Meghalaya-owned are deployed to carry out the rescue operations.\nThe General Manger of (Northeastern Coalfields), J.A. Borah, said one of the eight submersible pumps that drain out 500 gallon of water per minute had reached the area.\n\"Two more pumps will be reaching the site and another two tomorrow along with the auxiliary pipes and other materials which are not available in or Shillong,\" Borah told IANS.\nMining expert and award-winning rescuer Jaswant lamented on the lack of coordination between the and rescuing agencies.\n\"The rescue operations is very slow because lack of coordination from the state and central agencies. In this kind of an emergency situation, we expect they should work like a machine and synchronized like a machine,\" Gill told IANS.\nGill, who shot to fame after he successfully rescued 64 miners from a flooded quarry in in 1989, hoped that the trapped miners could be \"rescued alive\".\nIn Meghalaya's capital Shillong, women workers staged a protest at the headquarters against the Conrad Sangma-led government for the \"slow process\" in rescuing the trapped miners.\n\"The government woke up only after lamented on the slow progress of the rescue operation,\" state Congress women's said.\n\"The NDRF demanded high-capacity pumps for three or four days after the pumps which was used in draining out became ineffective. What took so long for them to get those high-capacity pumps,\" she said.\nThe accident inside the illegal coal pit on December 13 was of significance, especially because the (NGT) had ordered an interim ban on \"rat-hole\" in the state from April 17, 2014.\nhad promised that \"appropriate action will be taken at appropriate time against the people who are involved in the and this is not acceptable to us\".\n--IANS\nrrk/mr\n(This story has not been edited by Business Standard staff and is auto-generated from a syndicated feed.)", "url": "https://www.business-standard.com/article/news-ians/navy-divers-find-wooden-structure-rat-hole-with-coal-sans-trapped-miners-118123100668_1.html", "label": 1}