{"authors": ["Press Trust Of India"], "date_download": "2019-03-27 14:35:25", "date_modify": "2019-03-27 14:35:25", "date_publish": "2023-10-20 00:00:00", "description": "Read more about Wealthy India can't be made without a healthy India: Naidu on Business Standard. The first step to create a developed India is to create a clean India, Vice-President M Venkaiah Naidu said today.Naidu was speaking at India Today's 'Safaigiri' awards on a day the Centre is observing the third anniversary of its Swachh Bharat", "filename": "article_pti-stories_wealthy-india-can-t-be-made-without-a-healthy-india-naidu-117100201023_1_1553697325.html", "image_url": "https://bsmedia.business-standard.com/_media/bs/img/article/default/1171002/full-117100201023.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/business-standard.com/article_pti-stories_wealthy-india-can-t-be-made-without-a-healthy-india-naidu-117100201023_1_1553697325.html", "title": "Wealthy India can't be made without a healthy India: Naidu", "title_page": "Wealthy India can't be made without a healthy India: Naidu | Business Standard News", "title_rss": "NULL", "source_domain": "business-standard.com", "text": "The first step to create a developed is to create a clean India, Vice-President M said today.\nNaidu was speaking at Today's 'Safaigiri' awards on a day the Centre is observing the third anniversary of its Swachh Mission, which aims at making the country open defecation free (ODF) by 2019.\n\"The first step to create a developed is to create a clean, hygienic and, therefore, a healthy India. A wealthy India can't be made without a healthy India,\" Naidu said.\nThe vice-president said that the cleanliness campaign was conceptualised as a people's movement to effect a change in mindset.\n\"It is easy to build a road, bridge or an airport but trying to change human behaviour is complex. I am happy that because of collective efforts by all there is a change of mindset,\" Naidu added.\nEchoing Prime Minister Modi's speech earlier in the day, Naidu laid emphasis on the role played by women who have demanded toilets in their homes and villages.\n\"Chhattisgarh's 105-year-old Kunwar Bai has sold her boats and contributed for construction of toilets. A teenager in Karnataka went on fast demanding that everyone in the neighbourhood should have a toilet. Dr Manjula, former CEO of Bangalore Rural, achieved ODF in 48 gram panchayats in six months. A 16-year-old from north Karnataka recently went on a hunger strike to put pressure on her mother to build a toilet,\" Naidu enumerated.\nWhile listing the achievements of the government's cleanliness campaign, Naidu said there was still \"a long way to go\" and a \"business as usual approach\" would not deliver results.\nHe also proposed that the government might have to think of punitive measures to ensure \"swacchta\".\n\"We have to think of going for punitive action also. It is crucial that swacchta becomes everyone's business,\" the vice-president said in his address.\nReferring to the note-ban, Naidu said that \"safaigiri\" is \"cleaning the dirt everywhere -- tan se, man se, dhan se\".\nNaidu later also gave away awards at the event.\nBabu Bai of Toomdar village, Rajasthan, who sold her jewellery to build a toilet for herself and her daughter-in- law won an award.\nAmong others who were recognised was Bangladesh for Best Asian Government Initiative in public sanitation, hygiene and cleanliness. Its High Commissioner Syed Muazzem Ali received the award.\n(This story has not been edited by Business Standard staff and is auto-generated from a syndicated feed.)", "url": "https://www.business-standard.com/article/pti-stories/wealthy-india-can-t-be-made-without-a-healthy-india-naidu-117100201023_1.html", "label": 1}