{"authors": [], "date_download": "2019-03-27 14:40:42", "date_modify": "2019-03-27 14:40:42", "date_publish": "2017-07-06 13:56:08", "description": "Marking the eve of the completion of their 10-day 'Koulu Rythu Poru Yatra', tenant farmers in Andhra Pradesh gathered in Vijayawada on Wednesday for a large-scale protest. The protest, organised by the Andhra Pradesh Tenant Farmers Sangam (Union), witnessed tenant farmers from different districts of the state participating in a rally from the city's Railway Station to Dharna", "filename": "article_angry-being-neglected-andhra-govt-tenant-farmers-gather-vijayawada-protest-64753_1553697642.html", "image_url": "https://www.thenewsminute.com/sites/default/files/Vijayawada_tenant_farmers_4.jpg", "language": null, "localpath": "/home/raj/news-please-repo//data/2019/03/27/thenewsminute.com/article_angry-being-neglected-andhra-govt-tenant-farmers-gather-vijayawada-protest-64753_1553697642.html", "title": "Angry at being 'neglected' by Andhra govt, tenant farmers gather at Vijayawada to protest", "title_page": "Angry at being 'neglected' by Andhra govt, tenant farmers gather at Vijayawada to protest | The News Minute", "title_rss": "NULL", "source_domain": "thenewsminute.com", "text": "News\nSeveral district representatives of the farmers raised issues related to their livelihood, such as issuing of Loan Eligibility Cards and waiving off old loans.\nMarking the eve of the completion of their 10-day 'Koulu Rythu Poru Yatra', tenant farmers in Andhra Pradesh gathered in Vijayawada on Wednesday for a large-scale protest.\nThe protest, organised by the Andhra Pradesh Tenant Farmers Sangam (Union), witnessed tenant farmers from different districts of the state participating in a rally from the city's Railway Station to Dharna Chowk, where a public meeting was held.\nThe 'yatra', began on June 26 in Sreekakulam and demanded proper implementation of the Land Licensed Cultivators Act, 2011 by the state government.\nViju Krishnan, National Joint Secretary, All India Kisan Mahasaba, participated in the event, along with AP Tenant Farmers Sangam State Committee members N Ranga Rao, Jamalaih, and Haribabu.\nKondal Reddy from the Rythu Swarajya Vedika was also present.\nSpeaking at the event, several district representatives of the farmers raised issues related to their livelihood, such as issuing of Loan Eligibility Cards and waiving off old loans, as per the electoral promises, while also granting fresh loans to the farmers.\nAs per an act passed in the united AP Assembly in 2011, Loan Eligibility Cards (LEC) had to be issued to tenant farmers, as it would give them access to 0% interest crop loans from banks, crop insurance and several other agricultural subsidies.\nSpeaking at the event, Viju Krishnan said that the condition of farmers under the rule of the BJP-TDP combine was distressing and also pointed at the increasing rate of suicides in the state and the country.\n\"We have found out that a farmer in India commits suicide every half an hour. In Andhra alone, out of all farmer suicides, more than 90% of them were tenant farmers,\" he said.\nHe went on to criticise the state government, adding, \"In the name of building a new capital, thousands of acres are being forcefully taken by them.\"\nN Ranga Rao said, \"There is no point in releasing Pattiseema waters for irrigation if loans are not given to the farmers first.\"\nHe also claimed, “Out of Rs 574 crore of farmer debts that need to be cleared, the state government has gotten away by waiving just Rs 144 crore.\"\nHe demanded that the government follow the recommendations of the Sri Radhakrishna Commission, which would benefit the tenant farmers.\nSpeaking at the event several other leaders criticised the state government, for implementing its anti-farmer policies.\nThere was also ruckus at the public meeting later in the day, as a constable who was in civilian clothes, was allegedly attacked by the activists near the stage, following a heated exchange.\nHowever, participants at the venue alleged that the constable had deliberately picked up a fight by intimidating them and seeking their personal details and addresses, while also videotaping the event.\nAfter the event, the police picked up some of the leaders and took them to the local police station. They were later let off.", "url": "https://www.thenewsminute.com/article/angry-being-neglected-andhra-govt-tenant-farmers-gather-vijayawada-protest-64753", "label": 1}