{"authors": ["Manoj C G"], "date_download": "2019-03-27 14:29:08", "date_modify": "2019-03-27 14:29:08", "date_publish": "2016-11-23 19:11:47", "description": "Congress wants privilege motion against PM Modi, CPM feels it’s contempt; differences over march, bandh.", "filename": "article_india_india-news-india__1553696948.html", "image_url": "https://images.indianexpress.com/2016/09/rahul-gandhi-feature1.jpg?w=480", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/indianexpress.com/article_india_india-news-india__1553696948.html", "title": "Opposition agrees to disrupt and agitate, differs on how to go about it", "title_page": "\n\t\t\t\tOpposition agrees to disrupt and agitate, differs on how to go about it | India News, The Indian Express\t\t\t", "title_rss": "NULL", "source_domain": "indianexpress.com", "text": "A privilege notice against Prime Minister Narendra Modi for not attending Parliament was among the plans Opposition parties discussed Tuesday as it became increasingly clear that the winter session of Parliament would continue to be disrupted by protests over the cash crunch.\nAdvertising\nAt a meeting Tuesday, the Opposition parties also discussed a coordinated, nationwide day-long protest apart from the already decided joint dharna on the Parliament premises and the march to Rasthrapati Bhawan.\nWATCH VIDEO: Demonetisation: Opposition Ups The Ante Against Government\nDespite the show of unity, however, fault-lines within the Opposition grouping appeared to remain. Leader of the Opposition (Rajya Sabha) Ghulam Nabi Azad and Congress deputy leader Anand Sharma, for instance, went to the Trinamool Congress’s parliamentary party office to discuss the finer points of Wednesday’s dharna in Parliament. West Bengal Chief Minister Mamata Banerjee will stage her own protest at Jantar Mantar Wednesday and it is not clear whether the rest of the Opposition would attend it.\nThe CPM, on the other hand, is not very enthusiastic about the proposal to petition President Pranab Mukherjee. And other Opposition parties, in turn, are not keen on the Left’s idea of calling a Bharat bandh saying it would further inconvenience already distressed people.\nAdvertising\nOne point on which there is no difference of opinion is that all the Opposition should not ease pressure on the BJP-led government. They also agreed on the demand for a joint parliamentary committee probe.\nCPM General Secretary Sitaram Yechury admitted there are various views on the proposal to meet the President. “What will the President of India do on this matter? That is a decision we will take together,” he said.\nCPM’s Md Salim too questioned the need to take out the march, saying the President has already lauded the government for the move.\nSources said the Congress’s Ahmed Patel argued that around 200 MPs marching to Rashtrapati Bhawan would have an impact. BSP’s Satish Chandra Mishra argued the matter has to be taken to the President because he is the constitutional head.\nWhile sources in the Congress said the idea is to move a privilege notice against the PM, Yechury said the CPM is planning to move a contempt notice against him for announcing a policy matter like demonetisation outside Parliament but not coming to the House to explain it. Both proposals were discussed. “We are legally examining the process. I believe it amounts to contempt of Parliament,” Yechury said.\n“If the PM is obdurate and not coming to Parliament, what can you do? But the point is at least let the people know,” he said when asked what purpose a contempt notice would serve. He asked whether the Prime Minister can make a policy statement outside Parliament when the House has already been summoned by the President. “According to us, he cannot. But that has been done,” he said.\nRahul Gandhi, meanwhile, reiterated the Congress’s demand: “Why is the prime minister not coming to Parliament? Why is he not talking in Parliament? He can speak on TV, he can speak in pop concerts, then why can’t he speak in Parliament?”\nAmong various points of difference was calling a Bharat bandh. Parties like the DMK and the Trinamool Congress were not in favour of this, arguing conditions similar to a strike are already being witnessed because of the cash crunch and more hardships should not be heaped on the people. A different option like forming human chains could be considered, DMK leaders said.\nSources said Congress’s Jyotiraditya Scindia forcefully argued that decisions taken in the strategy meetings would have to be binding on all parties; while differences may be discussed inside, there should be no transgressions outside. Even minute detail like the number of people in the first row of the dharna was discussed. Representation of various parties and slogans were discussed.\nSources said parties at the meeting decided to raise common slogans at Wednesday’s dharna in front of the Gandhi statue in Parliament.\nAdvertising\nEight slogans have been chosen by consensus but there will be no sloganeering for a party or a leader, and no party flags. One slogan would be “Modiji ka mann ki baat, garibon ke pet mein laath.”", "url": "https://indianexpress.com/article/india/india-news-india/opposition-agrees-to-disrupt-and-agitate-differs-on-how-to-go-about-it-winter-session-narendra-modi-4390530/", "label": 1}