{"authors": ["Press Trust Of India"], "date_download": "2019-03-27 14:28:59", "date_modify": "2019-03-27 14:28:59", "date_publish": "2035-03-20 00:00:00", "description": "Read more about AAP stages rally against land bill, threatens of major stir on Business Standard. AAP today threatened to widen its stir against the Centre if it goes ahead with the contentious land bill as party chief and Delhi Chief Minister Arvind Kejriwal held a rally here against the legislation.\t\"Narendra Modi government has been pursuing", "filename": "article_pti-stories_aap-stages-rally-against-land-bill-threatens-of-major-stir-115042200335_1_1553696939.html", "image_url": "https://bsmedia.business-standard.com/_media/bs/img/article/default/1150422/full-115042200335.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/business-standard.com/article_pti-stories_aap-stages-rally-against-land-bill-threatens-of-major-stir-115042200335_1_1553696939.html", "title": "AAP stages rally against land bill, threatens of major stir", "title_page": "AAP stages rally against land bill, threatens of major stir | Business Standard News", "title_rss": "NULL", "source_domain": "business-standard.com", "text": "AAP today threatened to widen its stir against the Centre if it goes ahead with the contentious as party chief and Chief Minister Kejriwal held a rally here against the legislation.\n\" Modi government has been pursuing anti-farmer and anti-poor policies because he has been obliged by the big industrialist, now it is time to pay them back,\" senior leader Ashutosh said.\nThe was today taking out a rally at Jantar Mantar that would be addressed by Kejriwal. It will also stage a march towards though AAP chief is not likely to join it.\n\"We warn Modi and his government that AAP will not let that happen and today thousands of farmers are coming from all across the country to register their protest and to tell the government that if it doesn't stop the Bill from becoming there would be an all movement and they would teach the government a lesson,\" Ashutosh said.\nLashing out at the Centre, party leader Sanjay Singh said the party will fight against the \"deadly Act\" tooth and nail.\nThe party said farmers from Chhattisgarh, Jharkhand, Punjab, Haryana, Odisha, Bundelkhand and Poorvanchal belt of Uttar Pradesh are participating in the rally to protest against the Bill.\n\"The BJP says that they have made necessary changes in the Act. This is nothing but a joke. What compelled the BJP to change the provisions of the Act, just after nine months in power. This is nothing but a move to benefit its industrialist friends,\" Singh said.", "url": "https://www.business-standard.com/article/pti-stories/aap-stages-rally-against-land-bill-threatens-of-major-stir-115042200335_1.html", "label": 1}