{"authors": [], "date_download": "2019-03-27 14:34:45", "date_modify": "2019-03-27 14:34:45", "date_publish": "2016-09-17 18:44:08", "description": "Odisha Chief Minister Naveen Patnaik said that he was not happy and said his government will decide tomorrow on steps to safeguard the state's interests.", "filename": "article_india_india-news-india__1553697285.html", "image_url": "https://images.indianexpress.com/2016/09/odisha-cm-480.jpg?w=480", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/indianexpress.com/article_india_india-news-india__1553697285.html", "title": "Mahanadi row: Centre tries to resolve issue but Odisha CM Naveen Patnaik unhappy", "title_page": "\n\t\t\t\tMahanadi row: Centre tries to resolve issue but Odisha CM Naveen Patnaik unhappy | India News, The Indian Express\t\t\t", "title_rss": "NULL", "source_domain": "indianexpress.com", "text": "The Centre on Saturday attempted to resolve Mahanadi river water dispute between Odisha and Chhattisgarh at a trilateral meeting in New Delhi but Odisha Chief Minister Naveen Patnaik was not happy and said his government will decide tomorrow on steps to safeguard the state’s interests.\nAdvertising\nAt the meeting convened by Union Water Resources Minister Uma Bharti, it was decided that a committee would be formed to examine dam projects in the two states including those on Mahanadi, sharing of whose water has become a matter of dispute between them, to see if rules were flouted during their construction.\nPatnaik said he wanted Chhattisgarh to immediately stop work on its barrages but his demand was not accepted at the meeting which was also attended by his counterpart Raman Singh.\n“I have called a meeting of the Cabinet in Bhubaneswar on Sunday. We will decide steps to take. We will leave no stone unturned in the interest of people of Odisha,” he said.\nAdvertising\nEarlier, Bharti said the decision to form the committee was taken “amicably”.\n“A committee will be formed under officer on special duty to examine all the projects of Chhattisagarh and Odisha which are eligible to be first studied by technical advisory committee (TAC), but are being built without TAC’s go ahead\n“The committee under OSD will study data from the two states within a week to see if rules were flouted while constructing the projects,” Bharti told reporters.\nThe committee, which will also have officials from the two states as their members, will study the projects within a week. Two teams will be sent to the two states to gather data.\nThe Union Minister said another committee will be formed, as proposed by Odisha government, to study situation in Mahanadi basin/catchment area during monsoon and non-monsoon period.\n“If the committee says, a board will be set up to settle disputes. The committee will be headed by Water Resources Ministry official and will have officials from both states, Water Resources Ministry officials and environmentalists as its members,” she added.\nWatch What Else Is Making News\nPatnaik claimed that the barrages being constructed by Chhattisgarh government on Mahanadi will affect drinking water and irrigation facilities in Odisha, a concern which was downplayed by Singh.\nAmong other things, Bharti said Chhattisgarh proposed setting up of a gauge station by Central Water Commission at a point where Mahanadi enters Odisha to know amount of water flows to latter. “Odisha has backed the proposal,” she added.\nTo resolve the dispute, the Union Water Resources Minister proposed that both Odisha and Chhattisgarh stop work for a week on projects which have become a bone of contention between the two states.\nAsked whether the states agreed to this, she said, “we can only propose” as water is a state subject.\nTerming Mahanadi as “lifeline” for Odisha, Patnaik said Chhattisgarh’s barrages on Mahanadi will “seriously” affect supply of drinking water and irrigation activities in Odisha besides creating environmental issues in its sanctuaries.\n“I raised the point strongly and said the Chhattisgarh government must stop work on their barrages on Mahanadi river. At least, stop work for sometime, sit down and look into these matters. But they were not agreeable. I have called a meeting of the Cabinet in Bhubaneswar tomorrow. We will decide steps to take. We will leave no stone unturned in the interest of people of Odisha,” he said.\nAsked if the meeting did not yield any solution for Odisha, Patnaik said, “I said (it) quite clearly.”\nSingh downplayed concerns raised by Patnaik saying the quantum of water which flows from Chhattisgarh to Odisha’s Hirakud Dam can fill the reservoir “five times” and said the neighbouring state’s objection as “surprising”.\nWhen asked about Patnaik’s decision to call state cabinet’s meeting to decide further steps in the matter, Bharti said, “It is the state’s right to take steps it wants. We have no right to advise any state on it.”\nShe added that the Central Water Commission (CWC) has not received any master plan from Chhattisgarh for any project on Mahanadi.\nSpeaking about issues raised by Patnaik during the two-and-half hour meeting, Singh said the six barrages, construction of which is being questioned by Odisha, are complete to the extent of 99 percent and don’t require permission of CWC. He sought to quiz timing of the neighbouring state’s objection.\nHe also blamed Odisha for not being ready to form a board to settle inter-state disputes over use of Mahanadi.\nAdvertising\n“Chhattisgarh is using only 15 percent of the river water. 35 percent is used by Odisha. Rest is flowing into the sea. You use this downstream water going into sea,” Singh advised Odisha government.", "url": "https://indianexpress.com/article/india/india-news-india/mahanadi-row-centre-tries-to-resolve-issue-but-odisha-cm-naveen-patnaik-unhappy-3036152/", "label": 1}