{"authors": [], "date_download": "2019-03-27 14:18:12", "date_modify": "2019-03-27 14:18:12", "date_publish": "2015-06-29 09:05:13", "description": "The Aam Aadmi Party AAP will hold a protest march in the national capital today, demanding the resignation of External Affairs Minister Sushma Swaraj, Rajasthan Chief Minister Vasundhara Raje and HRD Minister Smriti Irani", "filename": "articles_aap-to-hold-protes_f2e39b4e8ef3ff00e26c4ef26573f46e_16328179_1553696292.html", "image_url": "https://www.mid-day.com/articles/aap-to-hold-protest-march-demanding-resignation-of-tainted-bjp-leaders-today/16328179", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/mid-day.com/articles_aap-to-hold-protes_f2e39b4e8ef3ff00e26c4ef26573f46e_16328179_1553696292.html", "title": "AAP to hold protest march demanding resignation of 'tainted' BJP leaders today", "title_page": "AAP to hold protest march demanding resignation of 'tainted' BJP leaders today - news", "title_rss": "NULL", "source_domain": "mid-day.com", "text": "national\nThe Aam Aadmi Party (AAP) will hold a protest march in the national capital today, demanding the resignation of External Affairs Minister Sushma Swaraj, Rajasthan Chief Minister Vasundhara Raje and HRD Minister Smriti Irani\nNew Delhi: The Aam Aadmi Party (AAP) will hold a protest march in the national capital today, demanding the resignation of External Affairs Minister Sushma Swaraj, Rajasthan Chief Minister Vasundhara Raje and HRD Minister Smriti Irani.\nThe protest march will take place from Jantar Mantar to the Parliament. The BJP, which has been defending Sushma Swaraj despite opposition demands that she be sacked for helping Lalit Modi, has been hit with another worry when the former IPL boss claimed that Raje secretly supported his immigration plea in Britain.\nThe opposition mounted pressure on Raje after the emergence of a letter reportedly carrying her signature, in which she backs Lalit Modi's application in the UK. Meanwhile, a Delhi court agreed to hear a complaint against Union HRD Minister Smriti Irani over her educational qualifications.", "url": "https://www.mid-day.com/articles/aap-to-hold-protest-march-demanding-resignation-of-tainted-bjp-leaders-today/16328179", "label": 1}