{"authors": ["Press Trust Of India"], "date_download": "2019-03-27 14:40:26", "date_modify": "2019-03-27 14:40:26", "date_publish": "2025-01-19 00:00:00", "description": "Read more about Jabalpur collector appears in HC over stray animal menace on Business Standard. Jabalpur Collector Chhavi Bharadwaj appeared in person before the Madhya Pradesh High Court on Thursday to file an affidavit over action taken to remove stray animals from the streets here.A division bench of justices P K Jaiswal and Anjali Palo", "filename": "article_pti-stories_jabalpur-collector-appears-in-hc-over-stray-animal-menace-119012500044_1_1553697626.html", "image_url": "https://bsmedia.business-standard.com/_media/bs/img/article/default/1190125/full-119012500044.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/business-standard.com/article_pti-stories_jabalpur-collector-appears-in-hc-over-stray-animal-menace-119012500044_1_1553697626.html", "title": "Jabalpur collector appears in HC over stray animal menace", "title_page": "Jabalpur collector appears in HC over stray animal menace | Business Standard News", "title_rss": "NULL", "source_domain": "business-standard.com", "text": "Chhavi Bharadwaj appeared in person before the High Court on Thursday to file an over action taken to remove stray animals from the streets here.\nA division bench of justices P K and had summoned the bureaucrat after finding out that no was filed in compliance with a previous court order, the district collector's counsel, Samdarshi Tiwari, said.\nThe appeared before the court and filed the affidavit, Tiwari added.\nOver the delay in filing the affidavit, Tiwari said this was on account of the being away from\nIn the affidavit, Bharadwaj said a decision was taken by the authorities concerned to take action under CrPC section 144 (related to prohibitory orders) against persons who set animals free on streets, the said.\nThe district administration and the police had extended all possible support to the Municipal Corporation (JMC) to take action in this regard, he added.\nThe court was informed by the JMC that there was a shortage of land to keep the stray animals and the process was on to earmark more land, the said.\nThe court gave a fortnight's time to officials to identify the land and create a new space to keep the stray animals, Tiwari said.\n(This story has not been edited by Business Standard staff and is auto-generated from a syndicated feed.)", "url": "https://www.business-standard.com/article/pti-stories/jabalpur-collector-appears-in-hc-over-stray-animal-menace-119012500044_1.html", "label": 1}