{"authors": ["Press Trust Of India"], "date_download": "2019-03-27 14:34:50", "date_modify": "2019-03-27 14:34:50", "date_publish": "2018-04-05 18:20:13", "description": "Read more about Cauvery: Oppn sponsored bandh near total in TN on Business Standard. The DMK-led opposition parties' sponsored bandh demanding setting up of the Cauvery Management Board was by and large peaceful and near total in Tamil Nadu, barring stone-pelting incidents in some parts.Rail and road blockade, demonstrations,", "filename": "article_pti-stories_cauvery-oppn-sponsored-bandh-near-total-in-tn-118040500895_1_1553697290.html", "image_url": "https://bsmedia.business-standard.com/_media/bs/img/article/default/1180405/full-118040500895.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/business-standard.com/article_pti-stories_cauvery-oppn-sponsored-bandh-near-total-in-tn-118040500895_1_1553697290.html", "title": "Cauvery: Oppn sponsored bandh near total in TN", "title_page": "Cauvery: Oppn sponsored bandh near total in TN | Business Standard News", "title_rss": "NULL", "source_domain": "business-standard.com", "text": "The DMK-led opposition parties' sponsored bandh demanding setting up of the Management Board was by and large peaceful and near total in Tamil Nadu, barring stone-pelting incidents in some parts.\nRail and road blockade, demonstrations, and impromptu rallies by the Opposition marked the shutdown in the state affecting normal life to some extent.\nPolice said stone pelting incidents were reported from places including Chennai, Vellore, Erode and Sivaganga.\nA police man was injured in Chennai in a stone-pelting incident, they said.\nIn some regions like parts of district, the bandh evoked partial and mixed response.\nAlthough state-run transport corporation buses were operated, it witnessed a drop in services owing to support for the bandh from opposition backed trade unions, including DMK's LPF.\nDeputy O Panneersevalm, however, said 98 per cent of the buses were operated.\nand Metro rail operations were not affected.\nThere was poor patronage for buses in most parts of the state like at the major inter and intra state Koyambedu Bus Terminus here.\nDespite availability of drivers and conductors, there were almost no takers for the services in the sprawling terminus which presented a deserted look.\nbuses remained parked inside the terminus.\nKSRTC operates services to several destinations in including Chennai. Similarly, state run buses to Karnataka were suspended, officials said.\nWhile political parties held demonstrations off Hosur, close to the Karnataka border, of Kannada Chaluvali Vatal Paksha, Vatal Nagaraj held a similar agitation near Attibele close to the Tamil Nadu border.\nPolice personnel of both the states persuaded the protesters to disperse after sometime.\nWith the backing of a key traders body, retail outlets, grocery shops and establishments were closed in most places, including Chennai and the delta districts of Tiruchirappalli and Thanjavur.\nBanks, pharmacies, hospitals and schools, however, remained open.\nCalling the shutdown a \"100 per cent success,\" DMK working M K said a decision on the next course of protests would be taken up if the Centre did not listen to the voice of Tamil Nadu on\nCPI (M) K Balakrishnan, too dubbed the shutdown as a huge success. Such protests would continue till the CMB was constituted, he said.\nThol Thirmavalavan, Manithaneya Makkal Katchi M H Jawahirullah also said the shutdown was a success.\nHitting out at the AIADMK regime for being \"subservient\" to the Centre, said the state should pressure the Centre to withdraw its plea in the\nThe Centre has submitted a petition seeking \"clarification,\" on a scheme for implementing the top court's verdict over allocation of Cauvery water among riparian states.\nEarlier, led a sit-in demonstration and an impromptu rally of opposition workers from (a main arterial road) to Kamaraj Salai abutting the\nHolding a black flag, which had letters \"constitute CMB,\" embossed on it, Stalin, alongwith leaders of Congress, VCK and others walked the 1.6 km stretch.\nThe police personnel's efforts to halt the rally midway by placing barricades did not suceed and they walked up to the\nHe, alongwith other party leaders, including Tamil Nadu Committee and Thirumavalavan, were removed from the spot.\nPolice personnel had to literally carry Stalin, the of Opposition from the spot as he refused to disperse leading to tumultous scenes.\nAccusing the DMK of stone pelting incidents, senior AIADMK and Fisheries D Jayakumar said, \"stone was used in the stone age..has DMK returned to stone age.\"\nApparently referring to impromptu demonstrations, Jayakumar said \"these things cannot be accepted in a democracy.\"\n\"There are designated places to stage protests where agitations can be held. Protests should not disturb others,\" he said.\nStalin said some \" were deliberately spreading rumours to make it appear as if violent protests were staged.\"\nsaid there should be no violence in protests held over the Cauvery issue.\n\"There is an opportunity for violence, if attempts are made to halt the protest,\" he said.\nMeanwhile, pro-Kannada organisations today gave a call for a statewide bandh in poll-bound Karnataka on April 12 in a counter to protests in Tamil Nadu.\n(This story has not been edited by Business Standard staff and is auto-generated from a syndicated feed.)", "url": "https://www.business-standard.com/article/pti-stories/cauvery-oppn-sponsored-bandh-near-total-in-tn-118040500895_1.html", "label": 1}