{"authors": [], "date_download": "2019-03-27 14:18:24", "date_modify": "2019-03-27 14:18:24", "date_publish": "2018-07-09 07:10:06", "description": "Read more about Appropriate electoral tactics to maximise anti-BJP vote: Yechury on Business Standard. Communist Party of India (Marxist) general secretary Sitaram Yechury on Sunday said that they will adopt \"appropriate electoral tactics to maximise the pooling of anti-BJP votes\".Speaking to the media after a meeting with the central committee", "filename": "article_news-ani_appropriate-electoral-tactics-to-maximise-anti-bjp-vote-yechury-118070900077_1_1553696304.html", "image_url": "https://bsmedia.business-standard.com/_media/bs/img/article/default/1180709/full-118070900077.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/business-standard.com/article_news-ani_appropriate-electoral-tactics-to-maximise-anti-bjp-vote-yechury-118070900077_1_1553696304.html", "title": "Appropriate electoral tactics to maximise anti-BJP vote: Yechury", "title_page": "Appropriate electoral tactics to maximise anti-BJP vote: Yechury | Business Standard News", "title_rss": "NULL", "source_domain": "business-standard.com", "text": "(Marxist) Yechury on Sunday said that they will adopt \"appropriate electoral tactics to maximise the pooling of anti-BJP votes\".\nSpeaking to the media after a meeting with the central committee members of and discussing the ongoing political scenario after BJP-IPFT came to power in\nYechury said that their policies will be formed according to the states.\n\"Our main slogan is to\" defeat BJP, save India'. In it will be 'defeat Trinamool Congress, save Bengal,' similarly in Tamil Nadu, it will be to 'defeat AIADMK, save ',\" the former Parliamentarian said.\nYechury further accused of using the worst kind of by consolidating communal Hindutva votes.\nHe also announced that the Left parties will hold a protest on July 24 outside Parliament in against the \"murder of democracy in and Tripura\", CPI-M Yechury.\nHe further accused the Rashtriya Swayamsevak Sangh (RSS) and of patronising the atmosphere of fear and violence in the country using 'private army'. He also said that a danger for the future of the country and the society.\nHe further said that the government minimum support price scheme is a fraudulent activity.\n\"They are calculating the cost of production through their own formula, which is much less than what the is spending on cultivation. The fraud of minimum support price to the farmers will be exposed through struggles of the peasantries and there is no guarantee that the government agencies will buy the crops at this price,\" said the CPI (M)\nThe CPI (M) general secretary announced that they demand a new law where every will have the right to sell at the minimum support price. Also, that the party will support All Kisan Sabha in its call for 'Jail Bharo' on August 9.\nYechury also questioned the rule imposed on the state of and Kashmir and condemned BJP-RSS to use the and Kashmir situation for political gain.\n\"They are trying to keep the situation in and Kashmir volatile to feed the communal polarisation in the rest of the country. It was expected that during the Governor's Rule, the situation will improve but it has remained as it was earlier. Three people, including a young girl, were killed just two days back as now the first step against stone pelting is firing and which is not justified,\" said Yechury.\n(This story has not been edited by Business Standard staff and is auto-generated from a syndicated feed.)", "url": "https://www.business-standard.com/article/news-ani/appropriate-electoral-tactics-to-maximise-anti-bjp-vote-yechury-118070900077_1.html", "label": 1}