{"authors": [], "date_download": "2019-03-27 14:40:32", "date_modify": "2019-03-27 14:40:32", "date_publish": "2019-02-04 22:10:12", "description": "Taking a dig at his political opponents, particularly the Shiv Sena, Fadnavis said Hazare should recall the comments made in the past by the people who have met him and extended their support.", "filename": "article_india__1553697632.html", "image_url": "https://images.indianexpress.com/2019/01/fadnavis759.jpg?w=759", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/indianexpress.com/article_india__1553697632.html", "title": "Govt has agreed to accept Hazare’s demands, says Maha CM Devendra Fadnavis", "title_page": "\n\t\t\t\tGovt has agreed to accept Hazare’s demands, says Maha CM Devendra Fadnavis | India News, The Indian Express\t\t\t", "title_rss": "NULL", "source_domain": "indianexpress.com", "text": "Under fire over indefinite fast of Anna Hazare for appointment of anti-corruption watchdogs, and in the wake of the Gandhian’s warning to return his Padma Bhushan award, Maharashtra Chief Minister Devendra Fadnavis Monday requested the octogenarian to end his protest, saying the government has agreed to accept almost all of his demands.\nAdvertising\nTaking a dig at his political opponents, particularly the Shiv Sena which has appealed to the state government to save the life of the 81-year-old, Fadnavis said Hazare should recall the comments made in the past by the people who have met him and extended their support.\n“We request Anna to call off fast. We have agreed to almost all of his demands, especially the one related to Lokayukta and formation of a joint committee. We have said yes to it,” the chief minister told reporters on the sidelines of an event here.\nThe anti-graft crusader has been on hunger strike since January 30 in his native Ralegan Siddhi village in Ahmednagar district, over 240 kilometres from here, for appointment of anti-corruption watchdogs at the Centre and in Maharashtra.\nHis other demand includes resolution of farmers’ issues.\nAdvertising\nAs per doctors, Hazare has lost 4.25 kgs since last Wednesday.\nEarlier in the day, Maharashtra Navnirman Sena (MNS) chief Raj Thackeray and noted water conservationist Rajendra Singh separately called on the Gandhian in his village.\nThackeray asked Hazare not to sacrifice his life for the “useless” government.\nFadnavis said, “Some people met Hazare and extended their support to his cause. Anna should remember the comments made by these people against him in the past”.\nHours after the Sena appealed to the government to save Hazare’s life and took a swipe against Prime Minister Narendra Modi on appointing anti-graft watchdogs, Fadnavis said some people are playing politics as Hazare’s health is deteriorating.\n“The people who are meeting Anna nowadays actually do not have any concerns for his health,” the chief minister said.\nShiv Sena chief Uddhav Thackeray, whose party is an ally of the BJP at the Centre and in Maharashtra, had Sunday extended his support to Hazare, asking him to emulate socialist leader Jayaprakash Narayan and lead an agitation against corruption.\nHazare had earlier warned that if the Modi government did not fulfil its promises, he would return his Padma Bhushan award.\nFadnavis said he had sent a letter to Hazare requesting him to call off his fast.\n“We have also given an appropriate letter to him about the issues pertaining to the Central government. The Centre has taken steps on all the issues Anna has been demanding. He should withdraw his fast unto death without any hesitation. I have sent a letter making the similar request to him,” the CM added.\nIn an apparent bid to build the anti-corruption narrative ahead of elections, the state Cabinet last week decided to bring the office of Maharashtra Chief Minister under the jurisdiction of Lokayukta.\nAdvertising\nThe government also decided that ministers and Opposition leaders will also be brought under the ambit of Lokayukta- an anti-corruption ombudsman organisation in the States which mainly helps people publicise corruption among the politicians and government Officials.", "url": "https://indianexpress.com/article/india/govt-has-agreed-to-accept-hazares-demands-says-maha-cm-5569114/", "label": 1}