{"authors": [], "date_download": "2019-03-27 14:29:04", "date_modify": "2019-03-27 14:29:04", "date_publish": "2019-01-17 14:00:29", "description": "The rally at Kolkata's Brigade parade ground is being seen as an effort by Banerjee to unite the Opposition against the Narendra Modi-led government ahead of the Lok Sabha elections.", "filename": "article_india__1553696944.html", "image_url": "https://images.indianexpress.com/2018/09/stalin-7.jpg?w=759", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/indianexpress.com/article_india__1553696944.html", "title": "DMK leader MK Stalin confirms attendance at Mamata’s mega rally on Jan 19", "title_page": "\n\t\t\t\tDMK leader MK Stalin confirms attendance at Mamata’s mega rally on Jan 19 | India News, The Indian Express\t\t\t", "title_rss": "NULL", "source_domain": "indianexpress.com", "text": "Dravida Munnetra Kazhagam (DMK) leader MK Stalin will attend Trinamool Congress leader and West Bengal Chief Minister Mamata Banerjee’s rally on January 19. In a tweet from the DMK’s official handle on Thursday, Stalin confirmed his attendance.\nAdvertising\nSeveral leaders from various parties are expected to attend the rally that is being held against the BJP government at the Centre. Among those who have committed their presence at the rally are — former Prime Minister HD Deve Gowda, chief ministers of Andhra Pradesh, Telangana, Delhi and Karnataka, former J&K CM Omar Abdullah, former Uttar Pradesh CM Akhilesh Yadav, former Maharashtra CM Sharad Pawar.\nParties like the Janata Dal (Secular), Aam Aadmi Party (AAP), Nationalist Congress Party (NCP), and the People’s Democratic Party (PDP) are also slated to attend the event.\nCongress chief Rahul Gandhi is likely to skip the rally but it is learned that senior party leader Mallikarjun Kharge will be attending the event as a party representative.\nAdvertising\nThe rally at Kolkata’s Brigade parade ground is being seen as an effort by Banerjee to unite the Opposition against the Narendra Modi-led government ahead of the Lok Sabha elections.\nOn several occasions in the recent months, leaders of the Opposition parties have been seen holding meetings in the hopes of stitching up a strong alliance against the ruling government.\nIn December last year, a meeting was held at the Parliament annexe by a number of Opposition leaders to ‘chart the future course of action’ and form a front of non-BJP parties.\nRecently, the Akhilesh Yadav-led Samajwadi Party and Mayawati’s Bahujan Samaj Party had announced an alliance in Uttar Pradesh ahead of the Lok Sabha elections. Both parties will be sharing 38 seats each out of the state’s 80 parliamentary constituencies.", "url": "https://indianexpress.com/article/india/dmk-leader-mk-stalin-confirms-attendance-at-mamatas-mega-rally-on-jan-19-5542603/", "label": 1}