{"authors": [], "date_download": "2019-03-27 14:29:13", "date_modify": "2019-03-27 14:29:13", "date_publish": "2016-11-25 19:30:08", "description": "The opposition parties had called the bandh to protest the passage of decades-old Chhotanagpur and Santal Paragana Tenancy Act (CNT and SPT) on November 23, claiming that it would hurt the interests of the tribals.", "filename": "article_india_india-news-india__1553696953.html", "image_url": "https://images.indianexpress.com/2016/11/jharkhand4801.jpg?w=480", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/indianexpress.com/article_india_india-news-india__1553696953.html", "title": "Vehicles torched during Jharkhand bandh", "title_page": "\n\t\t\t\tVehicles torched during Jharkhand bandh | India News, The Indian Express\t\t\t", "title_rss": "NULL", "source_domain": "indianexpress.com", "text": "Eight vehicles were on Friday set ablaze while the driver of another truck was injured in an attack as normal life was affected in Jharkhand during a statewide bandh called by the opposition parties, police said. The opposition parties had called the bandh to protest the passage of decades-old Chhotanagpur and Santal Paragana Tenancy Act (CNT and SPT) on November 23, claiming that it would hurt the interests of the tribals. While six vehicles, including a bus and trucks, were torched in Dumka district, a truck and a dumper were set alight by the bandh supporters in East Singhbhum district.\nAdvertising\nIn West Singhbhum district, bandh supporters attacked a truck carrying coins worth lakhs of rupees and injured its driver, SP Michael Raj S said. The bandh supporters, police and State Bank of India officials were unaware of the coins being transported from RBI, Patna, he added. On being informed, a police team reached the spot and ensured the truck’s safe journey to Chakradharpur.\nPolice said six vehicles were torched and several others damaged by the bandh supporters armed with bows and arrows in front of Santal Paragana College in Dumka district. They assembled at the college ground violating prohibitory orders under section 144, CrPC imposed by the district administration on account of the bandh, police said.\nA 10-wheeler truck was set ablaze near Pipla on NH 33 under MGM police station, while a dumper was torched at Dhamdum village under Potka police station of East Singhbhum district. SP (Rural) Md Arshi said 11 persons were arrested in connection with the two incidents.\nAdvertising\nRegarding the Pipla incident, Arshi said the bandh supporters attempted to burn the truck, but timely intervention by the police ensured that the flames were doused. Four persons were arrested in this regard.\nMeanwhile, over 1,000 bandh supporters, including JVM general secretary Abhay Singh, East Singhbhum district Congress chief Vijay Khan, former Jharkhand minister Dulal Bhuiyan and Jharkhand People’s Party chief Surya Singh Besra were rounded up in the Kolhan region, comprising East and West Singhbhum and Seraikela-Kharswan districts.\nThe bandh supporters put up road blockades at various places by burning tyres, affecting road traffic. Many shops and business establishments downed their shutters while long distance buses were off road. Seraikela-Kharswan district SP Indrajeet Mahatha said shops and markets remained open while banks, ATMs and petrol pumps functioned normally. However, the mining sector was affected by the bandh.", "url": "https://indianexpress.com/article/india/india-news-india/vehicles-torched-during-jharkhand-bandh-4395128/", "label": 1}