{"authors": ["Press Trust Of India"], "date_download": "2019-03-27 14:34:50", "date_modify": "2019-03-27 14:34:50", "date_publish": "2015-04-17 21:42:08", "description": "Read more about Nobody will be allowed to break India's unity: Rajnath on Business Standard. Union Home Minister Rajnath Singh today said India's unity and integrity were \"inviolable\" and nobody will be allowed to break them.\t\"I would like to assure the countrymen that no one will be allowed to break the unity and integrity of the country", "filename": "article_pti-stories_nobody-will-be-allowed-to-break-india-s-unity-rajnath-115041701222_1_1553697290.html", "image_url": "https://bsmedia.business-standard.com/_media/bs/img/article/default/1150417/full-115041701222.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/business-standard.com/article_pti-stories_nobody-will-be-allowed-to-break-india-s-unity-rajnath-115041701222_1_1553697290.html", "title": "Nobody will be allowed to break India's unity: Rajnath", "title_page": "Nobody will be allowed to break India's unity: Rajnath | Business Standard News", "title_rss": "NULL", "source_domain": "business-standard.com", "text": "Union Home Minister today said India's unity and integrity were \"inviolable\" and nobody will be allowed to break them.\n\"I would like to assure the countrymen that no one will be allowed to break the unity and integrity of the country be it Masarat Alam or anybody else,\" Singh told reporters after addressing a rally in Mati here.\nThe government had yesterday allowed hardline separatist leader Syed Ali Shah Geelani to hold a rally in the outskirts of where his supporters including Masarat Alam, released from jail last month, raised pro- slogans and others waved Pakistani flags.\nDefending the PDP- coalition government of Jammu and Kashmir, Rajnath said that even state government hadn't anticipated such anti- activities.\nHe also congratulated J&K Chief Minister over the arrest of Alam.\nneeds to maintain better relations with as it is a neighbouring country. But whenever they indulge in anti- activities, a strong message is sent to them, he said.", "url": "https://www.business-standard.com/article/pti-stories/nobody-will-be-allowed-to-break-india-s-unity-rajnath-115041701222_1.html", "label": 1}