{"authors": ["Press Trust Of India"], "date_download": "2019-03-27 14:40:44", "date_modify": "2019-03-27 14:40:44", "date_publish": "2018-12-24 19:20:38", "description": "Read more about TRS chief KCR steps up efforts to forge non-BJP, non-Cong alliance, meets Mamata after Patnaik on Business Standard. Telangana Chief Minister K Chandrasekhar Rao on Monday met his West Bengal counterpart Mamata Banerjee and said efforts for a non-BJP and non-Congress alliance will continue.He further said that very soon they will come out with a concrete plan for", "filename": "article_pti-stories_trs-chief-kcr-steps-up-efforts-to-forge-non-bjp-non-cong-alliance-meets-mamata-after-patnaik-118122400725_1_1553697644.html", "image_url": "https://bsmedia.business-standard.com/_media/bs/img/article/default/1181224/full-118122400725.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/business-standard.com/article_pti-stories_trs-chief-kcr-steps-up-efforts-to-forge-non-bjp-non-cong-alliance-meets-mamata-after-patnaik-118122400725_1_1553697644.html", "title": "TRS chief KCR steps up efforts to forge non-BJP, non-Cong alliance, meets Mamata after Patnaik", "title_page": "TRS chief KCR steps up efforts to forge non-BJP, non-Cong alliance, meets Mamata after Patnaik | Business Standard News", "title_rss": "NULL", "source_domain": "business-standard.com", "text": "Telangana K on Monday met his counterpart and said efforts for a non-BJP and non- alliance will continue.\nHe further said that very soon they will come out with a concrete plan for the next year's elections.\nRao, who met his counterpart at the state secretariat here, described it as a \"very pleasant one\".\nHe said that \"discussions (on Federal Front) will continue\".\nThe chief came to meet Trinamool and a day after he met his Odisha counterpart and BJD Naveen Patnaik, another strong regional leader.\nFresh from victory in his home state Telangana, Rao is meeting prominent leaders to provide an alternative to the and the BJP ahead of the 2019 election.\nFrom eastern metropolis as per an earlier official release he would go to to meet and latter to and among others.\n\"Discussions with didi is always there. When two political leaders meet, they definitely discuss matters of mutual interest and matters of national interest.\n\"We had a very pleasant discussion. We will continue our discussion. There is a dialogue which I had started yesterday. This is a unification of forces across the nation. There is a dialogue I started yesterday. I met Odisha's yesterday and today I met didi,\" Rao told reporters.\n\"Our dialogue will continue. Very shortly we will come out with a concrete plan,\" he said recollecting about getting congratulatory call from Banerjee after he was elected as the for the second time.\n\"I came to visit the Kalighat (famous in Kolkata) and I thought of meeting didi and seek her blessings,\" he said.\nAsked about his mission on non-BJP and non-Congress alliance, KCR said,\" I will continue to do with my efforts. It is the mission of KCR, I will continue in my mission.\"\nWith not very far, efforts to cobble up ties among parties have gained momentum.\nAmong anti-BJP bloc, while some leaders like N Chandrababu Naidu and DMK's M K Stalin are trying to forge a broad coalition including Congress, others like chief and Mamata Banerjee are strong votaries of Federal front of regional parties.\nMamata Banerjee whose state has 42 seats has also called a grand rally in Kolkata on January 19 of opposition parties.\nOdisha has a total of 21 seats while Telangana carved out of has 17 seats.\nStalin's \"Rahul-for-PM\" proposal recently was not taken kindly by TMC and other parties who advocated that leadership issue of the opposition camp should be decided after the Parliamentary polls.\nAfter meeting his BJD counterpart on Sunday, the had emphasised a \"dire need\" for unification of regional parties to provide an alternative to the Congress and the BJP ahead of next year elections.\nBoth the chief ministers had a detailed discussion on national issues, including the need for \"better friendship among regional parties\", Patnaik said.\n\"This is just the beginning of a dialogue... We will meet again and discuss how to take things forward,\" Rao said.\n(This story has not been edited by Business Standard staff and is auto-generated from a syndicated feed.)", "url": "https://www.business-standard.com/article/pti-stories/trs-chief-kcr-steps-up-efforts-to-forge-non-bjp-non-cong-alliance-meets-mamata-after-patnaik-118122400725_1.html", "label": 1}