{"authors": [], "date_download": "2019-03-27 14:40:28", "date_modify": "2019-03-27 14:40:28", "date_publish": "2018-09-06 20:38:31", "description": "Section 144 of CrPC has been imposed in the state, while schools and petrol pumps will remain shut across different districts. Internet services are also expected to be affected in some places.", "filename": "article_india__1553697628.html", "image_url": "https://images.indianexpress.com/2018/09/bandh.jpg?w=759", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/indianexpress.com/article_india__1553697628.html", "title": "Bandh in Madhya Pradesh: Security beefed up ahead of protest over SC/ST Act", "title_page": "\n\t\t\t\tBandh in Madhya Pradesh: Security beefed up ahead of protest over SC/ST Act | India News, The Indian Express\t\t\t", "title_rss": "NULL", "source_domain": "indianexpress.com", "text": "The Madhya Pradesh police has stepped up security ahead of a call for a ‘Bharat Bandh’ by some organisations on Thursday in protest against parliamentary amendment against the dilution of SC/ST Act. Section 144 of CrPC has been imposed in the state, while schools and petrol pumps will remain shut across different districts. Internet services are also expected to be affected in some places.\nAdvertising\nInspector General of Police (Intelligence) Makrand Deuskar told PTI that orders prohibiting the gathering of people in large numbers have been imposed. “The administration in most of the districts have clamped prohibitive orders under CrPC section 144 in view of the bandh on September 6,” he said, adding that 34 units of the special armed force of police have been deployed in various districts.\nThe state witnessed protests by minority rights organisations after the Supreme Court diluted the SC/ST (Prevention of Atrocities) Act, 1989. Gwalior-Chambal region, considered a sensitive area, had witnessed large-scale violence on April 2 this year during the Bharat Bandh called by minority groups. To pacify the agitating groups, the Union government brought an amendment in the monsoon session of Parliament to override the apex court’s order.\nMeanwhile, District Education Officer in Bhind has ordered that schools in the district will remain closed.\nAdvertising\nJabalpur district collector Chhavi Bharadwaj has written to the state home department, seeking suspension of Internet services in the district till 6 pm on Thursday.\nPetrol pumps across the state will also remain shut from 10 am to 2 pm on Thursday. “We have decided to shut petrol pumps from 10 am to 2 pm tomorrow due to security reasons as some organizations have given a call for bandh,” Madhya Pradesh Petrol Pump Owners Association president Ajay Singh said.\n(With inputs from PTI)", "url": "https://indianexpress.com/article/india/bharat-bandh-in-madhya-pradesh-security-beefed-up-ahead-of-protest-over-amendments-to-sc-st-act-5341956/", "label": 1}