{"authors": [], "date_download": "2019-03-27 14:35:12", "date_modify": "2019-03-27 14:35:12", "date_publish": "2017-04-24 09:07:35", "description": "The top news this Monday morning", "filename": "article_india__1553697312.html", "image_url": "https://images.indianexpress.com/2017/04/niti-aayog-759.jpg?w=759", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/indianexpress.com/article_india__1553697312.html", "title": "April 24, 9 am news update: Opposition CMs attack PM Modi on GST, Delhi records 54% voting in MCD polls, and more", "title_page": "\n\t\t\t\tApril 24, 9 am news update: Opposition CMs attack PM Modi on GST, Delhi records 54% voting in MCD polls, and more | India News, The Indian Express\t\t\t", "title_rss": "NULL", "source_domain": "indianexpress.com", "text": "Opposition CMs attack Centre over funding, federalism, GST losses\nAdvertising\nDuring the Niti Aayog Governing Council meeting on Sunday, chief ministers from Opposition parties attacked Prime Minister Narendra Modi and the ruling party of curtailment of funds and federalism, and asked for timely compensation for loss of revenue due to the Goods and Services Tax (GST). West Bengal CM Mamata Banerjee and Delhi CM Arvind Kejriwal did not attend the meet. Read more here.\nAfter 54% voting in the capital, BJP jubilant, AAP circumspect\nThe municipal corporation elections of Delhi recorded a voter turnout of 54 per cent on Sunday. Voting was held in 270 wards, after polling was postponed in two wards due to the death of two candidates. Maujpur in east Delhi and Sarai Pipal Thala in north Delhi will be held in May. The results will be announced on Wednesday. For more on what happened, click here.\nAdvertising\nTamil Nadu farmers suspend Jantar Mantar protest till May 25\nFarmers from Tamil Nadu, who have been demanding loan waivers for the last 40 days at Jantar Mantar, called off their strike till May 25 after meeting TN Chief Minister Edappadi K Palaniswami on Sunday morning. The chief minister, who assured farmers that their demands will be met, spoke to Prime Minister Narendra Modi on the sidelines of the Niti Aayog Governing Council meeting later in the day. Click here for more.\nMehbooba Mufti asks CMs to reach out to Kashmiri students, PM Modi backs appeal\nJammu and Kashmir Chief Minister Mehbooba Mufti asked her counterparts to reach out to Kashmiri students in their respective states, following the attacks on Kashmiris in Rajasthan and Uttar Pradesh. Speaking at the Niti Aayog meeting, she said the students migrated from Kashmir in search of better education. For more, click here.\nFrench elections 2017 Live updates: Emmanuel Macron wins first round, to face Le Pen in runoff vote\nThe race is tight between Emmanuel Macron and Marine Le Pen with the former leading with at least 23.9 per cent of the votes against the far-right leader’s 21.4 per cent. This in turn means the candidates have qualified for the second-round run for the French presidency, scheduled in two weeks. Keep up with the results here.", "url": "https://indianexpress.com/article/india/april-24-9-am-news-update-governing-council-meet-narendra-modi-gst-delhi-bypolls-voting-tn-farmers-mehbooba-mufti-france-election-4625679/", "label": 1}