{"authors": [], "date_download": "2019-03-27 14:25:43", "date_modify": "2019-03-27 14:25:43", "date_publish": "2017-03-19 18:42:04", "description": "Read more about ABVP protests against Kerala CM's visit to Hyderabad on Business Standard. The Akhil Bharatiya Vidyarathi Parishad (ABVP) workers staged a protest against visiting Kerala Chief Minister Pinarayi Vijayan here on Sunday, blaming him for the killing of RSS workers in Kerala.", "filename": "article_news-ians_abvp-protests-against-kerala-cm-s-visit-to-hyderabad-117031900503_1_1553696743.html", "image_url": "https://bsmedia.business-standard.com/_media/bs/img/article/default/1170319/full-117031900503.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/business-standard.com/article_news-ians_abvp-protests-against-kerala-cm-s-visit-to-hyderabad-117031900503_1_1553696743.html", "title": "ABVP protests against Kerala CM's visit to Hyderabad", "title_page": "\nABVP protests against Kerala CM's visit to Hyderabad\n | Business Standard News", "title_rss": "NULL", "source_domain": "business-standard.com", "text": "The Akhil Bharatiya Vidyarathi Parishad (ABVP) workers staged a protest against visiting Chief Minister here on Sunday, blaming him for the killing of workers in\nRaising slogans of \"Vijayan go back\" they tried to disrupt a meeting which was being addressed by the Chief Minister. Police, however, arrested the protesters including women.\nMild tension prevailed outside RTC Kalabhavan where the CPI-M leader was addressing a meeting of Malayalis living here.\nHolding ABVP flags, a group of protesters tried to rush towards the meeting venue.\nPolice stopped the protesters, bodily lifted them into waiting police vehicles and shifted to a police station.\nVijayan is in on a two-day visit to attend various programmes. He will address a public meeting of CPI-M in Saroornagar on the city outskirts on Sunday evening.\nPolice have made tight security arrangements for his visit in view of threats from right-wing organisations.\nA BJP legislator in Hyderabad, Raja Singh, has threatened to obstruct the public meeting.\n\"If the Kerala CM, who is a murderer of Hindus, is invited to the event, I will not allow it to happen. I will go to any extent to stop the meeting,\" said Raja Singh, a member of Telangana assembly.\nHe had demanded of the Telangana government not to grant permission to Vijayan to visit\nAn leader from Madhya Pradesh had earlier this month announced a Rs 1-crore reward for anyone who brings the head of Kerala Chief Minister.\nSeveral activists of the and Kerala's ruling CPI-M were killed in the political violence in the southern state.\nReacting to the threat, Vijayan had said that he could not stop work due to such threats. \"The RSS has taken the heads of many people. I can't stop working and travelling due to this. Let them issue many more threats... I don't care,\" he had said.\n--IANS\nms/nir\n(This story has not been edited by Business Standard staff and is auto-generated from a syndicated feed.)", "url": "https://www.business-standard.com/article/news-ians/abvp-protests-against-kerala-cm-s-visit-to-hyderabad-117031900503_1.html", "label": 1}