{"authors": ["Press Trust Of India"], "date_download": "2019-03-27 14:29:09", "date_modify": "2019-03-27 14:29:09", "date_publish": "2018-05-16 21:30:15", "description": "Read more about Assam govt employees to support AASU against Citizenship Bill on Business Standard. The government employees of Assam will support the All Assam Students Union (AASU) in their state-wide protest against the Citizenship (Amendment) Bill, 2016, with the call 'Job not above Motherland'.Reminiscent of the anti-foreigners Assam", "filename": "article_pti-stories_assam-govt-employees-to-support-aasu-against-citizenship-bill-118051601503_1_1553696949.html", "image_url": "https://bsmedia.business-standard.com/_media/bs/img/article/default/1180516/full-118051601503.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/business-standard.com/article_pti-stories_assam-govt-employees-to-support-aasu-against-citizenship-bill-118051601503_1_1553696949.html", "title": "Assam govt employees to support AASU against Citizenship Bill", "title_page": "Assam govt employees to support AASU against Citizenship Bill | Business Standard News", "title_rss": "NULL", "source_domain": "business-standard.com", "text": "The government employees of will support the All Students Union (AASU) in their state-wide protest against the Citizenship (Amendment) Bill, 2016, with the call 'Job not above Motherland'.\nReminiscent of the anti-foreigners Agitation (1979-1985), Sodou Asom Karmachari Parishad (SAKP), a major association of government employees, will launch a joint movement with to oppose the bill and for an error-free National Register of Citizens that is being updated.\nhad spearheaded the Assam Agitation from\nIn a meeting here yesterday, said the association will join hands with for a state-wide movement to oppose the bill as it \"threatens the existence, language, heritage and culture of the indigenous people of Assam\".\n\" was born out of the Assam Agitation when the employees of the showed great courage to voice their views defying odds against illegal migration into Assam. We still have the same spirit,\" he said.\nhas over 3.5 lakh government employees as its members.\n\"With the slogan 'Job not above motherland' which was chanted during the Assam Agitation, we have once again joined hands with AASU to fight for the cause of the state,\" he said.\n\"How can we remain silent when our state is under threat? SAKP had expressed opposition to the bill before the when its members visited Assam (May 7-9)\", Kalita said.\nThe Bill will threaten the existence, language, heritage and culture of the indigenous people of Assam if implemented, he claimed.\nAASU and told the meeting that the bill, if passed, will push the Assamese language, culture and indigenous tribes and communities of Assam \"to the brink\".\nAASU and SAKP decided that May 18 would be observed as 'Preronar Din' (Day of Inspiration) to encourage the employees engaged in NRC updation and making lists of genuine Indian citizens.\nThey would organise a protest in front of the Raj Bhavan here on June 4 opposing the bill, AASU said.\nThe meeting also agreed to approach the district deputy commissioners for ensuring the safety and security of government employees engaged in the NRC update process.\nBhattacharyya claimed that there were reports of government employees in certain places being pressured to include the names of suspected illegal immigrants and some residents based on verbal information without official legacy data about them being citizens of\n\"This is a clear violation of norm. The employees are feeling the pressure at various levels. We appeal to district administrations to ensure the security of the government employees to help them work without fear\", he said.\nThe NRC legacy document verification has to be completed by May 31 as per the directive of the Supreme Court, he added.\nThe Citizenship (Amendment) Bill, 2016 was introduced in the Lok Sabha to amend the Citizenship Act, 1955.\nA key amendment in the Bill seeks to grant citizenship to people without valid documents from six minority communities -- Hindus, Sikhs, Buddhists, Jains, Parsis and Christians -- from Afghanistan, and after six years of residence in\n(This story has not been edited by Business Standard staff and is auto-generated from a syndicated feed.)", "url": "https://www.business-standard.com/article/pti-stories/assam-govt-employees-to-support-aasu-against-citizenship-bill-118051601503_1.html", "label": 1}