{"authors": ["Samudra Gupta Kashyap"], "date_download": "2019-03-27 14:40:59", "date_modify": "2019-03-27 14:40:59", "date_publish": "2015-09-13 02:27:45", "description": "Shops and business establishments remained shut, public transport was mostly off the road, and educational institutions too remained closed, while bandh supporters pelted stones in several towns to enforce the bandh.", "filename": "article_india_india-others__1553697659.html", "image_url": "https://images.indianexpress.com/2018/10/fav-icon.png?w=32", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/indianexpress.com/article_india_india-others__1553697659.html", "title": "Bandh against Centre’s decision on Bangla, Pakistan minorities cripple life in Assam", "title_page": "\n\t\t\t\tBandh against Centre’s decision on Bangla, Pakistan minorities cripple life in Assam | India News, The Indian Express\t\t\t", "title_rss": "NULL", "source_domain": "indianexpress.com", "text": "Normal life was severely affected across Assam on Saturday due to a 12-hour bandh called by 12 students’ and youth organization demanding withdrawal of the Centre’s recent order to permit entry to and stay in India to members of different minority communities fleeing Bangladesh and Pakistan due to religious persecution in those countries.\nAdvertising\nShops and business establishments remained shut, public transport was mostly off the road, and educational institutions too remained closed, while bandh supporters pelted stones in several towns to enforce the bandh. Over 300 bandh supporters were also arrested in different towns.\nThe bandh, which was originally called by the Asom Jatiyatabadi Yuva-Chatra Parishad (AJYCP), was subsequently backed by eleven other groups including the All Bodo Students’ Union (ABSU), All Dimasa Students’ Union, All Karbi Students’ Union, All Assam Sonowal-Kachari Students’ Union, and All Moran Students’ Union. The Asom Gana Parishad too extended support to the bandh.\nThe ministry of home affairs had on Monday issued a notification saying the Centre had decided to exempt “on humanitarian considerations” Bangladeshi and Pakistani nationals belonging to minority communities who have entered India on or before December 31, 2014 from the relevant provisions of rules and order made under the Passport (Entry into India) Act, 1920 and the Foreigners Act, 1946, in respect of their entry and stay in India without such documents or after the expiry of those documents, as the case may be.\nAdvertising\nThe Centre’s decision has evoked massive protests in Assam, with the All Assam Students’ Union (AASU) threatening to approach the Supreme Court against it. “While Assam has been struggling to protect the indigenous communities from being outnumbered by illegal migrants from Bangladesh, the Centre’s decision will only open the floodgates for more to come,” said AASU general secretary Lurin Jyoti Gogoi.\nThe AASU had on Friday taken out a torch-light protest march in Guwahati, while the AGP had staged a sit-in protest. Former chief minister and senior AGP leader Prafulla Kumar Mahanta said the BJP-led government at the Centre was least bothered about the indigenous communities of Assam. “The Modi government has further complicated the Bangladeshi influx problem by taking such a decision that will further reduce the indigenous people of Assam into a minority,” Mahanta said.", "url": "https://indianexpress.com/article/india/india-others/bandh-against-centres-decision-on-bangla-pak-minorities-cripple-life-in-assam/", "label": 1}