{"authors": [], "date_download": "2019-03-27 14:29:17", "date_modify": "2019-03-27 14:29:17", "date_publish": "2017-03-17 03:19:38", "description": "Forty years ago today.", "filename": "article_opinion_editorials__1553696957.html", "image_url": "https://images.indianexpress.com/2017/03/news480.jpg?w=480", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/indianexpress.com/article_opinion_editorials__1553696957.html", "title": "March 17, 1977, Forty Years Ago: Nation Votes", "title_page": "\n\t\t\t\tMarch 17, 1977, Forty Years Ago: Nation Votes | The Indian Express\t\t\t", "title_rss": "NULL", "source_domain": "indianexpress.com", "text": "Nation Votes\nAdvertising\nA heavy turnout marked the first round of the polling to elect the sixth Lok Sabha. Reports of violence and a few cases of booth-capturing were received mainly from Bihar and West Bengal. Polling was described as varying from “unprecedentedly heavy” in northern states to “moderate” in several parts of southern India and Rajasthan. Political observers predict a higher turnout than the 61.33 per cent recorded in 1967. Eight states, including Punjab, Haryana, Himachal Pradesh, West Bengal, Andhra Pradesh and Orissa, and seven union territories including Delhi, completed the process while all other states and UTs except Kerala had partial polling.\nRecord Turnout\nUnprecedented polling was reported in Delhi and Bombay. An estimated 70 per cent voted in Delhi to elect seven MPs. Polling in Bombay North and Bombay North-East was over 75 per cent and between 65 to 70 per cent in four other constituencies.\nGeorge Ends Strike\nGeorge Fernandes, a MISA detenu and Janata candidate from Muzaffarpur, Bihar, ended his hunger strike in response to a message by Jayaprakash Narayan, a resolution passed at a Muzaffarpur rally and an appeal from the Janata Party. Fernandes was on fast to protest the government’s refusal to release him on parole during the elections. “The fight against dictatorship continues,” he stated.\nMovie Release Held\nThe movie Khoon Pasina was stopped from release in Himachal Pradesh, especially in Simla district, during the election campaign. The reason: The movie villain is named Zaalam Singh. The Congress candidate from the Simla reserved constituency is also named Zaalam Singh. The screen Zaalam Singh, in contrast to the living Zaalam Singh, is projected as a person who, after being a goonda in his youth, grows into a tyrant.", "url": "https://indianexpress.com/article/opinion/editorials/march-17-1977-forty-years-ago-nation-votes-4572439/", "label": 1}