{"authors": ["Rina Chandran", "Min Read"], "date_download": "2019-03-27 14:34:57", "date_modify": "2019-03-27 14:34:57", "date_publish": "2018-05-25 10:55:44", "description": "BANGKOK (Thomson Reuters Foundation) - Deadly clashes this week in southern India, and farmers' protests in the west against a refinery and a bullet train, highlight the increasingly fraught disputes over land and environment in the country's most industrialized states.", "filename": "article_us-india-landrights-industry-anlysis_deadly-disputes-over-land-environment-in-indias-wealthiest-states-idUSKCN1IQ1DJ_1553697297.html", "image_url": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180525&t=2&i=1265855807&w=1200&r=LYNXNPEE4O0U6", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/reuters.com/article_us-india-landrights-industry-anlysis_deadly-disputes-over-land-environment-in-indias-wealthiest-states-idUSKCN1IQ1DJ_1553697297.html", "title": "Deadly disputes over land, environment in India's wealthiest states", "title_page": "\n                Deadly disputes over land, environment in India's wealthiest states | Reuters", "title_rss": "NULL", "source_domain": "reuters.com", "text": "BANGKOK (Thomson Reuters Foundation) - Deadly clashes this week in southern India, and farmers’ protests in the west against a refinery and a bullet train, highlight the increasingly fraught disputes over land and environment in the country’s most industrialized states.\nDemonstrators shout slogans during a protest, after at least 13 people were killed when police fired on protesters seeking closure of plant on environmental grounds in town of Thoothukudi in southern state of Tamil Nadu, in Chennai, India, May 24, 2018. REUTERS/P.Ravikumar\nPolice opened fire Tuesday on protesters seeking to shut down a copper smelter run by Vedanta Resources in the southern port city of Thoothukudi, killing 10. Three more persons have since died.\nResidents and activists had for years demanded the plant be shut down, saying its emissions were polluting the air, water and soil, affecting people’s health and livelihoods.\nVedanta denied the allegations, and said in a statement that it had complied with “all the necessary regulations”.\nOn Thursday, officials in Tamil Nadu state, where Thoothukudi is located, ordered the plant to be shut down.\n“This government...respects the sentiments of the people (and) is taking steps legally to close down the unit,” chief minister Edappadi K. Palaniswami told reporters.\nThe protests are among several in India’s wealthiest states, where villagers are increasingly taking to the streets against industry-friendly policies they say are taking away their land and livelihoods.\nAcross the country, such conflicts have increased, activists say, as land is sought for industrial use in one of the world’s fastest growing major economies\nA 2013 law was meant to protect the rights of farmers and villagers, ensuring consensus over land acquisitions, rehabilitation for those displaced, and adequate compensation.\nIt also requires environment and social impact assessments.\nBut several states have diluted these provisions to speed up acquisitions for developments they say generate jobs and wealth.\nIn the rush to lure more investors, officials often clear projects too quickly and overlook violations, analysts say.\n“The more developed states have a reputation for being more business friendly, so they receive more applications for setting up industry, and they clear them faster,” said Aseem Shrivastava, a development economist.\n“They tend to have a lighter touch with violations to keep investments coming,” he told the Thomson Reuters Foundation.\nBLIND EYE\nTamil Nadu, among the most industrialized states in the country, is dogged by reports of child labor and abuse of tens of thousands of women workers in its multi-billion dollar textile industry.\nAt the same time, policies that favor industry have driven hundreds of desperate farmers in the state to take their own lives, activists say.\n“Laws to protect people only exist on paper,” said Geetha Narayanan, an activist in Chennai, the capital of Tamil Nadu state where the deadly protests against the smelter took place.\n“In Thoothukudi, people have been protesting for 20 years, and going to court to say public consultations were not held, that environmental impact assessments were not done. Yet the government turned a blind eye until lives were lost,” she said.\nIn the western states of Gujarat and Maharashtra, farmers have taken to the streets to protest land acquisitions for a bullet train, as well as a $44-billion refinery and petrochemical project.\nThe $17-billion-dollar high-speed rail link to connect financial hub Mumbai and Ahmedabad, has sparked a debate on the definition of “public purpose”, or the state’s legal right to take private property for public use.\nOfficials say the train, being built with Japanese cooperation, will cut travel time between the two cities by more than half, to under three hours, helping businesses, and generating more jobs in the areas serviced by the line.\nFarmers stand to lose 850 hectares of land, and have not given their consent as required, said Sagar Rabari, a leader with farmers’ group Gujarat Khedut Samaj.\n“This is fertile land that is the only means of livelihood for thousands,” Rabari said by phone. “If we lose this land, how will we live?”\nCalls to the National High Speed Rail Corporation seeking comment were not returned.\nHOLD ACCOUNTABLE\nGujarat and Maharashtra states account for more than a tenth of the nearly 600 ongoing land disputes in the country, according to data from research firm Land Conflict Watch.\nAlong with Tamil Nadu, they are among India’s most industrialized states, with wealthier and better educated populations - factors that contribute to a greater number of conflicts, said Shrivastava.\n“While the states are wealthier, the urban-rural divide is wider, which is leading to more dissatisfaction among villagers,” he said.\n“But because literacy levels are higher, people are more aware of their rights, follow the government’s moves more closely, and are better able to organize and protest. So we’re going to see more, and more violent conflicts,” he said.\nIn Maharashtra, thousands of farmers are also refusing to surrender land for a proposed refinery of a consortium of Indian firms with Saudi Aramco, the world’s top oil producer.\nThe earmarked region along India’s west coast is famed for its juicy Alphonso mangoes and lush cashew plantations.\nThe state government has failed to secure even one acre of the roughly 15,000 acres (6,000 hectares) needed, state industry minister Subhash Desai told Reuters.\nSome of those farmers joined thousands of others in a 180-kilometre (112 miles) march to Mumbai recently, demanding that the government recognize their rights over forests and stop the forced acquisition land for industrial projects.\nOther farmers in Gujarat had reason to celebrate this week, as the U.S. Supreme Court agreed to hear their lawsuit against a World Bank agency, which financed a power plant they blame for damaging the environment and their livelihoods.\n“The government says development is good. But the fact that industries contribute to the economy does not preclude them from following the law,” said Ritwick Dutta, an environmental lawyer who has taken Vedanta and other large corporations to court.\n“People’s lives are at stake,” he said.", "url": "https://www.reuters.com/article/us-india-landrights-industry-anlysis/deadly-disputes-over-land-environment-in-indias-wealthiest-states-idUSKCN1IQ1DJ", "label": 1}