{"authors": [], "date_download": "2019-03-27 14:18:18", "date_modify": "2019-03-27 14:18:18", "date_publish": "2018-12-27 13:43:45", "description": "MPs from Karnataka staged a protest outside the Parliament in New Delhi on Thursday demanding the implementation of the controversial Mekedatu project. The MPs from across party lines held placards near the Mahatma Gandhi statue and demanded that the project be executed at the earliest.", "filename": "article_implement-mekedatu-project-soon-karnataka-mps-protest-outside-parliament-94053_1553696298.html", "image_url": "https://www.thenewsminute.com/sites/default/files/Mekedatu-MP-Protest.jpeg", "language": null, "localpath": "/home/raj/news-please-repo//data/2019/03/27/thenewsminute.com/article_implement-mekedatu-project-soon-karnataka-mps-protest-outside-parliament-94053_1553696298.html", "title": "‘Implement Mekedatu project soon’: Karnataka MPs protest outside Parliament", "title_page": "‘Implement Mekedatu project soon’: Karnataka MPs protest outside Parliament | The News Minute", "title_rss": "NULL", "source_domain": "thenewsminute.com", "text": "Cauvery Issue\n\"Our protest is also to counter Tamil Nadu MPs protest, who have been stalling the functioning of Parliament and are strongly opposing the Mekedatu project,\" said BJP MP Shobha Karandlaje.\nMPs from Karnataka staged a protest outside the Parliament in New Delhi on Thursday demanding the implementation of the controversial Mekedatu project. The MPs from across party lines held placards near the Mahatma Gandhi statue and demanded that the project be executed at the earliest.\nBoth Lok Sabha and Rajya Sabha MPs demanded that the Centre grant permission for the early implementation. The protest was organised to show the unity among all political parties in Karnataka in favour of the project. \"Our protest is also to counter Tamil Nadu MPs protest, who have been stalling the functioning of Parliament and are strongly opposing the Mekedatu project,\" said BJP MP Shobha Karandlaje.\nChief Minister HD Kumaraswamy met Union Minister for Water Resources Nitin Gadkari to discuss the early implementation of the project on Wednesday. “In the meeting, Gadkari said he was convinced that the Mekedatu project will benefit Tamil Nadu. The minister also assured that he will direct his officials to fix a meeting of Chief Ministers of the two states at the earliest,” the Chief Minister’s office said.\n“The project will help conserve excess water for our state. We need it for the people,” said PC Mohan, BJP MP for Bengaluru Central.\nOn Wednesday, the Union government said that a meeting of the heads of Tamil Nadu and Karnataka would be called soon. Nitin Gadkari is slated to discuss the merits of the projects with the representatives of the two states and also hear their grievances, sources in the CMO said.\nKarnataka has proposed the construction of a balancing reservoir along River Cauvery river at Mekedatu to conserve excess water in the Cauvery river basin. The government plans to use the water to meet the drinking water requirements of Bengaluru, Ramanagara and Channapattana, and also generate electricity. In November, the Central Water Commission gave Karnataka the green signal to prepare a Detailed Project Report.\nHowever, the lower riparian state of Tamil Nadu is opposing the project saying that the Mekedatu project would curtail water supply from Cauvery river. They also argue that it is against the Supreme Court’s February verdict. Earlier this month, Tamil Nadu moved a contempt petition in the apex court against the CWC, Cauvery Neeravari Nigam Limited and Karnataka Water Resource Minister DK Shivakumar for ‘wilful disobedience’ of the SC order on Cauvery water sharing.", "url": "https://www.thenewsminute.com/article/implement-mekedatu-project-soon-karnataka-mps-protest-outside-parliament-94053", "label": 1}