{"authors": [], "date_download": "2019-03-27 14:34:48", "date_modify": "2019-03-27 14:34:48", "date_publish": "2015-12-01 10:32:02", "description": "Protesters raised concerns over two issues — the deletion of Section 10(1) that ensured equal salaries for private and government teachers and enactment of the fee verification bill.", "filename": "article_cities_delhi__1553697288.html", "image_url": "https://images.indianexpress.com/2015/11/ie26cinema-club-chandigarh480.jpg?w=480", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/indianexpress.com/article_cities_delhi__1553697288.html", "title": "Changes in Delhi education system: Parents, teachers hit protest note", "title_page": "\n\t\t\t\tChanges in Delhi education system: Parents, teachers hit protest note | Cities News, The Indian Express\t\t\t", "title_rss": "NULL", "source_domain": "indianexpress.com", "text": "Hundreds of teachers and parents gathered near Delhi Assembly Monday to protest against the proposed amendments to the Delhi School Education Act. Deputy chief minister Manish Sisodia had introduced the Delhi School (Verification of Accounts and Refund of Excess Fee) Bill and the Delhi School Education (Amendment) Bill in the Legislative Assembly two weeks ago. The House accepted both Bills with unanimous majority.\nAdvertising\nProtesters raised concerns over two issues — the deletion of Section 10(1) that ensured equal salaries for private and government teachers and enactment of the fee verification bill.\n“Section 10 mandated that salaries and other benefits of employees of a recognised private school will not be less than that given to government school teachers. With the deletion of Section 10(1), these teachers will now be left at the mercy of the school management,” said Ashok Agarwal, national president, All India Parents’ Association.\nAgarwal also criticised the second bill. “It is a total eyewash. Private schools submitted their accounts to the Directorate of Education earlier as well, but nothing came of it. The legislation only gives more power to private schools to hike their fees as and when they like,” he said.\nAdvertising\nTeachers too expressed disappointment over the move. “This is creating a division between government and private school teachers, making the former second class teachers in the setup. What is the rationale?” said Roohi Rahman, a teacher at Hamdard Public School.\n“Private school teachers are already an exploited lot. With Section 10 (1) being dropped, we will lose the basic legal right to get salary equal to our government counterparts…,” said Asma Syed, another teacher.\nEven as schools have welcomed the changes, activists and experts have expressed apprehension. “The government should have followed a graded approach to divide schools when it comes to giving salaries for teachers. As far as the fee verification bill is concerned, there is nothing new. We were submitting details earlier, we will do the same now. Those found bungling rightfully deserve punishment,” said S K Bhattacharya, president, action committee of unaided private schools.\n“The bill presupposes that a fee-hike by private schools is per-se legal and valid, unless the same is challenged through a complaint and is set aside by the committee. If we look at the existing acts on private unaided school-fee regulation, particularly the Tamil Nadu (Regulation of Collection of Fee) Act, 2009, there is a stipulation of prior approval by the committee before fee-hike. The said hiked fee, once approved, cannot be hiked further up to three years. In this bill… the entire burden is upon the complainant. It was expected that Delhi’s Act should be an advancement over Tamil Nadu’s… But this bill falls way short..,” said Khagesh Jha, activist and lawyer, about the fee refund bill.", "url": "https://indianexpress.com/article/cities/delhi/changes-in-education-system-parents-teachers-hit-protest-note/", "label": 1}