{"authors": [], "date_download": "2019-03-27 14:18:20", "date_modify": "2019-03-27 14:18:20", "date_publish": "2018-02-05 16:07:34", "description": "Agitated by the delay in appointment of judges, lawyers practising at the Karnataka High Court launched a week-long hunger strike in Bengaluru on Monday. The lawyers, under the banner of the Advocated Association Bengaluru and the Karnataka Bar Council, sat down in protest outside the Karnataka High Court. According to BV Acharya, Former Advocate General of Karnataka, out of a", "filename": "article_karnataka-hc-lawyers-go-week-long-hunger-strike-over-judicial-vacancies-75940_1553696300.html", "image_url": "https://www.thenewsminute.com/sites/default/files/Karnataka-lawyers-protest-judges-appointment-min.jpeg", "language": null, "localpath": "/home/raj/news-please-repo//data/2019/03/27/thenewsminute.com/article_karnataka-hc-lawyers-go-week-long-hunger-strike-over-judicial-vacancies-75940_1553696300.html", "title": "Karnataka HC lawyers go on week-long hunger strike over judicial vacancies", "title_page": "Karnataka HC lawyers go on week-long hunger strike over judicial vacancies | The News Minute", "title_rss": "NULL", "source_domain": "thenewsminute.com", "text": "Court\nOut of a total sanctioned strength of 62 judges, there are only 24 appointed judges in the Karnataka High Court.\nAgitated by the delay in appointment of judges, lawyers practising at the Karnataka High Court launched a week-long hunger strike in Bengaluru on Monday.\nThe lawyers, under the banner of the Advocated Association Bengaluru and the Karnataka Bar Council, sat down in protest outside the Karnataka High Court.\nAccording to BV Acharya, Former Advocate General of Karnataka, out of a total sanctioned strength of 62 judges, there are only 24 appointed judges in the High Court.\n“Out of the 24 appointed judges, 16 are working in the Principal Bench at Bengaluru, 5 in Dharwad and 3 in Gulbarga. This year, 4 more judges will retire. This means that the High Court will have only 20 judges to preside over 3.2 lakh cases,” he added.\nSpeaking to TNM, senior High Court lawyer DLN Rao said that Karnataka has the highest number of vacancies compared to other states.\n“Karnataka has the highest number vacancies of judges. The percentage of vacancies is 61.3%. Judges are being overworked and cases are taking longer to dispense because of this. We have requested the Chief Minister and the Chief Justice of Karnataka several times over the last few years but no appointments have been made,” Rao added.\nThe lawyers also said that the quality of dispensation of justice will be affected if existing judges are overworked. “This is the worst thing that could happen to a litigant. What is the purpose of justice if the case is not decided in your lifetime? There are so many undertrials languishing in prisons, thousands of bail applications and property dispute cases just piling up. This will lead to a breakdown of the law. Hence, we are left with no option but to protest,” Rao said.\nThe protesting lawyers alleged that despite several efforts to reach the Union government and the Law Minister, no effort has been made to appoint judges.\n“We will hold a hunger strike from 10.30 am to 5.30 pm for a week starting today (Monday). If our demand is not met, then all lawyers across the state will abstain from going to court for a single day. On Thursday, we will meet the Advocate General and put forth our demands,” said AP Ranganath, President of the Advocates Association Bengaluru.\nStating that it is the constitutional duty of the collegium to appoint judges, BV Acharya said that people will lose faith in the judiciary if the vacancies are not filled immediately.\n“There are 24 judges to oversee 3,20,000 cases. This is humanly impossible. This year four judges will retire. With this kind of case load, in a hypothetical situation where no new cases are accepted, it will take 15-20 years to dispose the existing cases. At this rate, people will lose faith in what can now be called the only saving grace of our democracy - the judiciary. If people lose faith in the judiciary, there is an imminent threat to democracy and people will take to the streets to settle disputes,” he added.\nAcharya says that appointments to the High Court should be made in a time bound manner and well in advance, preferably a month before the occurrence of the anticipated vacancy.", "url": "https://www.thenewsminute.com/article/karnataka-hc-lawyers-go-week-long-hunger-strike-over-judicial-vacancies-75940", "label": 1}