{"authors": ["Abhishek Saha"], "date_download": "2019-03-27 14:40:59", "date_modify": "2019-03-27 14:40:59", "date_publish": "2019-01-11 10:00:04", "description": "Commissioner of police, Guwahati, Deepak Kumar, told The Indian Express, “Certain statements were made in that meeting on January 8 which we thought needed to be investigated.\"", "filename": "article_north-east-india_assam__1553697659.html", "image_url": "https://images.indianexpress.com/2019/01/hiren-gohain.jpg?w=759", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/indianexpress.com/article_north-east-india_assam__1553697659.html", "title": "Protest against citizenship Bill: Assam academic Hiren Gohain, two others booked for sedition", "title_page": "\n\t\t\t\tProtest against citizenship Bill: Assam academic Hiren Gohain, two others booked for sedition | North East India News, The Indian Express\t\t\t", "title_rss": "NULL", "source_domain": "indianexpress.com", "text": "Prominent Assam academic Hiren Gohain (80), activist Akhil Gogoi (42) and journalist Manjit Mahanta (50) have been booked on charges of sedition for their comments during a protest against the Citizenship (Amendment) Bill, 2016, in Guwahati Monday.\nAdvertising\nGuwahati Police Commissioner Deepak Kumar told The Indian Express, “Yes, we have registered a case. Certain statements were made in that meeting on January 7 which we thought needed to be investigated. We will investigate it.”\nExplained Move to arrest them may intesify protests Three prominent individuals of Assam being booked for sedition comes at a time when the state is witnessing series of protests against the Bill. Powerful organisations and the political opposition believe that the Bill violates the basic tenets of 1985 Assam Accord and poses a threat to the Assamese community. The three men were not arrested Thursday, but their arrest could intensify protests. All the three activists told The Indian Express that notwithstanding the case or arrest, the agitation against the Bill will continue.\nThe complaint was registered by officer-in-charge of Latasil police station Upen Kalita. The complaint, accessed by The Indian Express, states that Gogoi criticised the Bill and talked about “initiating a struggle for a sovereign Assam, independent of India”. It added, “Although a democratic congregation, the meeting witnessed anti-India statements by all speakers, so I request action be initiated against them.”\nThe FIR was filed on Wednesday at Latasil police station, charging the trio under Sections 120(B), 121, 123 and 124(A) of the IPC.\nAdvertising\nThe January 7 meeting was organised by the “Save Assam” forum at the heart of Guwahati and attended by eminent citizens, including former Assam DGP Harekrishna Deka, former CMs Prafulla Mahanta and Tarun Gogoi, and several activists.\nKalita told The Indian Express, “We have primary evidence in the form of video footage of the public meeting and the case has been registered based on that.”\nThe video footage shows Gohain saying, “If the question of Independence arises, if no one listens to us, the government, the state and political parties, then it’s a different thing, then we will definitely be compelled to raise the demand for independent Assam. But let’s not get carried away by temporary emotions, as citizens of India, we will fight as long as we can. If that fight is not successful, then the demand for Independence will come up.”\nReacting to the FIR, Gohain told The Indian Express, “I have allegedly made statements amounting to sedition. In truth, some young elements at the rally at their indignation at the attitude of the government mentioned relevance of ‘freedom’ of Assam. I intervened that such a demand can have relevance if and when all democratic resources have been exhausted and if the state and all democratic parties and organisations reject the legitimate demands of people of Assam.”\nAkhil Gogoi told The Indian Express, “This government is a fascist government. It’s an Emergency-like situation in this country right now. They are trying to stop this movement and hence this case. I have not said anything seditious and I have all the courage to face this case.”\nGogoi said he never mentioned “secession” or “armed struggle”. He said, “I had mentioned that people will ‘think’ of a recourse if they do not get required powers within India’s existing federal structure. And I stand by that statement.”\n“The allegation is false. We never said that people should demand sovereignty or independence. We said that if the attack on Assamese continue, then such a situation might come. If the government wants to douse fire with petrol, that won’t help,” Mahanta, convenor of an anti-Citizenship Bill Forum in the state, told The Indian Express.", "url": "https://indianexpress.com/article/north-east-india/assam/assam-intellectuals-hiren-gohain-akhil-gogoi-manjit-mahanta-booked-for-sedition-for-remarks-on-citizenship-amendment-bill-5531915/", "label": 1}