{"authors": ["Press Trust Of India"], "date_download": "2019-03-27 14:35:25", "date_modify": "2019-03-27 14:35:25", "date_publish": "2016-09-13 16:57:23", "description": "Read more about 1 more dies of injuries while escaping lathicharge; toll now 2 on Business Standard. One more person died of injuries he suffered while escaping police lathicharge, as sporadic protests were today reported in the city, where an uneasy calm prevailed, and other parts of Karnataka, a day after Bengaluru was rocked by violence over the", "filename": "article_pti-stories_1-more-dies-of-injuries-while-escaping-lathicharge-toll-now-2-116091300754_1_1553697325.html", "image_url": "https://bsmedia.business-standard.com/_media/bs/img/article/default/1160913/full-116091300754.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/business-standard.com/article_pti-stories_1-more-dies-of-injuries-while-escaping-lathicharge-toll-now-2-116091300754_1_1553697325.html", "title": "1 more dies of injuries while escaping lathicharge; toll now 2", "title_page": "1 more dies of injuries while escaping lathicharge; toll now 2 | Business Standard News", "title_rss": "NULL", "source_domain": "business-standard.com", "text": "One more person died of injuries he suffered while escaping police lathicharge, as sporadic protests were today reported in the city, where an uneasy calm prevailed, and other parts of Karnataka, a day after was rocked by violence over the raging Cauvery water sharing row with\nThe toll in the Cauvery stir related violence rose to two with a 30-year old man, who had jumped in panic from a three- storey building while trying to escape police lathicharge, succumbed to multiple injuries this afternoon.\n\"Kumar, about 30 years old, has died. He was brought to ourhospital at 9:30 last night in a critical stage.He is said to have jumped from third floor of a building as he was trying toescape from a lathicharge yesterday,\" Dr Giridhar, Managing Director of Lakshmi Multi-Speciality Hospital, told PTI.\n\"He had several injuries on his body like head,facial and pelvic. Both his legs were also fractured,\" he said.\nOne person was killed and another injured in police firing in the country's IT capital yesterday after sudden eruption of widespread violence, escalating tensions between the two states.\nCurfew, imposed late last night, continued to remain in force in 16 police station limits of the city which is under prohibitory orders till September 14.\nA bus that was half burnt yesterday was torched once again today near New Timber layout and another vehicle was also set on fire near Tigalarapalya.\nBoth had Tamil Naduregistration number plates.\nPolice lobbed tear gas at Hegganahalliand Pattegarapalaya as protesters tried to burn tyres on the streets, defying curfew.\nPolice are also conducting combingoperations in several sensitive areas and dispersing crowds thatare gathering.\nSenior police officials said curfew would continueuntil further orders and would be reviewed this evening.\nSporadic protests have been reported in differentparts of the state like Mandya, Chitradurga, Ramanagara andMysuru.\nIn Chitradurga, a lorry bearing registration number was burnt, while in Ramanagara protesters held demonstrations in front of a farmhouse that reportedly belongs to a daughter of former Chief Minister M Karunanidhi.\nShooting of a Tamil film was stopped by protesters at\nJaganmohan palace in Mysuru, police said.\nIn a video message to the people of the state, Karnataka Chief Minister Sidddaramaiah warned of stringent action against any act of vandalism or disturbance to peace.\nHome Minister G Parameshwara said anyone who takes the law into their hands would not be spared and stringent action would be taken against them.\n\"We will take stringent action against them. No one will be spared. We will not allow anyone to take law into their hands and we want your cooperation for this,\" he said.\nNoting that a few organisations and political forces were behind yesterday's violence, Parameshwara said more than 300 people had been arrested so far and more would follow.\nHe said it is government's responsibility toprotect public and their property and \"we will do our workwithout any hesitation,\" he added.\nAsked whether the government had failed in assessing thesituation yesterday and in maintaining law and order, he said, \"we did our best and we showed some sort of tolerance, but that has been misused.\"\nPointing out that the violence was an instantaneous reaction to the developments in Tamil Nadu, Parameshwara said \"we have controlled it as far as possible, or else therewere chances of it going out of control and more loss oflives.\"\nHe said that other than a couple of stray incidents, the situation is peaceful.\nParameshwara said government has decided to give Rs 10 lakh compensation each to families of the two persons killed.\nSidddaramaiah held consultations with senior Congress leaders from the state on the prevailing situation.\nSpeaking to reporters after the meeting, Congress Leaderin the Lok Sabha Mallikarjuna Kharge sought Prime Minister Narendra Modi's intervention.\nHe said the Prime Minister has to convene a meeting of Chief Ministers from riparian states for an out of court settlement of the issue. \"I request the Prime Minister at this critical juncture as it involves inter-state water dispute. His role is important for peaceful settlement of the dispute.\"\nThe city that saw widespread violence, appeared to be limping back to normalcy, with no fresh incidents of violence being reported since last night.\nThe bustling IT city was bereft of its monstroustraffic. There were very few vehicles moving on city roads,with schools and colleges and also government offices remaining shut due to Bakrid today. State run transport services remained skeletal with veryfew buses plying on roads in select areas.\nOfficials saidtransport services to Tamil Nadu remain suspended. MetroRail services have been temporarily stopped.\nThe Supreme Court, modifying its September 5 order, had yesterday asked Karnataka to release a reduced amount of 12000 cusecs of Cauvery River water to Tamil Nadu tillSep 20.\nOn Sep 5, it had directed release of 15,000 cusecs for 10 days to ameliorate the plight of farmers of Tamil Nadu, triggering protests from farmers and pro-Kannada outfits with Karnataka observing a bandh against it on Sep 9.", "url": "https://www.business-standard.com/article/pti-stories/1-more-dies-of-injuries-while-escaping-lathicharge-toll-now-2-116091300754_1.html", "label": 1}