{"authors": [], "date_download": "2019-03-27 14:18:31", "date_modify": "2019-03-27 14:18:31", "date_publish": "2016-06-06 00:00:00", "description": "Read more about CPI (M) a 'combination of Hitler and Stalin': RSS on Business Standard. RSS ideologue Rakesh Sinha said the CPM govt in Kerala and the party are engaged in violence against the Sangh and BJP", "filename": "article_news-ani_cpi-m-a-combination-of-hitler-and-stalin-rss-116101300740_1_1553696311.html", "image_url": "http://bsmedia.business-standard.com/_media/bs/img/misc/2016-06/06/full/1465197390-6251730.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/business-standard.com/article_news-ani_cpi-m-a-combination-of-hitler-and-stalin-rss-116101300740_1_1553696311.html", "title": "CPI (M) a 'combination of Hitler and Stalin': RSS", "title_page": "CPI (M) a 'combination of Hitler and Stalin': RSS | Business Standard News", "title_rss": "NULL", "source_domain": "business-standard.com", "text": "Asserting that the of (Marxist) is a combination of German dictator Adolf Hitler and Soviet dictator Joseph Stalin, the Rashtriya Swayamsevak Sangh (RSS) on Thursday said talks of liberal democracy but his party lives in duality.\nideologue Rakesh Sinha said the CPM government in and the party are engaged in violence against the Sangh and\n\"The reason is very obvious. The is expanding and is growing in the state that is not being tolerated by the CPM as a party. Secondly, CPM lives in duality. Its creed is violence, but in talks of liberal democracy,\" Sinha told ANI.\n\"I think the Government of should take cognizance of growing violence in Kannur. Almost 250 Swayamsevaks have been killed till now,\" he added.\nThe BJP's unit today staged a protest outside the secretariat in Thiruvananthapuram against the murder of a party worker in Kannur.\nThe has called for a shutdown in the state to protest against the murder of its activist allegedly by the members in Pinarayi village in Kannur district.\nThe BJP, which has demanded a CBI probe into the murder, has also accused Kerala's Left Democratic Front government and Chief Minister Pinarayi Vijayan of unleashing \"political terrorism\" in", "url": "https://www.business-standard.com/article/news-ani/cpi-m-a-combination-of-hitler-and-stalin-rss-116101300740_1.html", "label": 1}