{"authors": [], "date_download": "2019-03-27 14:34:54", "date_modify": "2019-03-27 14:34:54", "date_publish": "2019-01-02 16:36:33", "description": "AIADMK members had trooped into the well as soon as the House resumed in the afternoon and were continuously shouting slogans \"we want justice, take the permission (to build dam on Cauvery) back, don't deny rights of Tamil Nadu\".", "filename": "article_india__1553697294.html", "image_url": "https://images.indianexpress.com/2018/12/venkaiah-naidu-7.jpg?w=759", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/indianexpress.com/article_india__1553697294.html", "title": "Cauvery issue rocks Rajya Sabha, Naidu orders AIADMK, DMK, MPs to leave House", "title_page": "\n\t\t\t\tCauvery issue rocks Rajya Sabha, Naidu orders AIADMK, DMK, MPs to leave House | India News, The Indian Express\t\t\t", "title_rss": "NULL", "source_domain": "indianexpress.com", "text": "Continuous protests by the AIADMK and DMK MPs over the Cauvery issues forced Rajya Sabha Chairman Venkaiah Naidu to adjourn the house for the day on Wednesday. The House had to be adjourned twice in the afternoon amid din over the issue and finally for the day, minutes after it reassembled at 3 PM.\nAdvertising\nWith the AIADMK and DMK MPs constantly shouting slogans against the government and demanding ‘justice’ over the Cauvery issue, Naidu had to invoke Rule 255, asking over a dozen members of both parties from Tamil Nadu to leave the House for the day.\nAccording to Rule 255, the Chairman may direct any member whose conduct, in his opinion, is grossly disorderly, to withdraw immediately from the council. As per the rule, any member so ordered to withdraw shall do so forthwith and shall absent himself during the remainder of the day’s meeting.\nAIADMK members had trooped into the well as soon as the House resumed in the afternoon and were continuously shouting slogans “we want justice, take the permission (to build dam on Cauvery) back, don’t deny rights of Tamil Nadu”, disrupting functioning. One of their MPs even said that the Government of India has “shamed” Tamil Nadu.\nAdvertising\nMPs from Tamil Nadu are protesting against the Karnataka government’s move to construct a dam in Mekedatu over Cauvery river and are seeking the Centre’s intervention in the matter. Both AIADMK and DMK believe the construction of the dam will choke the water supply to the state and would have adverse effects on the farmers.\nEven though Parliamentary Affairs Minister Vijay Goel and Naidu requested the members from Tamil Nadu to allow the Water Resources Minister Nitin Gadkari to deliver his statement on the issue, the MPs continued their protest in the Well, with four DMK members also joining to associate with them. An upset Naidu then said that Gadkari would not make any statement.\nNaidu then asked Home Minister Rajnath Singh to move a resolution to proclaim President’s rule in Jammu and Kashmir on December 19, 2018 under Article 356 of the Constitution. Singh tabled the resolution which was already approved in Lok Sabha on December 28, 2018. He delivered his statement amid the din.\nThe Opposition leader Ghulam Nabi Azad was invited to initiate the discussion on the resolution but the Chairman had to briefly adjourn the House.\nBefore adjournment, the Chairman asked the AIADMK and DMK members to leave for the day. When the House resumed, Deputy Chairman Harivansh asked the concerned members to leave the House but they continued to protest.\n(With PTI inputs)", "url": "https://indianexpress.com/article/india/cauvery-dam-issue-rajya-sabha-venkaiah-naidu-aiadmk-dmk-rajya-sabha-5520156/", "label": 1}