{"authors": ["Ta Ameerudheen"], "date_download": "2019-03-27 14:18:16", "date_modify": "2019-03-27 14:18:16", "date_publish": "2017-06-24 17:30:00", "description": "Kerala's chief minister is all for dissent – unless it is against him.", "filename": "article_841520_is-kerala-chief-minister-using-development-plank-to-stop-dissent-and-protests_1553696296.html", "image_url": "https://d1u4oo4rb13yy8.cloudfront.net/book/61335-glpbmfbzco-1498213055.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/scroll.in/article_841520_is-kerala-chief-minister-using-development-plank-to-stop-dissent-and-protests_1553696296.html", "title": "Why Pinarayi Vijayan just won’t tolerate protests against ‘development work’", "title_page": "Why Pinarayi Vijayan just won’t tolerate protests against ‘development work’", "title_rss": "NULL", "source_domain": "scroll.in", "text": "On June 19, at the inauguration of the Kochi Metro rail service, Kerala Chief Minister Pinarayi Vijayan declared that mass protests will not force his Left Front government to abandon development projects.\nVijayan, a senior leader of the Communist Party of India (Marxist), has been a staunch advocate of “development works” since he assumed office in May 2016. “We will provide financial compensation for those who are affected by the projects,” he said in Kochi. “We will rehabilitate those who lose their land. But there is no scope for protests. If protests continue, we have no option but to go ahead with development works. Development is our main agenda.”\nThe next day, as if on cue, the police beat up residents of Puthuvype, a suburb of Kochi city, protesting construction of Indian Oil Corporation’s Liquefied Petroleum Gas import terminal. Hundreds of men, women and children were injured in the police action. Images of bleeding protestors splashed live on TV news channels, generating wider public support for the agitation. A few protestors had been injured in a similar police action on June 16 as well.\nOne of the protestors injured in police action at Puthuvype in Kochi. Photo credit: Ashish Vincent\nPeople in Puthuvype have been agitating since February. They complain that the terminal is being built in violation of the National Green Tribunal’s directive that no construction should be done in the inter-tidal zone, which is between 200 metre and 300 metre from the coastline. The massive project will disrupt the natural flow of the tides, the residents claim, thereby putting them at risk.\nThe police action drew flak from political leaders cutting across party affiliations. The veteran Communist leader and former Chief Minister VS Achuthanandan wrote a letter to Vijayan demanding action against police officers who had attacked the protesters.\nThe Communist Party of India, a partner in the Left Democratic Front coalition government, asked the chief minister to rein in the police officers.\nAs pressure mounted, Vijayan invited the protesters for conciliatory talks on Wednesday, only to snub them in the press conference afterwards. “The government knew there was no basis for the allegations [of the protesters],” he said.\n“This is not a state government project,” the chief minister added, referring to the terminal. “Abandoning it will help forces who want Kerala not to be developed. Development cannot be compromised.”\nSelective dissent\nVijayan’s position on protests against “development works’ contrasts starkly with his professed views on dissent. Inaugurating the International Documentary and Short Film Festival in Thiruvananthapuram on June 15, he said, “The government is committed to providing platforms for voices of dissent that question the popular narrative.”\nThe comments had come after the Union Ministry of Information and Broadcasting denied permission to screen three documentary films at the festival – The Unbearable Being of Lightness on Dalit scholar Rohit Vemula who committed suicide in January 2016, In the Shade of Fallen Chinar on the lives of a group of young Kashmiri artists, and March March March on the 2016 protests at Jawaharlal Nehru University, Delhi.\nApparently, Vijayan supports dissent as long as it is not directed at his government.\nIndeed, soon after taking over as chief minister in May 2016, Vijayan had convened a meeting of editors of all major newspapers and TV channels and asked them not to give publicity to protests against development projects by organisations that do not have representation in the Assembly.\nBrewing trouble\nBut far from stamping out ongoing protests, Vijayan may face more agitations if he does not change his style of functioning. Already, discontent is brewing over the government’s plan to acquire land for expansion of the national highway the crosses the length of the state. Protesters have been demanding that the highway’s width be fixed at 30 metres, instead of the proposed 45 metres, to reduce displacement of people. But Vijayan is adamant that no talks will be held with the affected people.\nThe state has also been witnessing protests against the Gas Authority of India Limited’s proposed gas pipeline from Kochi to Mangalore in Karnataka. A demonstration against the multi-crore project at Koottanadu in Palakkad district in January 2017 invited a police assault, which left many people injured.\nThen, too, Vijayan had refused to offer any concessions, saying the police would act against those trying to impede development initiatives.", "url": "https://scroll.in/article/841520/is-kerala-chief-minister-using-development-plank-to-stop-dissent-and-protests", "label": 1}