{"authors": ["Press Trust Of India"], "date_download": "2019-03-27 14:41:00", "date_modify": "2019-03-27 14:41:00", "date_publish": "2018-11-14 21:50:18", "description": "Read more about Agitation for removal of Kolasib DC, later withdrawn on Business Standard. A large number of agitators demonstrated before the office of the deputy commissioner (DC) of Kolasib on the Mizoram-Assam border Wednesday demanding his removal for allegedly enrolling 218 new Bru voters without conducting hearing and physical", "filename": "article_pti-stories_agitation-for-removal-of-kolasib-dc-later-withdrawn-118111401444_1_1553697660.html", "image_url": "https://bsmedia.business-standard.com/_media/bs/img/article/default/1181114/full-118111401444.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/business-standard.com/article_pti-stories_agitation-for-removal-of-kolasib-dc-later-withdrawn-118111401444_1_1553697660.html", "title": "Agitation for removal of Kolasib DC, later withdrawn", "title_page": "Agitation for removal of Kolasib DC, later withdrawn | Business Standard News", "title_rss": "NULL", "source_domain": "business-standard.com", "text": "A large number of agitators demonstrated before the office of the (DC) of on the Mizoram- border Wednesday demanding his removal for allegedly enrolling 218 new Bru voters without conducting hearing and physical verification.\nThis is the second instance of people demonstrating against a in the northeastern state.\nThe protest and picketing was, however, called off in the evening by unit of All NGO Coordination Committee, the apex body of civil societies and student bodies of the state spearheading the agitation, after a stay order by the Aizawl bench of the and holding talks with MKHC.\npolice said the agitators held demonstrations in front of the office of the DC, Arun T, since morning though he did not attend office. They were demanding that the DC leave immediately.\nThe of a district is also its Polling for the 40-member Assembly is scheduled for November 28.\nA delegation of the Kohhran Hruaitute Committee(MKHC), a conglomerate of leaders of 16 major churches in the state, led by its Rev R Lalrinsanga had been sent by the to hold talks with the NGO Committee's Kolasib unit today.\nThe HC during the day restrained the Kolasib DC from publishing the final electoral roll pertaining to Bru voters lodged in the six relief camps in before Monday.\nJustice of Aizawl bench heard the public interest litigation filed against the DC by the Committee's Kolasib unit and ordered issuance of notice to the DC.\nJustice Zothankhuma said if the final electoral has been published, the DC should bring the voters lists to the court on Monday.\nThe Committee district unit had demanded that the leave Kolasib district on or before 5 PM on Tuesday, sources in it said.\nThousands had organised a picket in front of the S B Shashank's office at Aizawl on November 6 and November 7 demanding his removal.\nwas forced to leave the state in the face of large-scale demonstrations and the sent two high-level ECI teams on November 6 and November 9 to check the situation.\nThe Kolasib DC has been accused by the All NGO Coordination Committee, the apex and students body, of enrolling 218 Brus lodged in the six relief camps in without conducting any hearing and ascertaining whether they were bona fide residents of Mizoram.\nThe leaders of the Committee's Kolasib unit have alleged that Arun T was trying to conceal his actions and that his efforts resulted in enlisting of Bru voters who could be suspected of \"not being bona fide residents of the state\", the Committee sources said.\nThe committee leaders in a letter accused the DC of lying a number of times and that the people of Kolasib district did not have confidence in him to conduct the election to the state assembly under his supervision.\nCopies of the letter were sent to the state K Rajasekharan, and the CEO, the committee sources said.\nThe alleged actions of the DC had resulted in a mob attack on the office of the Kolasib deputy commissioner on the night of November 6 in which a few people, including Commandant of the first battalion of the Reserve Police Lalthafamkima were injured and police resorted to teargassing.\nThe Mizoram Joint CEO, had issued an order to the Kolasib deputy commissioner on November 6, asking him to delete all the 218 names and conduct a public hearing in presence of village leaders and NGOs to ascertain the true identities of the newly-enrolled voters lodged in the Bru relief camps, officials said.\nThe talks held between the Committee's Kolasib unit and senior district police officials besides talks with the senior home department officials on Tuesday night had been inconclusive.\nCivil societies in Mizoram have been demanding that Bru voters in the six relief camps in should exercise their franchise in Mizoram as laid down by law and committed by of in 2014.\nThey also demanded that all the eligible Bru voters should be enrolled in the voters lists in Mizoram only after they return to Mizoram not \"surreptitiously inside the relief camps\".\nThe face-off between the CEO, and the and outfits took place after he complained against (home), Lalninmawia Chuaungo for allegedly interfering with the election process in the state.\nhad claimed that Chuaungo had played an active role in the revision of electoral roll of Bru refugees from Mizoram, who were forced to flee to Tripura after facing ethnic violence in 1997.\nThe complaint had led to the removal of Chuaungo, which irked the state government, political parties and outfits in the state.\nMassive protests were held against Chuaungo's removal outside the CEOs office in Aizawl and wrote to demanding Shashanks removal.\n(This story has not been edited by Business Standard staff and is auto-generated from a syndicated feed.)", "url": "https://www.business-standard.com/article/pti-stories/agitation-for-removal-of-kolasib-dc-later-withdrawn-118111401444_1.html", "label": 1}