{"authors": [], "date_download": "2019-03-27 14:25:39", "date_modify": "2019-03-27 14:25:39", "date_publish": "2017-08-13 16:30:16", "description": "The CM had convened a meeting of CPI(M) and BJP-RSS state leaders on July 31 to discuss ways and means to ensure peace and avoid such incidents. The meeting had taken certain decisions and decided to hold similar meetings in three affected districts.", "filename": "article_india__1553696739.html", "image_url": "https://images.indianexpress.com/2016/09/kerala-759.jpg?w=759", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/indianexpress.com/article_india__1553696739.html", "title": "RSS-BJP against President’s rule in Kerala says senior RSS leader", "title_page": "\n\t\t\t\tRSS-BJP against President’s rule in Kerala says senior RSS leader | India News, The Indian Express\t\t\t", "title_rss": "NULL", "source_domain": "indianexpress.com", "text": "The RSS-BJP in Kerala are against the imposition of President’s rule in the state in the wake of violent clashes between the RSS and CPI(M) activistst here, a senior RSS leader has said. However, he has also questioned the recent peace talks initiated by the Kerala government to stop such political violence, alleging that the Left cadres have used such process to regroup and launch further attacks. The Kerala state head of RSS, P Gopalan Kutty Master,said the RSS and the BJP were against imposition of President’s rule and added that RSS chief Mohan Bhagwat wanted them to engage in the peace talks to see there is no violence. Talking to reporters here, Master said that Chief Minister Pinarayi Vijayan has assured of engaging in a continued dialogue to deal with the violent incidents.\nAdvertising\nThe Chief Minister had convened a meeting of CPI(M) and BJP-RSS state leaders on July 31 to discuss ways and means to ensure peace and avoid such incidents. The meeting had taken certain decisions and decided to hold similar meetings in three affected districts as a followup. These meetings were also held during which a framework was evolved and both sides committed to see that conflicts are avoided and the police takes action against anyone resorting to violence. Master said he apprehended that its workers may be attacked as the peace talks have been initiated after an RSS worker was hacked to death here on July 29. “Whenever there were discussions, a peace pause, it was used by them (the Left cadre) to bring another attack (RSS-BJP men). They used that time for the next attack. That has been our experience. They are using that period to arrange for the next attack,” he alleged.\nThe RSS-BJP and the CPI(M) have been at loggerheads in Kerala, particularly its northern parts, after the Left Democratic Front came to power in the state last year. The RSS-BJP combine has claimed that 14 of its members were killed by the Left cadres during the period, while the CPI(M) has alleged that 13 of workers lost their lives in violence perpetuated by the saffron organisations. Both sides have blamed each other for the “political killings”. Master said that the state unit of RSS-BJP had discussed the issue of attacks on its workers with BJP president Amit Shah seeking to draw the attention of the party’s central leadership. He said the RSS-BJP combine was against dissolving an elected government. “It is not good to dissolve the government elected by people,” he said responding to questions by reporters. Master alleged that BJP worker P Santhosh was killed in January this year in Kannur after two such peace meetings were held between the two sides. Similarly, he said that immediately after the dialogue between both sides in Kannur district, RSS worker Rajesh was murdered. He said he had spoken to Vijayan when a large number of CPI(M) workers had gathered outside a local court which was dealing with the bail pleas of some RSS-BJP workers.\n“Fortunately, nothing happened in the court as police took some right steps. But the CPI(M) men had gathered at the court even as the peace talks are on. I talked to the chief minister on the issue,” Master said. He said the Chief Minister told him that “they will find out who these people were and added the peace process should not be affected.” Master said Home Minister Rajnath Singh had also discussed the issue with Vijayan. “The Union Minister spoke to the chief minister and has sought a report. Like that, it will lead to good results in curbing violence.” He said as asked by Bhagwat, the Kerala units of the RSS and the BJP were ready for talks with the government and stressed the saffron combine was not against peace. He, however, maintained that it is required for the RSS-BJP men to defend themselves if the CPI(M) workers attacked them and ensure their morale is not down.\n“A planned retaliation is not good for the organisation.But when some incident takes place, sudden retaliation is necessary. We tell our people to beware of things. Be prepared every time as there can be attack at any point of time,”Master added. The CPI(M) had recently said that while the Home Minister adopts one position, another Union Minister and the BJP leadership take a contrary stand. “This clearly shows that the BJP-RSS are not keen to see that peace is restored and there are no political clashes,” it had said in a statement. It said that the RSS-BJP “game-plan is clear. Resort to provocative actions and uncalled for physical assaults against the CPI(M) workers and raise the cry that the CPI(M) is resorting to violence and blame the Kerala government for not stopping such attacks.”", "url": "https://indianexpress.com/article/india/rss-bjp-against-president-rule-in-kerala-says-senior-rss-leader-4794976/", "label": 1}