{"authors": [], "date_download": "2019-03-27 14:40:43", "date_modify": "2019-03-27 14:40:43", "date_publish": "2019-01-10 21:10:55", "description": "Chief Minister Biplab Kumar Deb said that a magisterial inquiry was ordered to look into how the incident took place and under what circumstances did the police open fire.", "filename": "article_north-east-india_tripura__1553697643.html", "image_url": "https://images.indianexpress.com/2018/07/biplab-deb.jpg?w=759", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/indianexpress.com/article_north-east-india_tripura__1553697643.html", "title": "Citizenship Bill protests: Magisterial inquiry ordered into Madhabbari clashes in Tripura", "title_page": "\n\t\t\t\tCitizenship Bill protests: Magisterial inquiry ordered into Madhabbari clashes in Tripura | North East India News, The Indian Express\t\t\t", "title_rss": "NULL", "source_domain": "indianexpress.com", "text": "The Tripura government Thursday ordered a magisterial inquiry into the violence erupted at Madhabbari in West Tripura district over protests against Citizenship (Amendment) Bill on Tuesday. The police have extended prohibitory order under Section 144 of CrPC for the next 48 hours along with the ban on SMS and mobile internet services.\nAdvertising\nOn Tuesday, a bandh called by the North East Students Organisation (NESO) had turned violent when protesters clashed with police, leaving 15 people, including 10 policemen and 5 protestors, injured.\nAddressing a press conference, Chief Minister Biplab Kumar Deb said that a magisterial inquiry was ordered to look into how the incident took place and under what circumstances did the police open fire.\n“I am also facing problem. When the suspension is lifted would depend on the situation,” Deb was quoted as saying by PTI.\nAdvertising\nDeb said, “Police are supposed to open fire below the knee. One Sumit Debbarma, who received gunshot on his shoulder…maybe he was in such a posture that the bullet entered through his shoulder and came out of his waist. Everything would be inquired into, including that how the situation turned violent.”\nDeb said Debbarma was shifted to Kolkata’s R N Tagore hospital after his condition deteriorated, adding that his condition was improving.\nDeb also alleged the involvement of Indigenous Nationalist Party of Tripura (INPT), a tribal party, in the incidents of road blockade at Madhabbari.\n“We have received police report that the supporters of INPT were behind blocking the road and involved in the incidents of pelting stones and bottles on police,” Deb said.\nAlso present at the conference was N C Debbarma, the State Revenue Minister and Indigenous Peoples Front of Tripura (IPFT) president, who refused to comment over the involvement of IPFT’s student wing Twipra Student Federation’s involvement in the road blockade. IPFT has also shown its resentment against the Citizenship Bill.\nDeb said that the Bill was passed with positive thinking and that Tripura has a long tradition of giving shelter to the refugees. The chief minister said if any person or organisation or political party wants to oppose anything they should do it in a democratic manner, but anybody taking the law into their own hands would not be tolerated.\n(With PTI inputs)", "url": "https://indianexpress.com/article/north-east-india/tripura/citizenship-bill-protests-magisterial-inquiry-madhabbari-clashes-tripura-5532568/", "label": 1}