{"authors": ["Anjali Karnavar"], "date_download": "2019-03-27 14:35:04", "date_modify": "2019-03-27 14:35:04", "date_publish": "2016-04-25 01:50:19", "description": "Simultaneous protests were held in Delhi, Hyderabad and Bengaluru.", "filename": "article_cities_mumbai__1553697304.html", "image_url": "https://images.indianexpress.com/2016/04/qnet-mumbai-480.jpg?w=480", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/indianexpress.com/article_cities_mumbai__1553697304.html", "title": "Qnet Scam: Mumbai residents protest outside Michael Ferreira’s house", "title_page": "\n\t\t\t\tQnet Scam: Mumbai residents protest outside Michael Ferreira’s house | Cities News, The Indian Express\t\t\t", "title_rss": "NULL", "source_domain": "indianexpress.com", "text": "Scores of Mumbaikars protested in front of former World Billiards champion Michael Ferreira’s house on Sunday, demanding a speedy trial in 2013 Qnet scam.\nAdvertising\nFerreira is alleged to be an 80 per cent shareholder in Vihaan Direct Marketing Selling Ltd, a franchise of Hong Kong-based company Qnet, which reportedly duped thousands across the country. Simultaneous protests were held in Delhi, Hyderabad and Bengaluru, with the same demand — to accelerate the numerous trials against Qnet.\nRead | Qnet scam: Mumbai Police arrests Michael Ferreira’s former daughter-in-law\nIn August 2013, the Economic Offences Wing of the Mumbai Police registered an FIR against QNet and its Indian franchise Vihaan, which claimed to sell cosmetics and other products. The EOW arrested nine directors of Qnet for allegedly indulging in a binary scheme, where existing members are required to bring in more members and are paid commissions for it. Officials from EOW said the practice is banned in India under the Prize Chitfund and Money Circulation Schemes (Banning) Act.\n[related-post]\nAdvertising\nAccording to Gurupreet Anand, one of the petitioners of the case registered in Mumbai, the number of complainants against the company in the country is too big to gauge as approximately 31,500 complaints have been registered in the state of Tamil Nadu alone.\n“It is not just the company. I knew Ferrera’s father. He was a solicitor back then and lent money over property as collateral which he then took away from the poor. His son had forged my signature and sold off my property,” claimed 90-year-old Cyril Hendricks, the oldest protester outside the Ferreira residence.\nWATCH INDIAN EXPRESS VIDEOS HERE", "url": "https://indianexpress.com/article/cities/mumbai/qnet-scam-mumbai-residents-protest-outside-michael-ferreiras-house/", "label": 1}