{"authors": ["Shaju Philip"], "date_download": "2019-03-27 14:25:43", "date_modify": "2019-03-27 14:25:43", "date_publish": "2017-12-11 06:50:15", "description": "The project, which should have been commissioned in 2013, now has a revised deadline of February 2019.", "filename": "article_explained__1553696743.html", "image_url": "https://images.indianexpress.com/2017/12/gail.jpg?w=759", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/indianexpress.com/article_explained__1553696743.html", "title": "Why a gas pipeline is triggering anger in Kerala", "title_page": "\n\t\t\t\tWhy a gas pipeline is triggering anger in Kerala | Explained News, The Indian Express\t\t\t", "title_rss": "NULL", "source_domain": "indianexpress.com", "text": "On November 1, Kozhikode in north Kerala witnessed violent protests against the laying of a pipeline by the Gas Authority of India Ltd (GAIL). The Kochi-Koottanad-Bengaluru-Mangaluru Pipeline (KKBMPL) is meant to transport natural gas from Kochi to Mangaluru and Bengaluru (see map). But it has run into rough weather with agitators clashing with police and preventing officials engaged in land acquisition procedures. They have hurled stones and damaged project machinery.\nAdvertising\nPolitical parties including the Congress and CPM backed the protest until recently, but have backtracked for fear of being seen as “anti-development”. The project has been delayed considerably as a result of resistance to acquisition of land under the Right of Use (RoU) agreement. The project, which should have been commissioned in 2013, now has a revised deadline of February 2019.\nFringe parties such as the rightwing Social Democratic Party of India (SDPI) and the Jamaat-e-Islami’s Solidarity Youth Movement are currently driving the agitation. Despite the disruption attempts, GAIL has managed to continue laying the pipeline, albeit under heavy police protection.\nPetronet LNG Limited is South India’s first LNG-receiving, regasification and re-loading terminal. Located in Kochi, it has a capacity of five million metric tonnes per annum (MMTPA ). Constructed at a cost of Rs 4,500 crore, the Kochi LNG terminal was meant to ensure natural gas supply for domestic and industrial use in Kerala and in South India.\nAdvertising\nGAIL thus envisaged a pipeline from Kochi to Mangaluru and Bengaluru. Conceived in 2007, the Kerala project had two phases — in the first phase, a 44 km-long pipeline was laid in Kochi, linking the terminal with local industrial users, including Bharat Petroleum Corporation Limited. To take the natural gas to domestic consumers, Indian Oil Corporation (IOC) entered into a pact with Adani Gas Limited. The second phase of the pipeline was to go through seven districts of Kerala — covering 503 km in that state, besides 312 km in Tamil Nadu and 22 km in Karnataka.\nThe Kerala leg began in 2012. It was to be completed in 2013 — however, the project faced stiff resistance from farmers and landowners who had the backing of political parties. So far, only about 80 km of the Kochi-Mangaluru stretch has been laid. Although GAIL has stressed that LNG is both safe and essential for the state’s development, the agitators have depicted the scheme as a “gas bomb”. Consequently, GAIL had to terminate the contracts it entered into with construction firms to lay the pipeline.\nMeanwhile, the Kochi terminal plunged into major crisis, making a huge loss for want of a pipeline to take the product to Mangaluru and Bengaluru. In the last fiscal, the LNG terminal incurred a pre-tax loss of Rs 200 crore. As a result of re-tendering, the Kerala leg faced a cost escalation of Rs 231 crore.\nThe protestors demand that the pipeline be relocated from populated areas and taken through the sea route, instead. This has been rejected by GAIL, which reportedly fixed the alignment minimising impact on populated areas. Another demand is that the land acquired under the RoU should be given a price five times higher than the market value. The protestors also want the rehabilitation of dwellers along the pipeline’s route if the latter have less than ten cents — 100 cents constitute an acre — of land. GAIL states there is no provision to rehabilitate such dwellers and the compensation under the RoU is as per fair value. GAIL also states that the land had been surveyed nine years ago and misgivings were cleared at grassroots-level meetings in all districts.\nSignificantly, unlike other infrastructure projects, GAIL’s pipeline work involves no evictions. GAIL acquires the RoU from land owners and/or farmers. Owners are paid compensation as per the Petroleum and Mineral Pipelines (Acquisition of Right of User in Land) Act, 1962. But the public sector firm has been facing resistance particularly on starting work in a stretch — under the RoU, GAIL acquires land at a distance of 10 metres, but gives compensation for crops standing at a distance of 20 metres because such a stretch is required for its machinery. With landholdings less than 10 cents, the area to be acquired under the RoU has been reduced to two metres. Ownership remains with the landowners, who simply shouldn’t cultivate deep-rooted trees at a distance of 10 metres, or carry out constructions.\nGAIL pays compensation as per the amount fixed by the state revenue department. After the CPM-led government assumed office in 2016, compensation for land acquired under the RoU was increased. Last month, against protests, the state government effected another steep hike in the compensation — increased to 10 times the fair value from the existing five times, for land acquired under the RoU at a distance of 10 metres. This would have retrospective effect, and GAIL would have to pay at the revised rate.\nThis is significant, as of the land required in Kerala, 70 per cent is under paddy cultivation. The Kerala leg also requires 75 major horizontal drillings at the beds of water bodies to take the pipeline across rivers. Thus, the challenge isn’t simply in the pipeline, but also in factors surrounding it.", "url": "https://indianexpress.com/article/explained/why-gail-project-gas-pipeline-is-triggering-anger-in-kerala-4977006/", "label": 1}