{"authors": [], "date_download": "2019-03-27 14:29:20", "date_modify": "2019-03-27 14:29:20", "date_publish": "2018-10-27 00:00:00", "description": "The Congress in Chhattisgarh held a protest on a curious issue -- it has accused the BJP of insulting former prime minister Atal Bihari Vajpayee who died in August this year. Prime Minister Vajpayee's niece Karuna Shukla, who joined the Congress in the run-up to the 2014 Lok Sabha elections, has alleged that the Chhattisgarh BJP has forgotten to immerse the deceased leader's ashes.", "filename": "assembly-chhattisgarh_chhattisgarh-congress-invokes-atal-bihari-vajpayee-says-bjp-didnt-immerse-his-ashes-1933182_1553696960.html", "image_url": "https://c.ndtvimg.com/2018-10/kfdt3jeo_karuna-shukla-protest_625x300_16_October_18.jpg", "language": null, "localpath": "/home/raj/news-please-repo//data/2019/03/27/ndtv.com/assembly-chhattisgarh_chhattisgarh-congress-invokes-atal-bihari-vajpayee-says-bjp-didnt-immerse-his-ashes-1933182_1553696960.html", "title": "Chhattisgarh Congress Invokes Vajpayee, Says BJP Didn't Immerse His Ashes", "title_page": "Chhattisgarh Congress Invokes Atal Bihari Vajpayee Says BJP Didnt Immerse His Ashes", "title_rss": "NULL", "source_domain": "ndtv.com", "text": "Congress workers led by PM Vajpayee's niece Karuna Shukla protested outside BJP office in Raipur.\nHighlights Congress protests at BJP office in Raipur led by PM Vajpayee's niece Alleges that BJP forgot to scatter his ashes, has insulted his memory Says BJP must come clean on an urn kept in the media room\nThe Congress in Chhattisgarh held a protest on a curious issue -- it has accused the BJP of insulting former Prime Minister Atal Bihari Vajpayee who died in August this year.\nPrime Minister Vajpayee's niece Karuna Shukla, who joined the Congress in the run-up to the 2014 Lok Sabha elections, has alleged that the Chhattisgarh BJP has forgotten to immerse the deceased leader's ashes.\nAfter Prime Minister Vajpayee's cremation in Delhi in August this year, his ashes were taken in urns to various states for immersion.\nMs Shukla said that the ashes were lying about at the Chhattisgarh BJP office in Raipur as the state BJP had forgotten to immerse them even two months after Prime Minister Vajpayee's death.\nCongress workers headed by Ms Shukla marched to the BJP office in Raipur today and demanded that the urn be handed over to her. The Congress workers shouted slogans in support of the former BJP prime minister such as \"Atal tera yeh apmaan, nahi sahega Hindustan (Atal, India won't tolerate this insult to you)\".\nBJP workers began shouting in retaliation and the police stepped in, detaining Ms Shukla and other protestors for a couple of hours.\n\"We had written to the collector, the superintendent of police and election commission informing them about the protest. Despite this, they used their brute force on me,\" Ms Shukla said.\nExplaining why the Congress feels the BJP has insulted Prime Minister Vajpayee, party spokesperson Vikas Tiwari said, \"In the media room in the BJP office, there is a sack with an urn inside it. People there told us that these are Atalji's ashes. The ashes were supposed to be taken to a particular block but the BJP didn't take them\".\nPraising the former prime minister, Mr Tiwari told NDTV, \"Vajpayee ji was a national figure, a Bharat Ratna. He was respected across partisan lines. His niece (Ms Shukla) and all of us requested that the ashes be given to us\".\nMr Tiwari said that as the former prime minister died over two months back, the BJP is \"disrespecting Hindu rituals by failing to immerse his ashes\".\nThe BJP accused the Congress of \"playing petty politics in the name of Atal Bihari Vajpayee\".\n\"Congress has fallen to new depths by playing politics over Atalji's ashes,\" said BJP leader Sanjay Shrivastava.\nGet the latest election news, live updates and election schedule for Lok Sabha Elections 2019 on ndtv.com/elections. Like us on Facebook or follow us on Twitter and Instagram for updates from each of the 543 parliamentary seats for the 2019 Indian general elections.", "url": "https://www.ndtv.com/assembly-chhattisgarh/chhattisgarh-congress-invokes-atal-bihari-vajpayee-says-bjp-didnt-immerse-his-ashes-1933182", "label": 1}