{"authors": [], "date_download": "2019-03-27 14:34:55", "date_modify": "2019-03-27 14:34:55", "date_publish": "2016-09-13 04:00:00", "description": "Tamil Nadu chief minister J Jayalalithaa has expressed concern at the situation in Karnataka after widespread protests across the state over Cauvery.", "filename": "bangalore_others_Amma-write_4f5374a89c06b6986abc98fa26f90913_54299824_1553697295.html", "image_url": "https://bangaloremirror.indiatimes.com/photo/52761249.cms", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/bangaloremirror.indiatimes.com/bangalore_others_Amma-write_4f5374a89c06b6986abc98fa26f90913_54299824_1553697295.html", "title": "Amma writes to Siddu seeking safety of Tamils", "title_page": "Siddu: Amma writes to Siddu seeking safety of Tamils", "title_rss": "NULL", "source_domain": "bangaloremirror.indiatimes.com", "text": "Tamil Nadu\nJ Jayalalithaa\nKarnataka\nSiddaramaiah\nRamanathapuram\nchief ministerhas expressed concern at the situation inafter widespread protests across the state over Cauvery.“This is an alarming situation and is causing considerable anxiety,” she stated in a letter to“I write to bring to your urgent attention the need to ensure the safety and security of the many lakhs of Tamil speaking people residing in Karnataka and of their properties in the light of the escalating incidents of violence taking place in many parts of Karnataka.”She acknowledged that she received the letter sent by Siddaramaiah earlier.She noted that the protests by some sections in Tamil Nadu, including farmers, have been peaceful and lawful. Despite very provocative incidents that are taking place in Karnataka, absolute restraint has been observed in Tamil Nadu by all sections.“We have ensured that no major incidents of any kind targeting Kannada speaking people or their properties have occurred. The two minor incidents in Chennai andthat have been referred to in the letter received from the additional chief secretary, Home, Karnataka, addressed to the principal secretaries, Home and Public, Tamil Nadu, have already been acted upon very promptly and cases registered and the miscreants arrested. Law and order continues to be well maintained in Tamil Nadu.”", "url": "https://bangaloremirror.indiatimes.com/bangalore/others/Amma-writes-to-Siddu-seeking-safety-of-Tamils/articleshow/54299824.cms", "label": 1}