{"authors": ["Niranjan Kaggere"], "date_download": "2019-03-27 14:18:19", "date_modify": "2019-03-27 14:18:19", "date_publish": "2016-07-02 04:00:00", "description": "Home Min impressed by popularity of police in Bavaria, will replicate model in Namma Bengaluru with focus on investigation and weapons", "filename": "bangalore_cover-story_Bluru_28c17c2c5958e73ce833c6ed11978d2e_53014059_1553696299.html", "image_url": "https://static.toiimg.com/photo/imgsize-169929,msid-53014157/53014157.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/bangaloremirror.indiatimes.com/bangalore_cover-story_Bluru_28c17c2c5958e73ce833c6ed11978d2e_53014059_1553696299.html", "title": "B’luru Police will grow up to be Munich Polizei", "title_page": "B’luru Police will grow up to be Munich Polizei", "title_rss": "NULL", "source_domain": "bangaloremirror.indiatimes.com", "text": "Home Min impressed by popularity of police in Bavaria, will replicate model in Namma Bengaluru with focus on investigation and weaponsThose who grew up watching Doordarshan will have bizarre memories of German TV crime dramas like Old Fox and Derrick. They showed us that the Germans, for the most part, knew what they were doing, especially when it comes to policing. And that’s exactly what home minister Parameshwara found to be true on his 10-day visit to Bavaria. And it gave rise to one question: Why public acceptability of the Bengaluru police force so low, and what could be done to change that.The German police had 87 per cent acceptability as against politicians, who came in at just 14 per cent. He was further intrigued by the way police work in the Bavarian capital Munich, which has earned it the sobriquet of a ‘Safe City’.Back home in Bengaluru on Thursday, Parameshwara seems to be determined to make Bengaluru a ‘Safe City’ too, on the lines of Munich. To execute his plan, the minister has even signed a joint declaration with Bavaria for experts from the German police to help hone the skills of Karnataka cops. Over the next few years, the Karnataka police, particularly the Bengaluru Police, will get advanced training in traffic management, crime investigation, training, and people-friendly policing.“I was surprised when I was told that 87 per cent of Germans see the police as their friends and do not have the same opinion about politicians. However, the situation in Karnataka is something contrary to what I witnessed. In general, our understanding of the police force is similar to the cat-and-mouse (Kalla-Police) idiom. We often portray them in a bad light, especially to scare stubborn kids. But in Germany it is the opposite and the public has lot of faith in the police. Be it a domestic quarrel or a major crime, the public ensures that police are informed, irrespective of the outcome and the police respond in similar faith,” Parameshwara explained.The minister also said that he was thinking of outsourcing the study to find out more about Karnataka police’s public acceptability to either the Institute of Social and Economic Change (ISEC) or any other independent NGO.Inspired by the policing methods and subsequent declaration of Munich as a safe city, Parameshwara wants to emulate the same in Bengaluru too. “They have declared Munich a safe city where women, children and senior citizens have no threats; it is constantly safeguarded by the police. We want to emulate the same in Bengaluru by making the city safe for all and led the delegation of senior officers to Germany at the Bavarian government’s invitation. In the days to come, there will be lot of exchange of ideas and training between both forces. The Bavarian police will also be trained by their Karnataka counterparts in tackling rising incidents of cybercrime,” Parameshwara explained.Trying to understand the way the police work in Bavaria, Parameshwara and his team visited several police stations and police installations. “What was interesting was that the police go to schools and educate children about the importance of police, traffic rules and other aspects of policing, on a regular basis. This leaves an indelible mark on the minds of children and when they grow up they are not afraid of the police but give them a helping hand by informing them about activities in their neighbourhood. This is the strength of the police there.” Parameshwara said. The home minister said that the same strategy would be tried out here.The training regime of the German police encompassing advanced technology also captured the attention of the team. “Unlike our police system where senior officers are posted from the IPS, in Germany, be it the commander or any senior officer, everybody would have started as a constable and may have reached the top post by clearing trainings and exams conducted by their own police university. Their training is based on situations and circumstance. They have recreated about 80 to 85 models based on real-life incidents through which they train their personnel. No police will sit in the station and all of them will be out in the field as soon as they finish attendance formalities at the station. Except for some House Officer, the rest will be in the field, which is a good approach to connect with the public.”Impressed by the effective use of technology at all levels from registering complaints to crime detection, the Bengaluru police will be trained by their German counterparts. Similarly, the strategy of Bengaluru and Karnataka police in handling large crowds, violent protests, detecting cybercrimes will be key areas where the Bavarian police would like to hone their skills. “Back in 2007, Karnataka and Bavaria signed an MoU on various issues. Now with the signing of a joint declaration, the police task too has been included in the list of cooperation extended between the states,” Parameshwara said.“Some of their smart techniques like public security, safe city planning and development, victim protection, citizen-friendly policing, cooperation between police and justice, civil societies, traffic management and advanced training will be worth emulating here. Including Munich, several German cities are known for having the best traffic systems. The police in Bavaria have a high success rate in cracking all kinds of cases through proper and scientific investigation and use of modern weaponry. All these will be a boost to our men when experts from there come down and impart training. Similarly, we too will share our knowledge,” Parameshwara explained.With the state government setting aside funds for the modernisation of the police force and additional funds trickling in from the Centre, the home minister is confident of giving a complete makeover to the Karnataka police, particularly the Bengaluru cops.Let’s hope the effort doesn’t turn into Didi’s Comedy Show, another popular German show from the Doordarshan days.", "url": "https://bangaloremirror.indiatimes.com/bangalore/cover-story/Bluru-Police-will-grow-up-to-be-Munich-Polizei/articleshow/53014059.cms", "label": 1}