{"authors": [], "date_download": "2019-03-27 14:18:20", "date_modify": "2019-03-27 14:18:20", "date_publish": "2016-11-28 12:51:25", "description": "Even as the Congress in Karnataka organised a massive protest outside Town Hall in Bengaluru, it is business as usual across the state.", "filename": "bengaluru_bharat-bandh-congress-ruled-karnataka-it-s-business-as-usual-2274961_1553696300.html", "image_url": "https://www.oneindia.com/img/2016/11/img-20161128-wa0013-converted-28-1480317281.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/oneindia.com/bengaluru_bharat-bandh-congress-ruled-karnataka-it-s-business-as-usual-2274961_1553696300.html", "title": "Bharat bandh: In Congress ruled Karnataka it's business as usual", "title_page": "Bharat bandh: In Congress ruled Karnataka it's business as usual - Oneindia News", "title_rss": "NULL", "source_domain": "oneindia.com", "text": "Bharat bandh: In Congress ruled Karnataka it's business as usual\nBengaluru\noi-Anusha\nEven as the Congress in Karnataka organised a massive protest outside Town Hall in Bengaluru, it is business as usual across the state. Establishments, schools, colleges and transport services remained unaffected.\nThe Karnataka Congress staged a massive protest against Prime Minister Modi's demonetisation move on Monday. A march from Town Hall to Mysore bank circle marked Congress' protest in support of Aakrosh Diwas. The march was led by senior Congress leaders including the party's working President Dinesh Gundu Rao.\n[Also Read: Bharat Bandh- Tripura comes to a standstill]\nDistrict units of the Congress have also been instructed to carryout protests and submit a memorandum to respective District Commissioners. The memorandum will speak of Congress' dissatisfaction over demonetisation move.\nApart from protests, life has been largely unaffected in Karnataka. While holiday has been declared for schools and colleges in some districts, others are functioning as usual. Transportation services are operational but will be halted if incidents of violence are reported. All shops, businesses, establishments are fully operational.\nPetrol bunks, hospitals, malls, cinema halls, tourist spots, banks are unaffected and remain open as usual. Even as the State assembly called off session for both the houses, all government offices are up and running as usual.\n[Also Read: 'Left' alone, Kolkata unaffected by Bandh]\nAPMC yards, wholesale markets and retail shops remain open. While examinations have been cancelled as a precautionary measure, most colleges remain open. The JD(S) has refused to support any bandh call likewise the Congress that has only planned protests for the day.\nOneIndia News", "url": "https://www.oneindia.com/bengaluru/bharat-bandh-congress-ruled-karnataka-it-s-business-as-usual-2274961.html", "label": 1}