{"authors": [], "date_download": "2019-03-27 14:40:48", "date_modify": "2019-03-27 14:40:48", "date_publish": "2018-02-27 00:00:00", "description": "BJP leader Manoj Baitha's vehicle was reportedly involved in an accident on Saturday in Bihar's Muzaffarpur in which nine school children died.", "filename": "bihar_muzaffarpur-hit-and-run-huge-protests-in-bihar-tejashwi-yadav-targets-nitish-kumar-2084833_1553697648.html", "image_url": "https://english.cdn.zeenews.com/sites/default/files/2018/02/27/663779-bihar970.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/zeenews.india.com/bihar_muzaffarpur-hit-and-run-huge-protests-in-bihar-tejashwi-yadav-targets-nitish-kumar-2084833_1553697648.html", "title": "Muzaffarpur hit-and-run: Huge protests in Bihar, Tejashwi Yadav targets Nitish Kumar", "title_page": "Muzaffarpur hit-and-run: Huge protests in Bihar, Tejashwi Yadav targets Nitish Kumar | Bihar News", "title_rss": "NULL", "source_domain": "zeenews.india.com", "text": "Patna: Opposition parties on Tuesday stage protest outside Bihar Legislative Assembly over Muzaffarpur hit and run case.\nBJP leader Manoj Baitha's vehicle was reportedly involved in an accident on Saturday, in which nine school children died. On Monday, a FIR was lodged against Baitha over the children`s death.\n\"Why hasn't Manoj Baitha been arrested yet? The news was spread that he surrendered before police. But we do not know that for sure. Only administration can say if he surrendered, was arrested or fled to Nepal. Neither Nitish Kumar (CM) nor Sushil Modi (Deputy CM) have spoken on this or sought apology yet. Government is trying to brush this under the carpet.\" RJD leader and Leader of the Opposition in the state Assembly Tejashwi Yadav said.\nEarlier too, the Opposition RJD in Bihar had alleged that the person driving the SUV was \"a drunk BJP leader\" whom the Nitish Kumar government was trying to shield.\n\"Prohibition in Bihar is a farce and the ghastly incident of Muzaffarpur, where a drunk BJP leader crushed nine children to death and left more than 20 others injured, proves our point,\" Yadav had told reporters on February 26, 2018.\nHe had later led a march to Raj Bhawan and submitted a memorandum to Governor Satya Pal Malik.\nRubbishing the charge, Deputy Chief Minister Sushil Kumar Modi asserted that the police has been directed to take \"sternest possible action\" against the accused, \"irrespective of political affiliations\".\n\"Even if the person is found to be associated with the BJP, he will not be spared. I have spoken to the district police chief of Muzaffarpur and asked for sternest possible action, irrespective of political affiliations of the accused,\" he had said.\nMeanwhile, Station House Officer of Meenapur Police Station Sona Prasad Singh had said, \"We registered a FIR against Baitha on Sunday on the basis of a complaint by Mohd Ansari of Dharampur village, who lost five grandchildren in the tragedy on Saturday,\"\nDaroga Ansari, whose granddaughter was among those killed, had in a written complaint to police named Manoj Baitha, said to be the state general secretary of the BJP's \"Mahadalit\" cell and a resident of Sitamarhi district, as the culprit.\nOn Sunday, angry villagers had staged a protest by blocking the National Highway to demand Baitha`s arrest.\n(With Agency inputs)", "url": "https://zeenews.india.com/bihar/muzaffarpur-hit-and-run-huge-protests-in-bihar-tejashwi-yadav-targets-nitish-kumar-2084833.html", "label": 1}