{"authors": [], "date_download": "2019-03-27 14:34:56", "date_modify": "2019-03-27 14:34:56", "date_publish": "2017-05-31 00:00:00", "description": "Tamil Nadu's main opposition party DMK on Wednesday led a march to protest against the Centre's recent order banning the slaughter of cattle and their sale.", "filename": "chennai_massive-protests-in-chennai-over-centres-ban-on-cattle-slaughter-attack-on-iit-madras-student-2010662_1553697296.html", "image_url": "https://english.cdn.zeenews.com/sites/default/files/2017/05/31/599172-stalin-kani-1.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/zeenews.india.com/chennai_massive-protests-in-chennai-over-centres-ban-on-cattle-slaughter-attack-on-iit-madras-student-2010662_1553697296.html", "title": "Massive protests in Chennai over Centre's ban on cattle slaughter, attack on IIT-Madras student", "title_page": "Massive protests in Chennai over Centre's ban on cattle slaughter, attack on IIT-Madras student | Chennai News", "title_rss": "NULL", "source_domain": "zeenews.india.com", "text": "Chennai: Tamil Nadu's main opposition party DMK on Wednesday led a march to protest against the Centre's recent order banning the slaughter of cattle and their sale.\nDMK working president MK Stalin and his colleague Kanimozhi led the protest march in Chennai.\nChennai: DMK working president MK Stalin & DMK leader Kanimozhi lead a protest against central government on cattle slaughter ban pic.twitter.com/QgU7Cu2Qa9 — ANI (@ANI_news) May 31, 2017\nMeanwhile, the Revolutionary Students &Youth Front also staged a protest against Centre's cattle slaughter ban and the alleged attack on an IIT-Madras PhD scholar for organising 'beef fest'.\nChennai:Revolutionary Students&Youth Front protests agnst cattle slaughter ban&attack on a IIT-Madras PhD scholar for organising 'Beef Fest' pic.twitter.com/5YGQALPSvI — ANI (@ANI_news) May 31, 2017\nR Sooraj, a PhD scholar in aerospace engineering department at IIT-Madras, was attacked by a group of students allegedly led by an ABVP sympathiser, Manish, according to a report by Indian Express.\nEight students have been booked for allegedly beating up the IIT-Madras PhD scholar after the latter took part in a ‘beef fest’ in the campus on Sunday night.\nThe accused have been booked under IPC Sections 147 (Punishment for rioting), 341 (Punishment for wrongful restraint), 323 (Punishment for voluntarily causing hurt) and 506(1) (criminal intimidation).\nThe victim, whose right eye has been severely injured, has also been booked under IPC Section 324 (voluntarily causing hurt) and Section 341 (wrongful restraints).\nKerala CM Pinarayi Vijayan had later denounced the attack and requested his Tamil Nadu counterpart Edappadi K Palaniswami to take necessary action.\nA group of 70 to 80 students held the beef festival on Sunday evening to demonstrate against the Centre’s notification on cattle sale rules.\nNotably, beef is not banned in Tamil Nadu.", "url": "https://zeenews.india.com/chennai/massive-protests-in-chennai-over-centres-ban-on-cattle-slaughter-attack-on-iit-madras-student-2010662.html", "label": 1}