{"authors": [], "date_download": "2019-03-27 14:35:17", "date_modify": "2019-03-27 14:35:17", "date_publish": "2017-06-16 06:46:15", "description": null, "filename": "cities_tn-protests-ap-s-move-to-built-check-dam-across-kusa-1497595627_1553697317.html", "image_url": "https://www.thestatesman.com/wp-content/uploads/2017/08/1487413276-palaniswami-afp.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/thestatesman.com/cities_tn-protests-ap-s-move-to-built-check-dam-across-kusa-1497595627_1553697317.html", "title": "TN protests AP's move to built check dam across Kusa", "title_page": "TN protests AP's move to built check dam across Kusa - The Statesman", "title_rss": "NULL", "source_domain": "thestatesman.com", "text": "The Tamil Nadu government on Friday lodged its \"strong protest\" against Andhra Pradesh's \"unilateral action\" of taking up construction of a check dam on a sub-tributary of an inter-state river.\nIn a letter to his Andhra Pradesh counterpart N Chandrababu Naidu, Tamil Nadu Chief Minister K Palaniswami said the move has caused \"great alarm and apprehension\" among farmers in this state and sought his intervention.\nPalaniswami said the Irrigation Department of Andhra Pradesh has commenced construction of a check dam across river Kusa at Nelavayl village in Chittoor District there. Kusa was a sub-tributary of inter-state Kosasthalaiyar river, he said.\n\"This unilateral action of the authorities in Andhra Pradesh has caused great alarm and apprehension amongst the farmers in Tamil Nadu. The Kusa river, a sub-tributary of Kosasthaliyar river, supports an ayacut of about 354.32 acres fed by the Veligaram tank (Thiruvallore district) in Tamil Nadu. Any intervention of the flow to this tank is of great concern to the farmers who depend on the waters of this tank,\" he said.\nThe Andhra Pradesh government should have consulted and obtained prior consent of Tamil Nadu, the lower riparian state, before commencing any new work across the Kusa, he added.\nThe action of the authorities in Andhra Pradesh will affect the natural flow in the stream or channel taking off from it and would obstruct the flow to the Veligaram tank, he said.\nThe state government lodges its \"strong protest\" against the action of the Andhra Pradesh Government in having \"unilaterally\" commenced work for construction of a check dam at Nelavayl, Palaniswami said.\nHe urged Naidu to \"immediately intervene\" and issue instructions to officials concerned to stop construction activities at Nelavayl and also not to take up any diversion/check dam works across Kusa or in any tributaries or sub tributaries of Kosasthalaiyar river without obtaining the prior concurrence of his government.\nPalaniswami also requested Andhra Pradesh to furnish \"full details\" of the check dam under construction/proposed to be constructed in the sub-tributaries and tributaries of Kosasthalaiyar river.", "url": "https://www.thestatesman.com/cities/tn-protests-ap-s-move-to-built-check-dam-across-kusa-1497595627.html", "label": 1}