{"authors": [], "date_download": "2019-03-27 14:35:09", "date_modify": "2019-03-27 14:35:09", "date_publish": "2016-09-10 09:26:00", "description": "The bandh received a lukewarm response in Belagavi city and other towns of the district on Friday.", "filename": "city_hubballi_Confusion-on-_2678961733770e211c0ebd1618c127ff_54260842_1553697309.html", "image_url": "https://static.toiimg.com/thumb/msid-54260873,width-1070,height-580,imgsize-194596,resizemode-6,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "language": null, "localpath": "/home/raj/news-please-repo//data/2019/03/27/timesofindia.indiatimes.com/city_hubballi_Confusion-on-_2678961733770e211c0ebd1618c127ff_54260842_1553697309.html", "title": "Confusion on school holiday in Belagavi", "title_page": "Confusion on school holiday in Belagavi | Hubballi News - Times of India\n\t\t\t", "title_rss": "NULL", "source_domain": "timesofindia.indiatimes.com", "text": "BELAGAVI: The bandh received a lukewarm response in Belagavi city and other towns of the district on Friday.Barring routes to Hubballi and Bengaluru, KSRTC buses plied as usual from Belagavi depot, and so did autorickshaws and maxi cabs. Commercial establishments ran business with half their shutters open till 11am. Later, they opened completely.As a precautionary measure, some private schools had announced a holiday. Government schools functioned, but with thin attendance. Early in the day, confusion prevailed among parents about the holiday following an announcement to this effect by chief minister Siddaramaiah on Thursday. However, DDPIs of both Belagavi and Chikkodi educational districts clarified that there is no holiday for schools.Activists of Uttara Karnataka Vikas Vedike, led by Ashok Pujari, staged a protest at Channamma Circle at 7am. Later, activists of different organizations staged protests after 10am at the busy road junction. Some protesters blocked trucks belonging to Tamil Nadu. However, police intervened and released the trucks by sending the protesters away.Police also foiled the attempt by Karnataka Rakshana Vedike activists to block traffic at Kolhapur Circle. Farmers organizations like Karnataka Rajya Raita Sangha, Hasiru Sene, Bharatiya Krishik Samaj staged protests and raised slogans against Tamil Nadu chief minister J Jayalalithaa. Activists of Karnataka Navanirman Pade burnt the effigy of Jayalalithaa , while the city unit of BJP submitted a memorandum to DC N Jayaram, opposing the release of water to Tamil Nadu.", "url": "https://timesofindia.indiatimes.com/city/hubballi/Confusion-on-school-holiday-in-Belagavi/articleshow/54260842.cms", "label": 1}