{"authors": [], "date_download": "2019-03-27 14:35:28", "date_modify": "2019-03-27 14:35:28", "date_publish": "2016-09-17 02:15:13", "description": "The 12-hour bandh called on Friday to protest against the violence unleashed on Tamilians in Karnataka over Cauvery dispute was near total in Coimbato", "filename": "city_coimbatore_Bandh-near-_0039e82d56b94b2ae34fb0fa200e57bf_54371749_1553697328.html", "image_url": "https://static.toiimg.com/thumb/msid-54371752,width-1070,height-580,imgsize-131323,resizemode-6,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "language": null, "localpath": "/home/raj/news-please-repo//data/2019/03/27/timesofindia.indiatimes.com/city_coimbatore_Bandh-near-_0039e82d56b94b2ae34fb0fa200e57bf_54371749_1553697328.html", "title": "Bandh near total, sporadic violence mar day", "title_page": "Bandh near total, sporadic violence mar day | Coimbatore News - Times of India\n\t\t\t", "title_rss": "NULL", "source_domain": "timesofindia.indiatimes.com", "text": "Coimbatore: The 12-hour bandh called on Friday to protest against the violence unleashed on Tamilians in Karnataka over Cauvery dispute was near total in Coimbatore, barring sporadic violent protests by various political outfits. All private establishments remained shut and roads were empty for most part of the day. Textile and industrial units in Tirupur and Coimbatore also joined the bandh by downing their shutters. Government offices and buses, however, functioned as usual.As members of various political outfits took to the roads on Friday to stage protests and disrupt train services, city police arrested 725 of them and rural police 751, to restore normalcy.More than 90% shops located on Dr Nanjappa Road, Cross Cut Road, 100-feet Road, Ram Nagar, North Coimbatore and Town Hall downed shutters to mark their protest against the Karnataka government for not releasing enough Cauvery water to Tamil Nadu and also not protecting Tamilians living in that state from violence. A few hotels and petrol bunks were open in the city, while many theatres didn't function from 6am to 6pm.Tamil Nadu State Transport Corporation (TNSTC) operated moffusil buses to Erode, Salem and Tirupur districts from Coimbatore Central Bus Stand. Private buses, however, operated only after 6pm.Members of Ilanchiruthaigal Ezhuchi Pasarai, youth wing of Viduthalai Chiruthaigal Katchi (VCK), attempted to stage a protest at Coimbatore railway station. They entered platform number IV and climbed on the locomotive of Blue Mountain Express. The city police reached the spot and arrested and removed 28 members from the platform.Balasingam, district organiser of Ezhuchi Pasarai, said the state has long been facing problems with getting its share of Cauvery, Siruvani and Palar river water. \"The Centre hasn't done anything for the welfare of Tamil Nadu. It always supports Karnataka, Kerala and Andhra Pradesh,\" he alleged.VCK district secretary Ilakkiyan, accompanied by and 28 party workers, meanwhile, staged a protest in front of Coimbatore railway junction. They were also arrested and removed from the spot.In another instance, DMK MLA N Karthik, along with 150 party workers, managed to enter Peelamedu railway station, where they sat on the railway track. They staged protest for 10 minutes before police arrested and removed them. \"Karnataka government failed to protect Tamilians living there. More than 100 TN vehicles were burnt by Kannadigas,\" Karthik said.MDMK district secretary R R Mohankumar, along with 34 party cadres, staged a protest in front of Coimbatore railway junction, while DMK urban north district secretary Muthusamy, accompanied by 124 party men, staged a protest at North Coimbatore railway junction. Police arrested and removed all of them.Members of Tamil Nadu traders association staged a protest in front of the South Taluk office, while Social Democratic Party of India (SDPI) staged a protest at Coimbatore railway junction.Over 120 members of SDPI entered platform number V and climbed on the locomotive of Nagarcoil Express. Police arrested and removed them. All the arrested were released after 6pm.", "url": "https://timesofindia.indiatimes.com/city/coimbatore/Bandh-near-total-sporadic-violence-mar-day/articleshow/54371749.cms", "label": 1}