{"authors": [], "date_download": "2019-03-27 14:29:18", "date_modify": "2019-03-27 14:29:18", "date_publish": "2016-06-08 01:27:22", "description": "Less than one month after severe setbacks for Congress in four state elections, the party has been hit by multiple crises in other states with legisla.", "filename": "city_agartala_The-exodus-co_5f1d2f3246c13209d9a6993319b375e7_52645133_1553696958.html", "image_url": "https://static.toiimg.com/thumb/msid-52645147,width-1070,height-580,imgsize-11303561,resizemode-6,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "language": null, "localpath": "/home/raj/news-please-repo//data/2019/03/27/timesofindia.indiatimes.com/city_agartala_The-exodus-co_5f1d2f3246c13209d9a6993319b375e7_52645133_1553696958.html", "title": "The exodus continues: After Himanta, Jogi and Kamat, Tripura MLAs quit Congress", "title_page": "The exodus continues: After Himanta, Jogi and Kamat, Tripura MLAs quit Congress | Agartala News - Times of India\n\t\t\t", "title_rss": "NULL", "source_domain": "timesofindia.indiatimes.com", "text": "Less than one month after severe setbacks for Congress in four state elections, the party has been hit by multiple crises in other states with legislators switching sides and senior functionaries revolting against “autocratic” CMs, the latest being Tripura.Six dissident MLAs in CPM-ruled Tripura on Tuesday quit the party to join TMC, a day after Jiten Sarkar resigned to join the Left, pushing the main opposition in the assembly to the third spot. Dissidence began growing in Bengali-majority Tripura when Congress joined hands with the Left to fight Mamata Banerjee during the Bengal polls.Pro-Bengali sentiments in Tripura were so strong that party functionaries and workers hoisted TMC flags atop their houses on May 19 when Mamata trounced Congress and the Left in Bengal. Of the 10 Congress MLA in Tripura, which goes to polls in 2018, only state chief Birajit Sinha and two other MLAs are left with the party, one of the lowest since Tripura became a full-fledged state in 1972.The resignation of Maharashtra Congress veteran Gurudas Kamat in protest against the promotion of “outsiders” by the leadership came as a jolt with the Mumbai civic polls just six months away. On Tuesday, Kamat’s supporters held a show of solidarity outside his Mumbai residence where corporators said their re-election in civic polls would be hit.The Congress government in Meghalaya is also grappling with rebellion, especially after BJP won neighbouring Assam. Top Meghalaya functionaries have sent an SOS to the party brass, fearing that the saffron party might effect a replay of revolts as in Uttarakhand and Arunachal. Congress has just 30 lawmakers in the 60-member assembly. As in those states, dissidents in Meghalaya have accused CM Mukul Sangma of “dictatorial ways”.In Uttarakhand, where Congress briefly lost power to President’s rule as its MLAs rebelled, party officials have come out against CM Harish Rawat over issues ranging from the neglect of the Garhwal region to “controversial” Rajya Sabha nominations. The hill state goes to polls next year.Revenue minister Yashpal Arya, Uttarakhand Congress chief Kishore Upadhyay and two legislators, Jeet Ram and Mayuk Mahar, have ranted against Rawat. Annoyed over the RS nomination of former MP Pradeep Tamta, Arya also met party chief Sonia Gandhi. So far considered close to Rawat, Upadhyay accused him of showing a “change in attitude” after assuming office, causing a “political imbalance” by giving key positions to people from Kumaon — a move, he said, that could cost the party in the next polls. Rawat said he would definitely take his opinion into consideration.Former Chhattisgarh CM Ajit Jogi also announced on Monday that he would float a new party. The party does not seem much worried by his plans. Congress’ Digvijaya Singh said only his “wife, son and an MLA” were with him and called his exit “good” . But it would be difficult to play down the exit of Kamat, said to be upset because the leadership “propped up outsiders” like Sanjay Nirupam at his cost. The party on Tuesday virtually rejected Kamat’s plans to quit politics, insisting that he was an “integral part of the Congress family”.(Inputs from Mumbai, Dehradun, Guwahati, Raipur)", "url": "https://timesofindia.indiatimes.com/city/agartala/The-exodus-continues-After-Himanta-Jogi-and-Kamat-Tripura-MLAs-quit-Congress/articleshow/52645133.cms", "label": 1}