{"authors": ["Kapil Dixit"], "date_download": "2019-03-27 14:40:49", "date_modify": "2019-03-27 14:40:49", "date_publish": "2018-12-05 20:23:14", "description": "ALLAHABAD: A gang of eight armed robbers looted Rs 8 lakh from the Gramin Shakha of Bank of Baroda in Sahrua in Pratapgarh district after taking staff.", "filename": "city_allahabad_up-criminals_e87997e742b29c069b047756c4297217_66956901_1553697649.html", "image_url": "https://static.toiimg.com/thumb/msid-66956916,width-1070,height-580,imgsize-1222553,resizemode-6,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "language": null, "localpath": "/home/raj/news-please-repo//data/2019/03/27/timesofindia.indiatimes.com/city_allahabad_up-criminals_e87997e742b29c069b047756c4297217_66956901_1553697649.html", "title": "UP: Criminals take bank staff, customers hostage; loot Rs 8 lakh in Pratapgarh", "title_page": "UP: Criminals take bank staff, customers hostage; loot Rs 8 lakh in Pratapgarh | Allahabad News - Times of India\n\t\t\t", "title_rss": "NULL", "source_domain": "timesofindia.indiatimes.com", "text": "ALLAHABAD: A gang of eight armed robbers looted Rs 8 lakh from the Gramin Shakha of Bank of Baroda in Sahrua in Pratapgarh district after taking staff and customers hostage at gun point on Wednesday afternoon.The robbers also threatened the bank staff of dire consequences when they resisted to hand over the cash to the outlaws.Senior police officials, including SP (Pratapgarh), along with forces of three police stations and forensic experts rushed to the spot and carried out investigations.Additional DG (Prayagraj Zone) SN Sabat said, “A gang of armed and masked robbers came to the bank on three or four bikes and looted around Rs 8 lakh cash. He added that special police teams have been constituted to crack the case.Pratapgarh police, meanwhile, maintained the robbers had entered bank at around 2.37pm and escaped after looting the cash within 15 minutes.“Apart from the bank staff, as many as three or four customers were inside the bank when the robbers struck. However, no security guard was on duty. The robbers, who were carrying country-made pistols, damaged a computer monitor and one of them even entered into cash counter. The robbers had brought two bags to carry the cash and put entire money into these bags.The entire bank dacoity was recorded in the CCTV.“Cops are scanning the CCTV footage to compile clues regarding the bank dacoity” said a senior cop adding “police have already quizzed the bank staff to ascertain the identities of robbers and found that two of them were middle-aged” he added.“We have obtained some CCTV footage and sought the assistance of police from neighbouring districts. As many as three police teams have been constituted to crack the bank dacoity. A series of raids have been carried out in Vishwanathganj and adjoining areas,” he added.Eyewitnesses told police two of the robbers stationed themselves near the main gate, the others held the bank staff and customers captive at gun point. All of them had covered their faces expect eyes and were talking in local dialect. They threatened to open fire if anyone dared to raise alarm.The robbers were well acquainted with the layout of the bank and escaped unchallenged.", "url": "https://timesofindia.indiatimes.com/city/allahabad/up-criminals-take-bank-staff-customers-hostage-loot-rs-8-lakh-in-pratapgarh/articleshow/66956901.cms", "label": 1}