{"authors": [], "date_download": "2019-03-27 14:29:03", "date_modify": "2019-03-27 14:29:03", "date_publish": "2018-11-29 22:54:49", "description": "JAIPUR: An organisation named 'Sarva Brahmin Mahasabha' has registered its protest against the controversial statement given by Uttar Pradesh chief mi.", "filename": "city_jaipur_jaipur-sarva-br_6e9244e793fe0ede0f294dd693bac8d1_66871089_1553696943.html", "image_url": "https://static.toiimg.com/thumb/msid-66871130,width-1070,height-580,imgsize-1915880,resizemode-6,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "language": null, "localpath": "/home/raj/news-please-repo//data/2019/03/27/timesofindia.indiatimes.com/city_jaipur_jaipur-sarva-br_6e9244e793fe0ede0f294dd693bac8d1_66871089_1553696943.html", "title": "Jaipur: 'Sarva Brahmin Mahasabha' protests against UP CM's 'dalit' remark on Lord Hanuman", "title_page": "Jaipur: 'Sarva Brahmin Mahasabha' protests against UP CM's 'dalit' remark on Lord Hanuman | Jaipur News - Times of India\n\t\t\t", "title_rss": "NULL", "source_domain": "timesofindia.indiatimes.com", "text": "JAIPUR: An organisation named 'Sarva Brahmin Mahasabha' has registered its protest against the controversial statement given by Uttar Pradesh chief minister Yogi Adityanath . They said that all the Hanuman temples and important temples of Jaipur city will organise a special pooja to get Adityanath’s wisdom.“Adityanath is trying to divide Lord Hanuman into castes and have used derogatory language against the Rudra Avataar Hanuman. We will not tolerate this and will start a movement against him in all the Hanuman temples in the city until he apologizes,” said a member of the Organisation.Yogi Adityanath has sparked controversy two days back while addressing a public meeting in Malakheda, Alwar, he claimed that Lord Hanuman was a Dalit. “Hanuman was a Dalit, forest dweller and deprived. He worked tremendously to unite all the Indian community to fulfil the wishes of Lord Ram. I urge the people to vote for Ram and not Ravan this election” said Yogi.Yogi has been served a legal notice by the organisation to apologize within three days or face the consequences.At the same time Union Minister Rajpal Chaudhary, while visiting Alwar district for the election campaign said that there used to be no caste system at the time of Ram and Hanuman. “There was no caste system at the time of Hanuman but a ‘Varna’ system was in existence. Those days a Dalit was not deprived or exploited. Everyone born in that era belonged to Arya community” said Satpal Chaudhary.However, he refused to comment on the views presented by Yogi a few days back in Alwar district.Yogi’s comment has attracted sharp criticism from Congress which said that BJP is dividing public on Hindu and Muslim voters but now they are trying to divide gods as well.", "url": "https://timesofindia.indiatimes.com/city/jaipur/jaipur-sarva-brahmin-mahasabha-protests-against-up-cms-dalit-remark-on-lord-hanuman/articleshow/66871089.cms", "label": 1}