{"authors": ["Madan Kumar"], "date_download": "2019-03-27 14:41:08", "date_modify": "2019-03-27 14:41:08", "date_publish": "2015-08-23 23:19:38", "description": "RJD president Lalu Prasad on Sunday slammed PM Narendra Modi for his government’s failure to check the rising prices of onions being sold in Bihar at", "filename": "city_patna_Lalu-slams-PM-ov_3338d3806c400b181d228ebe36d9f6b0_48644942_1553697668.html", "image_url": "https://static.toiimg.com/photo/msid-47529300/47529300.jpg", "language": null, "localpath": "/home/raj/news-please-repo//data/2019/03/27/timesofindia.indiatimes.com/city_patna_Lalu-slams-PM-ov_3338d3806c400b181d228ebe36d9f6b0_48644942_1553697668.html", "title": "Lalu slams PM over rising onion prices", "title_page": "Lalu slams PM over rising onion prices | Patna News - Times of India\n\t\t\t", "title_rss": "NULL", "source_domain": "timesofindia.indiatimes.com", "text": "PATNA: RJD president Lalu Prasad on Sunday slammed PM Narendra Modi for his government’s failure to check the rising prices of onions being sold in Bihar at Rs 70-80/kg.Commenting on Modi’s 56-inch chest tag, Lalu also dared the PM to bring back black money stashed abroad if he had guts to do so. “You don’t have the capability to either check onion being sold on the black market or arrest the hoarders. But during 2014 Lok Sabha stumping, you made tall claims about bringing back black money from abroad. ‘Arre, kahan hai 56-inch waale’ (where is the person with 56-inch chest?), Lalu tweeted.Lalu posted a picture of August 2013 showing the then Delhi BJP chief Vijay Goel selling onions as symbolic protest against the then Delhi government’s failure in checking onion prices. He posted a caption also, “Double standards of Jumla Party”.Talking to reporters, the RJD chief recalled how Goel had launched a campaign in New Delhi against the then Congress government’s failure to check onion prices. “But, today, these BJP leaders are silent. Why are they not protesting today when the Modi-led NDA government has miserably failed in checking the onion prices?” Lalu asked.In another tweet, Lalu quipped, “Why the value of Indian rupee is depreciating as low as the value of PM.”", "url": "https://timesofindia.indiatimes.com/city/patna/Lalu-slams-PM-over-rising-onion-prices/articleshow/48644942.cms", "label": 1}