{"authors": [], "date_download": "2019-03-27 14:40:36", "date_modify": "2019-03-27 14:40:36", "date_publish": "2017-05-17 06:04:17", "description": "At least 100 postgraduate (PG) students of Ranchi University (RU) staged a day-long dharna to protest against the closure of the Central Library by 8p", "filename": "city_ranchi_demand-to-keep-_a00975d9f4659038d892e65a5e7a9241_58708842_1553697636.html", "image_url": "https://static.toiimg.com/thumb/msid-58708887,width-1070,height-580,imgsize-1407116,resizemode-6,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "language": null, "localpath": "/home/raj/news-please-repo//data/2019/03/27/timesofindia.indiatimes.com/city_ranchi_demand-to-keep-_a00975d9f4659038d892e65a5e7a9241_58708842_1553697636.html", "title": "Demand to keep Ranchi University library open 24 hrs", "title_page": "Demand to keep Ranchi University library open 24 hrs | Ranchi News - Times of India\n\t\t\t", "title_rss": "NULL", "source_domain": "timesofindia.indiatimes.com", "text": "RANCHI: At least 100 postgraduate (PG) students of Ranchi University (RU) staged a day-long dharna to protest against the closure of the Central Library by 8pm.While the library remained open from 8am to 8pm for six days in a week, students demanded that it remained open 24X7 to enable tribal students travelling from distant places to avail the facilities as per their convenience.\"Our tribal classmates cannot afford expensive text books and hence, they are dependent entirely on our varsity library. If libraries in a few known varsities like Jawaharlal Nehru University, Delhi University and Banaras Hindu University can remain open 24X7, why not libraries in our varsity\" asked Tanuj Khatri, president of RU postgraduate Chatra Sangh, under whose banner the dharna was held.Khatri added, \"Ahead of the student body's election in December last year, they had said in the manifesto that the library will be kept open for 24 hours on all seven days. However, our plea for the same went unheard later.\"Khatri vowed to continue with the stir till their demands were met. \"On February 8, the VC had assured us that the library will be open till late evening. Three months have passed but this proposal still remains on paper,\" he alleged.Over 90, 000 research journals, periodicals, Ph.d thesis are available in the library.", "url": "https://timesofindia.indiatimes.com/city/ranchi/demand-to-keep-ranchi-university-library-open-24-hrs/articleshow/58708842.cms", "label": 1}