{"authors": [], "date_download": "2019-03-27 14:40:58", "date_modify": "2019-03-27 14:40:58", "date_publish": "2015-12-06 01:23:08", "description": "More than 500 people gathered at the junction in front of Savitribai Phule Pune University on Saturday morning to protest against the proposed five-fo", "filename": "city_pune_Citizens-stand-by-2000-trees_articleshow_50059840_1553697658.html", "image_url": "https://static.toiimg.com/photo/msid-47529300/47529300.jpg", "language": null, "localpath": "/home/raj/news-please-repo//data/2019/03/27/timesofindia.indiatimes.com/city_pune_Citizens-stand-by-2000-trees_articleshow_50059840_1553697658.html", "title": "Citizens stand by 2,000 trees", "title_page": "Citizens stand by 2,000 trees | Pune News - Times of India\n\t\t\t", "title_rss": "NULL", "source_domain": "timesofindia.indiatimes.com", "text": "PUNE: More than 500 people gathered at the junction in front of Savitribai Phule Pune University on Saturday morning to protest against the proposed five-fold widening of Vaikunth Mehta Institute Road.The road is allegedly being widened to benefit occupants of a plush residential complex being built in Bhosalenagar.The protesters included small children, elderly people, local residents, environment lovers and members of non-governmental organisation Parisar, besides students and staff of the Vamnicom Institute.They held up posters and raised slogans against the plan to fell more than 2,000 trees, break off a chunk of the hill, and demolish structures such as a primary school and residential and staff quarters to make way for a wider road to connect Bhosalenagar Annexe to the university junction.'Lend a hand to save trees', 'If you cut a tree, you cut your life', 'We don't want a concrete jungle', 'Save the trees, stop the road' were some of the messages the banners sported. Most of the protesters chose to dress in green to highlight the importance of saving the city's tree cover.Madhavi Thombre, a resident of Ray Venue Society on the existing road, said, \"If the road is widened, our area will become a thoroughfare. We will be choked by all the air and noise pollution. The road widening will also eat into our cultural centre and seating alcoves that residents currently enjoy. What's worse is that there is a private motive involved. Pune is losing too much of its tree cover and this area is among the last few remaining green zones.\"Local resident Hema Chari fears that there won't be any safe space left for her five-year-old daughter to play. \"My daughter learnt to ride a bicycle on the existing road. She asked me where she will cycle now if traffic starts to pass through here,\" Chari said.Vamnicom Institute students, who stand to lose a part of their campus, held up banners highlighting the vital role trees play in the natural beautification of the institute premises. Student Laukik Kamte said, \"Pune is fast losing its rich green cover. A part of our campus and its trees will be cut to make way for the wider road. We are against this.\"Residents have already submitted several petitions against the proposal to the Pune Municipal Corporation (PMC). Petitioners, including activist Ranjit Gadgil from Parisar, hope the protest will make civic officials understand the reasons for the opposition. \"The entire project involves several departments of the PMC and so far, none of them have responded to any of our petitions and letters. We hope this protest will get them to wake up to the reality of what they are proposing and reconsider the project,\" Gadgil said.Residents have also created petitions on online platforms like Change.org and Facebook to gather as much support as possible for their mission.Anticipating the traffic mayhem such a proposal would entail, local traffic officials, too, supported the protesters' cause. One such officer, who did not wish to be named, said, \"Traffic is already chaotic at the junction. Adding a 100m-wide road leading to it would lead to a total mess. Bhosalenagar already has connectivity to Aundh Road and Range Hills Road, which, if developed properly, can benefit even residents and commuters of areas like Bopodi and Sangvi.\"", "url": "https://timesofindia.indiatimes.com/city/pune/Citizens-stand-by-2000-trees/articleshow/50059840.cms", "label": 1}