{"authors": ["Pushpa Narayan"], "date_download": "2019-03-27 14:35:05", "date_modify": "2019-03-27 14:35:05", "date_publish": "2017-10-20 12:45:28", "description": "Doctors in Tamil Nadu are prescribing piracy to protest against Vijay-starrer ‘Mersal’ which, they say, has portrayed them in poor light.", "filename": "city_chennai_tn-doctors-boy_837069e98c968108af368eda384a5f5c_61151055_1553697305.html", "image_url": "https://static.toiimg.com/thumb/msid-61151069,width-1070,height-580,imgsize-154438,resizemode-6,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "language": null, "localpath": "/home/raj/news-please-repo//data/2019/03/27/timesofindia.indiatimes.com/city_chennai_tn-doctors-boy_837069e98c968108af368eda384a5f5c_61151055_1553697305.html", "title": "TN doctors boycott Vijay-starrer Mersal, prescribe piracy", "title_page": "Mersal controversy: TN doctors boycott Vijay-starrer Mersal, prescribe piracy | Chennai News - Times of India\n\t\t\t       ", "title_rss": "NULL", "source_domain": "timesofindia.indiatimes.com", "text": "CHENNAI: Doctors in Tamil Nadu are prescribing piracy to protest against Vijay-starrer ‘Mersal’ which, they say, has portrayed them in poor light.Led by the state chapter of the Indian Medical Association, doctors have been sharing links of the movie on a pirated website through social media and urging fellow professions and paramedical staff to boycott the film or not to “pay” for its tickets in theatres.Terming it a “silent protest,” Indian Medical Association president Dr TN Ravishankar said, “We decided not to approach the media or court for relief. We will only be giving more publicity for the movie. Instead, if we spread the movie links on webpages, it will hit their collections. I hope they will realise then,” he said.In one of scenes in the movie, Vijay says people go to private hospitals because of government hospitals fail to offer good services. “He also say we use this profession only to make money,” Dr Ravishankar said.The association has sought support from local chapters of other organisations, including the Association of Physicians of India, Federation of Obstetrics and Gynaecology Society of India and Indian Radiologists and Imaging Association.The message reads: “Please forward to as many doctors and create a silent protest movement from the medical fraternity -- IMA Tamil Nadu.”“We have received that Mersal film has expressed opinion against medical community and doctors. It is unfortunate in our democratic set up to react and get a positive response. Hence we request you to boycott the film. Please make sure your relatives, friends, hospital employees boycott the film. This will go a long way in expressing our protest. Approaching the media and court will only result in publicity for the film which should not be done. (It is) an appeal from IMA Tamil Nadu to redeem our prestige and show our unity. Please see the movie on _____ and do not pay to see it. Hitting on the collection only will make them realise.” (SIC)(Name of the website has been hidden as per anti-piracy laws).Association of surgeons of India state executive member Dr Chandrasekar said doctors at the government hospitals had been working even on public holidays and services offered in the hospitals include state-of-the-art surgeries including heart and liver transplants.“I worked on Diwali and the day after attending to several burns patients. None of our patients pay us money. It’s unfair to say we are negligent or lazy,” he said.", "url": "https://timesofindia.indiatimes.com/city/chennai/tn-doctors-boycott-vijay-starrer-mersal-prescribe-piracy/articleshow/61151055.cms", "label": 1}