{"authors": ["Divya Chandrababu", "Sindhu Kannan"], "date_download": "2019-03-27 14:35:19", "date_modify": "2019-03-27 14:35:19", "date_publish": "2017-03-28 21:04:59", "description": "Marina Beach in Chennai was deserted on Tuesday evening after a #Marina2.0 hashtag started trending on social media forcing the city police to be up o", "filename": "city_chennai_chennai-police_0ef1c1ab59453029353f10cf43f6f469_57877738_1553697319.html", "image_url": "https://static.toiimg.com/thumb/msid-57877806,width-1070,height-580,imgsize-1147999,resizemode-6,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "language": null, "localpath": "/home/raj/news-please-repo//data/2019/03/27/timesofindia.indiatimes.com/city_chennai_chennai-police_0ef1c1ab59453029353f10cf43f6f469_57877738_1553697319.html", "title": "Chennai police thwart Marina2.0 protest move", "title_page": "Chennai police thwart Marina2.0 protest move | Chennai News - Times of India\n\t\t\t       ", "title_rss": "NULL", "source_domain": "timesofindia.indiatimes.com", "text": "CHENNAI: Marina Beach in Chennai was deserted on Tuesday evening after a #Marina2.0 hashtag started trending on social media forcing the city police to be up on their feet to thwart any sort of gathering given the experience of the mass students uprising for jallikattu in January.A large posse of policemen were deployed on the Kamarajar Salai after messages about a protest spread on Twitter, Facebook and WhatsApp groups calling out to youngsters to congregate once again on the beach on Wednesday morning, this time in support of farmers.A few of them even assembled on the beach on Tuesday evening, only to be chased away by cops who called this a rumour.The police picked up four people from the beach for questioning. They have been identified as Rajapandian, 31, of Tiruvallur, Samuthradevi, 35, of Alandur, Manikandan, 28 of Trichy and Leo Nelson, 32 of Chromepet.Rajapandian and Manikandan told the police that they had come to Marina Beach to participate in the protest, while the other two said that they were usual visitors to the beach. Police let them go after an inquiry. Hundreds of vendors had also kept away from Marina Beach.Deputy commissioner of Mylapore V Balakrishnan told TOI that such rumours affected the normal life of the public visiting the beach and those running shops. “Those spreading such unnecessary rumours will face legal action,” he said.Debt-ridden and drought-hit Tamil Nadu farmers have been protesting at Jantar Mantar in New Delhi since mid-March, in different ways, to draw attention to their plight.", "url": "https://timesofindia.indiatimes.com/city/chennai/chennai-police-thwart-marina2-0-protest-move/articleshow/57877738.cms", "label": 1}