{"authors": [], "date_download": "2019-03-27 14:40:48", "date_modify": "2019-03-27 14:40:48", "date_publish": "2015-03-17 05:18:32", "description": "The Dimapur lynching incident, which has been condemned globally, has brought shame to the state, said governor P B Acharya", "filename": "city_guwahati_Guv-Dimapur-l_7a16d641a1c9880a0b9037d1a0656790_46587697_1553697648.html", "image_url": "https://static.toiimg.com/photo/msid-47529300/47529300.jpg", "language": null, "localpath": "/home/raj/news-please-repo//data/2019/03/27/timesofindia.indiatimes.com/city_guwahati_Guv-Dimapur-l_7a16d641a1c9880a0b9037d1a0656790_46587697_1553697648.html", "title": "Guv: Dimapur lynching brought shame to state", "title_page": "Guv: Dimapur lynching brought shame to state | Guwahati News - Times of India\n\t\t\t", "title_rss": "NULL", "source_domain": "timesofindia.indiatimes.com", "text": "KOHIMA: The Dimapur lynching incident, which has been condemned globally, has brought shame to the state, said governor P B Acharya.Speaking to the media on Monday at his office chamber, Acharya said the incident has given a bad name to the state.However, he clarified that the question of religion should not be brought into the incident as a criminal has no religion and people should not take law into their own hands. He said a criminal or accused, when found guilty, will be punished according to the law of the land.On March 5, a 10,000-strong mob, mostly students, stormed the Dimapur jail and dragged out rape accused Syed Farid Khan , paraded him naked to the city tower before lynching him. Khan was arrested on February 24 on charges of raping a Naga girl.Khan was a resident of Assam’s Karimganj district. There was widespread anger and protests against Khan’s lynching with many political parties in Assam demanding that the Nagaland government reveal the truth behind the incident.The governor said Assam, Tripura and Nagaland are facing the problem of influx of illegal immigrants and the governments and people of these states should be more alert while dealing with the situation.The governor also urged people to cooperate with the investigating agency in bringing out the truth. He said he would meet the Muslim Council Dimapur on Wednesday.In a separate development, a two-day medical camp will be conducted on March 25 and 26 at the Naga Hospital Kohima where six top doctors from Mumbai will conduct a health camp, the governor said.", "url": "https://timesofindia.indiatimes.com/city/guwahati/Guv-Dimapur-lynching-brought-shame-to-state/articleshow/46587697.cms", "label": 1}