{"authors": ["Anurag Kotoky"], "date_download": "2019-03-27 14:34:54", "date_modify": "2019-03-27 14:34:54", "date_publish": "2016-09-14 00:00:00", "description": "IT firms closed offices in Bengaluru on Tuesday, after protests in Karnataka against the sharing of river water with Tamil Nadu turned violent", "filename": "Companies_7AAJYRppXV0hKhwJqg0T6J_Infosys-Wipro-shut-Bengaluru-offices-after-violence-over-Ca_1553697294.html", "image_url": "https://images.livemint.com/rf/Image-621x414/LiveMint/Period2/2016/09/14/Photos/Processed/Bengaluruprotest-k3pB--621x414@LiveMint.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/livemint.com/Companies_7AAJYRppXV0hKhwJqg0T6J_Infosys-Wipro-shut-Bengaluru-offices-after-violence-over-Ca_1553697294.html", "title": "Cauvery dispute: Infosys, TCS, Wipro shut offices after violence", "title_page": "Cauvery dispute: Infosys, TCS, Wipro shut offices after violence", "title_rss": "NULL", "source_domain": "livemint.com", "text": "New Delhi: Infosys Ltd., Tata Consultancy Services Ltd. and Wipro Ltd. closed offices in Bengaluru on Tuesday, after protests in Karnataka against the sharing of river water with neighbouring Tamil Nadu turned violent.\nThe protests intensified on Monday after the country’s Supreme Court court asked Karnataka to release 12,000 cubic feet per second of Cauvery river water everyday to Tamil Nadu until 20 September. Water sharing is a politically sensitive topic for Indian farmers, who predominantly depend on monsoon rains for crop cultivation.\n“This dispute can only be solved within the legal ambit,\" Prime Minister Narendra Modi said in a statement. “I am personally pained at the developments.\"\nAlso Read: Cauvery dispute: Karnataka bows to SC order, will release water to Tamil Nadu\nA curfew was imposed in 16 areas of Bengaluru city until 14 September after mobs vandalized vehicles and protested the court order, NDTV reported Tuesday, citing police. No new incidents have been reported, Bengaluru police said in a Twitter post.\nWipro employees will work on 17 September to make up for the holiday on Tuesday, the company said in a statement.", "url": "https://www.livemint.com/Companies/7AAJYRppXV0hKhwJqg0T6J/Infosys-Wipro-shut-Bengaluru-offices-after-violence-over-Ca.html", "label": 1}