{"authors": ["New Delhi", "Nov", "Dhns"], "date_download": "2019-03-27 14:35:13", "date_modify": "2019-03-27 14:35:13", "date_publish": "2015-11-24 08:16:46", "description": "Scores of teachers and parents protested outside Delhi Vidhan Sabha against the new amendments in Delhi School Education Act, 1973 passed by the cabinet.", "filename": "content_513676_teachers-parents-agitate-against-bills_1553697313.html", "image_url": "https://www.deccanherald.com/sites/dh/files/DH-favicon.png", "language": null, "localpath": "/home/raj/news-please-repo//data/2019/03/27/deccanherald.com/content_513676_teachers-parents-agitate-against-bills_1553697313.html", "title": "Teachers, parents agitate against bills", "title_page": "Teachers, parents agitate against bills | Deccan Herald", "title_rss": "NULL", "source_domain": "deccanherald.com", "text": "Scores of teachers and parents protested outside Delhi Vidhan Sabha against the new amendments in Delhi School Education Act, 1973 passed by the cabinet.\nThe protesters, under the banner of All India Parents Association (AIPA), raised concerns over two bills introduced by the Delhi government in the Delhi Assembly. These include deleting Section 10(1) which ensures equal salaries for private and government teachers and enactment of Delhi School (Verification of Accounts and Refund of Excess Fee) Bill, 2015.\n“Section 10 mandates that pay and other benefits of the employees of a recognised private school shall not be less than those paid to their counterparts working in government schools.\nThe proposed amendment takes away the right to pay parity of the teaching and non-teaching staff of recognised private schools guaranteed to them earlier. Also, instead of controlling arbitrary fee hike by unaided private schools, gives absolute powers to such schools to loot the hapless parents/students, in whatever way they like,” said Ashok Agarwal, National President, AIPA.\n“42 years old provision that was achieved by the workers after a long struggle has been taken away by the AAP Govt. People have voted Kejriwal’s party for protection of the workers rights and not to snatch them and that too in the manner it is being done,” he said, adding, “apparently, this has been done at the behest of the private school managements lobby to benefit them.”\nThe teachers community has also expressed disappointment over the move.\n“The government expects the teachers to produce model citizens. Can the private school tecahers do this if they are left to be exploited and made second class teachers.\nIf government feels the teachers are being paid more than what they deserve, then let it reduce the salary of government teachers too so that there is no heart burn in any section. Moreover, the standard of education will also come down as a lot of teachers will resign after this,” said Roohi Rahman, a teacher in Hamdard Public School.\nThe protesters also blamed the government for being unable to check the “menace of exorbitant fee hike” every year by unaided private schools and said that the bill on verification of accounts and refund of excess fee fails to cater to the “mischief of unjustified hike”.\n“The bill presupposes that fee-hike by the private schools is per-se legal and valid, unless the same is challenged through a complaint and is set aside by the committee. If we look at the existing acts on private unaided school-fee regulation, particularly the Tamil Nadu (Regulation of Collection of Fee) Act, 2009, there is a stipulation of prior approval by the committee before fee-hike and the said hiked fee, once approved, cannot be further hiked upto three years,” Agarwal added.\nWhile here, this bill has put the entire burden upon the complainant. It is expected that the Delhi’s Act should be advancement over Tamil Nadu Act and should surpass the benchmark set by Tamil Nadu, but this bill falls way short of even what Tamil Nadu has already achieved,” he said.", "url": "https://www.deccanherald.com/content/513676/teachers-parents-agitate-against-bills.html", "label": 1}