{"authors": ["Dh News Service", "New Delhi"], "date_download": "2019-03-27 14:41:36", "date_modify": "2019-03-27 14:41:36", "date_publish": "2018-03-20 00:00:00", "description": "Rajya Sabha chairman and Vice President M Venkaiah Naidu cancelled...", "filename": "content_665550_miffed-over-frequent-disruptions-rs_1553697696.html", "image_url": "https://www.deccanherald.com/sites/dh/files/article_images/2018/03/20/665550.jpg", "language": null, "localpath": "/home/raj/news-please-repo//data/2019/03/27/deccanherald.com/content_665550_miffed-over-frequent-disruptions-rs_1553697696.html", "title": "Miffed over frequent disruptions in RS , Naidu cancels dinner for MPs", "title_page": "Miffed over frequent disruptions in RS , Naidu cancels dinner for MPs | Deccan Herald", "title_rss": "NULL", "source_domain": "deccanherald.com", "text": "Rajya Sabha chairman and Vice President M Venkaiah Naidu cancelled a dinner he was set to host for members of the Upper House on March 21, in view of the ongoing impasse in Parliament.\nNaidu was anguished that protesting MPs from parties belonging to Andhra Pradesh and Tamil Nadu disrupted the proceedings of the Rajya Sabha soon after External Affairs Minister Sushma Swaraj finished her statement on the 39 Indians killed in Iraq.\nShe was followed by Leader of Opposition Ghulam Nabi Azad, who made brief remarks on the issue.\nSoon after that, leaders from the TDP, AIADMK and the DMK stormed into the Well of the House and shouted slogans for special status to Andhra and constitution of a Cauvery Water Management Board, respectively.\nAzad blamed the government for the impasse, saying that 10 Opposition parties including the Congress, TMC, SP, BSP, DMK, NCP, CPI and the CPM met on Tuesday morning and agreed that the House should function.\nAgitated by the sloganeering, Naidu lamented the insensitivity of the parliamentarians and asked, \"What is wrong with this House\".\nAt a meeting with the floor leaders of various parties in his chamber on Tuesday, the chairman conveyed anguish over the ongoing stalemate in the House and informed them of his decision to cancel the dinner.\nNaidu said it would not be appropriate to go ahead with the dinner with the House not functioning for over two weeks.", "url": "https://www.deccanherald.com/content/665550/miffed-over-frequent-disruptions-rs.html", "label": 1}