{"authors": [], "date_download": "2019-03-27 14:18:20", "date_modify": "2019-03-27 14:18:20", "date_publish": "2016-08-18 00:00:00", "description": "With monsoon playing havoc in the Cauvery delta, fears of a distress year has gripped Karnataka. The state which has recorded six per cent less rainfall and a storage deficit of 54 per cent across ...", "filename": "content_archival_news_india_karnataka-struggles-to-meet-water-needs-as-cauvery-delta-in-distress_1553696300.html", "image_url": "http://www.theweek.in/content/dam/week/news/india/2016/August/Image/mettur-dam-pti.jpg", "language": null, "localpath": "/home/raj/news-please-repo//data/2019/03/27/theweek.in/content_archival_news_india_karnataka-struggles-to-meet-water-needs-as-cauvery-delta-in-distress_1553696300.html", "title": "Cauvery delta in distress", "title_page": "Cauvery delta in distress ", "title_rss": "NULL", "source_domain": "theweek.in", "text": "With monsoon playing havoc in the Cauvery delta, fears of a distress year has gripped Karnataka. The state which has recorded six per cent less rainfall and a storage deficit of 54 per cent across its four reservoirs - KR Sagar, Hemavathy, Harangi and Kabini, wants the neighboring Tamil Nadu to share the distress.\nAccording to sources, the state will convey the distress situation to the central water resources ministry seeking to apply the distress sharing formula this year. Given the current situation, the state will not be able to release the stipulated quota of 31 tmc to Tamil Nadu in the first quarter of the water year (June to August), as per the final verdict of the Cauvery Water Dispute Tribunal.\nMeanwhile, the Karnataka government has appealed to its farmers to desist from sowing, water-intensive crops like paddy and sugarcane, this Kharif season. Rationing of water for irrigation and drinking water to Bengaluru, Mysuru and Mandya are proving to be a big challenge, with poor rainfall in the catchment areas.\nEnergy minister D.K.Shivakumar, said, \"We had planned not to release water to the irrigation canals. But as the farmers have already started sowing, we are compelled to release water to the canals till August 30. The water release to the canals will be suspended from August 31 and September 10, when the storage level of reservoirs will be assessed to decide on further releases to the canals. We need 40 tmc of water for irrigation purpose over the next 80 days. But we have only 12.5 tmc. Moreover, Bengaluru alone needs 15 tmc drinking water.\"\nThe farmers in Karnataka are now protesting against the daily release of 4,000 cuses of water to Tamil Nadu, stating that they cannot afford to skip sowing this season, as the state has already suffered two consecutive droughts.\nKarnataka has an obligation to deliver 192 tmc to Tamil Nadu in a normal water year (beginning June). But the discord between the two riparian states arises over water sharing during the distress (deficit rainfall) years as Karnataka cannot fulfill the monthly quota or even the total stipulated quota during a drought year.", "url": "https://www.theweek.in/content/archival/news/india/karnataka-struggles-to-meet-water-needs-as-cauvery-delta-in-distress.html", "label": 1}