{"authors": ["Chennai", "Sep", "Dhns"], "date_download": "2019-03-27 14:18:30", "date_modify": "2019-03-27 14:18:30", "date_publish": "2019-03-17 00:00:00", "description": "Political parties and trade organisations in Tamil Nadu will go ahead with the general strike on Friday....", "filename": "content_570633_tn-gears-up-cauvery-bandh_1553696310.html", "image_url": "https://www.deccanherald.com/sites/dh/files/article_images/2019/03/17/570633-1552832402.jpg", "language": null, "localpath": "/home/raj/news-please-repo//data/2019/03/27/deccanherald.com/content_570633_tn-gears-up-cauvery-bandh_1553696310.html", "title": "TN gears up for Cauvery bandh today; youth sets self on fire", "title_page": "TN gears up for Cauvery bandh today; youth sets self on fire | Deccan Herald", "title_rss": "NULL", "source_domain": "deccanherald.com", "text": "Political parties and trade organisations in Tamil Nadu will go ahead with the general strike on Friday to condemn the attacks on Tamilians in Karnataka over the Cauvery water release issue.\nThe call for strike has got support from various quarters amid the Supreme Court rapping the Tamil Nadu and Karnataka governments for permitting agitations to challenge a judicial order passed by it.\nThough the ruling AIADMK government is not supporting the strike, almost all opposition parties, including the DMK, Congress, Vijayakanth-led DMDK, Tamil Maanila Congress and the PMK have extended support.\nAutos and omni bus services are expected to stay off the roads. Some private schools and education institutions have declared holiday on Friday.\nHowever, the Tamil Nadu government made it clear that all the schools will function normally.\nThe state administration also said that the government bus services will be operated by giving full security.\nPetroleum Dealers Association also said that more than 4,500 petrol and diesel outlets will be shut. However, company-owned petrol bunks are expected to operate.\nWhat is shut\nIn addition, the Federation of Tamil Nadu Traders Association, which is also taking part in the bandh, announced that nearly 20 lakh shops will be closed.\nHowever, medical shop owners said they would close shutters only in the afternoon.\nTamil Nadu Wholesale Traders secretary Soundararajan said the main vegetable markets across the state will also be closed to show support to the agitation.\nThe state government has taken steps to sell vegetables in all its cooperative markets at affordable prices to the people.\nDMDK’s Vijayakanth will launch a hunger strike with party cadres in Chennai while the DMK and the Congress have organised ‘democratic rallies’ across the state to condemn the attacks on Tamils in the neighbouring state.\nBoth the CPI and the CPM, which also declared to back the agitation, will join the silent rallies organised by delta farmers in Thanjavur, Thiruvarur, Trichy, Nagapattinam and some parts of Salem.\nMeanwhile, about one lakh police personnel will be deployed across all the districts from Thursday night in view of the bandh call.\nExtra security to state establishments\nThough Tamil Nadu remained largely peaceful on Thursday except for sporadic protests, tension prevailed in the state over the Cauvery issue and normal life was thrown out of gear in border areas, DHNS reports from Chennai.\nMost of the Tamil Nadu State Transport Corporation (TNSTC) buses to Karnataka from Chennai and other districts were cancelled, putting passengers in great trouble. The Karnataka state buses were not operated.\nTrucks, vans and other private vehicles bearing Tamil Nadu license plates were also stranded in the border area. Hosur was the worst hit since people on both states could not reach their destinations, while a similar situation prevailed in Sathyamangalam in Erode district.\nMeanwhile, sporadic protests and rallies were held across the state against the recent attack on Tamilians in Karnataka. A youth who attempted self immolation at a rally in Chennai by Naam Tamizhar Katchi was admitted to hospital and his condition remaineds critical.\nNearly 20 cadres of a pro-Tamil group were arrested in Coimbatore when they tried to stage a protest demonstration near a Karnataka Bank branch. Though the state remained largely peaceful, extra security was provided to Karnataka-owned offices and banks.\nAdditional police security was also provided near the Udupi chain of restaurants situated in various towns.", "url": "https://www.deccanherald.com/content/570633/tn-gears-up-cauvery-bandh.html", "label": 1}