{"authors": [], "date_download": "2019-03-27 14:18:21", "date_modify": "2019-03-27 14:18:21", "date_publish": "2018-07-20 03:37:56", "description": null, "filename": "dairy__1553696301.html", "image_url": "http://www.indiancooperative.com/wp-content/uploads/2018/07/latest-2-3.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/indiancooperative.com/dairy__1553696301.html", "title": "Maha crisis: Govt offers soft loan to dairy co-operatives", "title_page": "Maha crisis: Govt offers soft loan to dairy co-operatives – Indian Cooperative", "title_rss": "NULL", "source_domain": "indiancooperative.com", "text": "With an aim to expand the White Revolution further as well as to contain the frustration of farmers in Maharashtra, the govt of India has initiated several steps including creation of a corpus of Rs 300 crore with the NDDB for providing soft loans to dairy cooperatives, asserts a govt release.\nKeeping the ongoing milk crisis in Maharashtra in mind the NDA govt has been requesting various states to take necessary steps to encourage supply of milk and milk products through schemes like Mid-day meal and anganwadi for nutritional supports to children.\nFarmers in Maharashtra are protesting against the rates offered to them by the cooperative sector of the state in the wake of crash in international prices of skimmed milk powder.\nCow’s milk is offered to the farmers at around Rs 16-19 per litre by Maharashtra’s private dairies. A slightly higher rate of 18.5 to Rs 23 per litre is offered by the Co-operative sector, say media reports.\nMaharashtra ranks 7 in milk production in India. Maharashtra which boasts of a strong cooperative movement in general is weak when it comes to dairy cooperatives. While Gujarat offers Gujarat Rs 29.5 per litre it is abysmally low in case of Maharashtra.\n“To spur domestic demand, milk distribution programme has also been started in Karnataka, Bihar and Rajasthan through anganwadis. In Rajasthan milk and dairy products are distributed through the mid-day meal scheme,” it says.\nEarlier, milk powder import duty was increased from 30% to 40%. DGFT has been requested to increase export incentive for milk and milk products and Casein from 10% to 20%.\nIt bears recall that India occupies the top spot in milk production in the world and contributes 19% to world milk production. Milk production has grown by 23.69% in 2014-18.", "url": "http://www.indiancooperative.com/dairy/maha-crisis-govt-offers-soft-loan-to-dairy-co-operatives/", "label": 1}