{"authors": ["Subrata Panda", "Please Enter Your Name Here"], "date_download": "2019-03-27 14:25:44", "date_modify": "2019-03-27 14:25:44", "date_publish": "2018-05-08 13:09:22", "description": "GST Council said it will help farmers, several states opposed the proposal that has been called discriminatory by experts.", "filename": "economy_sugar-cess-goes-aga_57893eba370aa4853768e845795d6da8__1553696744.html", "image_url": "https://cdn-live.theprint.in/wp-content/uploads/2018/05/h2018031041947-2-e1525784903272.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/theprint.in/economy_sugar-cess-goes-aga_57893eba370aa4853768e845795d6da8__1553696744.html", "title": "Sugar cess goes against idea of tax reforms through GST, say experts", "title_page": "Sugar cess goes against idea of tax reforms through GST, say experts", "title_rss": "NULL", "source_domain": "theprint.in", "text": "Text Size: A- A+\n99 Shares\nGST Council said it will help farmers, several states opposed the proposal that has been called discriminatory by experts.\nNew Delhi: A proposal to bring back the sugar cess, which was abolished following the implementation of Goods and Services Tax (GST) in July last year, has been opposed by several states as well as experts, who call it a move that will defeat the very idea of ‘one nation, one tax’.\nAt a recent meeting, the GST Council, it was reported, was contemplating reimposing the sugar cess, saying it would help sugarcane farmers. The council argued that the cess, if introduced, will help the Centre in raising Rs 6,700 crore for the distressed sugarcane farmers because the cost of production of sugarcane has exceeded the market price.\n“When we are talking about tax reforms, we cannot have cess on sugar. If the government wants to help the sugarcane producers, then they should find another way,” said Dr Jaimini Bhagwati, RBI chair professor, ICRIER, and a former joint secretary in the ministry of finance.\n“Don’t do it by putting a cess because there are states which do not produce sugarcane and to that extent they are being discriminated against,” Bhagwati said, speaking on the sidelines of the release of UN Economic and Social Survey of Asia and the Pacific 2018, in Delhi Tuesday.\nHe argued that a cess is collected by the Centre and it’s the central government that will take a call on which states will get the funds generated from it.\nThis move, if implemented, would benefit farmers from Uttar Pradesh, Maharashtra and Karnataka. However, states such as Tamil Nadu, Kerala, West Bengal and Andhra Pradesh protested against this proposal, forcing the GST council to order a review by a committee headed by Assam finance minister Himanta Biswa Sarma.\n“In any case, cesses go against the whole philosophy of GST,” Bhagwati said.\nBroadening the tax base\nBhagwati stressed on broadening the tax base to mobilise finances in order to carry out developmental activities in the country as it has a revenue deficit of Rs 4.39 lakh crore in FY18 (revised estimates).\nThis, he suggested, cannot be achieved by taxing the people more but by improving the tax compliance, which will help the GDP move a couple of percentage points higher over a period of time.\nAccording to Rupa Chanda, head of the Economic and Social Commission for Asia and Pacific for South West Asia, the scope for increasing the tax base lies in having a relook on the various loopholes, exemptions and incentives which do not serve any purpose.\n“When we say broaden the tax base, it doesn’t necessarily mean bringing more people under the ambit of taxes but rationalising the tax structure,” Chanda added.\nBanking and fiscal problems\nOn India’s fiscal deficit, Bhagwati said in the past four-five years the situation has turned a little adverse because fiscal deficits of state governments as a whole have been on the rise. So, the states need to rein in some of their exuberance in the way they have incurred expenditure.\nThe growth in credit off-take (loans given by banks) has been slow but steady after a period of relative slump, said Bhagwati.\nApart from this, the net non-performing assets — which caused a stress in the Indian banking sector — is not more than Rs 4 lakh crore, he said. “Our current problem in the banking sector is not as worse as it was in 1997-98 since the net NPAs as a percentage of GDP is lower than what it was in 1997-98,” Bhagwati said, ruling out any crisis in the Indian economy at present.\nCheck out My543, our comprehensive report card of all Lok Sabha MPs.\n99 Shares\nShow Full Article", "url": "https://theprint.in/economy/sugar-cess-goes-against-idea-of-tax-reforms-through-gst-say-experts/56289/", "label": 1}