{"authors": [], "date_download": "2019-03-27 14:40:36", "date_modify": "2019-03-27 14:40:36", "date_publish": "2016-04-19 00:00:00", "description": "The Gujarat high court’s ruling that every member of a rioting mob is guilty could reduce violence", "filename": "editorials_no-longer-just-part-of-the-crowd_story-ERZxkW0MjGDL3yuOxZzZLM_1553697636.html", "image_url": "https://www.hindustantimes.com/rf/image_size_640x362/HT/p2/2016/04/19/Pictures/jhajjar_87159d0a-0632-11e6-afce-cd590874c67e.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/hindustantimes.com/editorials_no-longer-just-part-of-the-crowd_story-ERZxkW0MjGDL3yuOxZzZLM_1553697636.html", "title": "Gujarat HC ruling on rioting mob: No longer just part of the crowd", "title_page": "Gujarat HC ruling on rioting mob: No longer just part of the crowd\n | editorials | Hindustan Times", "title_rss": "NULL", "source_domain": "hindustantimes.com", "text": "The dictum that there is strength in numbers has been used to chilling effect by mobs in India. Add to this anonymity and hardly anyone has to pay for the violence unleashed by mobs whether it be in communal riots or caste and class wars.\nWe have seen numerous riots in which frenzied mobs have destroyed public property and visited murder and mayhem in the name of religion, caste or just revenge on people. Yet, thanks to the facelessness of the mob, it is difficult for the law enforcement agencies to pinpoint blame on individuals or indeed those who incited the mob in the first place.\nIn this context, the Gujarat high court’s ruling that anyone in a mob is guilty of the misdemeanours of the gathering holds out some hope. The ruling was in a 13-year-old case of mob dacoity in the Shah-e-Alam area of Ahmedabad where innocent commuters were looted and harmed. We have had some high profile arrests of those in mobs, notably Jagdish Tytler in the Sikh riots of 1984 and Maya Kodnani in the fateful Gujarat riots of 2002. But there have been numerous instances of those in power having encouraged mobs with their statements — the late Balasaheb Thackeray would often say that he was not responsible for the conduct of his ‘boys’ if anyone tried to besmirch the fair name of the Shiv Sena. Rajiv Gandhi, unwittingly or wittingly, seemed to justify mob violence when he talked of the earth shaking when a great fell, a reference to his mother Indira Gandhi’s assassination.\nThe ruling will, at the very least, lead to people pausing to think of the consequences of being part of a murderous mob. No doubt, this ruling could mean that innocent people could also suffer but in such cases, making exceptions would be lead to people misusing the provision to get off the hook.\nThe court, has however, reduced punishment for those found guilty of mob violence from life imprisonment to a minimum of 10 years in jail. While the ruling may reduce the fervour of miscreants to take to the streets in the belief that they can get away with it, it would also be the time to focus on restitution for the properties destroyed during mob violence.\nIn the Haryana Jat agitation recently, crores of rupees worth of private and public property was vandalised and no one seems to be accountable. In many instances, the police have to go by reports of eyewitnesses to determine guilt in mob violence. This could lead to miscarriages of justice. The court ruling is hardly ideal but it will certainly lessen the enthusiasm among people to be part of the scene in mob gatherings, irrespective of their role in its actions.\nFirst Published: Apr 19, 2016 19:24 IST", "url": "https://www.hindustantimes.com/editorials/no-longer-just-part-of-the-crowd/story-ERZxkW0MjGDL3yuOxZzZLM.html", "label": 1}