{"authors": [], "date_download": "2019-03-27 14:35:10", "date_modify": "2019-03-27 14:35:10", "date_publish": "2017-08-01 18:46:47", "description": "Puthiya Tamizhakam protests against Tamil Nadu government seeking exemption to the state from NEET.", "filename": "education_neet-exemption-no_2849856dc30a440ef28ff4df5b2abb69_story-ISaFwAw8OcaJbo70IEEoeJ_1553697310.html", "image_url": "https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2017/08/01/Pictures/neet-medical-exam_442b5ef8-76bb-11e7-930d-20ef51ded0a4.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/hindustantimes.com/education_neet-exemption-no_2849856dc30a440ef28ff4df5b2abb69_story-ISaFwAw8OcaJbo70IEEoeJ_1553697310.html", "title": "NEET exemption not required for Tamil Nadu: Krishnasamy", "title_page": "NEET exemption not required for Tamil Nadu: Krishnasamy | education | higher studies | Hindustan Times", "title_rss": "NULL", "source_domain": "hindustantimes.com", "text": "Protesting against Tamil Nadu government seeking exemption to the state from NEET, Puthiya Tamizhakam on Tuesday staged a demonstration in Coimbatore, demanding that medical aspirants should be selected through the test.\nLed by its founder-president, Dr Krishnasamy, the agitators raised slogans against the Government, saying that students should be selected to the course through NEET score, which was an All India test.\nThe PT leader said state board students from rural areas would not face any setback, as made out by political parties but emerge successful in the test and get admissions in institutions in Tamil Nadu, which has adequate numbers.\nIt was not necessary for state ministers and the chief minister to go to Delhi frequently seeking exemption from NEET, he said.\nSome 10 state board students who were successful in NEET and joined the demonstration, said they wanted the NEET score to be considered for admission to the medical courses.\nSimilar demonstrations were held at all district headquarters of the State, Krishnasamy said.\nThe AIADMK, DMK and other parties in the state have been opposing NEET, saying state board students, especially from rural areas, would find it difficult to compete with CBSE students.\nFirst Published: Aug 01, 2017 18:46 IST", "url": "https://www.hindustantimes.com/education/neet-exemption-not-required-for-tamil-nadu-krishnasamy/story-ISaFwAw8OcaJbo70IEEoeJ.html", "label": 1}