{"authors": ["India.Com News Desk"], "date_download": "2019-03-27 14:35:04", "date_modify": "2019-03-27 14:35:04", "date_publish": "2018-02-07 09:46:29", "description": "Chennai, February 7: Opposition DMK leader stirred a controversy by making an outrageous promise to the students protesting against the national medical exam. In a bid to outdo the ruling AIADMK, form - NEET 2018: Would've Allowed You to Cheat, DMK Leader Tells Medical Aspirants", "filename": "education__1553697304.html", "image_url": "https://www.india.com/wp-content/uploads/2017/10/exam12.jpg66662.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/india.com/education__1553697304.html", "title": "NEET 2018: Would've Allowed You to Cheat, DMK Leader Tells Medical Aspirants", "title_page": "NEET 2018: Would've Allowed You to Cheat, DMK Leader Tells Medical Aspirants | Exams & Results News, India News, India.com", "title_rss": "NULL", "source_domain": "india.com", "text": "Chennai, February 7: Opposition DMK leader stirred a controversy by making an outrageous promise to the students protesting against the national medical exam. In a bid to outdo the ruling AIADMK, former transport minister KN Nehru told a group of students that the DMK would have allowed students to cheat if it had not been able to get them an examination from the medical entrance exam.\n“For how long will Tamilians remain honest?” DMK leader from Tiruchirappalli West said, NDTV reported.\n“You allow copying in Bihar, MP (Madhya Pradesh) and it is all done openly. Why?” Nehru asked.\nThe Central Board of Secondary Education conducts the National Eligibility Entrance Test, or NEET, examination. This year, the examination would be conductd on 7 May and there is no change in the syllabus.\nStudents in Tamil Nadu have been protesting against it as they believe it places students from the state board at a disadvantage. The southern state had abolished entrance exams nearly a decade earlier and medical admissions had been offered on the basis of Class 12 marks.", "url": "https://www.india.com/education/neet-2018-wouldve-allowed-you-to-cheat-dmk-leader-tells-medical-aspirants-2881794/", "label": 1}