{"authors": [], "date_download": "2019-03-27 14:40:35", "date_modify": "2019-03-27 14:40:35", "date_publish": "2019-02-12 10:35:00", "description": "The Shiv Sena said it may have ideological differences with Chandrababu Naidu but if the chief minister of a state is sitting on dharna for his state, the party will support the cause.", "filename": "elections_lok-sabha-2019_story_chandrababu-naidu-gets-a-boost-as-bjp-ally-shiv-sena-joins-protest-against-modi-govt-1453903-2019-02-12_1553697635.html", "image_url": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/201902/Sanjay_taut_ANi-647x363.jpeg?4gPYOqbLcKJH346XNh0G_n_4J6Ka9XNs", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/indiatoday.in/elections_lok-sabha-2019_story_chandrababu-naidu-gets-a-boost-as-bjp-ally-shiv-sena-joins-protest-against-modi-govt-1453903-2019-02-12_1553697635.html", "title": "Chandrababu Naidu gets a boost as BJP ally Shiv Sena joins protest against Modi govt", "title_page": "Chandrababu Naidu gets a boost as BJP ally Shiv Sena joins protest against Modi govt - Elections News", "title_rss": "NULL", "source_domain": "indiatoday.in", "text": "Shiv Sena MP Sanjay Raut (centre) at the protest organised by Andhra Pradesh Chief Minister Chandrababu Naidu (not in picture) in New Delhi. (Photo: ANI)\nShiv Sena, the disgruntled ally of BJP, on Monday joined the day-long protest called by Andhra Pradesh Chief Minister N Chandrababu Naidu against the Centre in Delhi over the denial of special status to Andhra Pradesh.\nWith Shiv Sena leader Sanjay Raut sharing dais with the opposition leaders, including Madhya Pradesh Chief Minister Kamal Nath and senior Congress leader Digvijaya Singh, the event had political overtones ahead of the upcoming Lok Sabha polls.\n\"We are with N Chandrababu Naidu for the demand he is pressing for his state. Every state has its own role to play and every state has its own demands. We may have ideological differences but if the chief minister of a state is sitting on 'dharna' for his state, we must support the cause,\" said Raut.\n\"My leader Uddhav Thackeray told me to go and support N Chandrababu Naidu. We will think about politics later on,\" said Raut.\nNaidu said that Shiv Sena is not happy with Prime Minister Narendra Modi and thanked Shiv Sena for its support. \"Uddhav Thackeray is my best friend. Even Bal Thackeray was very affectionate towards me. I really appreciate Shiv Sena chief for extending his cooperation,\" said Naidu.\nALSO READ | For his day-long protest, Chandrababu Naidu spends Rs 60 lakh on accommodation of supporters\nALSO READ | Wherever he goes, he lies: Rahul Gandhi targets PM Modi at Naidu's protest\nALSO WATCH | Modi is an actor, appreciate his skills and abilities: Chandrababu Naidu", "url": "https://www.indiatoday.in/elections/lok-sabha-2019/story/chandrababu-naidu-gets-a-boost-as-bjp-ally-shiv-sena-joins-protest-against-modi-govt-1453903-2019-02-12", "label": 1}