{"authors": [], "date_download": "2019-03-27 14:18:15", "date_modify": "2019-03-27 14:18:15", "date_publish": "2018-05-19 04:15:58", "description": "On Friday, Congress workers burnt effigies of what they called symbolising the “misuse of power’’ by the Modi government at the Centre and BJP president Amit Shah. There was, however, no incident of violence reported from anywhere.", "filename": "elections__1553696295.html", "image_url": "https://images.indianexpress.com/2018/05/protest.jpg?w=759", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/indianexpress.com/elections__1553696295.html", "title": "Gujarat: Across state, Congress protests against Karnataka Governor; 30 detained from outside Vala’s home", "title_page": "\n\t\t\t\tGujarat: Across state, Congress protests against Karnataka Governor; 30 detained from outside Vala’s home | Elections News, The Indian Express\t\t\t", "title_rss": "NULL", "source_domain": "indianexpress.com", "text": "The Gujarat unit of the Congress on Friday organised sit-in protests across all the 33 districts and eight municipal corporations to protest Karnataka Governor Vajubhai Vala’s decision to invite BJP to form the government in the south Indian state. Vala, the former finance minister in the BJP government in Gujarat, has represented Rajkot for several terms as an MLA.\nAdvertising\nOn Friday, Congress workers burnt effigies of what they called symbolising the “misuse of power’’ by the Modi government at the Centre and BJP president Amit Shah. There was, however, no incident of violence reported from anywhere.\nState Congress president Amit Chavda and Leader of Opposition in the Assembly Paresh Dhanani, who are currently touring various districts and meeting the local party leaders, attended the dharna in Tapi district.\nIn Ahmedababd, the state level dharna was held at Lal Darwaza which was attended by former state party president Arjun Modhwadia and party’s sitting MLA Himmatsinh Patel, Ahmedabad city congress committee president Chetan Raval and others.\nAddressing party workers, Modhwadia said that by inviting BJP’s B S Yeddyurappa to take oath as Karnataka chief minister, Governor Vala tried to “subvert the democracy”.\nHe said that the Congress-JD(S) combine had submitted the Karnataka Governor the list of MLAs which was more than the required number to form the government. “By doing so, he (Vala) has not only undermined the dignity of his office but has also acted in an unconstitutional manner,” said Modhwadia.\n“The action of the Karnataka Governor is a dangerous precedent striking at the very heart of India’s democracy and it portends grave consequences for all forthcoming elections,” Congress spokesperson Manish Doshi said.\nHe, however, added that the Friday’s decision of the Supreme Court asking the BJP to prove its majority on the floor of the Assembly within 24 hours “has come as a big intervention to protect democracy and exposed BJP leaders as also the Karnataka Governor’’.\nMeanwhile, a group of Congress workers assembled outside the home of Vala in Rajkot and shouted slogans against him. Police said that they have detained 30 Congress protesters.\nCongress city unit chief Mahesh Rajput, who led the protest outside Vala’s Nutan Nagar society residence near Kalavad Road here, called the Karnataka governor’s act a “blot on the democracy”. “Despite being the Governor of a state, Vala has acted like a BJP worker,” Rajput said.\nDeputy Commissioner of Police Harshad Mehta said, “We have detained 30 Congress workers from outside the residence of the Karnataka Governor. No member of Vala’s family was at home when the protest and sloganeering took place.”", "url": "https://indianexpress.com/elections/gujarat-across-state-congress-protests-against-karnataka-governor-30-detained-from-outside-valas-home-5182544/", "label": 1}