{"authors": [], "date_download": "2019-03-27 14:18:19", "date_modify": "2019-03-27 14:18:19", "date_publish": "2018-05-01 19:00:00", "description": "In the last lap of campaigning for Karnataka election, PM Modi attacked CM Siddaramaiah but only to get hit back strongly.", "filename": "elections_karnataka-election-2018_story_pm-modi-attacks-siddaramaiah-over-governance-in-karnataka-gets-targeted-in-return-1224285-2018-05-01_1553696299.html", "image_url": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/201805/PicSiddaPM010518_0.jpeg?grWGKIKGczYqAtq_v3NfxCcpqgzmgeJj", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/indiatoday.in/elections_karnataka-election-2018_story_pm-modi-attacks-siddaramaiah-over-governance-in-karnataka-gets-targeted-in-return-1224285-2018-05-01_1553696299.html", "title": "PM Modi attacks Siddaramaiah over governance in Karnataka, gets targeted in return", "title_page": "PM Modi attacks Siddaramaiah over governance in Karnataka, gets targeted in return - Elections News", "title_rss": "NULL", "source_domain": "indiatoday.in", "text": "Prime Minister Narendra Modi today launched an offensive against Karnataka Chief Minister Siddaramaiah on last leg of campaigning for the state Assembly election. Siddaramaiah was also not the one to hold himself back. He retorted to the PM's attack with an equal intensity if not more.\nThe prime minister touched several aspects of governance in Karnataka under the Congress government led by Siddaramaiah. However, on every count, the Karnataka chief minister hit back at the PM.\nTalking about political violence and law and order situation in Karnataka, Modi alleged that the Congress promotes intolerance and violence. There can be nothing worse than attack on Lokayukta, he said.\n\"In Karnataka there is no law, there is no order. The respected Lokayukta is not safe, how can the common people be safe... Violence cannot exist in a democracy. It is shameful how BJP karyakartas were murdered in Karnataka. The Congress must answer on increasing crimes,\" he said.\nSiddaramaiah replied to this charge through the social media.\nIn a tweet, he said, \"Crime is not increasing in Karnataka abnormally. PM repeats the lie of increasing crime rate for political purposes. I challenge him for an open debate on a single platform on crime and law and order situation in Karnataka vis-a-viz BJP ruled states.\"\nEarlier, speaking during an election rally in Chamarajanagar, the PM sought to take Siddaramaiah to task over contesting from more than one constituency.\nModi said, \"I was reading the papers and saw a 2+1 formula in Karnataka. This is a version of family politics in Karnataka. This is the innovation of the sleeping CM of Karnataka. He is afraid of defeat and, therefore, he is changing seats and fighting on two. And, in his old seat he has sent his son.\"\nThe prime minister further said, \"If CM [Siddaramaiah] has a 2+1 formula then ministers have 1+1 formula. Relatives of ministers are fighting polls. This is hurting the workers of the Congress.\"\nModi alleged that for the Congress, Karnataka election was about family politics while for the BJP, he said, it was about people's politics. \"The people of Karnataka will decide whether they want family politics or people's politics,\" the PM said.\nThe prime minister repeated his taunt on the Siddaramaiah government calling it a \"10 per cent commission government\" and claimed that the people know about it and how it had damaged the mission of serving the society.\nSiddaramaiah hit back. In a series of tweets, he sought to turn the table on Modi.\nThe Karnataka CM said, \"Was it fear that drove you to contest from two parliamentary constituencies (Varanasi and Vadodara) Mr PM? Of course, you are a 56-inch man, you would have some clever explanation! Forget two seats, Sir. Worry about the fact that your party will not cross 60-70.\"\nSiddaramaiah made further charges against Modi. He said, \"Today the PM avoided talking about his complicity in closing CBI cases against the Reddy brothers. Instead he spoke about some 2+1 formula. Here is the explanation to his formula to win election. 2 Reddys + 1 Yeddy.\"\nThe Karnataka CM was referring to the charges of corruption against the infamous Reddy brothers and BJP's chief ministerial candidate BS Yeddyurappa.\nHe tagged a tweet from the handle of Karnataka Congress which alleged that the BJP's \"corruption formula\" to loot Karnataka was \"2 + 1 = 2 Reddys and 1 Yeddy\". \"Why don't you talk about this formula Modi? \"\nSiddaramaiah said he did not know about himself but PM Modi had implemented the \"2+1 formula\".\nWith the last lap of electioneering starting on a shrill note, Karnataka is likely to witness sharper exchange of duel in the days to come.\nRead: Karnataka election: Separate flag issue put on hold, says MHA after Siddaramaiah seeks answer\nRead: Modi challenges Rahul Gandhi to pronounce M Visvesvaraya's name 5 times", "url": "https://www.indiatoday.in/elections/karnataka-election-2018/story/pm-modi-attacks-siddaramaiah-over-governance-in-karnataka-gets-targeted-in-return-1224285-2018-05-01", "label": 1}