{"authors": [], "date_download": "2019-03-27 14:34:49", "date_modify": "2019-03-27 14:34:49", "date_publish": "2015-03-21 00:00:00", "description": "The World Socialist Web Site invites workers and other readers to contribute to this regular feature.", "filename": "en_articles_2015_03_21_labo-m21_1553697289.html", "image_url": "https://www.wsws.org/img/open-graph-icon.png", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/wsws.org/en_articles_2015_03_21_labo-m21_1553697289.html", "title": "Workers Struggles: Asia, Australia and the Pacific", "title_page": "Workers Struggles: Asia, Australia and the Pacific - World Socialist Web Site", "title_rss": "NULL", "source_domain": "wsws.org", "text": "Workers Struggles: Asia, Australia and the Pacific\n21 March 2015\nAsia\nPolice force striking Chinese shoe workers back into factory\nRiot police in the southern Chinese province of Guangdong on Wednesday clashed with 5,000 striking workers at the Stella International Xing Ang shoe factory in Dongguan on the third day of a strike against the company’s long-term failure to pay housing assistance entitlements. Workers had given the management until March 1 to pay which it failed to do.\nRiot police surrounded the striking workers and forced most of them back into the plant. Workers remained locked in throughout the night but refused to work. According to one worker, police monitored all exits and beat up employees who tried to escape. The worker said that police beat anyone outside the factory who was wearing a factory uniform. Many workers were hospitalised with police dog bites, he said. Nearly all employees returned to their work stations the next morning.\nIndian workers strike over privatisation\nWorkers at the state-run Roadways bus company struck for 24 hours on March 17 in opposition to the Haryana state government’s new timetable for private buses and the opening of long-distance routes to private operators. Strikers protested outside every transport office in the state. Bus services remained paralysed during the walkout.\nRoadways workers fear that jobs in government buses would be cut and that many eligible youth would not be employed as a result of the government’s privatisation plans. The strike was called by the Haryana Roadways Employees Coordination Committee.\nA day earlier, Tuticorin port workers demonstrated against the Tamil Nadu state government’s decision to privatise major ports. The workers were organised by the Democratic Staff Union of Tuticorin Port and the Water Transport Workers’ Federation of India.\nIndian court lawyers protest against police attack\nLawyers at courts in the states of Odisha, Punjab, Chandigarh and Haryana and at the New Delhi High Court refused to work on March 16. The strike was against a police attack which killed one of their colleagues in the Allahabad High Court premises. The lawyers condemned the police, voiced their solidarity with the deceased lawyer and called for serious punishment of the police involved and for extra security for court lawyers.\nKarnataka village panchayat workers protest\nVillage panchayat (local government) workers protested outside the Labor Commissioner’s Office in Mandya on March 16 over long-standing demands for a wage rise, job permanency and social security benefits as per regular government employees. The workers demanded that the minimum monthly wage be applied as announced in the State Gazetteer several years ago. They want the monthly wages of bill collectors, computer operators and clerks to be fixed at 15,000 rupees ($US239.5), pump operators and D group workers at 12,000 rupees, and sweepers at 1,000 rupees ($16).\nThe action was called by the Karnataka State Gram Panchayat Employees Union affiliated to the Centre for Indian Trade Unions.\nKarnataka rural postal workers on strike\nRural postal workers in Kalaburag district, Karnataka stopped work on March 11 and were still on strike on March 16 to demand permanent jobs and a pay rise as per the seventh pay commission. Strikers were maintaining a protest outside the main post office in Kalaburag city. The walkout was called by the All India Postal Grameen Dak Sevak Employees Union, which also called for the reversal of plans to privatise postal services.\nMeanwhile, farmers’ organisations joined with demonstrating rural postal workers in Udupi to support their demands, including better postal facilities.\nAndhra Pradesh midday meal workers continue protests\nFollowing a two-day hunger strike in Vishakhapatnam last week, school midday meal workers and helpers protested in the coastal districts of Andhra Pradesh and Hyderabad on March 17 to demand a decent wage and job permanency. The police arrested about 25 union leaders and protesting workers in Ongole.\nThe school meal workers want a minimum wage of 10,000 rupees ($159), reduction of increased workloads and removal of the threat to reduce the number of aged workers. The workers are currently paid a between 3,000 and 4,500 rupees a month. The protest was organised by the Centre for Indian Trade Unions.\nKerala liquor outlet workers strike\nLiquor outlet workers in Trivandrum, the capital of India’s south-west state of Kerala, stopped work for the day on March 17 to oppose job cuts and the closure of 52 shops, or 10 percent of the state-run liquor outlets. The workers are employees of the Kerala State Beverages Corporation (BEVCO) and Kerala State Co-operative Consumers’ Federation.\nTamil Nadu transport workers protest over colleague’s death\nTamil Nadu State Transport Corporation (STC) workers in Vellore held a protest fast in the Vellore bus depot over the death of one their colleagues on March 17. The workers said that the branch manager Kalyanasundaram abused the driver Janardhanam, who said he felt ill when reporting for duty. According to the protestors, Janardhanam had cardiac problems and had a heart attack as a result of mental stress imposed on him by the manager. The workers demanded action against the manager and his arrest.\nBangladesh garment workers demonstrate over unpaid wages\nAround 500 workers at the Profusion Textile Mills garment factory in Gazipur, 53 km north of Dhaka, took strike action on March 11 to demand unpaid wages for January and February. The strike was sparked when factory management failed to honor a commitment to pay the wages by March 17. Police were deployed to the industrial zone to prevent the demonstration spreading to other factories.\nPakistan: Islamabad teachers demand wages\nDaily wage and voluntary teachers of the Federal Directorate of Education in Bhara Kahu, Islamabad demonstrated outside the education headquarters this week demanding unpaid wages. Some of the teachers have not been paid for two years. Voluntary teachers also alleged that the authority has broken an agreement to enrol them as daily wage contract teachers after 90 days of service despite working for two years. At least 100 voluntary teachers are affected.\nThe government is increasingly using contract labour to restrict the rights and benefits of employees in education and other sectors. It has also repeatedly refused to honour its own agreements to permanently employ these workers.\nCambodian garment workers strike\nOver 200 striking employees demonstrated in front of the Siko Phnom Penh Garment Factory in the capital’s Dangkor district on March 16 after management fired an employee for establishing a new union at the factory. One worker told media that the warehouse worker founded a branch of the National Trade Union Confederation because, “The only approved union operating at the factory does nothing to help workers with problems.”\nAustralia and the Pacific\nNew South Wales power workers to strike\nThe United Services Union (USU), representing clerical and administrative employees at the state-owned electricity network company Ausgrid, has notified the company that its members will be taking protected strike action, commencing March 31, in their dispute for a new enterprise agreement. Workers will strike for four hours in depots and offices at Wallsend, Charlestown and Belmont on March 31, at Gosford, Ourimbah, Somersby, Tuggerah and Singleton on April 1, and at six Hunter region depots on April 8.\nA USU spokesman claimed that job security was the primary concern for workers ahead of the March 28 election, specifically the NSW Liberal government’s plans to privatise the energy network.\nAusgrid claims that it was unable to reach a final enterprise agreement deal until the Australian Energy Regulator decides on the company’s revenue in late April. The union has already reduced its pay demand in order to avoid industrial action before next Saturday’s state election.\nElectrical Trades Union (ETU) members at Ausgrid struck for four hours on March 3 over their wages dispute. The ETU has reduced its members’ wage demand from an 8 percent increase over two years to annual 2.5 percent increases over two years in line with the state government’s wages policy.\nNew South Wales child protection workers walk out\nChild protection workers walked off the job for an hour at lunchtime on Thursday to protest against a shortage of caseworkers. The Public Service Association (PSA) said the industrial action was in response to the NSW state government’s failure to properly resource child protection services.\nThe association claimed that only one in four children at risk of serious harm is being seen by a caseworker for assessment. The PSA has been highlighting the caseworker understaffing issue for three years. A PSA spokesperson said case workers rejected the government’s inadequate response that staff shortages were due to the high proportion of female workers, including those taking maternity leave.\nAustralian scientific research workers to vote for industrial action\nCommonwealth Scientific and Industrial Research Organisation (CSIRO) workers have been granted permission by the Fair Work Commission (FWC) to hold a Protected Action Ballot in their dispute with the federal government for a new enterprise agreement. The FWC decision authorises a range of protected protests, including work bans, stoppages and strike action.\nWorkplace agreements covering 160,000 public sector workers in over 70 federal departments are up for renewal, with the government making similar low pay offers and reduced conditions. Workers in all federal public sector departments have rejected the offers. The government has offered so-called pay rise increases of between 0 and 1.05 percent per year over three years in return for a longer working day, the loss of time off and a slowdown in the rate of progression up the pay scales.\nThe CSIRO ballot of workers will commence on March 27, supposedly clearing the way for industrial action at CSIRO by late April, a few weeks before the federal budget. The CSIRO Staff Association is currently assisting management to eliminate 1,300 jobs or 20 percent of CSIRO’s workforce, since the government’s $115 million budget cut to research. The union will no doubt limit any action to ineffectual low level work bans similar to those currently being imposed by the Community and Public Sector Union in Centrelink, Medicare and Child Support since December in their pay dispute with the government.\nNew Zealand fast food workers continue protests against ‘0-hours’ contracts\nFollowing several protests targeting Wendy’s Hamburger fast food restaurants this year, around 30 workers demonstrated outside the new Wendy’s restaurant in Dunedin, New Zealand on March 14 over the use of ‘0-hour’ contracts. McDonald’s, KFC, Pizza Hut, Starbucks and Burger King also employ staff on these contracts with workers rostered anywhere between 3 and 40 hours a week.\nA Unite union spokesman said such contracts often require staff to remain ready to work for one employer only, but they are not contractually guaranteed set hours of work. Contract employees do not receive the same entitlements as other workers, such as a day off in lieu for any public holidays worked. According to a Massey University study, two thirds of employment in New Zealand is classed as casual, part-time or contract.\nPapua New Guinea: Goroka hospital staff and doctors strike again\nDoctors joined striking nurses and other support staff and withdrew their services on March 13 in a long-running dispute with the government and hospital administration for urgently needed equipment and better facilities at the Goroka Base Hospital in Papua New Guinea’s Eastern Highlands.\nThe walk-out followed the temporary mass resignation of 400 hospital workers on January 19, over the dismissal of five senior staff members, including the hospital manager who supported the workers, over the lack of supplies and for improved conditions. The doctors and nurses, who had demanded that the hospital’s board of directors be sacked, returned to work after the health minister announced that a three-man committee would be sent to Goroka to investigate their demands. None of these issues have been resolved.\nPlease enable JavaScript to view the comments powered by Disqus.", "url": "https://www.wsws.org/en/articles/2015/03/21/labo-m21.html", "label": 1}