{"authors": ["Deutsche Welle", "Www.Dw.Com"], "date_download": "2019-03-27 14:34:46", "date_modify": "2019-03-27 14:34:46", "date_publish": "2019-03-13 00:00:00", "description": "Tensions over Cauvery between Tamil Nadu and Karnataka, which speak two different languages, date back over 100 years. Despite a recent Supreme Court ruling, the dispute seems set to run on. Vasudevan Sridharan reports.", "filename": "en_cauvery-a-thinning-river_c2bc7b1cff5045e6f8ecb556bc0e46c6_a-42788625_1553697286.html", "image_url": "https://www.dw.com/image/42785363_304.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/dw.com/en_cauvery-a-thinning-river_c2bc7b1cff5045e6f8ecb556bc0e46c6_a-42788625_1553697286.html", "title": "Cauvery - a thinning river widening the rift between two Indian states", "title_page": "Cauvery — a thinning river widening the rift between two Indian states | Asia| An in-depth look at news from across the continent | DW | 02.03.2018", "title_rss": "NULL", "source_domain": "dw.com", "text": "\"Chola naadu sorudaithu\" (Chola kingdom, the place of abundant food) is how a long-standing Tamil adage refers to the Chola kingdom, the present Tanjore region of southern India. Yet, the river-belt region once known as the \"Granary of South India\" is now fighting for its survival because of the depleting water resources from the Cauvery River.\nCauvery, a 765 kilometers (475.3 miles) river providing a lifeline to millions of Indians across the two southern states of Tamil Nadu and Karnataka, is hitting the headlines again as the country's apex court recently delivered its long-awaited verdict on the water-sharing agreement.\nIn what is being seen as a minor blow to Tamil Nadu, the Supreme Court ordered that Karnataka, which has four dams on the river, would have to share 14 thousand million cubic feet of water less than the existing level. This allocation will be in force for the next 15 years, said the top court, putting the water dispute to rest, at least temporarily.\nRead more:\nRestoring India's depleting rivers – an uphill task\nGanges under threat from climate change\nCauvery, one of India's most exploited rivers, energizes the delta region covering an area of 81,155 square kilometers. It is also one of India's most fertile landmasses that is larger than the size of Republic of Ireland. It has been at the center of a political and legal dispute that goes back over 100 years.\nThe water war has shed blood, cost lives, plus millions in loss of property and productivity over the decades. Tensions between Tamil Nadu and Karnataka, which speak two different languages, rise almost every year, especially during the summer months.\nAlmost 95 percent of Cauvery's waters are used for agricultural, domestic or industrial purposes, with the cultivation of water-intensive crops such as sugarcane and rice consuming a lion's share.\nWater level has gone down in many areas across the Tanjore delta region in recent years\n'Rice Bowl of Tamil Nadu'\nOnce heralded as the \"Rice Bowl of Tamil Nadu,\" the Tanjore delta region now portrays a grim picture with dwindling production cycles and speculation over farmer suicides. If the status of dozens of tributaries and hundreds of small water-bodies located along the Tamil Nadu delta region vitalized by the Cauvery River is to be taken as a sample, it should leave the region parched.\n\"At least 500 cows and several other cattle had died in recent years due to water scarcity, especially during summers in this district alone,\" Selvaraj, who goes by a single name, and is a farmer for several generations but now forced to seek other jobs, told DW. \"This should convey the seriousness of the situation.\"\nHe added: \"Now, the entire Tanjore delta region relies on groundwater rather than the resources from the river for all irrigation purposes. We do not know whether we'll have enough water for irrigation in the foreseeable future.\"\nRead more:\nIndia's polluted Ganges River threatens people's livelihoods\nIndia grants Ganges and Yamuna rivers 'legal person' status\nProtests led by Tamil Nadu farmers are slowly galvanizing following the court verdict amid concerns that it could snowball further.\nA senior bank employee who did not want to be identified and is in charge of dispersing agriculture loans in Tanjore region also confirmed to DW that farmers are one of the worst affected communities in recent years, going by the banking transactions they have had.\n'Kaveramma' of Karnataka\nNevertheless, the Supreme Court's ruling on the sharing of the river Cauvery, fondly known as \"Kaveramma\" (mother Cauvery) in Karnataka, brought some smiles to Karnataka as the sitting government, which faces an election in the coming months, can claim a partial victory given they can slightly reduce the water supply shared with their neighbor.\nListen to audio 05:48 Share Ganges under threat Send Facebook google+ Whatsapp Tumblr linkedin stumble Digg reddit Newsvine Permalink https://p.dw.com/p/2qgHX Living Planet: Ganges under threat\nShortly after the judgment, Karnataka's Chief Minister Siddaramaiah told reporters: \"It is not a victory or defeat for any state in cooperative federalism. The SC [Supreme Court] has partly allowed our plea. We have got some relief. We are happy.\"\nStill, there have been plenty of voices from both politics and civil society in the poll-bound Karnataka demanding more needs to be done in favor of their state. While the governing administration will be keen to trumpet the verdict as its achievement in the upcoming election campaign, the political opposition is looking for ways to pin them down.\nHD Deve Gowda, former Indian prime minister hailing from Karnataka and who holds a political clout in the Cauvery delta region, called the court's verdict unfavorable to his state. Gowda, an expert on Cauvery-related matters who routinely advises politicians and lawyers, said the Karnataka administration is \"celebrating the outcome without understanding the gravity of the issue.\" Karnataka is a drought-prone area and second only to the arid Rajasthan state in northern India.\nVerdict's ramifications\nThere has also been criticism that the judiciary did not capitalize on the opportunity to order better water conservation techniques and more efficient irrigation practices in the Cauvery basin in both the states.\nAdditionally, one of the key elements of the latest Supreme Court's verdict was labelling waters of multi-state rivers as \"national assets,\" taking away the possibility of provincial governments laying total claim on the water bodies.\nPotentially, the ruling could have a cascading effect on several other disputes existing among multiple states across the country like the ones between Punjab, Haryana and Rajasthan; as well as Odisha and Chhattisgarh.", "url": "https://www.dw.com/en/cauvery-a-thinning-river-widening-the-rift-between-two-indian-states/a-42788625", "label": 1}