{"authors": ["Deutsche Welle", "Www.Dw.Com", "Author", "Cherie Chan"], "date_download": "2019-03-27 14:35:02", "date_modify": "2019-03-27 14:35:02", "date_publish": "2019-06-02 00:00:00", "description": "PM Modi's move to abruptly withdraw all high-value currency notes from circulation remains highly contentious a year on, with former PM Manmohan Singh calling it \"a black day\" for India's economy and democracy.", "filename": "en_one-year-after-demonetiz_4c67b3c27c194e48107ac227e20db348_a-41276486_1553697302.html", "image_url": "https://www.dw.com/image/36311834_304.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/dw.com/en_one-year-after-demonetiz_4c67b3c27c194e48107ac227e20db348_a-41276486_1553697302.html", "title": "One year after demonetization - Has India eliminated ′black money′?", "title_page": "One year after demonetization – Has India eliminated ′black money′? | Asia| An in-depth look at news from across the continent | DW | 08.11.2017", "title_rss": "NULL", "source_domain": "dw.com", "text": "Indian Prime Minister Narendra Modi made an abrupt-yet-drastic decision on November 8 last year, a move that later came to be known as \"demonetization.\" Addressing the nation via a television broadcast, he announced that all 500- and 1,000-rupee currency notes (making up 86 percent of India's banknotes at the time in value terms) would \"no longer be legal tender.\"\nIn their place, new 500- and 2,000- rupee notes would be issued, he said. The stated objectives of this mammoth exercise were threefold: eliminating \"black money,\" fake currency and terror financing. Black money is a term used in the country to refer to unaccounted, untaxed wealth.\nThe move caused huge disruption to everyone's lives. Most people encountered problems accessing cash for their daily needs, with pictures of serpentine queues outside banks and ATMs becoming an essential staple of news reports.\nIt led to hardships for hundreds of millions of Indians employed by the country's vast informal sector of the economy that deals predominantly in cash. Over 100 deaths were also reported, linked to exhaustion after standing for long hours waiting for their turn to replace their rupee notes or make small withdrawals.\nRead more: India growth slips in wake of cash ban\nWatch video 03:54 @dwnews #Demonetization Indians queue for cash\n'A coercive step'\nSupporters of PM Modi and his party, the Bharatiya Janata Party (BJP), hailed the edict as a good and necessary measure that \"will clean up the system.\" Critics, though, have lambasted it as a \"silly\" move that caused enormous pain to Indians, particularly those in rural areas with little access to bank branch networks or ATMs.\n\"It badly hit India's rural poor, who have little access to banks. They need cash transactions to buy seeds and fertilizers. This led to many suicides,\" Jean Dreze, a development economist, told DW.\nFormer Prime Minister Manmohan Singh, an accomplished economist and the architect of India's economic liberalization program, even called it \"organized loot\" and \"legalized plunder.\"\nOn the eve of the first anniversary of demonetization, Singh once again slammed the move. \"Nowhere in the world has any democracy has taken such a coercive step,\" he told a group of traders in the Modi's home state of Gujarat.\nTalking to BloombergQuint, Singh also noted: \"The damage it has caused has been multiple — economic, social, reputational and institutional. Slowing GDP is merely one indicator of the economic damage. Its impact on the weaker sections of our society and business is far more damaging than any economic indicator can reveal.\"\nFurthermore, Singh said, it was \"an attack on the independence and credibility of the RBI as an institution,\" referring to India's central bank, the Reserve Bank of India.\nBold action?\nBut Modi's administration disagrees, with Finance Minister Arun Jaitley terming demonetization as \"a watershed moment in the history of Indian economy.\" In a 1,843-word blog, titled A Year After Demonetization, he said that November 8, 2016 \"signifies the resolve of this Government to cure the country from 'dreaded disease of black money.'\" Jaitley said the move had met its objective of reducing cash in the economy, ending anonymity of cash, bringing in more individuals in the tax net and dealing a body blow to black money.\nModi's government and the BJP are also marking November 8 as \"anti-black money day,\" with ministers and party workers focusing on publicizing the supposed gains achieved as a result of the decision.\n\"The prime minister means business and demonetization has sent black marketers scurrying. He is seen by the people as decisive and willing to take bold action,\" G V L Narasimha Rao, a BJP leader, told DW.\nTo counter the ruling party's narrative, the opposition Congress party-led alliance has said it is observing it as \"black day.\"\n\"People have already seen through this charade and the government is going to great lengths to cover up. The real effects of demonetization are being felt now, especially by farmers and those working in the unorganized sector,\" senior Congress leader Ghulam Nabi Azad told DW.\nA costly risk?\nIndia's central bank recently revealed that nearly all of the demonetized currency had returned to the system.\nCurrency worth 15.28 trillion rupees (around €203 billion, $235 billion) had been deposited in banks up to June 30 this year, according to the RBI. This actually meant that either there was no significant black money in cash or hoarders found a way to legitimize most of their ill-gotten cash.\nIn addition, the cost for printing new currency notes and recalibrating ATM machines was huge.\n\"Demonetization may have pushed the Indian economy toward more formal ways of operating and expanded the country's tax base. But neither of these required a policy as incredibly destructive as demonetization,\" economist Arun Kumar told DW.\nArun Shourie, an economist and former union minister under a BJP government, said that demonetization was not a move against black money. \"Those who possess black money, or who have black assets, don't hold them in cash,\" he told DW.\nRealizing the blowback from its move and that most of the cash had returned, the government gave a different spin stating that the exercise was not just aimed at unearthing unaccounted wealth but also about getting a higher number of people into the tax net, improving digitization and curbing terrorist financing.\nWhere Asia's millionaires live 1. Japan A new report by New World Wealth reveals Japan has the highest number of millionaires in the region, totaling almost 1.3 million. The country's total individual wealth is $15.23 trillion, the second-highest in the Asia Pacific after China. Japan has one of the most even wealth distributions in the world, with a lot of millionaires but relatively few multi-millionaires and billionaires.\nWhere Asia's millionaires live 2. China The world's second-biggest economy has 654,000 millionaires, placing it second on the list. But it has the largest amount of total individual wealth in the region - valued at $17,25 trillion - and the highest number of multi-millionaires. However, the country's wealth per capita is only $12,800, ranked seventh among other Asia Pacific countries.\nWhere Asia's millionaires live 3. Australia While the country only has the third largest number of millionaires - about 290,000 - in Asia Pacific, it tops the list of wealthiest individuals - with wealth per capita being $204,400, well ahead of other rich states in the region. The report suggests that it might be due to the high value of real estate in the country.\nWhere Asia's millionaires live 4. India India hosts the fourth largest number of millionaires in the region - 236,000. But the country is also ranked at the bottom third in terms of wealth per capita, performing only better than Vietnam and Pakistan. The report points out that the growth in the number of millionaires in the South Asian nation is impressive, rising from 40,000 individuals in 2000 to 236,000 in 2015.\nWhere Asia's millionaires live 5. Singapore With a population of only five million, Singapore has 224,000 millionaires, only 12,000 less than India. Not surprisingly, Singapore has a high value of wealth per capita, amounting to $158,300 per person, ranking second on the list following Australia.\nWhere Asia's millionaires live 6. Hong Kong (Special Administrative Region of China) The Asian financial hub hosts 215,000 millionaires, but also has 9,560 multi-millionaires, ranking after mainland China, Japan and India. Hong Kong has the third-largest luxury market in the region in 2015. The report says that the $19.8 billion worth of annual sales is remarkable considering the size of the city, and suggests it might be due to heavy buying behavior of Chinese.\nWhere Asia's millionaires live 7. South Korea South Korea hosts 125,000 millionaires, fewer than Singapore and Hong Kong. The report predicts that there would be a 55 percent growth in the number of millionaires in the country over the coming decade.\nWhere Asia's millionaires live 8. The island of Taiwan The island has 98,200 millionaires. The number has increased by 75 percent since 2000, a modest rise compared to that in other emerging economies in the region. In fact, the figure has even dropped by 10 percent since last year, when it stood at 109,100.\nWhere Asia's millionaires live 9. New Zealand The nation has 89,000 millionaires among its 4.5 million population. It is also among the top three in the region in terms of wealth per capita, ranked only after Australia and Singapore.\nWhere Asia's millionaires live 10. Indonesia Apart from the traditionally affluent Singapore, the archipelago is the only one from Southeast Asia that made it to the top ten of the list, hosting 48,500 millionaires by the end of 2015. This represents a 525 percent increase since 2000, a larger growth than in China and India. Author: Cherie Chan\nSlowdown\nThe Indian economy has slowed considerably since demonetization. In the April-June quarter of this year, the country recorded a growth of 5.7 percent, the lowest in the last three years, prompting many economists to point fingers at demonetization, among other reasons like the newly introduced Goods and Services Tax (GST).\nRead more: India's economic growth projected to slow\nSectors like real estate, manufacturing and finance have been under stress over the past year. Even agrarian discontent — which has been witnessed across various states, including Madhya Pradesh, Tamil Nadu and Maharashtra, with farmers protesting and demanding loan waivers during the summer months — has been attributed to demonetization.\nBut PM Modi still views it as a key structural reform measure he had to take as part of his government's efforts to combat pervasive corruption and tax fraud in India. The jury is still out on this, and results in the upcoming state elections next month could send a signal as to whether the Indian public agrees with him on this front.\nRead more: Indian state elections - A referendum on PM Modi's demonetization policy", "url": "https://www.dw.com/en/one-year-after-demonetization-has-india-eliminated-black-money/a-41276486", "label": 1}