{"authors": [], "date_download": "2019-03-27 14:41:03", "date_modify": "2019-03-27 14:41:03", "date_publish": "2017-11-06 04:38:30", "description": null, "filename": "features_talks-in-limbo-1502523227_1553697663.html", "image_url": "https://www.thestatesman.com/wp-content/uploads/2017/11/Clipboard01-3.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/thestatesman.com/features_talks-in-limbo-1502523227_1553697663.html", "title": "Talks in limbo", "title_page": "Talks in limbo - The Statesman", "title_rss": "NULL", "source_domain": "thestatesman.com", "text": "The last peace talks between the Centre and the leaders of the United National Liberation Front, headed by its chairman Arabinda Rajkhowa, took place nearly four years ago. Rajkhowa said since the ball is now in the Centre’s court, it is for it to make the next move. Since then there had been news about the process being revived but nothing has come through so far. In fact, since assuming power at the Centre, the BJP has shown little interest in engaging the Ulfa leaders. And few in Assam seem to show an interest in the talks.\nThe common people have reason to ignore because there is no unity among them. Rajkhowa and his team surrendered to Indian authorities in December 2009 and started formal talks in February 2011. The breakaway faction led by self-styled commanderin-chief Paresh Barua has refused to come forward. He is now operating from somewhere along the ChinaMyanmar border with the support of some Chinese agencies.\nRecently, spiritual leader, Sri Sri Ravi Shankar took an initiative to bring Barua to the negotiation table. At a function held in Guwahati, he gave the hint of Barua coming for talks. But Barua denied it, calling it “biased and ridiculous”. Now in his 60s, Barua has repeatedly said that any talks with New Delhi would be possible only if it agreed to include Assam’s sovereignty in the agenda. In a media statement, Barua tried to explain that the Ulfa rebels took up arms not to threaten any individual or sovereign nation but only for their protection. He blamed the Centre for its colonial approach to people of the North-east.\nChasing the dream of “swadhin Asom”, Ulfa leaders once engaged in large-scale extortion, kidnapping and even, brutal killings. No one was spared. They targeted anyone critical about their misdeeds. One notable example was the killing of journalist Kamala Saikia, an elderly teacher and freedom fighter at Sivasagar on 9 August 1991. Ulfa cadres abducted and killed him for being vocal about the outfit’s disruptive activities. Saikia was among 20 journalist editors of Assam to fall to rebels’ bullets.\nLately, the government has taken a fresh initiative to bring the peace process on track. General secretary Anup Chetia was extradited from Bangladesh some months ago, on the plea that his presence alone would help expedite the decision-making. But so far nothing has happened.\nIt is clear that nothing extraordinary is expected if Barua does not change his mind. It is not because of Barua’s charisma as a “revolutionary” leader, but some Assamese intellectuals’ have love and affection for him. One group of intellectuals, including academicians, social activists and even journalists, projects Barua as the last hope for Assamese society. At a recent incident in Nagaon, these intellectuals had tried their best to raise Assamese sentiment. While indirectly glorifying Barua, they even held demonstrations against “outsiders” in the state.\nIt all started with a group of traders, primarily from the Bengali community, allegedly assaulting a few former Ulfa cadres after a row over donations. The CCTV visuals, made available to local news channels, showed the traders slapping some of them until police intervened.\nBarua reacted, saying that the outsiders (read Bengali traders) would be taught a lesson for the act. Ulfa leaders in Guwahati came out with a theory that those youths had gone to collect funds for flood relief. Rajkhowa and Chetia joined in the chorus, asserting that the Bengali traders misbehaved with Assamese youths (actually former Ulfa rebels) thereby hurting the sentiments of the locals (read indigenous people).\nA group of Assamese, including literary critic Dr Hiren Gohain, asked the Bengali community to come clean on the Nagaon incident. It alleged that the larger Bengali-speaking community had not condemned the Nagaon incident.\nThen came a newly-floated organisation called the Assam Indigenous Forum, which alleged that the Nagaon incident was simply invited by the provocative statements of some local BJP leaders. The forum, led by none other than Chetia, asserted that influential minister Himanta Biswa Sarma was one of those irresponsible leaders who made comments defaming Assamese nationals time and again.\nClaiming to have support from the Assam Jatiyabadi Yuva Chhatra Parishad, Krishak Muki Sangram Samity and All Tai Ahom Students’ Union, the forum also demonstrated in front of the Raj Bhawan in Guwahati and sent a memorandum to Prime Minister Narendra Modi, through then Assam Governor Banowarilal Purohit, which asserted local peoples’ rights in the state.\nMany others joined in the chorus terming the Nagaon incident as an assault on indigenous people. This was followed by a series of demonstrations, mainly in eastern Assam. Later the police arrested over 10 people for alleged involvement in the incident.\nExpressing dismay over the tendency of glorifying the Ulfa rebels as saviours of Assamese nationalism, the Patriotic People’s Front Assam urged the authorities to take strong steps.\nChief minister Sarbananda Sonowal, also in charge of the home portfolio, took three days to comment on the incident. In his statement, he termed the Nagaon incident as unfortunate. Expressing deep dissatisfaction over the attempt of a section of people to add communal colour to the incident, Sonowal called on all communities to maintain peace and harmony. The forum was surprised that the chief minister did not use stronger words. It said, if not Assamese nationals as a whole, many so-called saviours of Assam, must understand that Barua can bring to the region nothing but disorder and violence. They must not forget the criminal activities of various armed rebels. It called for a strong political will to combat such forces.\nThe writer is the Guwahati- based Special Representative of The Statesman", "url": "https://www.thestatesman.com/features/talks-in-limbo-1502523227.html", "label": 1}