{"authors": [], "date_download": "2019-03-27 14:40:48", "date_modify": "2019-03-27 14:40:48", "date_publish": "2017-10-04 22:39:07", "description": "Farmers in Jaipur protest against land acquisition by burying themselves neck-deep.", "filename": "fyi_story_jaipur-rajasthan-farmers-bury-protest-land-acquisition-jda-1058002-2017-10-04_1553697648.html", "image_url": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/201710/jaipur-farmer-protest-land-acquisition-647_100417102720.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/indiatoday.in/fyi_story_jaipur-rajasthan-farmers-bury-protest-land-acquisition-jda-1058002-2017-10-04_1553697648.html", "title": "Jaipur farmers bury themselves partially to protest against land acquisition", "title_page": "Jaipur farmers bury themselves partially to protest against land acquisition - FYI News", "title_rss": "NULL", "source_domain": "indiatoday.in", "text": "Farmers in Jaipur have resorted to something which is bound to get them the Vasundhara Raje-led government's attention.\nFarmers in Neendar village, some 20 km from state secretariat, have buried themselves neck-deep. The farmers have been protesting against what they claim as forcible acquisition of their land by Jaipur Development Authority (JDA).\n\"It has been 20 days since we have been in this agony. Since October 2, we have taken samaadhi in soil.\"\n\"No one has come to ask about us. No government has come to us about how we have been. We have been sitting here and our children are suffering too. Their education taking a hit,\" a female agitator said.\nThe protesting farmers claimed that JDA has acquired about 540 acres of land and now plans to build housing societies which will be sold to earn profits.\n\"The protest is inspired by Mahatma Gandhi. We have been peacefully sitting here since October 2. We want to send a message to government that they need to hear us and release and return our acquired land.\"\n\"Nobody has had a word with us yet. We have been given a notice. There are around 20 dhaanis and a lot of families live here. Some families have even sold their lands to educate their children.\"\n\"What will become of the people who have been living here for ages now? As many as 5,000 families will be affected. If the voices of our protest fall on deaf ears, we will resort to Satyagraha,\" a protestor told India Today.\nAccording to farmers, it is a 'do or die' situation and they plan to go on with their protest until they are heard.", "url": "https://www.indiatoday.in/fyi/story/jaipur-rajasthan-farmers-bury-protest-land-acquisition-jda-1058002-2017-10-04", "label": 1}