{"authors": [], "date_download": "2019-03-27 14:40:42", "date_modify": "2019-03-27 14:40:42", "date_publish": "2018-03-07 17:40:00", "description": "A photo of some men trying to demolish a Rajiv Gandhi statue is being widely shared as one clicked in Tripura in 2008. Is this true?", "filename": "fyi_story_fact-check-was-rajiv-gandhi-s-statue-brought-down-by-the-left-in-tripura-in-2008-1183879-2018-03-07_1553697642.html", "image_url": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/201803/raji.jpeg?6dOCE7CWK0bbF01pjb3WKKTodIds3ZNg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/indiatoday.in/fyi_story_fact-check-was-rajiv-gandhi-s-statue-brought-down-by-the-left-in-tripura-in-2008-1183879-2018-03-07_1553697642.html", "title": "FACT CHECK: Was Rajiv Gandhi's statue brought down by the Left in Tripura in 2008?", "title_page": "FACT CHECK: Was Rajiv Gandhi's statue brought down by the Left in Tripura in 2008? - FYI News", "title_rss": "NULL", "source_domain": "indiatoday.in", "text": "CLAIM\nPhoto showing men vandalising former Prime Minister Rajiv Gandhi is from Tripura, clicked during a protest in 2008.\nRATING\nFalse.\nORIGIN\nThe internet is amazing. Powerful. Extremely useful, no doubt. Social media platforms and instant messaging apps help people stay connected and share information but just like every human invention misused, these offerings are now used to spread false information, propagate a certain narrative and to a large extent, fuel hatred.\nSince the day when Communist idol Vladimir Lenin's statue was brought down in Tripura's Belonia, just two days after the announcement of Assembly election results in the state, there have been attacks on Dravidian icon Periyar's statue in Tamil Nadu's Vellore and on Jana Sangh leader Syama Prasad Mookerjee's statue in South Kolkata.\nSocial media users were divided on whether or not bringing down statues, be it by the Right or the Left, is the right thing to do.\nMeanwhile, there is false information propagated on social media platforms and instant messaging applications. Sample this - Dr Gaurav Pradhan, famous for his political predictions, and the founder of Swades Samvad, tweeted saying, \"This is Shri Rajiv Gandhi statue in Tripura which was brought down by LEFT (sic) in the most humiliating manner in 2008,\" sharing a photo that shows one man just about to hit Rajiv Gandhi's statue with a hammer.\nDear @JhaSanjay @priyankac19 @rssurjewala & other @incindia PIDIs\nThis is Shri Rajiv Gandhi statue in Tripura which was brought down by LEFT in the most humiliating manner in 2008\nWould u guys say something about it or Lenin is your new father now? pic.twitter.com/IcAIYIgNZd #GauravPradhan (@DrGPradhan) March 7, 2018\nThis photo, however, is not of Left wing activists bringing down Rajiv Gandhi's statue in Tripura in 2008 but United Andhra Pradesh activists tearing down Rajiv Gandhi's statue while protesting against the formation of Telangana state, in Anantapur in 2013.\nHere is a screengrab of a Deccan Chronicle article from 2013 that says the truth.\nHere is another tweet about this particular statue being set on fire.\nThis happened in 2013, feeling betrayed by the Congress for deciding to create a separate Telangana state, supporters of united Andhra Pradesh vented their anger on the ruling partys icons: statues of former prime ministers Indira and Rajiv Gandhi. pic.twitter.com/etmDBweOgb Anuradha (@anuvb) March 6, 2018\nWhen you come across such photos and tweets, please take it with a pinch of salt and verify before passing it further ahead.", "url": "https://www.indiatoday.in/fyi/story/fact-check-was-rajiv-gandhi-s-statue-brought-down-by-the-left-in-tripura-in-2008-1183879-2018-03-07", "label": 1}