{"authors": [], "date_download": "2019-03-27 14:34:50", "date_modify": "2019-03-27 14:34:50", "date_publish": "2019-03-28 00:00:00", "description": "From PM Modi to Delhi CM Kejriwal, Goa to host political leaders across the spectrum this month", "filename": "Goa_Star-power-to-fire-up-poll-campaign_110632_1553697290.html", "image_url": "https://www.heraldgoa.in/images/fb-post1.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/heraldgoa.in/Goa_Star-power-to-fire-up-poll-campaign_110632_1553697290.html", "title": "Star power to fire up poll campaign", "title_page": "Herald: Star power to fire up  poll campaign", "title_rss": "NULL", "source_domain": "heraldgoa.in", "text": "From PM Modi to Delhi CM Kejriwal, Goa to host political leaders across the spectrum this month\nPANJIM: The Prime Minister and his ministers, Opposition leaders, Chief Ministers are expected to land in Goa over the next two weeks as campaigning for the February 4 polls enters the final phase.\nPANJIM: The Prime Minister and his ministers, Opposition leaders, Chief Ministers are expected to land in Goa over the next two weeks as campaigning for the February 4 polls enters the final phase.\nStar campaigners taking flights to Goa include Prime Minister Narendra Modi, BJP National President Amit Shah, Shiv Sena’s Uddhav Thackeray, Congress Vice-President Rahul Gandhi, MP Sachin Pilot, AAP’s Delhi Chief Minister Arvind Kejriwal. Star campaigners taking flights to Goa include Prime Minister Narendra Modi, BJP National President Amit Shah, Shiv Sena’s Uddhav Thackeray, Congress Vice-President Rahul Gandhi, MP Sachin Pilot, AAP’s Delhi Chief Minister Arvind Kejriwal.\nBesides making their presence felt through door-to-door campaigning and corner meetings, candidates are also depending on party bigwigs to garner votes. Leading the pack of BJP heavyweights is Modi, whose rally is tentatively scheduled in Panjim on January 28. The party has always bragged of the Goa connection with major developments in Modi’s political career graph right from being anointed as PM candidate during a BJP conclave in 2013 in Goa. Besides making their presence felt through door-to-door campaigning and corner meetings, candidates are also depending on party bigwigs to garner votes. Leading the pack of BJP heavyweights is Modi, whose rally is tentatively scheduled in Panjim on January 28. The party has always bragged of the Goa connection with major developments in Modi’s political career graph right from being anointed as PM candidate during a BJP conclave in 2013 in Goa.\nBJP MP Narendra Sawaikar confirmed that Union Ministers Rajnath Singh, Smriti Irani, Nitin Gadkari and Venkaiah Naidu, besides Maharashtra Chief Minister Devendra Fadnavis will hold rallies across different constituencies. BJP MP Narendra Sawaikar confirmed that Union Ministers Rajnath Singh, Smriti Irani, Nitin Gadkari and Venkaiah Naidu, besides Maharashtra Chief Minister Devendra Fadnavis will hold rallies across different constituencies.\nWhile the ruling party highlights its achievements, the Opposition is out to expose the U-turns of the government. While the ruling party highlights its achievements, the Opposition is out to expose the U-turns of the government.\nAICC Vice-President Gandhi and Sachin Pilot and Jyotiraditya Scindia will be seen boosting the morale of Congress candidates. Party sources said AICC President Sonia Gandhi is likely to visit Goa if her health permits. “She was unwell in the recent past. If her health permits, she will hold a rally in Punjab and fly to Goa later,” a source said. AICC Vice-President Gandhi and Sachin Pilot and Jyotiraditya Scindia will be seen boosting the morale of Congress candidates. Party sources said AICC President Sonia Gandhi is likely to visit Goa if her health permits. “She was unwell in the recent past. If her health permits, she will hold a rally in Punjab and fly to Goa later,” a source said.\nWith AAP carrying out ‘Zhaadu Yatra’ in a bid to attract people’s attention, Delhi Chief Minister and AAP Convener Arvind Kejriwal is likely to address another public gathering this month-end. During his visits to the State in the past few weeks, Kejriwal addressed public meetings at Benaulim, Vasco, Mapusa and Sanquelim and earlier a rally in Cuncolim on December 19, 2016. With AAP carrying out ‘Zhaadu Yatra’ in a bid to attract people’s attention, Delhi Chief Minister and AAP Convener Arvind Kejriwal is likely to address another public gathering this month-end. During his visits to the State in the past few weeks, Kejriwal addressed public meetings at Benaulim, Vasco, Mapusa and Sanquelim and earlier a rally in Cuncolim on December 19, 2016.\nShiv Sena, which is contesting the polls in alliance with MGP and Goa Suraksha Manch, will have Uddhav Thackeray and son Aditya campaigning. Shiv Sena, which is contesting the polls in alliance with MGP and Goa Suraksha Manch, will have Uddhav Thackeray and son Aditya campaigning.", "url": "http://www.heraldgoa.in/Goa/Star-power-to-fire-up-poll-campaign/110632.html", "label": 1}