{"authors": ["Raj Shankar"], "date_download": "2019-03-27 14:18:22", "date_modify": "2019-03-27 14:18:22", "date_publish": "2018-05-19 06:27:26", "description": "It was a day of political kite-flying and the rumour mills in IT city were in overdrive, spurred by mother of all jet fuels — claims, counter claims,", "filename": "headlines_karnataka-electio_c08698e8fe4084f4a7b01256b6e162d9_1279266_1553696302.html", "image_url": "https://www.freepressjournal.in/wp-content/uploads/2018/05/PTI5_18_2018_000077B-675x450.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/freepressjournal.in/headlines_karnataka-electio_c08698e8fe4084f4a7b01256b6e162d9_1279266_1553696302.html", "title": "Karnataka Elections 2018: BJP strategy is to induce abstention", "title_page": "Karnataka Elections 2018: BJP strategy is to induce abstention", "title_rss": "NULL", "source_domain": "freepressjournal.in", "text": "Bengaluru: It was a day of political kite-flying and the rumour mills in IT city were in overdrive, spurred by mother of all jet fuels — claims, counter claims, allegations of abduction and a ‘bribe’ audio tape. Among all these imponderables, there will be a throw of dice with the numbers clearly stacked against the BJP.\nIn the heightened sense of uncertainty, one things is for sure – this weekend is going to witness a political drama, a thriller in which fair can be foul and foul fair. But the most controversial move, which muddied the waters, came in the evening with Governor Vajubhai Vala appointing 3-term BJP MLA K G Bopaiah as the pro tem speaker. Convention has it that the senior-most MLA should be the pro tem speaker — in the current situation, RV Deshpande, an 8-term lawmaker and former minister from the Congress.\nThe pro tem speaker can play a crucial role in the way the trust vote is conducted. He can interpret the rule books the way he thinks is right. And the rule book have many grey areas. The BJP strategy is not to provoke defections but to secure abstentions – by convincing MLAs to either refrain from voting, or steering them away from the Assembly. If the BJP gets Opposition lawmakers to abstain from voting, it brings down the effective strength of the house and the majority mark; the majority is decided on the basis of those present and voting, not the strength of the house. The other option is to get the Congress-JDS lawmakers to defy the party whip and vote in its favour.\nBut the problem here is that cross-voting comes under the ambit of Anti-Defection Law, and will be challenged by the Cong-JD-S combine. Incidentally, the Supreme Court reportedly turned down the attorney general’s request for a secret ballot, so we will know who has backed whom. However, when the final court order came out, there was no mention of the method of voting. As per rules, it is the speaker, not the courts, who will decide on the method of voting.\nHence, Bopaiah, if he continues to be the pro tem speaker, can decide if the voting is to be held by secret ballot. Moreover, if a member seeks division, the speaker is bound to call for secret voting. That’s what the BJP wants as there is a possibility of Congress-JD(S) MLAs either abstaining or cross-voting. Strictly speaking, the BJP is eight short of the majority mark of 111 (it won 104 seats but one of its lawmakers has been picked as Pro Tem Speaker for Friday, who can cast a vote only if there is a tie). The Congress and the Janata Dal Secular of HD Deve Gowda have 115 lawmakers.\nAway from the noise and din, a dispassionate view is that the BJP does not have the numbers, the Congress-JD(S) combine has. Will Yeddyurappa end up as a 2-day Chief Minister? But in politics, especially in a state like ‘Kar-nataka’, anything can happen. If the BJP fails to make it, Yeddyurappa has to resign and the Governor will invite the other group to prove their majority.\n12 MLAs ARE IN TOUCH: BJP: On the ground, the Congress and the JD(S) whisked away their MLAs by bus late Thursday night to Hyderabad. But after the Supreme Court ordered the trust vote for Friday, the Congress made arrangements to bring them back. They have reportedly left Kurnool for Bengaluru in cars. The BJP claimed that 12 Congress MLAs and 8 JD(S) MLAs “are in touch” and that they will not vote for the Congress-JD(S) combine. But who these MLAs are was not clear.\nThe BJP also alleged that the Congress-JD(S) MLAs had been ‘‘kidnapped, brainwashed, mentally tortured and kept in isolation”. The Congress retaliated by putting out live pictures of 77 of the 78 MLAs having coffee in Hyderabad. The missing MLA was Anand Singh, a one-time BJP supporter and mining baron who switched sides to the Congress before elections. He is likely to sail with the BJP. JD(S) Karnataka CM candidate HD Kumaraswamy has said that the BJP had “hijacked” two of his MLAs. “But I’m certain they will come back,” he said.", "url": "https://www.freepressjournal.in/headlines/karnataka-elections-2018-bjp-strategy-is-to-induce-abstention/1279266", "label": 1}