{"authors": [], "date_download": "2019-03-27 14:35:42", "date_modify": "2019-03-27 14:35:42", "date_publish": "2017-10-24 14:08:10", "description": "Erratic rainfall, temperature and humidity patterns, rapid urbanisation, increased travel and poor vector-control create new dengue hotspots every year.", "filename": "health_going-viral-dengue-widens-grip-across-india_story-qT4y5zXLzPtcSW6xOptKGO_1553697342.html", "image_url": "https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2017/10/24/Pictures/diseases-municipal-worker-fumigates-prevent-dengue-mosquito_847232d8-b893-11e7-83cc-689513d74e1b.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/hindustantimes.com/health_going-viral-dengue-widens-grip-across-india_story-qT4y5zXLzPtcSW6xOptKGO_1553697342.html", "title": "Going viral: How dengue has widened its grip across India", "title_page": "Going viral: How dengue has widened its grip across India | health | Hindustan Times", "title_rss": "NULL", "source_domain": "hindustantimes.com", "text": "Dengue outbreaks in Delhi and Maharashtra make national headlines but this season its Kerala, Karnataka, Tamil Nadu and West Bengal that are grappling with the mosquito-borne infection that sickens and sometimes kills.\nThree states -- Kerala, Karnataka and Tamil Nadu – account for more than half of India’s 87,018 confirmed dengue cases and 151 deaths, national data collated till October 15 shows.\nThough the Centre lists West Bengal as a distant fourth with 5,389 cases and 13 deaths, a surge in new infections and deaths over the past two weeks has led to protests in Kolkata’s streets against chief minister Mamata Banerjee, who is also the state health minister.\nLast week, Banerjee blamed garbage, private hospitals and path laboratories for spreading panic, while Kolkata municipal corporation’s chief vector-control officer Debasish Biswas said dengue deaths were the result of “pre-existing conditions”.\nThey got it wrong.\nThe Aedes aegypti that spreads the viral fever breeds in fresh water and dengue infections aggravate pre-existing conditions, leading to complications and multi-organ failure.\n“By the end of this week, we may get a very different picture from Kolkata,” said Dr KK Aggarwal, president, Indian Medical Association.\nSince people get symptoms four-10 days after getting bitten by an infected mosquito, the outbreak is likely to have started during the October festivities.\n“In well-lit areas, the ‘day-biting’ Aedes aegypti also bites at night. Yet the government’s awareness campaigns and messaging remains outdated, so people don’t use protection,” said Dr Aggarwal.\nGoing viral\nDengue is a viral infection that causes severe joint pain, nausea, abdominal cramps, fever lasting several days, and in some cases, bleeding from the gums, nose or ears, and rashes. It has no cure but most people recover with symptomatic treatment for fever and pain.\nIn severe cases, people develop haemorrhagic fever, which may cause death from shock and multi-organ failure.\nBefore 1970, only nine countries experienced severe dengue outbreaks but by 2016, it spread across the tropics, putting more than 3.5 billion people are at risk of infection. Around 390 million people in more than 100 countries get infected with dengue each year, estimates the World Health Organisation.\nOver the past 50 years, variations in rainfall, temperature and relative humidity, rapid urbanisation, rising population, increased travel and poor vector-control in urban areas have increased the infection 30-fold.\n“The Aedes aegypti mosquito is a ‘synanthropic’ species – much like house flies and cockroaches -- that benefit from artificial habitats created where people live,” said Dr Veena Valecha, director, India’s National Institute of Malaria Research. Since Aedes aegypti breeds in fresh water collected in hard surfaces, such as containers and pots, it is found in and around homes.\n“This partly explains why more cases are reported from densely populated urban areas unlike malaria, which causes disease near fields and forests, too, because the anopheles mosquito breeds in freshwater ponds as well,” said Dr Valecha.\nEarly management of symptoms prevents complications. Among states with recorded deaths, Karnataka has more than 13,200 cases and five deaths, which makes the death rate a low 0.037%. Uttar Pradesh has India’s highest death rate of 1.26%, with 1,903 cases and 24 deaths.\n“Of the four dengue serotypes, DEN-2 and DEN-4 are more virulent and cause severe disease. This year, DEN-3 is causing infection in India, which leads to fewer hospitalisations,” said Dr Aggarwal.\nSince DEN-3 was also the dominant strain last year, many people developed “herd immunity” against it and fewer people needed hospitalisation.\n“After recovery, cross immunity to the other serotypes is partial and temporary, so if a person gets subsequent infections by other serotypes, the risk of developing severe dengue is higher,” warned Dr Aggarwal.\nUnderreporting, underdiagnosis\nDengue hit India the hardest in 2016, when close to 130,000 cases and 245 deaths were reported. For the first time, every state reported cases of the viral fever, National Vector Borne Disease Control Programme data shows.\nAs in the past, more cases and deaths this year are in the states with better public health infrastructure than the underserved states, raising fears of underdiagnosis and under-reporting.\nBihar, for example, has reported 845 cases and no deaths, and populated Madhya Pradesh has 1,027 cases and five deaths.\nInternational studies have alleged under-reporting happens at an unprecedented scale in India. A Sanofi Pasteur-funded study in the American Journal of Tropical Medicine and Hygiene said India had nearly six million annual clinically-diagnosed dengue cases between 2006 and 2012, which is about 282 times higher than the officially reported data by the health ministry. Sanofi Pasteur’s dengue vaccine, Dengvaxia, is awaiting regulatory approval in India.\nThe discrepancies are possible and often not intentional. “Often, people get treated symptomatically and don’t get tested. Also, testing is more complicated than, say malaria, which can be tested in the field using a simple rapid test,” said Dr Valecha.\nAnother hurdle is that IgM and IgG rapid card tests for dengue sometimes throw up false negative results. A positive IgG but a low or negative IgM, for example, indicates past dengue infection and can be misread by a less informed physician.\nThe confirmatory NS1 Elisa-based antigen test is expensive and costs between Rs 2,000 and Rs 3,000 in private clinics. “Dengue has no cure and since the treatment is symptomatic, many people say no to tests, adding to underdiagnosis and under-reporting,” Dr Valecha said.\n“Erratic rainfall, temperature and relative humidity patterns are changing epidemiological patterns, and unless real-time tracking is improved, new infection hotspots will keep appearing every year,” Dr Aggarwal said.\nFirst Published: Oct 24, 2017 14:08 IST", "url": "https://www.hindustantimes.com/health/going-viral-dengue-widens-grip-across-india/story-qT4y5zXLzPtcSW6xOptKGO.html", "label": 1}