{"authors": ["The Citizen Bureau"], "date_download": "2019-03-27 14:40:38", "date_modify": "2019-03-27 14:40:38", "date_publish": null, "description": "NEW DELHI: 70 persons have died lining up to exchange their own money, for hours if not days, across the country. An agitated and united Opposition st", "filename": "index.php_en_NewsDetail_index_1_9246_Demonetisation-Kills-70-Opposition-Stalls-Parliament-for-Condolence-ReferenceArvind-Kejriwals-Popularity-Soars_1553697638.html", "image_url": "https://www.thecitizen.in//NewsImages/360886mamata3.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/thecitizen.in/index.php_en_NewsDetail_index_1_9246_Demonetisation-Kills-70-Opposition-Stalls-Parliament-for-Condolence-ReferenceArvind-Kejriwals-Popularity-Soars_1553697638.html", "title": "Opposition Stalls Parliament for Condolence Reference,Arvind Kejriwal's Popularity Soars", "title_page": "Demonetisation Kills 70: Opposition Stalls Parliament for Condolence Reference,Arvind Kejriwal's Popularity Soars", "title_rss": "NULL", "source_domain": "thecitizen.in", "text": "NEW DELHI: 70 persons have died lining up to exchange their own money, for hours if not days, across the country. An agitated and united Opposition stalled Parliament, shouting slogans in the well of the House as the ruling party refused to even consider their demand for a condolence reference to the dead in the Rajya Sabha, and an explanation about the demonetisation chaos by Prime Minister Narendra Modi in the Lok Sabha.\nBoth Houses of Parliament were repeatedly adjourned, with Opposition members raising slogans against the government for creating a chaos that has already claimed 70 lives. The treasury benches insisted that the figure was not correct, with Finance Minister Arun Jaitley maintaining that a discussion on demonetisation was already underway, and by raising this new demand for a condolence reference, the Opposition was running away from the debate.\nOutside Parliament West Bengal Chief Minister Mamata Banerjee, Bahujan Samaj party leader Mayawati and Congress leader Rahul Gandhi have been particularly active in raising the issue respectively, by a march to Rashtrapati Bhawan, strong attack on PM Modi as being ‘pro rich’, and queuing up outside ATMs with the ordinary folk in solidarity.\nBut it seems to be Delhi Chief Minister Arvind Kejriwal who has attracted the eyeballs on the social media, with his tweets attracting a volume of new ‘followers’. A speech by him has had 48,02,000 views, a record in itself for any politician.\nKejriwal has been dominating the anti-demonetisation campaign in Delhi, using the media, the social media and the streets in an offensive that seems to be having a major impact. Most in busting the BJP campaign that the demonetisation would lead to an end to corruption, with the tenements now questioning this openly. At the start of the drive most people in the queues insisted that while they were suffering, they were sure it would end black money. This sentiment has been diluted after the Opposition campaign with the “all these black money walas are getting away, it is the poor who is suffering” argument.\nLook at the series of tweets by Kejriwal in just the last 254 hours, all with thousands of shares and likes:\n-(Translated from Hindi) “BJP says it is a party of Hindus. But in banning the notes BJP has not spared the Hindus even. It has destroyed the Hindus as well.”\n-(Translated from Hindi) “It seems Modiji is bent on taking everyones life.”\n-(Translated from Hindi) “Modiji see this. Now at least have some compassion for the people of this country. After all why this enmity with the janta? Don’t take so much ill will from the poor.\n-(Translated from Hindi) Notebandi has increased PayTM business dramatically. Modiji gave an advertistement for PayTM. Modiji should tell us what is the link between him and PayTM\n- And finally the slogan just a short while ago Note nahi, PM Badlo\nKejriwal does not mince words, says it as he clearly thinks it, and despite the virtual assault on the Delhi government’s powers by Lt Governor Najeeb Jung has remained on the frontlines of dissent as and when required. He has this easy style that makes him appear even more accessible than he is, and takes on the Prime Minister directly. On demonetisation, he went on to the streets holding a big meeting with Mamata Banerjee in Delhi at the Azad market, and has been giving sound bytes, social media tweets on a regular basis on this issue. Judging from the response to him, that has been growing, he has clearly tapped into a sentiment that works for the common citizen.\nBihar Chief Minister Nitish Kumar became the rare exception to support Prime Minister Narendra Modi for riding “the tiger” in his words. He supported the demonetisation, although leaders of his own party like Sharad Yadav had been vocal in their criticism in Parliament. It is not clear thus, what these differences will have on the ruling conglomerate in Bihar but for the moment Kumar remains with the PM.\nThis is sharp contrast to the BJP’s own allies in government like the Shiv Sena that has been completely opposed to the move, and joined West Bengal Chief Minister Mamata Banerjee in marching to the President Pranab Mukherjee in protest. The Shiv Sena has been tearing into the government on this issue from the first day.\nSignificantly, Telugu Desam chief and ally in government Chandrababu Naidu who had been enthusiastic initially sounds worried now. He said that he had not expected the chaos to last for so long, and that the entire process had been very badly managed.\nCongress leader Rahul Gandhi joined a ATM queue for the third time, today early in the morning, to share the problems being faced by the people. He has been leading the campaign for the otherwise status quoist party on this issue, with the younger MPs now taking over gradually. An indication of this was the fact that his colleague Jyotiraditya Scindia addressed the media in Parliament house today on this and other issues.\nPM Modi, however, remains adamant. The Opposition is demanding he speak to them about the deaths and the difficulties caused to the common man. So far there has not been a positive response from the government on this.", "url": "https://www.thecitizen.in/index.php/en/NewsDetail/index/1/9246/Demonetisation-Kills-70-Opposition-Stalls-Parliament-for-Condolence-ReferenceArvind-Kejriwals-Popularity-Soars", "label": 1}