{"authors": ["The Citizen Bureau"], "date_download": "2019-03-27 14:40:46", "date_modify": "2019-03-27 14:40:46", "date_publish": null, "description": "NEW DELHI: The Jharkhand government has issued a notice to award winning writer Hansda Sowvendra Shekhar for an article written for the Indian Express", "filename": "index.php_en_NewsDetail_index_2_8033_The-Adivasi-Will-Not-Dance-Writer-Gets-_1553697646.html", "image_url": "https://www.thecitizen.in//NewsImages/074324hhh.PNG", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/thecitizen.in/index.php_en_NewsDetail_index_2_8033_The-Adivasi-Will-Not-Dance-Writer-Gets-_1553697646.html", "title": "Writer Gets Notice from Jharkhand Govt for Article Questioning Domicile Policy", "title_page": "The Adivasi Will Not Dance: Writer Gets Notice from Jharkhand Govt for Article Questioning Domicile Policy", "title_rss": "NULL", "source_domain": "thecitizen.in", "text": "NEW DELHI: The Jharkhand government has issued a notice to award winning writer Hansda Sowvendra Shekhar for an article written for the Indian Express seeking an explanation whether his views “amounted to violation of service rules.” Shekhar is a government doctor and a Sahitya Akademi-winning novelist.\nThis has brought several writers, poets and filmmakers together to issue a statement criticising the decision.\nA statement issued by the Indian Writers Forum in protest states:\nThe award winning writer, Hansda Sowvendra Shekhar, has given us insights into the conditions of Adivasi life, both as a medical officer posted at the additional public health centre in Beldanga block of Pakur district in Jharkhand, and as a questioning, truth-telling creative writer.\nWe are distressed to hear from the media that the Jharkhand government has issued a notice to Hansda Sowvendra Shekhar “seeking an explanation on whether his article on the state’s domicile policy, written for the Indian Express, amounted to violation of service rules”. Titled “The Adivasi will not dance”, the piece written by Shekhar appeared on May 14, 2016 and took a critical look at the domicile policy announced by the ruling BJP–led government in Jharkhand on April 7, 2016.\nWe are already reeling under the brutalisation of Adivasis in Chattisgarh. Are we now to countenance more insidious forms of hounding those who question policy?\nWe firmly believe that every writer, indeed every citizen, has the right to question Indian realities, whether they are matters of policy, atrocities against sections of the citizenry, or the deprived day-to-day lives of the Indian people. We call on all writers, and all Indian citizens of conscience, to condemn this attempt to silence Hansda Sowvendra Shekhar, and join him in saying, “Yes, the Adivasi will no longer dance to the tunes of a government that crushes questions.”\nThe signatories include Romila Thapar, K.Satchidanandan, Githa Hariharan, Ashok Vajpeyi, Nandita Das and others.\nThe article by Shekhar that questions the Jharkhands domicile policy for the Adivasis and has invited the state government’s ire reads:\nThere has been such a huge influx of non-Adivasi outsiders into Jharkhand that it is necessary to define who is an actual Jharkhandi and be given preference in education, jobs, etc. in the state. (Illustration: C R Sasikumar)\nOn Sunday, April 24, as Prime Minister Narendra Modi addressed a grand panchayati raj sammelan in Jamshedpur, Jharkhand Mukti Morcha (JMM) leaders Deepak Birua, ShashiBhushan Samad, Niral Purty, and Mangal Singh Bobonga were held in preventive custody, while another JMM leader Champai Soren was kept under house arrest. Reason: The BJP-led government in Jharkhand was apprehensive that these Adivasi leaders would interrupt Modi’s sabha by protesting against the new domicile policy introduced in Jharkhand on April 7.\nThe domicile policy in Jharkhand is a contentious issue. There has been such a huge influx of non-Adivasi outsiders into Jharkhand that it is necessary to define who is an actual Jharkhandi and be given preference in education, jobs, etc. in the state. Despite the enormity of the issue, every party that won office in Jharkhand steered clear of formulating a domicile policy. They learned from the experience of Babulal Marandi, the first chief minister of Jharkhand and, at one time, an influential Adivasi leader.\nIn November 2000, the BJP-led NDA government at the Centre created Jharkhand. To show that the BJP respects Adivasis, Marandi, then with the party, was made the chief minister. This chain of having only an Adivasi as the chief minister remained unbroken till 2014. Right from the inception of Jharkhand in 2000, the Adivasis have been demanding that the khatiyan (land records) of the year 1932 be made the reference point to determine who the actual residents of Jharkhand are. This is a legitimate demand. It is obvious that the Adivasis have been living in Jharkhand from before 1932 and would certainly have their names in the khatiyan of 1932. The best method to ensure that the Adivasis of Jharkhand get their due and the creation of the state is justified is to formulate the domicile policy of Jharkhand by keeping the 1932 khatiyan as a reference point.\nIn 2002, Marandi, a visionary with liberal views, asked for the khatiyan of 1964 to be used as a reference point to determine the domicile policy. This meant people who’ve lived or owned land in the region as per the land records of 1964 were to be considered residents of Jharkhand. Adivasi leaders could’ve supported Marandi to create a pro-Adivasi domicile policy. Unfortunately, self-centred and politically myopic Adivasi leaders did not support Marandi. Nor did they demand the 1932 khatiyan as earnestly as they’re doing now.\nThe non-Adivasis opposed Marandi’s proposed domicile policy. There were violent agitations all over Jharkhand over the issue. The reason was a large chunk of non-Adivasis had come to Jharkhand, mostly from Bihar, after 1964. Marandi’s domicile policy and his stand on the Tata Steel lease issue nearly ended his political career. His own party, the BJP, clearly a party for non-Adivasis and capitalists, disowned him. He was removed from the post of the chief minister and the BJP installed another “Adivasi” leader, Arjun Munda, as the new chief minister. Marandi quit the BJP and formed the Jharkhand Vikas Morcha (JVM). But he never could be the political force he was in his heyday in the BJP.\nAfter Marandi’s fall, every subsequent government in Jharkhand avoided formulating the domicile policy. All these governments have had Adivasi chief ministers — Munda, Shibu Soren, Madhu Koda, and Hemant Soren — but no one dared to announce a domicile policy. It was clear that though the state of Jharkhand was being led by an Adivasi, the politics of Jharkhand was not in the hands of the Adivasis. Business houses owned and run by non-Adivasis have such a manipulative presence in the politics of Jharkhand that they can topple governments and nullify laws that are not in their interest. So all Adivasi leaders realised their precarious position in their own homeland and pragmatically remained quiet.\nAfter the BJP won the general election in 2014, the non-Adivasi outsiders of Jharkhand demanded a non-Adivasi CM who could do “vikas”. Propelled by the thumping victory of the BJP at the Centre and its “sabka vikas” agenda — and because an Adivasi is, apparently, incapable of ensuring BJP-type vikas — the party chose a non-Adivasi, Raghubar Das, for the chief minister’s office. Adivasis in Jharkhand protested, but what could be done? Having an Adivasi CM was just a symbolic gesture, not written law.\nIronically, Das is not from Jharkhand but from Chhattisgarh. He migrated to Jharkhand (then Bihar) to work with Tata Steel. Das has stated that all people living in the state for the last 30 years or more would be considered residents of Jharkhand. By creating a vague timeline like “30 years” instead of adopting a more solid parameter like the khatiyan of 1932, Das has accommodated every non-Adivasi outsider including himself. If the khatiyan of 1932 is made valid and it is proved that Das is not a resident of Jharkhand, he would not be able to contest a vidhan sabha election anymore.\nThe major influx of non-Adivasi outsiders into Jharkhand happened quite recently. In the 1970s and 1980s when industries prospered, non-Adivasis from Bihar, Uttar Pradesh, West Bengal, Odisha, and elsewhere came to Jharkhand to work in the factories, bought property, and settled down. Today, the situation is such that an Adivasi student, despite having his family land registered in the 1932 khatiyan, wouldn’t be considered a resident of Jharkhand if he hasn’t passed his matriculation from a school in the state. On the other hand, any non-Adivasi student who has no roots in Jharkhand, would be considered a resident if he has passed matriculation from a school in Jharkhand. A popular joke on WhatsApp says passengers of every train and bus passing through Jharkhand would be considered residents of the state.\nThe BJP did separate Jharkhand from Bihar, but its intention in doing so is showing only now. The Adivasis, the real residents of Jharkhand, are being sidelined, while non-advisai outsiders are taking over the state. Munda said a few days ago that the present domicile policy is against the Adivasis. Did he really mean it? Because, by some design, every Adivasi leader in the BJP who could’ve challenged Das —like Munda — lost in the 2014 Vidhan Sabha elections and cleared the way for Das and the non-Adivasi lobby in the party. If Munda and all Adivasi MLAs of the BJP are against this domicile policy, can they be expected to withdraw support for the Das government?\nToday, the BJP has launched an anti-Adivasi domicile policy. Tomorrow, it might repeal the pro-Adivasi Chhotanagpur Tenancy Act and Santhal Pargana Tenancy Act to legitimise the act of non-Adivasis grabbing Adivasi lands in Jharkhand. So, this fight has to continue.”", "url": "https://www.thecitizen.in/index.php/en/NewsDetail/index/2/8033/The-Adivasi-Will-Not-Dance-Writer-Gets-", "label": 1}