{"authors": [], "date_download": "2019-03-27 14:28:59", "date_modify": "2019-03-27 14:28:59", "date_publish": "2017-08-08 20:56:07", "description": "Terming as \"shameful\" the alleged stalking of a young woman by the state BJP chief's son and his friend, opposition parties in Haryana today staged protests and demanded a probe by the CBI or by a sitting judge of the high court.", "filename": "india-news_chandigarh-stalk_79a952b0f13108c3c763b2f3aae5e214__1553696939.html", "image_url": "https://images.financialexpress.com/2017/08/vikas-bharala-759.jpg", "language": null, "localpath": "/home/raj/news-please-repo//data/2019/03/27/financialexpress.com/india-news_chandigarh-stalk_79a952b0f13108c3c763b2f3aae5e214__1553696939.html", "title": "Chandigarh stalking case: Opposition parties in Haryana hold protest, demand justice", "title_page": "Chandigarh stalking case: Opposition parties in Haryana hold protest, demand justice - The Financial Express", "title_rss": "NULL", "source_domain": "financialexpress.com", "text": "Vikas Barala, one of the suspects (Indian Express)\nTerming as “shameful” the alleged stalking of a young woman by the state BJP chief’s son and his friend, opposition parties in Haryana today staged protests and demanded a probe by the CBI or by a sitting judge of the high court. Opposition parties including the Indian National Lok Dal (INLD), the Congress and the CPI also accused the Chandigarh Police of working under the pressure of the ruling BJP. Protesting against the incident, members of Kundu Khap or caste council blocked Rohtak-Jind road in Rohtak district and demanded action against the accused according to law. “No action has been taken against the accused and we want strict action against them by the police,” said Jaibir Kundu, a protester in Rohtak. Alleging that the police was working under pressure from the BJP, the INLD demanded a probe by the CBI or by a sitting judge of the High Court into the alleged incident. “It is clear that the Chandigarh Police is acting under pressure of the BJP and attempt is being made to save the accused. Therefore, we demand a probe by the CBI or by a sitting judge of the high court,” Haryana INLD chief Ashok Arora said. The INLD women’s wing took out a march in protest against the incident and burnt the effigy of Haryana BJP chief Subhash Barala.\nThe party submitted a memorandum to Punjab Governor, who is also the Administrator of the Union Territory of Chandigarh, demanding a “fair probe” in the case. “In the memorandum to Punjab governor, we apprised him that attempts were being made to protect the son of an influential person by Chandigarh police by watering down the case. We told him that kidnapping charge should have been added,” Arora said. The victim has alleged that the accused followed her in their car for over five km, banged her car’s window pane, threatened her, rather such a serious thing should invite attempt to murder charge also, he told reporters here after submitting the memorandum. Claiming that till the time the Chandigarh police was not aware that the accused was Barala’s son, he said that they took immediate action and promptly registered a case, but once they came to know about him, they started acting under pressure and watering down the case. He also demanded the resignation of the Haryana BJP chief on moral grounds, “because till the time he continues to occupy the post, he can influence the case.” Arora, who met the woman’s father at his Panchkula home today, said his party will continue its protest till the time the woman gets justice.\nThe 29-year-old woman has taken a strong stand “otherwise we might have had another Nirbhaya-like case. She deserves to be honoured”, he added.\nThe Communist Party of India (CPI) activists held protest at Panchkula, near here, and demanded justice for the victim and exemplary punishment to the culprits in the case. Meanwhile, All India Mahila Congress (AIMC) chief Shoba Oza met Haryana Governor Kaptan Singh Solanki here. In a memorandum to the Haryana governor, the Mahila Congress said “the AIMC is deeply disturbed at the dilution of criminal charges against the politically influential culprits belonging to the ruling BJP. We are pained that the Chandigarh Police is trying to protect Subhash Barala’s son in the case”. The Chandigarh Police dropped serious criminal charges of harassment, attempt to kidnap and outrage the modesty of a woman without any judicial proceedings and due criminal investigation, it said. Condemning the stalking incident, the Mahila Congress workers also staged a protest. Later, addressing a press conference here, Oza said that the accused should be put behind the bars and sections like kidnapping should be added in the FIR.\n“Because if these people are not punished for their misdeeds, then such people will get encouraged and in this scenario our daughters would be really unsafe in this country. “Unfortunately, police are trying to hush up the matter under pressure, this is condemnable. If this daughter of ours does not get justice in this case, then women and girls in this country will lose their faith in the system,” she said. Oza also said that ‘Beti Bachao-Beti Padhao’ has been reduced to a mere slogan in Haryana. On the alleged attack on the women on social media, she said, “Attempts were being made to spread lies about her. We demand that all those involved should be booked for cyber crime.”\nMeanwhile, Kundu Khap blocked Rohtak-Jind road in Rohtak district of Haryana while seeking action against accused as per the law. Over 70 protesters belonging to Ritoli village in Rohtak blocked Rohtak-Jind road, and also warned if police fails to take action against the accused, then they would again resort to protest. Rohtak Deputy Superintendent of Police (DSP) Tahir Hussan said the protesters were demanding appropriate action in connection with Chandigarh woman stalking case. The protest remained peaceful, DSP said. Notably, father of victim, a senior IAS officer, belongs to Kundu clan. A Khap is a community representing a clan or a group of related clans. They are found mostly among Jat people of Haryana and western Uttar Pradesh. Subhash Barala’s son Vikas Barala (23) and Ashish Kumar (27) were arrested on Saturday for allegedly stalking the 29- year-old woman here. However, both were released later on bail as they were booked under bailable sections of the IPC and the Motor Vehicles Act.", "url": "https://www.financialexpress.com/india-news/chandigarh-stalking-case-opposition-parties-in-haryana-hold-protest-demand-justice/799579/", "label": 1}