{"authors": [], "date_download": "2019-03-27 14:18:34", "date_modify": "2019-03-27 14:18:34", "date_publish": "2018-06-19 19:28:09", "description": "The Left party members in Bengal have supported the union of four chief ministers rallying behind Delhi CM Arvind Kejriwal. CPM central committee member Sujan Chakraborty said attack on people rights' cannot be tolerated.", "filename": "india_cpm-backs-four-chief-ministers-rallying-behind-arvind-kejriwal-says-attack-on-democratic-rights-should-not-be-defended-4545011_1553696314.html", "image_url": "https://images.firstpost.com/wp-content/uploads/2018/06/Untitled-design-442.jpg", "language": null, "localpath": "/home/raj/news-please-repo//data/2019/03/27/firstpost.com/india_cpm-backs-four-chief-ministers-rallying-behind-arvind-kejriwal-says-attack-on-democratic-rights-should-not-be-defended-4545011_1553696314.html", "title": "CPM backs four chief ministers rallying behind Arvind Kejriwal, says attack on democratic rights' should not be defended", "title_page": "CPM backs four chief ministers rallying behind Arvind Kejriwal, says attack on democratic rights' should not be defended - Firstpost", "title_rss": "NULL", "source_domain": "firstpost.com", "text": "Kolkata: There was nothing wrong in Kerala chief minister Pinarayi Vijayan joining his West Bengal counterpart Mamata Banerjee to rally behind Delhi chief minister Arvind Kejriwal, CPM said on Tuesday. They further added \"attack on democratic rights\" should be defended at any cost.\nThe two chief ministers from opposing political camps — the CPM and the TMC — along with their Andhra Pradesh and Karnataka counterparts on Saturday extended support to Kejriwal, who has been protesting at the lieutenant governor's office in Delhi since 11 June demanding that the \"strike\" by IAS officers be called off.\n\"The Left is always consistent regarding its views and policies on democracy, secularism and federal polity. Any attack on people's rights must be defended at any cost. There is nothing wrong in four chief ministers rallying behind another the Delhi chief minister,\" CPM central committee member Sujan Chakraborty told PTI.\nAnother senior CPM leader said it would be unfair to draw any conclusion from the Delhi meeting of the chief ministers as the party had been consistent in its fight against the saffron party.\n\"We have a policy against the BJP. We have been the most consistent political party in India in terms of our fight against the BJP and the RSS,\" he said.\nAsked about the reaction of the CPM cadres to the meet, given the fact that the party had engaged in a slugfest with the TMC during the recent panchayat polls, Chakraborty said, \"It is true that we are fighting against the TMC in Bengal. But the situation in Delhi was different and whatever the Kerala chief minister did was in consultation with party leadership.\"\nMeanwhile, TMC secretary-general Partha Chatterjee alleged that Kejriwal has been \"victimised\" by the BJP.\n\"Our party supremo Mamata Banerjee has been fighting against the BJP and its policies. We feel all opposition forces should unite to counter the BJP,\" he said.\nFirstpost is now on WhatsApp. For the latest analysis, commentary and news updates, sign up for our WhatsApp services. Just go to Firstpost.com/Whatsapp and hit the Subscribe button.", "url": "https://www.firstpost.com/india/cpm-backs-four-chief-ministers-rallying-behind-arvind-kejriwal-says-attack-on-democratic-rights-should-not-be-defended-4545011.html", "label": 1}