{"authors": [], "date_download": "2019-03-27 14:40:29", "date_modify": "2019-03-27 14:40:29", "date_publish": "2017-05-06 00:00:00", "description": "In an effort to give fresh impetus to PM Modi's Swachhta Abhiyaan or cleanliness drive, CM Yogi Adityanath visited Lucknow's Balu Adda Malin Basti along with his cabinet ministers on Saturday morning and cleaned the streets.", "filename": "india-news_swachhta-abhiyaan-up-cm-yogi-adityanath-wields-broom-to-clean-up-lucknow-after-swachh-survekshan-2017-article-170519_1553697629.html", "image_url": "https://cdn6.newsnation.in/images/2017/05/06/696759374-yogiadityanath_6.JPG", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/newsnation.in/india-news_swachhta-abhiyaan-up-cm-yogi-adityanath-wields-broom-to-clean-up-lucknow-after-swachh-survekshan-2017-article-170519_1553697629.html", "title": "Swachhta Abhiyaan: UP CM Yogi Adityanath wields broom to clean up Lucknow after Swachh Survekshan-2017", "title_page": "Swachhta Abhiyaan: UP CM Yogi Adityanath wields broom to clean up Lucknow after Swachh Survekshan-2017 - www.newsnation.in", "title_rss": "NULL", "source_domain": "newsnation.in", "text": "Uttar Pradesh chief minister Yogi Adityanath on Saturday took the broom in his own hands to clean up the streets of Lucknow's Balu Adda Malin Basti.\nIn an effort to give fresh impetus to PM Modi's Swachhta Abhiyaan or cleanliness drive, CM Yogi Adityanath visited the Balu Adda Malin Basti along with his cabinet ministers on Saturday morning and cleaned the streets.\nThe central government on Thursday announced results of the ‘Swachh Survekshan-2017’ and several districts of Uttar Pradesh performed very poorly in it.\nRead | PM Modi’s Varanasi ranks 32 in Swachh Survey 2017, here is full list of rankings\nPrime Minister Narendra Modi’s home constituency, Varanasi, was ranked at no 32 with Indore being the cleanest city of India and Gonda the dirtiest.\nApart from Varanasi, UP CM Yogi Adityanath’s home turf Gorakhpur also performed poorly and ranked 314 in the list.\nThe survey was carried out by the Quality Council of India, which had deployed 421 assessors for on the spot assessment of 17,500 locations in 434 cities and towns.\nRead | Yogi Adityanath: 'We have to work a lot for development of UP'", "url": "http://www.newsnation.in/india-news/swachhta-abhiyaan-up-cm-yogi-adityanath-wields-broom-to-clean-up-lucknow-after-swachh-survekshan-2017-article-170519.html", "label": 1}