{"authors": [], "date_download": "2019-03-27 14:25:43", "date_modify": "2019-03-27 14:25:43", "date_publish": "2019-01-07 00:00:00", "description": "Smriti Irani slams breakdown of law & order in Kerala - Union Minister says neither common man, nor an RS MP are safe in state", "filename": "india_report-smriti-irani-slams-breakdown-of-law-order-in-kerala-2705050_1553696743.html", "image_url": "https://cdn.dnaindia.com/sites/default/files/styles/full/public/2019/01/07/774945-irani-smriti-pti-010719.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/dnaindia.com/india_report-smriti-irani-slams-breakdown-of-law-order-in-kerala-2705050_1553696743.html", "title": "Smriti Irani slams breakdown of law & order in Kerala", "title_page": "Smriti Irani slams breakdown of law & order in Kerala", "title_rss": "NULL", "source_domain": "dnaindia.com", "text": "Following the incident of a crude bomb being hurled at the residence of BJP Rajya Sabha member and party's former Kerala unit president V Muraleedharan, the BJP on Sunday said there is a \"complete breakdown of law and order\" in the CPM-ruled Kerala.\nAddressing a press conference in New Delhi, Union Minister Smriti Irani condemned the attack on Muraleedharan's residence. \"Neither a common man nor a Member of Parliament is safe in Kerala,\" Irani said.\n\"There is a state of chaos and anarchy in Kerala. There is a complete breakdown of law and order,\" Irani said.\nThe Union Minister for Textiles said over 1,286 cases have been registered and over 37,000 people have been accused by the state police during the ongoing Sabarimala protests.\nThe BJP has backed protests after the Kerala government moved to implement a Supreme Court order, which lifted a ban on women of menstruating age entering the Ayyappa temple in Sabarimala.\nOn Sunday, the BJP staged a protest outside Kerala House in the national capital blaming CPM for violent attacks against its workers in Kerala.\nBJP sources said party MPs will also stage a protest near the Gandhi statue in the Parliament on Monday.\nViolence rocked parts of Kerala, particularly Kannur district, on Saturday with several houses and shops being attacked over the Sabarimala issue.\nKerala Governor P Sathasivam briefed Union Home Minister Rajnath Singh about the law and order situation in the state.", "url": "https://www.dnaindia.com/india/report-smriti-irani-slams-breakdown-of-law-order-in-kerala-2705050", "label": 1}