{"authors": [], "date_download": "2019-03-27 14:35:09", "date_modify": "2019-03-27 14:35:09", "date_publish": "2017-07-16 19:08:26", "description": "Tamil Nadu farmers are back in New Delhi with a march to the residence of Prime Minister Narendra Modi.", "filename": "india_story_tamil-nadu-farmers-are-back-new-delhi-narendra-modi-1024571-2017-07-16_1553697309.html", "image_url": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/201707/tn-farmers-ps-story_647_071617114954.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/indiatoday.in/india_story_tamil-nadu-farmers-are-back-new-delhi-narendra-modi-1024571-2017-07-16_1553697309.html", "title": "Tamil Nadu farmers are back in New Delhi, hold march to PM residence", "title_page": "Tamil Nadu farmers are back in New Delhi, hold march to PM residence - India News", "title_rss": "NULL", "source_domain": "indiatoday.in", "text": "Having attracted attention with their innovative ways to stage protest in New Delhi during March and April, the Tamil Nadu farmers are back in the national capital with their demands.\nAround 50 farmers from Tamil Nadu today staged protest in New Delhi holding a march from Nizamuddin railway station to Prime Minister Narendra Modi's residence on the Lok Kalyan Marg. The protesters held demonstration outside Prime Minister Narendra Modi's residence raising their demands.\nThe police detained the protesters and took them to the Parliament Street police station. The protesters have been demanding relief package from the Centre and waiver of farm loans. During their last phase of agitation, they unsuccessfully sought a meeting with Prime Minister Modi.\nTamil Nadu farmers at Parliament Street police station in New Delhi. (Photo: India Today) Tamil Nadu farmers at Parliament Street police station in New Delhi. (Photo: India Today)\nLast time around the same bunch of farmers had grabbed national headlines with their ways of protests. They protested with human skulls at the Jantar Mantar. On some other day, they shaved half their heads and beards, flogged themselves, stripped themselves outside the Prime Minister's Office and ate off the roads.\nSuspending their agitation in April after 40 days of protest, the farmers had said that they would be back in New Delhi on May 25. They are here now on July 16 holding demonstrations ahead of the Monsoon Session of Parliament scheduled to begin tomorrow.\nAmong the demands of the farmers are pension for farmers, higher profit margins and setting up of a Cauvery water management board.\nALSO READ |\nAfter 41 days, Tamil Nadu farmers suspend their agitation in Delhi till May 25\nWhy PM Narendra Modi did not meet protesting Tamil Nadu farmers\nALSO WATCH | Tamil Nadu farmers cut Mangalsutras to get PM's attention", "url": "https://www.indiatoday.in/india/story/tamil-nadu-farmers-are-back-new-delhi-narendra-modi-1024571-2017-07-16", "label": 1}