{"authors": [], "date_download": "2019-03-27 14:29:05", "date_modify": "2019-03-27 14:29:05", "date_publish": "2017-11-13 15:55:03", "description": "Uttar Pradesh police are a rejuvenated lot since the coronation of Yogi Adityanath, who has given them a free hand to target criminals and shoot them down.", "filename": "india_uttar-pradesh-polices-encounter-spree-raises-uncomfortable-questions-over-bypassing-legal-procedures-4207241_1553696945.html", "image_url": "https://images.firstpost.com/wp-content/uploads/2017/11/UTTAR-PRADESH-POLICE_AFP1.jpg", "language": null, "localpath": "/home/raj/news-please-repo//data/2019/03/27/firstpost.com/india_uttar-pradesh-polices-encounter-spree-raises-uncomfortable-questions-over-bypassing-legal-procedures-4207241_1553696945.html", "title": "Uttar Pradesh Police's encounter spree raises uncomfortable questions over bypassing legal procedures", "title_page": "Uttar Pradesh Police's encounter spree raises uncomfortable questions over bypassing legal procedures - Firstpost", "title_rss": "NULL", "source_domain": "firstpost.com", "text": "Lucknow: Uttar Pradesh police are a rejuvenated lot since the coronation of Chief Minister Yogi Adityanath, who has given them a free hand to target criminals and shoot them down, bypassing the process of law and courts. The cops are relishing this newfound freedom and are boasting on social media about the bullets they are pumping into criminals. Several tweets from Uttar Pradesh police officers elaborate the count of kills and captures over the last few months.\nThe equation was the other way around during the tenure of Akhilesh Yadav-led Samajwadi Party government, as policemen in the state were attacked 622 times. Even former Uttar Pradesh parliamentary affairs minister Mohammad Azam Khan had admitted in the state Assembly that police stations were attacked and ransacked and men in khaki were being targeted in different districts like Etawah, Auraiya and Lucknow.\nThe Uttar Police police, so far, has killed 23 and arrested 1,315 \"criminals\" in 528 encounters since 20 March. With 245 encounters, Meerut has witnessed the maximum action, according to the information provided by the DGP office. The Western Uttar Pradesh division of Meerut is considered a safe zone among criminals. As many as 122 policemen have also been injured during these encounters.\nAnother side of these rampant encounters came forth after Uttar Pradesh police killed alleged gangster Sumit Gurjar in Greater Noida on 3 October. The very next day, his family staged a protest in Noida against Uttar Pradesh police, claiming he was not an absconding criminal as police were making him out to be. They said he \"was killed in a fake encounter after being picked up from near his home on 30 September.\"\nThe police had earlier claimed that Gurjar and seven others were involved in a cash van robbery committed on 20 September. A reward of Rs 50,000 was announced on his arrest about a week before he was killed in \"retaliatory fire\". The National Human Rights Commission (NHRC), taking suo moto cognisance of the matter, sought an explanation from the chief secretary and the DGP, Uttar Pradesh, on 5 October. The Commission made it clear that it would be a violation of human rights if the encounter is proved to be fake.\nThe NHRC, in a press release, stated: \"Elimination of a criminal in such an unlawful manner can never send a good message to a civilised society. As has been emphasised time and again, the police do not have a right to take away the life of a human being. It is not the lawful way to deal with criminals.\"\nPrior to this episode, the Commonwealth Human Rights Initiative (CHRI) on 19 September, drew the attention of the Uttar Pradesh government to Supreme Court and NHRC guidelines, referring to the spate of \"encounter deaths\" of alleged criminals. \"While we recognise the criminal elements the police are up against, the police and political leadership must insist that all policing functions within the law. Without this, we lose the difference between the law and the outlaw,\" said Devika Prasad, coordinator, Police Reforms Programme, CHRI.\nIn 2014, the Supreme Court in People's Union for Civil Liberties (PUCL) versus the Government of Maharashtra, had issued a set of guidelines, which make it mandatory for a magistrate to investigate so-called encounter deaths to ensure that an independent and unbiased probe is conducted in such cases. The apex court also noted that the officers concerned must not be recommended for out-of-turn promotions or awards until their gallantry is established beyond doubt.\nWhile the Uttar Pradesh police are religiously following their chief minister's edict, a recent RTI application filed with the NHRC reveals that 455 cases of alleged fake encounters by the police have been registered with the Commission from Uttar Pradesh alone between 2005 and 30 September, 2017. The countrywide count of alleged fake encounter cases registered with the NHRC for the same period is at 1,241.\nAnother query under this RTI filed by LK Khurana of Meerut reveals that as many as 2,62,625 cases have been registered by the Commission against Uttar Pradesh police personnel in the aforementioned period.\nThe Uttar Pradesh police, however, seem to be content with their trigger-happy approach towards dacoits and burglars, which steals from these criminals a chance to spend time behind bars and correct their ways.\n\"All these encounters have been done in the interest of the society as per the instruction of the state government. Encounters happen, they are not planned. Our first priority is always to arrest the criminals. It is an aggressive and proactive approach towards the criminals who are spreading fear in the society,\" says additional director general for law and order, Uttar Pradesh, Anand Kumar. \"These encounters have jolted the criminals.\"\nThe method also seems to be finding a positive response from a large section of the public in the state. Parimal Dwivedi, a Lucknow-based human rights activist, says one must also consider the circumstances under which the police resort to killing.\n\"I do not promote the killings, but we should also consider the fact that the main reason behind these encounters is to establish fear among criminals in this state,\" he says.\nThe author is a Lucknow based freelance writer and a member of 101Reporters.com, a pan-India network of grassroots reporters.\nFirstpost is now on WhatsApp. For the latest analysis, commentary and news updates, sign up for our WhatsApp services. Just go to Firstpost.com/Whatsapp and hit the Subscribe button.", "url": "https://www.firstpost.com/india/uttar-pradesh-polices-encounter-spree-raises-uncomfortable-questions-over-bypassing-legal-procedures-4207241.html", "label": 1}