{"authors": [], "date_download": "2019-03-27 14:35:35", "date_modify": "2019-03-27 14:35:35", "date_publish": null, "description": "Sources have said that Adityanath will take a chopper to the West Bengal-Jharkhand border and then travel 20 kilometres by car to Purulia for his rally.", "filename": "india_article_mamata-banerj_4ff6008226d933b4363018c2aaf3742d_359887_1553697335.html", "image_url": "https://img.timesnownews.com/story/1549304817-mamatab.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/timesnownews.com/india_article_mamata-banerj_4ff6008226d933b4363018c2aaf3742d_359887_1553697335.html", "title": "West Bengal: Adityanath denied permission again; Shivraj Singh Chouhan, Shahnawaz Hussain face Didi’s brunt", "title_page": "West Bengal: Adityanath denied permission again; Shivraj Singh Chouhan, Shahnawaz Hussain face Didi’s brunt", "title_rss": "NULL", "source_domain": "timesnownews.com", "text": "West Bengal Chief Minister Mamata Banerjee. | File image\nKolkata: The ensuing political slugfest surrounding permission to Bharatiya Janata Party leaders to conduct rallies in Trinamool Congress bastion West Bengal in the run-up to the 2019 Lok Sabha elections continues to explode after Uttar Pradesh Chief Minister Yogi Adityanath was yet again denied permission to hold a gathering in the state.\nHowever, this time, two more BJP leaders — Syed Shahnawaz Hussain and former Madhya Pradesh chief minister Shivraj Singh Chouhan — have also been denied permission to hold rallies in the state.\nAdityanath addressed a public rally in Balurghat of South Dinajpur district in West Bengal via telephone on Sunday after the state administration allegedly denied permission for the landing of his chopper in Balurghat, where he was scheduled to address the rally.\nAlso read: Adityanath addresses West Bengal rally via telephone, rebukes Mamata\nEven as the Trinamool Congress government continues to face the ire of the BJP for denying permission to land Adityanath’s chopper in the state, two more rallies by the UP chief minister – Purulia and Bankura – were called off after the West Bengal government denied permission, sources have said.\nAdityanath was forced to call off the Bankura rally after he was not given the permission to land his chopper yet again. Sources have said that he will now take a chopper to the West Bengal-Jharkhand border and then travel 20 kilometres by car to Purulia for his rally. Also, since the permission was not given to land his chopper, the venue permission is also awaited.\nSources have also revealed that due to Adityanath’s Z+ category security, his office will take a final call on the rallies in the morning.\nMeanwhile, Chouhan, who was supposed to hold a rally in Kharagpur on February 6 has also got hiccups for similar reasons and his helicopter will land at Kalaikunda (defence airbase) as field permission has not yet been given.\nSimilarly, senior BJP leader Shahnawaz Hussain was also supposed to hold a rally in Murshidabad district’s Lalbagh area on February 5 but since his chopper was also denied permission, the event hangs by a thread.", "url": "https://www.timesnownews.com/india/article/mamata-banerjee-dharna-kolkata-protest-latest-news-update-cbi-raid-rajeev-kumar-west-bengal-police-yogi-adityanath-rally-denied-permission-again/359887", "label": 1}