{"authors": [], "date_download": "2019-03-27 14:29:04", "date_modify": "2019-03-27 14:29:04", "date_publish": "2016-06-27 00:00:00", "description": "A day after actor-politician Hema Malini was criticised for tweeting photos of a film shoot in Mumbai as violence ripped through her constituency, Mathura, she joined the BJP's protest march today against the alleged \"inaction\" by the Uttar Pradesh government.", "filename": "india-news_mathura-clashes-hema-malini-to-lead-bjp-protest-against-up-government-1415406_1553696944.html", "image_url": "https://i.ndtvimg.com/i/2016-06/hema-malini_650x400_51465034438.jpg", "language": null, "localpath": "/home/raj/news-please-repo//data/2019/03/27/ndtv.com/india-news_mathura-clashes-hema-malini-to-lead-bjp-protest-against-up-government-1415406_1553696944.html", "title": "Mathura Clashes: Day After Twitter Row, Hema Malini Joins BJP Protest", "title_page": "Mathura Clashes: Day After Twitter Row, Hema Malini Joins BJP Protest", "title_rss": "NULL", "source_domain": "ndtv.com", "text": "Actor-politician Hema Malini demanded CBI probe into Mathura clashes\nHighlights Mathura clashes left 24 people, including 2 cops, dead Cops were evicting thousands of members of a sect from a public park UP Chief Minister admitted cops weren't well prepared, promised a probe\nAfter massive clashes in Mathura, her constituency, Hema Malini had tweeted this photo of a film shoot.\n24 people including two policemen were killed in Mathura clashes\nMathura lawmaker met the family members of Mukul Dwivedi, Superintendent of Police.\nA day after actor-politician Hema Malini was criticised for tweeting photos of a film shoot in Mumbai as violence ripped through her constituency, Mathura, she joined the BJP's protest march today against the alleged \"inaction\" by the Uttar Pradesh government.She was stopped from entering violence-hit Jawahar Bagh area where 24 people died in clashes on Thursday. Police cited security reasons and ongoing combing operation for not giving permission.Demanding a CBI inquiry into the incident, Hema Malini said, \"I have been told that police was instructed not to fire at sect members. I don't want to blame anyone but inquiry should be done.\"She slammed the district administration for \"lapses\" and said there would not have been so much loss if the situation was handled properly.Earlier this morning, the BJP lawmaker had said, \" It's a state government's issue, why is everyone after me? Concentrating on the issue is more important than on my tweets at this point of time.\"\"UP government should've taken proper action to eradicate encroachment. Nearly, 3,000 people with weapons were there, wasn't the administration aware of it? They were aware, but couldn't handle,\" she said.24 people including two cops were killed when police in Mathura moved to evict thousands of members of a sect from a public park. Police said they were attacked with swords, knives, guns and grenades and then they had to open fire.The clearance operation was launched after authorities won a court order to remove hundreds of tents and makeshift wooden structures from a 260-acre plot occupied by the sect since late 2014. After the sect launched its massive attack, nearly 1,000 police men tried to regain control.The Mathura lawmaker also met the family members of Mukul Dwivedi, Superintendent of Police, who died in the clashes.Amid criticism of his government, Chief Minister Akhilesh Yadav had said yesterday he did not \"anticipate they (members of the sect who attacked cops) would be so well armed\".However, the chief minister pledged an impartial inquiry, and said \"a mistake has happened\" and that \"police was not well prepared\". Keshav Prasad Maurya , who heads the BJP in Uttar Pradesh, alleged that the cult enjoyed the patronage of the Chief Minister's uncle, Shivpal Yadav, who is a minister.\nGet the latest election news, live updates and election schedule for Lok Sabha Elections 2019 on ndtv.com/elections. Like us on Facebook or follow us on Twitter and Instagram for updates from each of the 543 parliamentary seats for the 2019 Indian general elections.", "url": "https://www.ndtv.com/india-news/mathura-clashes-hema-malini-to-lead-bjp-protest-against-up-government-1415406", "label": 1}