{"authors": [], "date_download": "2019-03-27 14:35:22", "date_modify": "2019-03-27 14:35:22", "date_publish": "2019-02-06 00:00:00", "description": "Three men were arrested in Assam's capital Dispur today after they staged a nude protest outside the Assam Secretariat against the Citizenship (Amendment) Bill.", "filename": "india-news_3-stage-nude-protest-outside-assam-secretariat-over-citizenship-bill-1986978_1553697322.html", "image_url": "https://c.ndtvimg.com/2019-02/6d67ivto_assam-nude-protest-650_625x300_01_February_19.jpg", "language": null, "localpath": "/home/raj/news-please-repo//data/2019/03/27/ndtv.com/india-news_3-stage-nude-protest-outside-assam-secretariat-over-citizenship-bill-1986978_1553697322.html", "title": "3 Arrested For Nude Protest Outside Assam Secretariat Over Citizenship Bill", "title_page": "3 Arrested For Nude Protest Outside Assam Secretariat Over Citizenship Bill", "title_rss": "NULL", "source_domain": "ndtv.com", "text": "The Citizenship Amendment Bill is being opposed all across the North East\nThree men were arrested in Assam's capital Dispur today after they staged a nude protest outside the Assam Secretariat against the Citizenship (Amendment) Bill.\nWhile one of them was completely naked, the other two had stripped down to their undergarments. The police contingent outside the secretariat immediately took them into custody.\nLast month, before the controversial bill was passed in the Lok Sabha, a group of Assamese youth had staged similar nude protests outside Parliament.\nMeanwhile, the ruling BJP in Assam today took out rallies in protests against the thrashing and manhandling of one of its district leader in Tinsukia earlier this week by anti-citizenship bill protesters. The BJP has now also decided to reach out to common people to explain why the party is going forward with the bill.\nAssam cabinet minister Himanta Biswa Sarma also claimed that the outlawed Independent faction of ULFA, led by Paresh Baruah, is behind the ongoing protests in the state.\n\"ULFA has a link to these protests. We are getting inputs. We are aware of whom all are receiving calls from ULFA and who are hatching these plans,\" Mr Sarma told reporters in Guwahati.\nThe Citizenship Amendment Bill that seeks to remove hurdles in eligible migrants from six minority groups from Bangladesh, Pakistan and Afghanistan from getting Indian citizenship is being strongly opposed across Northeast India. It has also been opposed by political parties including the Congress and Trinamool Congress.\nGet the latest election news, live updates and election schedule for Lok Sabha Elections 2019 on ndtv.com/elections. Like us on Facebook or follow us on Twitter and Instagram for updates from each of the 543 parliamentary seats for the 2019 Indian general elections.", "url": "https://www.ndtv.com/india-news/3-stage-nude-protest-outside-assam-secretariat-over-citizenship-bill-1986978", "label": 1}