{"authors": [], "date_download": "2019-03-27 14:35:08", "date_modify": "2019-03-27 14:35:08", "date_publish": "2017-03-23 08:30:55", "description": "The skulls are the remains of Tamil farmers who committed suicide due to severe drought in the state.", "filename": "india_drought-hit-farmers-tamil-nadu-protest-with-skulls-demanding-2382311_1553697308.html", "image_url": "https://www.oneindia.com/img/2017/03/skull1-23-1490237917.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/oneindia.com/india_drought-hit-farmers-tamil-nadu-protest-with-skulls-demanding-2382311_1553697308.html", "title": "Drought-hit farmers of Tamil Nadu protest with skulls demanding relief in Delhi", "title_page": "Drought-hit farmers of Tamil Nadu protest with skulls demanding relief in Delhi - Oneindia News", "title_rss": "NULL", "source_domain": "oneindia.com", "text": "Drought-hit farmers of Tamil Nadu protest with skulls demanding relief in Delhi\nIndia\noi-Oneindia\nBy Oneindia Staff Writer\nNew Delhi, March 23: Since March 14, a group of 80-odd farmers from Tamil Nadu are protesting at Jantar Mantar in Delhi demanding financial relief as they have lost their crops and savings in the ongoing drought in the state. The peaceful agitation has brought a lot of attention as the farmers are protesting with skulls.\nThe skulls are the remains of Tamil farmers who committed suicide due to severe drought in the state, say protesters. There are at least eight skulls at the protest site, reminding onlookers how drought forced several farmers in Tamil Nadu to commit suicide as they failed to pay back their loans taken from the banks and private money lenders.\nAccording to an estimate, the crisis in the agriculture sector in Tamil Nadu has reached a mammoth proportion. Since October last year, every day, two farmers are committing suicide in the state, say reports.\nThe protesters clad in green dhotis and white shirts look distraught and tired as their agitation is continuing for the last 10 days. But they are adamant to sit in dharna till all their demands are met by the Centre.\nSpeaking to reporters, an elderly farmer said, \"Our main demand is financial relief. We also want our loans to be waived off as we have lost all our crops and savings in the drought.\"\n\"We are going to continue the protest indefinitely until the Centre fulfils all our demands. The state government has sought Rs 39,565 crore as drought relief from the National Disaster Response Fund. But the central team has recommended a paltry sum of Rs 2,096.80 crore as drought relief. It is grossly inadequate. The state has witnessed an unprecedented drought in the last 150 years and the whole state has been declared drought-hit,\" South Indian Rivers Inter-Linking Farmers Association president P Ayyakannu who is leading the protest, told DNA.\nOneIndia News", "url": "https://www.oneindia.com/india/drought-hit-farmers-tamil-nadu-protest-with-skulls-demanding-2382311.html", "label": 1}