{"authors": ["Fe Online"], "date_download": "2019-03-27 14:35:13", "date_modify": "2019-03-27 14:35:13", "date_publish": "2016-08-18 17:15:52", "description": "Assembly speaker P Dhanapal had suspended all DMK MLAs for a period of one week for continuous disruption of house proceedings on Wednesday. Senior party leader MK Stalin was forcefully evicted from the house.", "filename": "india-news_dmk-mlas-protest_5f49797bf9f295291dd79d2d0b191e9b__1553697313.html", "image_url": "https://images.financialexpress.com/2016/08/stalin-evicted-ie-s.jpg", "language": null, "localpath": "/home/raj/news-please-repo//data/2019/03/27/financialexpress.com/india-news_dmk-mlas-protest_5f49797bf9f295291dd79d2d0b191e9b__1553697313.html", "title": "Suspended DMK MLAs protest outside Tamil Nadu Assembly", "title_page": "Suspended DMK MLAs protest outside Tamil Nadu Assembly - The Financial Express", "title_rss": "NULL", "source_domain": "financialexpress.com", "text": "Senior party leader MK Stalin was forcefully evicted from the house. (Source:IE)\nThe 89 DMK MLAs today staged a protest against their suspension outside the Tamil Nadu Legislative Assembly in Chennai. Assembly speaker P Dhanapal had suspended all DMK MLAs for a period of one week for continuous disruption of house proceedings on Wednesday. Senior party leader MK Stalin was forcefully evicted from the house. The party members were protesting against remarks made by the ruling AIADMK member S Gunasekaran who allegedly attempted to mock Stalin by commenting on his ‘Namaku Naame’ (mass contact programme) tour ahead of the assembly elections in May.\nDuring the mentioned programme, Stalin had extensively toured the state and interacted with people. The remarks triggered strong objection from the DMK members, leading to a ruckus. The conflict erupted during an on-going debate on demands for grants for the Housing and IT departments. However, the speaker rejected demands of expunging the remarks saying that the MLA did not mention the name of the opposition leader.” The MLA did not make any reference to anyone while making the comment”, said the speaker in rejection. Speaker later said he had to resort to such an action as the DMK members did not cooperate in proper conduct of the house.\nAfter the eviction, Leader of the House and Finance Minister O Panneerselvam moved a resolution for suspension of all DMK members for a period of seven days, which was passed by a voice vote in the AIADMK-dominated House. Opposition DMK has 89 members in the 234-member assembly. Speaking to media outside the House, Stalin said that the eviction and suspension of the DMK MLAs was a planned action by the ruling AIADMK. He said that the eviction was orchestrated as the government wants to prevent opposition from raising issues during the demand for debate for grants to the CM Jayalalithaa led Home Department.\nSlamming the move, DMK said that opposition member should be treated with respect and decorum in the house. “Opposition members need to be treated with respect and decorum, these are people’s elected representatives, said DMK spokesperson Manu Raj Sundaram.", "url": "https://www.financialexpress.com/india-news/dmk-mlas-protest-suspension-aiadmk-mk-stalin-tamil-nadu-assembly-jayalalithaa/350970/", "label": 1}