{"authors": [], "date_download": "2019-03-27 14:40:42", "date_modify": "2019-03-27 14:40:42", "date_publish": "2017-12-29 22:13:00", "description": null, "filename": "india_all-india_291217_year-ender-2017-political-dissent-seeks-new-heights-as-popular-leaders-go-anti-party_1553697642.html", "image_url": "https://s3.ap-southeast-1.amazonaws.com/images.asianage.com/images/aa-Cover-m2kqh08qjmht180clbd0u9nfc6-20171229183645.Medi.jpeg", "language": null, "localpath": "/home/raj/news-please-repo//data/2019/03/27/asianage.com/india_all-india_291217_year-ender-2017-political-dissent-seeks-new-heights-as-popular-leaders-go-anti-party_1553697642.html", "title": "Year ender 2017: Dissent seeks new heights as political leaders go anti-party", "title_page": "Year ender 2017: Dissent seeks new heights as political leaders go anti-party", "title_rss": "NULL", "source_domain": "asianage.com", "text": "Some tweeted, some fought movements, but none shied away from expressing opinions, even ones that opposed their party statements.\nMumbai: 2017 has been a year for quite a few ups and downs in the political horizon of India. While big states like Uttar Pradesh, Gujarat went to polls, people of Uttarakhand, Manipur, Goa, Punjab and Himachal Pradesh also voted for a new government in the state. The Bharatiya Janata Party (BJP) swept six of seven states where polling was held this year.\nSome popular leaders, however, publicly displayed dissatisfaction against their party decisions.\nHere is a list of top political leaders who did not shy away from dissent.\nShatrughan Sinha\n(Photo: AP)\nThe in-house rebel of the BJP has been embarrassing the party all through the year.\nIn April, he took to the microblogging site Twitter to attack Union Minister Maneka Gandhi, who held Bollywood trends responsible for rising incidents of sexual harassment.\n'Charming' the female protagonist, in Gandhi's books, amounted to nothing but sexual harassment. Sinha gave her a piece of his mind, tweeting, \"Humble suggestion to Smt. Maneka Gandhi. Please choose right subject at right time and after consulting right people. There are other ways of staying in the news or coming to the limelight than holding movies responsible for crimes.\"\nHumble suggestion to Smt. Maneka Gandhi. Please choose right subject at right time and after consulting right people. There are other...1>2 — Shatrughan Sinha (@ShatruganSinha) April 9, 2017\nLater in May, BJP MP Sinha got into a Twitter-scuffle with BJP-leader and deputy chief minister of Bihar Sushil Modi over bad-mouthing opponent party leaders - Rashtriya Janata Dal (RJD) chief Lalu Prasad Yadav and Aam Aadmi Party (AAP) leader and Delhi Chief Minister Arvind Kejriwal.\n“Enough of negative politics & mudslinging by opponents on our political leaders, be it Kejriwal, Laloo Yadav or Sushil Modi,” Sinha tweeted.\nEnough of negative politics & mudslinging by opponents on our political leaders, be it Kejriwal, Laloo Yadav or Sushil Modi..High time..1>2 — Shatrughan Sinha (@ShatruganSinha) May 22, 2017\n“High time to substantiate your claim...or pack up. Can’t just keep feeding media with one night stories & sensationalising. Enough is enough,” he said.\nIn December this year, during the Gujarat Assembly elections campaign, Prime Minister Narendra Modi remarked that the Congress was colluding with Pakistan to win votes in Gujarat.\nThe allegations drew outrage from a lot of quarters and Shatrughan Sinha was not to be left behind.\nSinha lashed out at the Prime Minister Narendra Modi for accusing the Congress of colluding with Pakistan to defeat the BJP in Gujarat.\n\"Hon'ble Sir! Just to win elections anyhow, and that too at the fag end of the process, is it a must to come up with & endorse new, unsubstantiated & unbelievable stories everyday against political opponents? Now linking them to Pak High Commissioner & Generals?! Incredible!,\" he had tweeted, 'Sir' a clear reference to Modi, though he did not name anyone.\nHon'ble Sir!\nJust to win elections anyhow, and that too at the fag end of the process, is it a must to come up with & endorse new, unsubstantiated & unbelievable stories everyday against political opponents? Now linking them to Pak High Commissioner & Generals?! Incredible!.1>2 — Shatrughan Sinha (@ShatruganSinha) December 11, 2017\nSinha also attacked Prime Minister Narendra Modi and party chief Amit Shah for sidelining veterans like LK Advani, Murli Manohar Joshi and Yashwant Sinha.\nIn the latest incident, the actor extended his solidarity to Rashtriya Janata Dal (RJD) chief and former Bihar Chief Minister Lalu Prasad Yadav, despite RJD and BJP being political rivals.\nSinha in a tweet expressed hope that the \"hero of the masses\" Lalu Prasad Yadav would get the \"most desired and deserving justice\" in fodder scam case.\n\"Hope wish & pray that the friend of the nation, hero of masses & favorite of downtrodden, one & only one Lalu Yadav gets the most desired & deserving justice. Satyamev Jayate??!!. God Bless!,\" the veteran actor tweeted.\nHope wish & pray that the friend of the nation, hero of masses & favorite of downtrodden, one & only one Lalu Yadav gets the most desired & deserving justice. Satyamev Jayate??!!. God Bless! — Shatrughan Sinha (@ShatruganSinha) December 23, 2017\nAfter the Gujarat Assembly election results came out, Shatrughan Sinha again took to twitter to congratulate not only the BJP, but also the Congress and its allies, like Hardik Patel, Jignesh Mevani and Alpesh Thakore.\nHe also went a notch further, to point out that the fall in winning margins in the state’s elections, probably should be a wake-up call for BJP.\n'Our party came through by the skin of its teeth... Better booth & other management was probably the key... A true wake up call...and time for us to realise that there is no substitute to real & genuine development of one and all... Long live BJP,' Sinha said in a tweet.\nYashwant Sinha\n(Photo: PTI)\nYashwant Sinha, the finance minister of the former Vajpayee government, has been largely sidelined since the BJP came back to power in 2014.\nHe has been critical about Modi’s policies ever since, but the biggest lash came in an article he wrote against the current finance minister Arun Jaitley in India Today earlier this year, titled, ‘I need to speak up now.’\nIn the article, he noted what he calls \"the mess the Finance Minister (Arun Jaitley) has made\" of the economy and remarks that many may share his views but are silent out of \"fear\".\nCongress, naturally, welcomed the article. Veteran Congress leader P Chidambaram quoted from the article and tweeted: \"Yashwant Sinha speaks Truth to Power. Will Power now admit the Truth that economy is sinking?\" and \"... ETERNAL TRUTH: No matter what Power does, ultimately Truth will prevail.\"\nYashwant Sinha speaks Truth to Power. Will Power now admit the Truth that economy is sinking? — P. Chidambaram (@PChidambaram_IN) September 27, 2017\nLater in December, Sinha was detained by the police in Maharashtra’s Akola, where he was protesting against the “government’s apathy” towards cotton and soybean cultivators.\n\"Before coming to power, the BJP had promised to give 50 per cent over and above the minimum support price (MSP). But after coming to power, the party forgot the promise. Just as Indian soldiers carried out surgical strikes across border, the farmers will also carry out a surgical strike against the government till justice has been done,\" Sinha said from the scene of protest.\nHe not only addressed the farmers, but also refused to leave even if the police allowed him to do so.\nSubramanian Swamy\nIn a conversation with Huffpost India in April this year, Subhramanian Swamy, veteran BJP leader and economist, said that political correctness is dead, and Hindutva is the only thing that guides BJP as of now.\nThe leader, who has a huge fan-following on Twitter and claims to be second most popular after Modi, also said in the same interview that he planned to challenge the Goods and Services Tax (GST) in the courts.\nThe above are just small examples of Swamy ‘standing up’ to the party’s leadership and decorum.\nSwamy has also perpetually targeted the BJP’s current Finance Minister Arun Jaitley and not only for his policies. He took to Twitter to slam him on the way he dressed during a tour in China.\n\"BJP should direct our ministers to wear traditional and modernised Indian clothes while abroad. In coat and tie, they look like waiters\", Swamy tweeted.\nBJP should direct our Ministers to wear traditional and modernised Indian clothes while abroad. In coat and tie they look like waiters — Subramanian Swamy (@Swamy39) June 24, 2016\nEven though he did not name anyone, Jaitley was the only one touring abroad at that time, and he had been seen wearing a coat and tie.\nMukul Roy\nFormer Rajya Sabha MP and Trinamool Congress (TMC) General Secretary Mukul Roy was one of closest aides of party supreme Mamata Banerjee. In fact, when Banerjee was elected as the chief minister of West Bengal and vacated office as Railways Minister of the UPA government, she personally recommended him to the then Prime Minister Dr Manmohan Singh as her successor.\nRoy and Mamata’s bond, however, became strained ever since his name came up in the Sarada chit fund scam and the Narada sting operation that followed.\nRoy was suspended from his position as TMC’s general secretary.\nRoy and Mamata’s ties however, seems to have remained strained as earlier this year, he was suspended from the party for six years as he met senior BJP leaders like Finance Minister Arun Jaitley and BJP General Secretary Kailash Vijayvargiya.\nMukul Roy officially quit TMC and joined the BJP in September this year. In an interview with popular Bengali news channel ABP Ananda, Mukul said, “This (Trinamool) is a one-man party. None of the party ministers or MLAs can say with hands on their heart that they are free to convey their opinions. I am against one-man parties anywhere in India. Be it Congress, Mayawati's party or AIADMK. I felt suffocated within the party (Trinamool).”\nThe senior leader went to the extent of washing the dirty linen of his former party in public. \"During the Left Front rule (in the state from 1977 to 2011), they did not conduct a free and fair election process but at least they allowed the opposition to do politics. But under this government, the opposition parties are not permitted to even hold rallies or meetings. Be it the Left, Congress or BJP - no one is given permission for holding political events. That is how much the political space has shrunk under this government,\" alleged Roy.\nMukul’s resignation was a blow to Mamata and her party, though she publicly remained quite unperturbed about it.\nRitabrata Banerjee\nFormer Rajya Sabha MP and All-India General secretary of Students Federation of India, Ritabrata Banerjee was expelled from the Communist Party of India (Marxist) earlier this year, for ‘anti-party’ activities.\nBanerjee was expelled under section 19 (13) of the party Constitution. Section 19 deals with party discipline and clause 13 is invoked against those who break the party line.\n“In exceptional circumstances Party Committees in their discretion may resort to summary procedure in expelling members for grave anti-party activities,” the clause read.\nHe was removed from the state committee following a report of a disciplinary commission headed by Mohammed Salim that found him guilty of leaking information to the media and enemy camp as well as for a having a lavish lifestyle beyond his means. His Mont Blanc pen and an Apple smart watch raised many questions.\nFollowing the expulsion, Banerjee did an hour-long interview with ABP Ananda, where he literally stripped the entire CPI (M) politburo clean in public view.\nFrom saying that the party harboured anti-Bengali sentiments, to alleging that Sitaram Yechury is a minority General secretary, a puppet in the hands of Prakash Karat and Brinda Karat, the real show-runners, he tried to expose them all.\nThe young orator also alleged that Sitaram Yechury’s entry into the Rajya Sabha was prevented by the Karats because of petty jealousy, and the committee that investigated the charges against him was a kangaroo committee.\nIf all the controversies were not enough, 2017 also saw a leaked video of Ritabrata Banerjee that was telecasted on television, which explicitly showed him indulging in sexual activities.\nWhile the party did not mention this, or the allegations of sexual harassment against him brought forward by several other women in their official statement for disciplinary action against him, it drew flak from a range of other quarters.", "url": "https://www.asianage.com/india/all-india/291217/year-ender-2017-political-dissent-seeks-new-heights-as-popular-leaders-go-anti-party.html", "label": 1}