{"authors": [], "date_download": "2019-03-27 14:29:21", "date_modify": "2019-03-27 14:29:21", "date_publish": "2016-06-09 00:00:00", "description": "The Bharatiya Janata Party hopes to use the Mathura clash between police and squatters last week to its advantage with a people’s campaign to free land from encroachers in poll-bound Uttar Pradesh.", "filename": "india-news_in-uttar-pradesh_6a48e30885a8bfacb07433b21bc1d19e_story-fPFSrGwNaEZ612ooLherLK_1553696961.html", "image_url": "https://www.hindustantimes.com/rf/image_size_640x362/HT/p2/2016/06/09/Pictures/bjp-workers-protest_44ecd3a8-2e28-11e6-85eb-521f5a9851b5.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/hindustantimes.com/india-news_in-uttar-pradesh_6a48e30885a8bfacb07433b21bc1d19e_story-fPFSrGwNaEZ612ooLherLK_1553696961.html", "title": "In Uttar Pradesh’s land grab cases, BJP smells a political opportunity", "title_page": "In Uttar Pradesh’s land grab cases, BJP smells a political opportunity\n | india news | Hindustan Times", "title_rss": "NULL", "source_domain": "hindustantimes.com", "text": "The Bharatiya Janata Party hopes to use the Mathura clash between police and squatters last week to its advantage, with a people’s campaign to free land from encroachers in poll-bound Uttar Pradesh.\nThe party feels the campaign will energise its cadres in the build up to the state assembly elections in early 2017 and pit them directly against the ruling Samajwadi Party.\nThe clash between the police and members of an obscure sect squatting on 280 acres of government land on June 1 left at least 27 people, including a superintendent of police, dead. The BJP has alleged that the squatters enjoyed the patronage of the SP leadership, a charge refuted by the ruling party.\nRead: Mathura clashes: Scarred for life, ‘cult’ children recall ‘bade pitaji’\nBJP president Amit Shah, in a meeting of party officials in Kasganj on Tuesday, announced that people can email (kabja.hatao@bjp.org) their complaint about illegally occupied land or properties – whether public or private – in their areas.\n“The BJP cadres will launch a people’s campaign to free the properties of illegal occupation. This will put our workers in direct touch with the people on one hand and pit them against the ruling SP on the other. No encroachments can happen without the support of the ruling party,” a BJP leader said in New Delhi.\nReacting sharply to the campaign and the accusation, SP spokesperson Rajendra Chaudhary said BJP workers should pass on the information they receive to the state government. “The BJP is always looking at ways to politicise everything. Is UP the only state where there are encroachments?”\nRead: Violent ideology, bizarre demands: Secretive world of the Mathura cult\nThe BJP also believes the campaign will help it wean Dalits, who make up over one-fifth of the electorate, away from the Bahujan Samaj Party. Politics in the state has been bipolar for the last decade and a half with either the SP or the BSP forming the government.\nThe party says that Dalits are at the receiving end of most cases of illegal occupation of smaller plots of land or private properties.\n“Dalits are exploited at the hands of Samajwadi Party, while they are used by the Bahujan Samaj Party… Dalits can only progress under BJP rule and only BJP can work for their welfare,” Shah said in Kasganj.\nBy the end of the month, Shah would have travelled and connected with booth-level officials of the party from all six regions of UP, a BJP leader said. Each of the 403 constituencies has around 350 booths.\nThe Mathura violence has given the opposition parties enough ammunition to begin the battle for the 2017 assembly elections. Bahujan Samaj chief and four-time UP chief minister Mayawati has attacked the Samajwadi Party and has sought the UP CM’s resignation.\nCongress vice-president Rahul Gandhi has also expressed his displeasure at the “sliding law and order in the state”.\nFirst Published: Jun 09, 2016 15:26 IST", "url": "https://www.hindustantimes.com/india-news/in-uttar-pradesh-s-land-grab-cases-bjp-smells-a-political-opportunity/story-fPFSrGwNaEZ612ooLherLK.html", "label": 1}