{"authors": [], "date_download": "2019-03-27 14:35:40", "date_modify": "2019-03-27 14:35:40", "date_publish": "2019-02-10 21:54:00", "description": null, "filename": "india_politics_100219_bjp-workers-stage-protest-against-kamal-nath-led-govt_1553697340.html", "image_url": "https://s3.ap-southeast-1.amazonaws.com/images.asianage.com/images/aa-Cover-b15gqav56mml9fakn8uqn1r6t3-20190210182155.Medi.jpeg", "language": null, "localpath": "/home/raj/news-please-repo//data/2019/03/27/asianage.com/india_politics_100219_bjp-workers-stage-protest-against-kamal-nath-led-govt_1553697340.html", "title": "BJP workers stage protest against Kamal Nath-led govt", "title_page": "BJP workers stage protest against Kamal Nath-led govt", "title_rss": "NULL", "source_domain": "asianage.com", "text": "BJP cite rise of hooliganism, failed law and order as the reason for protest.\nAn agitating BJP worker said, 'Madhya Pradesh used to a place of peace during BJP's rule. Congress supporters have started hooliganism now. It is a culture of Congress, people knew it. If the administration does not take action against them, BJP workers will fight against them on the streets.' (Photo: ANI)\nBhopal: Bharatiya Janta Party (BJP) workers staged a protest on Sunday against the Kamal Nath-led Madhya Pradesh government citing rise of hooliganism and failed law and order in the state.\n“Madhya Pradesh used to a place of peace during BJP's rule. Congress supporters have started hooliganism now. It is a culture of Congress, people knew it. If the administration does not take action against them, BJP workers will fight against them on the streets.” said an agitating BJP worker.\nThe demonstrators were holding banners which read “A protest against the rising crime- killing, robbery, hooliganism and crime against women under Congress government.”\nIn January, two BJP workers were killed in the state. Following this, former chief minister Shivraj Singh Chouhan had warned the Congress government in the state that if such incidents are not curbed, the BJP will \"come out on the streets.\"", "url": "https://www.asianage.com/india/politics/100219/bjp-workers-stage-protest-against-kamal-nath-led-govt.html", "label": 1}