{"authors": [], "date_download": "2019-03-27 14:40:35", "date_modify": "2019-03-27 14:40:35", "date_publish": "2015-12-27 00:00:00", "description": "Around 20 farmers held protests at the secretariat in Mumbai today against falling prices of Tur dal. They say they are being forced to sell their crop below the Minimum Support Price of Rs 5050 a quintal.", "filename": "india-news_maharashtra-farmers-protest-over-low-price-of-tur-dal-1689211_1553697635.html", "image_url": "https://i.ndtvimg.com/i/2015-12/maharashtra-farmers_650x400_71451509366.jpg", "language": null, "localpath": "/home/raj/news-please-repo//data/2019/03/27/ndtv.com/india-news_maharashtra-farmers-protest-over-low-price-of-tur-dal-1689211_1553697635.html", "title": "Maharashtra Farmers Protest Over Low Price of Tur Dal", "title_page": "Maharashtra Farmers Protest Over Low Price of Tur Dal", "title_rss": "NULL", "source_domain": "ndtv.com", "text": "The opposition says the government has not procured as much Tur as farmers expected (File)\nAround 20 farmers held protests at the secretariat in Mumbai today against falling prices of Turdal. They say they are being forced to sell their crop below the Minimum Support Price of Rs 5050 a quintal.The opposition says the government has not procured as much Tur as farmers expected. To make matters worse, there has been a bumper production this year. The farmers are now being forced to sell the remaining grain to private buyers at lower prices.So far, the govt has purchased 2.30 lakh tonne of the total 11.7 lakh tonne produced in Maharashtra this season. The state has announced it would procure stocks already registered by April 22. The excess stock is selling in retail market at Rs 50 to Rs 60 a kg - a huge come-down from last year's Rs 150 a kg..\"The government will have to buy Tur at the Minimum Support Price,\" said former Chief Minister Prithviraj Chavan. \"Last year, from the Red Fort, the Prime Minister had appealed to farmers saying 'you cultivate dal'. Due to this, farmers, especially those from Maharashtra, have cultivated Tur.\"Both Congress and Shiv Sena allege that there have been malpractices during procurement. \"This entire situation is a very big scam,\" Mt Chavan said.\"For the first time, the Chief Minister has admitted that it is a 400-crore scam. It is not a 400-crore scam but 1000-crore one, just like last year. So who's responsible?\" he questioned. While extending the deadline for procurement of pulses, PM Modi has thanked farmers for accepting his appeal to grow more tur dal. He has also hit out at the opposition for attacking him on the issue of price rise of dals within days of his assuming office in 2014.\nGet the latest election news, live updates and election schedule for Lok Sabha Elections 2019 on ndtv.com/elections. Like us on Facebook or follow us on Twitter and Instagram for updates from each of the 543 parliamentary seats for the 2019 Indian general elections.", "url": "https://www.ndtv.com/india-news/maharashtra-farmers-protest-over-low-price-of-tur-dal-1689211", "label": 1}