{"authors": [], "date_download": "2019-03-27 14:40:34", "date_modify": "2019-03-27 14:40:34", "date_publish": "2018-09-11 04:28:17", "description": "The Maharashtra Congress Monday claimed that its 'Bharat Bandh' to protest against rising fuel prices was \"100 per cent successful and largely peaceful\" with all sections of the society, including traders, participating voluntarily.", "filename": "india-news_bharat-bandh-mah_c473bf258a1e636357fb16910a9a5717__1553697634.html", "image_url": "https://images.financialexpress.com/2018/09/chavan-express.jpg", "language": null, "localpath": "/home/raj/news-please-repo//data/2019/03/27/financialexpress.com/india-news_bharat-bandh-mah_c473bf258a1e636357fb16910a9a5717__1553697634.html", "title": "'Bharat Bandh': Maharashtra Congress says stir '100 per cent successful'", "title_page": "'Bharat Bandh': Maharashtra Congress says stir '100 per cent successful' - The Financial Express", "title_rss": "NULL", "source_domain": "financialexpress.com", "text": "Maharashtra Congress chief Ashok Chavan. (PTI)\nThe Maharashtra Congress Monday claimed that its ‘Bharat Bandh’ to protest against rising fuel prices was “100 per cent successful and largely peaceful” with all sections of the society, including traders, participating voluntarily. The party further said the ruling BJP was “afraid” of the protest and accused the government of trying to suppress the demonstration in the state. Addressing a press briefing in the evening, Maharashtra Congress chief Ashok Chavan lashed out at the Shiv Sena, an ally in the BJP-led governments at the state and the Centre, saying it was equally to blame for the price rise. He said Sena was “helpless for power” and that its “real face stood exposed”.\nChavan said the Sena has “stopped roaring and is instead barking” after it chose to refrain from supporting the protest in Mumbai. “Their leader Sanjay Raut said we woke up late on the people’s issue. At least we woke up. There are posts on the social media that the Shiv Sena has stopped roaring and is instead barking,” he said.\nThe Sena had taken a swipe at the Congress’ bandh call in an editorial published in the former’s mouthpiece Saamana Monday. Chavan thanked the Maharashtra Navnirman Sena (MNS) for backing the agitation, but ruled out possibility of the Raj Thackeray-led party being a constituent of the grand-alliance of opposition parties the Congress is stitching together to take on the BJP.\n“The fuel price rise is unjust. Hence, we staged protest, which was 100 per cent successful. We got support from all sections of the people, including traders, voluntarily. The government tried to suppress the protest, but failed,” he claimed.\nChavan denied that the bandh caused trouble to people, adding that the government had failed to keep its promises and hence “had to go”. Mumbai Congress chief Sanjay Nirupam, who accompanied Chavan during the briefing, said the protest showed Mumbai could be shutdown without the Shiv Sena’s support. “I want the Shiv Sena to withdraw banners it hoisted in the city criticising the fuel price rise,” he demanded. Nirupam also asked the Sena to walk out of the government if it intended to do something for the people.", "url": "https://www.financialexpress.com/india-news/bharat-bandh-maharashtra-congress-says-stir-100-per-cent-successful/1309030/", "label": 1}