{"authors": ["Oi-Chennabasaveshwar P"], "date_download": "2019-03-27 14:40:58", "date_modify": "2019-03-27 14:40:58", "date_publish": "2019-01-31 12:31:54", "description": "As a mark of protest against the Citizenship Amendment Bill, families of the people who were killed during the Assam Agitation (1979-85) returned the mementos that were given to them by the Assam government in 2016.", "filename": "india_momento-wapasi-is-assam-agitation-repeating-2844552_1553697658.html", "image_url": "https://www.oneindia.com/img/2019/01/assam-1548918010.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/oneindia.com/india_momento-wapasi-is-assam-agitation-repeating-2844552_1553697658.html", "title": "Momento Wapasi: Is 'Assam Agitation' repeating?", "title_page": "Momento Wapasi: Is 'Assam Agitation' repeating? - Oneindia News", "title_rss": "NULL", "source_domain": "oneindia.com", "text": "Momento Wapasi: Is 'Assam Agitation' repeating?\nIndia\noi-Chennabasaveshwar P\nGuwahati, Jan 31: As a mark of protest against the Citizenship Amendment Bill, families of the people who were killed during the Assam Agitation (1979-85) returned the mementos that were given to them by the Assam government in 2016.\n\"These mementos given by the Assam government were once the treasured possessions for us as they were in recognition of our children, parents' and spouses' sacrifice. But now, after the citizenship bill, these are meaningless for us,\" an agitator told PTI.\nThe agitation is on even after PM Modi assured that his party will always protect the interests of Assam. The prime minister thanked the people of Assam in a tweet for supporting the Bharatiya Janata Party (BJP) in elections to three tribal autonomous councils.\nWhat is Assam Agitation?\nIn 1978 Hiralal Patwari died, requiring a by-election in the Mangaldoi Lok Sabha Constituency to fill his seat. During the process of the election, observers noticed that the number of registered voters had grown dramatically. AASU demanded that the elections be postponed till the names of foreign nationals were deleted from the electoral rolls. The Assam Agitation developed from there.\nBudget 2019: Over 10 Lakh poor people benefited from Ayushman Bharat Yojana, says President\nThis movement was started in 1979 under the leadership of All Assam Students Union (AASU) and the All Assam Gana Sangram Parishad (AAGSP) and officially ended on 15 August, 1985 after coming of an understanding with the Government of India which found official expression in the memorandum of understanding popularly known as the Assam Accord 1985. Eventually, the Illegal Migrants (Determination by Tribunal) Act, 1983 (IMDT Act) came into being following the Assam Accord signed between the Government of India and the AASU.\nDuring this period of six long years of the movement as reported 855 (later on 860 as submitted by AASU) people sacrificed their lives in the hope of an \"Infiltration Free Assam\". Government of Assam has already provided an amount of Rs. 5.00 Lakhs to the each of the martyrs of Assam Agitation.\nOpposition to Citizenship Amendment Bill 2016:\nOnce again Assamese have hit the street in protest against the Citizenship Amendment Bill 2016. The amendments to Citizenship Act of 1955 allows illegal migrants from certain minority communities coming from Afghanistan, Bangladesh, and Pakistan will then be eligible for Indian citizenship. In short, illegal migrants belonging to the Hindu, Sikh, Buddhist, Jain, Parsi or Christian religious communities from Afghanistan, Bangladesh or Pakistan would not be imprisoned or deported.\nMoreover, these citizens gain permanent citizenship after six years of residency in India instead of 11 years -- as mentioned in the Citizenship Act (1955). The registration of Overseas Citizen of India (OCI) cardholders may get cancelled if they violate any law. The Citizenship Amendment Bill 2016 was proposed in Lok Sabha on July 19, 2018 and passed in Lok Sabha in January 2019.", "url": "https://www.oneindia.com/india/momento-wapasi-is-assam-agitation-repeating-2844552.html", "label": 1}