{"authors": [], "date_download": "2019-03-27 14:28:57", "date_modify": "2019-03-27 14:28:57", "date_publish": "2019-02-04 12:15:00", "description": "Haryana Minister Anil Vij said Mamata Banerjee is present-day Tadaka, a mythological villain, saying she creates problem everywhere.", "filename": "india_story_mamata-banerjee-is-present-day-tadaka-says-haryana-minister-anil-vij-1446257-2019-02-04_1553696937.html", "image_url": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/201902/anil-vij-647x363.jpeg?ZG3D0_RDmpy9NyZHZEykeOyhRgmnGjDV", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/indiatoday.in/india_story_mamata-banerjee-is-present-day-tadaka-says-haryana-minister-anil-vij-1446257-2019-02-04_1553696937.html", "title": "Mamata Banerjee is present-day Tadaka, says Haryana minister Anil Vij", "title_page": "Mamata Banerjee is present-day Tadaka, says Haryana minister Anil Vij - India News", "title_rss": "NULL", "source_domain": "indiatoday.in", "text": "Haryana Minister Anil Vij, who is well-known for making controversial statements, has said Mamata Banerjee is present-day Tadaka, a mythological villain, saying she creates problem everywhere.\nHe said this in context of West Bengal Chief Minister Mamata Banerjee's dharna, protesting CBI's attempt to quiz Kolkata Police chief Rajeev Kumar in connection with the chit fund scams.\nANI shared a tweet:\nHaryana Minister Anil Vij said this in context of West Bengal Chief Minister Mamata Banerjee's dharna.\nMamata Banerjee had earlier denied permission for UP CM Yogi Adityanath's chopper to land in the state ahead of a poll rally.\nThe battle between West Bengal Chief Minister Mamata Banerjee and Prime Minister Narendra Modi has just got shriller in the build up to the general elections due in April/May.\nOn Sunday, Mamata Banerjee had denied permission for Uttar Pradesh chief minister Yogi Adityanath's helicopter to land in the state ahead of a poll rally.\nEarlier, the West Bengal government had denied permission for the BJP president Amit Shah's chopper to land in Malda district. He eventually held a rally there.", "url": "https://www.indiatoday.in/india/story/mamata-banerjee-is-present-day-tadaka-says-haryana-minister-anil-vij-1446257-2019-02-04", "label": 1}