{"authors": ["Oi-Oneindia Staff"], "date_download": "2019-03-27 14:40:27", "date_modify": "2019-03-27 14:40:27", "date_publish": "2018-03-13 06:53:50", "description": "Sitaram Yechury said farmers can 'uproot governments at the Centre and in Maharashtra' if they failed to concede their just demands.", "filename": "india_maharashtra-protest-do-farmers-have-the-power-uproot-govern-2657695_1553697627.html", "image_url": "https://www.oneindia.com/img/2018/03/farmers1-1520842888.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/oneindia.com/india_maharashtra-protest-do-farmers-have-the-power-uproot-govern-2657695_1553697627.html", "title": "Maharashtra protest: Do farmers have the power to uproot governments?", "title_page": "Maharashtra protest: Do farmers have the power to uproot governments? - Oneindia News", "title_rss": "NULL", "source_domain": "oneindia.com", "text": "Maharashtra protest: Do farmers have the power to uproot governments?\nIndia\noi-Oneindia Staff\nBy oneindia staff\nMumbai, March 13: The crises faced by the agriculture sector are out in the open. In the last few years, farmers have come together and protested against the government's apathy towards their problems. After last year's protest by farmers of Maharashtra, Madhya Pradesh, Rajasthan, Punjab and Tamil Nadu, among others, this year the farmers of Maharashtra came out in a huge number to raise their demands in Mumbai on Monday.\nWhile the \"long march\" of farmers of Maharashtra from Nashik to Mumbai, covering a distance of 180 kms on foot in a period of six days, led to the Bharatiya Janata Party (BJP) government in the state conceding to most of the demands raised by the agitators, a delay in fulfilling the promises is likely to witness more such protests in urban hubs of the country in the future.\nEarlier on Monday, Communist Party of India-Marxist (CPI-M) general secretary Sitaram Yechury addressed at least 50,000 protesting farmers at Mumbai's Azad Maidan. During his speech, Yechury said farmers can \"uproot governments at the Centre and in Maharashtra\" if they failed to concede their just demands. In both the state and at the Centre, the BJP is in power.\nThe veteran communist leader said the farmers were the \"new soldiers of India\" and like the jawans who protect the country's borders, the peasantry produces food for the people. \"Any party which ignores the cause of farmers will not survive. Last year, for the first time in the country, Maharashtra farmers had gone on 'strike' which resulted in the announcement of a farm loan waiver package. But after 10 months, it remains unimplemented,\" Yechury said.\nThe CPI-M general secretary also compared the \"long march\" of the farmers with the historic Dandi Yatra led by Mahatma Gandhi against the then British regime in 1930. He said that on (March 12) on this day 88 years ago, Mahatma Gandhi succeeded in shaking the very foundation of the British Empire which culminated in freedom for India.\n\"Today, if the farmers' demands are not conceded, they will shake up the state and the Centre and remove the government and install a government of their choice which will stand by the farmers' cause,\" Yechury said.\nHe also attacked the BJP government for being \"pro-rich\" as huge loans of industrialists and businessmen were being written off. Yechury criticised the current BJP regime for letting billionaires like Lalit Modi, Vijay Mallya and Nirav Modi--all of whom have cheated banks--escape the country with impunity.\n\"For writing off the entire debt burden of the farmers, the government needs barely Rs 1 lakh crore, which they don't have. But much more has been lost by banks and they are busy writing off loans by the big corporates,\" Yechury said.\nThe farmers' protest was spearheaded by the All India Kisan Sabha (AIKS) which is affiliated to the Left. After the farmers' leaders met chief minister Fadnavis who promised to act on most of their demands, the protesters had called off their agitation and took trains back home from Mumbai to Nashik district on Monday night.\nAlong with complete waiver of loans, the other demands of the agitating farmers include fair pay, implementation of the Swaminathan Committee report and transfer of Adivasi land to farmers, to name a few.\nOneIndia News", "url": "https://www.oneindia.com/india/maharashtra-protest-do-farmers-have-the-power-uproot-govern-2657695.html", "label": 1}