{"authors": ["Oi-Oneindia Staff"], "date_download": "2019-03-27 14:40:36", "date_modify": "2019-03-27 14:40:36", "date_publish": "2018-03-12 06:50:56", "description": "On Sunday, Maharashtra CM Devendra Fadnavis said the ruling BJP government will talk to the protesting farmers who have undertaken a 'Long March' to Mumbai to press their various demands.", "filename": "india_50-000-protesting-farmers-mumbai-we-will-talk-them-sort-i-2657006_1553697636.html", "image_url": "https://www.oneindia.com/img/2017/04/devendrafadnavis-24-1493026669.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/oneindia.com/india_50-000-protesting-farmers-mumbai-we-will-talk-them-sort-i-2657006_1553697636.html", "title": "50,000 protesting farmers in Mumbai: ‘We will talk to them, sort out issues’, says Maha CM", "title_page": "50,000 protesting farmers in Mumbai: ‘We will talk to them, sort out issues’, says Maha CM - Oneindia News", "title_rss": "NULL", "source_domain": "oneindia.com", "text": "50,000 protesting farmers in Mumbai: ‘We will talk to them, sort out issues’, says Maha CM\nIndia\noi-Oneindia Staff\nBy oneindia staff\n50,000 Farmers Have Marched To Mumbai | OneIndia News\nMumbai, March 12: Finally, the Maharashtra government seems to have woken up to the plight of the farmers who are planning to gherao the state Assembly on Monday to press for their demands, including complete waiver of loans. On Sunday, at least 50,000 farmers, who started their 180-km journey on foot from Nashik district last week (March 6), reached Mumbai. The sea of farmers holding \"red flags\" and shouting slogans started their midnight march from KJ Somaiya Ground to Azad Maidan in Mumbai on Monday. Reports say they have reached Azad Maidan at around 5 am on Monday.\nAlong with complete waiver of loans, other demands of the agitating farmers include fair pay and transfer of Adivasi land to farmers, to name a few. On Sunday, Maharashtra chief minister Devendra Fadnavis said the ruling Bharatiya Janata Party (BJP) government will talk to the protesting farmers who have undertaken a \"Long March\" to the city to press their various demands.\nHe also appealed to the agitators not to hold up the traffic on Monday so that students appearing for their class 10th exams in the city don't get caught up in the traffic jam. In fact, the protesters started their midnight march to Azad Maidan to avoid blocking the morning traffic for the students rushing to reach to their exam halls on time.\n\"We will talk to them and sort out their issues. The Government is positive on their demands. Most of the agitators are tribals, and their main demand is forest land rights,\" Fadnavis said.\n\"We have set up a committee of ministers to hold discussions on their demands. I have invited them (farmer leaders) for talks,\" he said. \"I have only made an appeal that they should not cause any problem to the traffic since it's an exam day and more than one lakh students will get affected,\" Fadnavis added, referring to the ongoing exams.\nOn Sunday, Mumbaikars showed their solidarity with the protesting farmers by providing them food and water. Some youngsters and students also joined the farmers in their march. Political parties like the Shiv Sena and the Maharashtra Navnirman Sena have announced their support for the farmers.\nOneIndia News", "url": "https://www.oneindia.com/india/50-000-protesting-farmers-mumbai-we-will-talk-them-sort-i-2657006.html", "label": 1}