{"authors": [], "date_download": "2019-03-27 14:35:21", "date_modify": "2019-03-27 14:35:21", "date_publish": "2017-01-20 22:21:33", "description": "Massive protests across the country has now resulted in the Ordinance put forward by the Tamil Nadu government being sent to President Pranab Mukherjee for his assent.", "filename": "india_delhi_story_jallikattu-ordinance-tamil-nadu-justice-for-jallikattu-956220-2017-01-20_1553697321.html", "image_url": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/201701/jallikat-story_647_012017102052_0.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/indiatoday.in/india_delhi_story_jallikattu-ordinance-tamil-nadu-justice-for-jallikattu-956220-2017-01-20_1553697321.html", "title": "Jallikattu Ordinance sent to President following massive protests over ban", "title_page": "Jallikattu Ordinance sent to President following massive protests over ban - India News", "title_rss": "NULL", "source_domain": "indiatoday.in", "text": "Massive protests across the country has now resulted in the Ordinance put forward by the Tamil Nadu government being sent to President Pranab Mukherjee for his assent.\nThe protest which started on Tuesday evening saw lakhs of people come together at Chennai's Marina beach. This faceless protest started through social media spread across various parts of Tamil Nadu, Karnataka, Mumbai and even the national capital. The Tamil community abroad also came out expressing solidarity over the jallikattu movement.\nAfter Tamil Nadu CM O Panneerselvam met Prime Minister Narendra Modi, despite the matter being sub-judice, talks did suggest that the Centre would back the state on its jallikattu push. The TN government put forward an Ordinance which was cleared by the MHA and has now been sent to the President for his assent.\nThe Apex Court has now softened its stance on the sport with it delaying its decision on it by a week. The Ordinance issued by the state government has not been made public. An emergency cabinet meeting was called by CM O Panneerselvam and the Ordinance was passed. The Ordinance was approved for the MHA and is now being sent to the President.\nHowever, Tamilians say that this is only a temporary solution and they will keep their \"Justice for Jallikattu\" fight on until a permanent solution is put forward.\nAlso Read:\nJallikattu LIVE: MHA clears Tamil Nadu government's Ordinance, sent to President", "url": "https://www.indiatoday.in/india/delhi/story/jallikattu-ordinance-tamil-nadu-justice-for-jallikattu-956220-2017-01-20", "label": 1}