{"authors": [], "date_download": "2019-03-27 14:18:19", "date_modify": "2019-03-27 14:18:19", "date_publish": "2017-09-27 05:02:10", "description": "India News: AHMEDABAD/BENGALURU: A senior judge of Karnataka high court, Justice Jayant Patel, resigned from his post almost a year before he was scheduled to ret.", "filename": "india_hc-judge-in-2015-ishrat-ruling-resigns_articleshow_60848901_1553696299.html", "image_url": "https://static.toiimg.com/photo/msid-47529300/47529300.jpg", "language": null, "localpath": "/home/raj/news-please-repo//data/2019/03/27/timesofindia.indiatimes.com/india_hc-judge-in-2015-ishrat-ruling-resigns_articleshow_60848901_1553696299.html", "title": "HC judge in 2015 Ishrat ruling resigns", "title_page": "HC judge in 2015 Ishrat ruling resigns | India News - Times of India\n\t\t\t", "title_rss": "NULL", "source_domain": "timesofindia.indiatimes.com", "text": "AHMEDABAD/BENGALURU: A senior judge of Karnataka high court, Justice Jayant Patel , resigned from his post almost a year before he was scheduled to retire in an apparent protest against his imminent transfer to Allahabad HC.His resignation on Monday evoked strong reactions from the legal fraternity in Gujarat against the Supreme Court collegium’s transfer and promotion policy. As a protest, the Gujarat High Court Advocates’ Association (GHAA) will go on strike on Wednesday and file a petition in the SC challenging the move to transfer Justice Patel.Justice Patel’s bench in Gujarat high court had ordered a CBI probe into the Ishrat Jahan case and had taken on the then Anandiben Patel government in August 2015 by quashing its ordinance to delay local body polls in the state after the Paatidar quota agitation.Justice Patel, who was scheduled to retire in August 2018, refused to comment on the reason behind his resignation. However, sources close to him said since his transfer was being contemplated for Allahabad HC, he saw no point in going there with less than a year left for his retirement. Justice Patel worked for 15 years in Gujarat HC and he is widely known for his fairness.Karnataka HC chief justice SK Mukherjee is retiring on October 9. Being the most senior judge in the HC after Justice Mukherjee, Justice Patel would have headed the HC as acting CJ or CJ from October 10. However, the move to send him to Allahabad high court has changed that scenario. At Allahabad HC, Justice Patel would have been third in seniority.At an emergency meeting on Tuesday, the GHAA passed a resolution which said the SC collegium’s decision to transfer Justice Patel “on the eve of his likely appointment” as acting CJ or CJ of Karnataka HC had “shaken the belief of the Bar in the independence of the judiciary”.The GHAA said the decision had the potential to adversely affect the morale of the legal fraternity and the judiciary. It asked all the Bar associations in Gujarat courts and tribunals to abstain from work “as a mark of protest and to vindicate the independence of judiciary”.", "url": "https://timesofindia.indiatimes.com/india/hc-judge-in-2015-ishrat-ruling-resigns/articleshow/60848901.cms", "label": 1}