{"authors": [], "date_download": "2019-03-27 14:35:38", "date_modify": "2019-03-27 14:35:38", "date_publish": "2019-01-21 00:00:00", "description": "Demanding a CBI inquiry, Chouhan said that the government must take steps to stop such incidents or else the BJP will come out on streets.", "filename": "india_madhya-pradesh-bjp-protest-against-cm-kamal-nath-over-bjp-leaders-murders-2172637_1553697338.html", "image_url": "https://english.cdn.zeenews.com/sites/default/files/2019/01/21/754232-bjp1.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/zeenews.india.com/india_madhya-pradesh-bjp-protest-against-cm-kamal-nath-over-bjp-leaders-murders-2172637_1553697338.html", "title": "Madhya Pradesh: BJP protest against CM Kamal Nath over BJP leaders' murders", "title_page": "Madhya Pradesh: BJP protest against CM Kamal Nath over BJP leaders' murders | India News", "title_rss": "NULL", "source_domain": "zeenews.india.com", "text": "BHOPAL: BJP workers and party leaders on Monday staged a protest in Bhopal against Madhya Pradesh Chief Minister Kamal Nath protesting the recent murders of BJP leaders Prahlad Bandhwar in Mandsaur and Manoj Thackeray in Barwani.\nMadhya Pradesh: BJP workers and party leaders protest against Chief Minister Kamal Nath in Bhopal, against the recent murders of BJP leaders Prahlad Bandhwar in Mandsaur and Manoj Thackeray in Barwani. pic.twitter.com/KqILxolHUR — ANI (@ANI) January 21, 2019\nOn Sunday, senior BJP leader and former chief minister Shivraj Singh Chouhan had accused the Congress-led state government of not taking the matter seriously. He stressed that murders are taking place since the Congress came to power.\n\"Congress used to talk of change but what change is this? Murders have started here, there was one in Indore, then in Mandsaur where a BJP leader was killed, another BJP leader killed in Barwani. Criminals are fearless today. Law and order collapsed,\" Chouhan had said.\nDemanding a CBI inquiry, Chouhan said that the government must take steps to stop such incidents or else the BJP will come out on streets.\n\"Govt is taking this lightly. There seems to be a larger conspiracy behind this (BJP leader killed in Mandsaur). I demand a CBI inquiry. BJP leader was killed in Barwani, I warn the govt that they stop such incidents otherwise BJP will come out on streets,\" Chouhan said.\nChouhan made the comments barely hours after senior BJP leader Manoj Thackeray from Balwadi was found dead in a field on Sunday morning. Thackeray was found dead after he had gone for a morning walk. A blood-stained rock was spotted from the crime site following which police are speculating that Thackeray was killed with that rock.\nAnother BJP leader named Prahlad Bandhwar was shot dead on Thursday in Mandsaur. Bandhwar was the president of Mandsaur Municipal Corporation.", "url": "https://zeenews.india.com/india/madhya-pradesh-bjp-protest-against-cm-kamal-nath-over-bjp-leaders-murders-2172637.html", "label": 1}