{"authors": [], "date_download": "2019-03-27 14:41:04", "date_modify": "2019-03-27 14:41:04", "date_publish": "2017-06-16 15:14:46", "description": "Farmers on Friday gathered at various places and blocked national highways in Haryana and Rajasthan as part of their nation-wide stir against the Mandsaur deaths.", "filename": "india_farmers-in-rajasthan-haryana-protest-against-mandsaur-deaths-block-highways-with-tractors-3684771_1553697664.html", "image_url": "https://images.firstpost.com/wp-content/uploads/2017/06/Maha_Farmers_Strike_Social_PTI4.jpg", "language": null, "localpath": "/home/raj/news-please-repo//data/2019/03/27/firstpost.com/india_farmers-in-rajasthan-haryana-protest-against-mandsaur-deaths-block-highways-with-tractors-3684771_1553697664.html", "title": "Farmers in Rajasthan, Haryana protest against Mandsaur deaths, block highways with tractors", "title_page": "Farmers in Rajasthan, Haryana protest against Mandsaur deaths, block highways with tractors - Firstpost", "title_rss": "NULL", "source_domain": "firstpost.com", "text": "Chandigarh/Jaipur: Farmers on Friday gathered at various places and blocked national highways in Haryana and Rajasthan as part of their nation-wide stir against the death of five cultivators in police firing in Madhya Pradesh and failure of the Centre to provide relief to the farming community.\nIn Haryana, led by Bhartiya Kisan Union (BKU) leader Gurnam Singh, farmers gathered near Mohra in Ambala and blocked the highway there by parking their tractors. Apart from Ambala, farmers are also holding protests at Rohtak, Sonepat, Hisar, Sirsa, Jind, Bhiwani and Charkhi Dadri.\nFollowing the protests, authorities had to divert the traffic at some places.\nSingh said that the farmers will block vehicular traffic for three hours during afternoon on all national highways across Haryana.\nHe, however, asked the farmers to protest in a peaceful manner and let ambulance and fire brigade vehicles pass the blockade.\nA group of 62 farmers’ unions had announced that it will block traffic for three hours on all national highways across the country on Friday.\nSingh said the decision to block traffic was taken to protest the killing of five farmers in police firing in Mandsaur in Madhya Pradesh and alleged failure of the government to provide relief to the farming community. The farmers are also demanding waiver of loans and implementation of the Swaminathan Committee report on payment of the minimum support price (MSP).\nThe opposition parties, including Congress and Indian National Lok Dal (INLD), have also lent their support to the agitating farmers.\nLed by former Haryana Chief Minister Bhupinder Singh Hooda, the Congress is organising a 'Kisan Panchayat' in Kurukshetra on Friday.\nMeanwhile, INLD workers burnt the effigy of Madhya Pradesh Chief Minister Shivraj Singh Chouhan near the mini secretariat in Panipat, under the elevated flyover which is part of a national highway, to protest the firing on farmers in Mandsaur in which five farmers were killed.\nLed by former state agriculture minister Jaswinder Sandhu, INLD workers took out a protest march in Karnal demanding loan waiver for the farmers.\nIn view of the farmers' protest, the Haryana police has taken necessary steps to deal with the situation.\nHaryana Director General of Police, BS Sandhu had said on Thursday that stringent security measures have been taken in the state in view of the protest.\nFour companies of the Central Reserve Police Force (CRPF) have been deployed in Ambala, Kurukshetra, Sonepat and Jind.\nSingh said it was unfortunate that the BJP had failed to fulfill their poll promise of implementing the Swaminathan Commission report.\nSingh also added that on International Yoga Day on 21 June, \"the farmers will stage protests to attract attention of the entire world towards their plight.\"\nMeanwhile, in Rajasthan, cultivators blocked Ganganagar-Hanumangarh highway as part of their protest.\nThe highway will remain blocked for three hours, starting 12 noon, in support of the demands of wavier of all farming loans, profitable minimum selling price (MSP) for all crops among others.\nFormer CPM MLA Pawan Duggal claimed that a large number of farmers have taken part in the blockade.\nPolice have also made necessary arrangements on the highway in wake of the protest.\nApart from this, Kisan Mahapanchayat will hold demonstrations in villages in Rajasthan, national president of Mahapanchayat Rampal Jat told PTI.\nDates have not been finalised yet, he added.\nFirstpost is now on WhatsApp. For the latest analysis, commentary and news updates, sign up for our WhatsApp services. Just go to Firstpost.com/Whatsapp and hit the Subscribe button.", "url": "https://www.firstpost.com/india/farmers-in-rajasthan-haryana-protest-against-mandsaur-deaths-block-highways-with-tractors-3684771.html", "label": 1}