{"authors": [], "date_download": "2019-03-27 14:18:15", "date_modify": "2019-03-27 14:18:15", "date_publish": "2018-12-05 00:55:00", "description": "Karnataka plans to build a reservoir on Cauvery river near Mekedatu. The protest, led by DMK, saw leaders from parties such as MDMK, VCK, TVK, Congress and the Left sharing stage with MK Stalin.", "filename": "india_story_tamil-nadu-cauvery-water-dispute-opposition-protest-mekedatu-1402669-2018-12-05_1553696295.html", "image_url": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/201812/STALIN-647x363.jpeg?H_w6nWXhszdlYr2gV2t384yqi9ll_fFJ", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/indiatoday.in/india_story_tamil-nadu-cauvery-water-dispute-opposition-protest-mekedatu-1402669-2018-12-05_1553696295.html", "title": "Tamil Nadu: Opposition stages massive protest over Mekedatu project on Cauvery river", "title_page": "Tamil Nadu: Opposition stages massive protest over Mekedatu project on Cauvery river - India News", "title_rss": "NULL", "source_domain": "indiatoday.in", "text": "Opposition parties in Tamil Nadu came together for a massive protest against the proposed project on Cauvery river near Mekedatu in Karnataka.\nThe protest, led by Dravida Munnetra Kazhagam (DMK), saw leaders from parties such as MDMK, VCK, TVK, Congress and the Left sharing stage with DMK president MK Stalin.\nKarnataka and Tamil Nadu are locked in the water dispute for decades.\nKarnataka plans to build a reservoir on Cauvery river near Mekedatu. The project was first proposed in 2013. It received cabinet approval in 2017.\nOn November 22, Central Water Commission (CWC) gave a go-ahead to Karnataka Neeravari Nigam Limited for preparation of a detailed project report for Mekedatu Balancing Reservoir and drinking water project.\nTamil Nadu has maintained that the project will affect water flow in Cauvery.\nThe Opposition protested against the Centre's green signal to the project.\n\"There should be no more dams. This is the Karnataka government's ploy,\" said A Sarvanan of DMK.\nHe said that if Karnataka goes ahead with the project, Tamil Nadu won't get water to irrigate the delta region in the state.\nHowever, Karnataka government says that the project will be beneficial for Tamil Nadu, too, and is essential for providing drinking water to Bengaluru and Ramanagar.\nThere was anger among Tamil Nadu farmers after the Centre gave a go-ahead to Karnataka. Farmers in Trichy took to the streets and burnt Prime Minister Narendra Modi's effigy.\nAfter Tuesday's protests, BJP accused opposition parties of creating tension in the state by saying that the project has got a go-ahead from the Centre.\nAIADMK has already moved the Supreme Court and the party has said that it stands by the people of Tamil Nadu while accusing DMK of hypocrisy.\n\"We strongly condemn DMK and allies for trying to mislead the public. It is the Congress in Karnataka which supports the JD(S). Congress and DMK are allies for upcoming elections. Stalin does not have the guts to condemn Congress government. AIADMK will stand with the people and will fight the issue tooth and nail\", said Kovai Sathyan, spokesperson of the AIADMK.\nAlso Read | Tamil Nadu knocks SC door against Karnataka over Mekedatu dam", "url": "https://www.indiatoday.in/india/story/tamil-nadu-cauvery-water-dispute-opposition-protest-mekedatu-1402669-2018-12-05", "label": 1}