{"authors": [], "date_download": "2019-03-27 14:40:54", "date_modify": "2019-03-27 14:40:54", "date_publish": "2017-07-18 17:07:23", "description": "BJP Mahila Morcha protest's against Mamata Banerjee govt - The BJP Mahila Morcha's Delhi unit today staged a protest against the Chief Minister Mamata Banerjee government's silence over the alleged atrocities against women in West Bengal, near the Banga Bhawan here .", "filename": "india_report-bjp-mahila-morcha-protest-s-against-mamata-banerjee-govt-2506047_1553697654.html", "image_url": "https://cdn.dnaindia.com/sites/all/themes/dnaindia/favicon-1016.ico", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/dnaindia.com/india_report-bjp-mahila-morcha-protest-s-against-mamata-banerjee-govt-2506047_1553697654.html", "title": "BJP Mahila Morcha protest's against Mamata Banerjee govt", "title_page": "BJP Mahila Morcha protest's against Mamata Banerjee govt", "title_rss": "NULL", "source_domain": "dnaindia.com", "text": "The BJP Mahila Morcha's Delhi unit today staged a protest against the Chief Minister Mamata Banerjee government's silence over the alleged atrocities against women in West Bengal, near the Banga Bhawan here .\nUnion minister Babul Supriyo, who represents Bengal's Asansol Parliamentary constituency, joined the protesters during the demonstration.\nThey resorted to sloganeering and courted arrest after the police stopped the women at a barricade erected near the Bhawan.\n\"The recent incidents of violence and atrocities against women in Bengal have exposed Mamata Banerjee who is keeping mum over these incidents,\" Poonam Parashar Jha, president of Delhi BJP Mahila Morcha, said.\nJha also lambasted the West Bengal Power Minister, Sobhandeb Chattopadhyay, for his \"objectionable statement against BJP leader Roopa Ganguly.\n\"Mamata Banerjee has closed her eyes to the attacks on women and the language used against women by her minister. We are prepared to take this fight to the West Bengal,\" Jha said.\n(This article has not been edited by DNA's editorial team and is auto-generated from an agency feed.)", "url": "https://www.dnaindia.com/india/report-bjp-mahila-morcha-protest-s-against-mamata-banerjee-govt-2506047", "label": 1}