{"authors": [], "date_download": "2019-03-27 14:41:02", "date_modify": "2019-03-27 14:41:02", "date_publish": "2019-01-17 09:22:00", "description": null, "filename": "india_all-india_170119_cm-sonowal-breaks-silence-says-wont-betray-assamese_1553697662.html", "image_url": "https://s3.ap-southeast-1.amazonaws.com/images.asianage.com/images/aa-Cover-35vtc59me805ps9morovqlbib4-20170505085019.Medi.jpeg", "language": null, "localpath": "/home/raj/news-please-repo//data/2019/03/27/asianage.com/india_all-india_170119_cm-sonowal-breaks-silence-says-wont-betray-assamese_1553697662.html", "title": "CM Sonowal breaks silence, says won’t betray Assamese", "title_page": "CM Sonowal breaks silence, says won’t betray Assamese", "title_rss": "NULL", "source_domain": "asianage.com", "text": "Sonowal reiterated that people have made him chief minister with a lot of trusts and he will not betray their trust.\nGuwahati: Breaking his long silence over the ongoing protests against the Citizenship Bill, Assam chief minister Sarbananda Sonowal on Wednesday called on All-Assam Student Union (AASU) and intellectuals to suggest measures to protect the indigenous people of Assam.\nBogged down by criticism for not opposing the Citizenship Amendment Bill, Mr Sonowal reiterated that people have made him chief minister with a lot of trusts and he will not betray their trust.\n“The Narendra Modi government has taken a practical step to implement Clause VI of the Assam Accord and formed a committee to suggest measures to protect the identity of the indigenous people. No government had taken steps for its implementation although the accord was signed in 1985,” he said.\n“The Clause VI will ensure reservation of seats in the state Assembly, elected bodies and government jobs for indigenous people. This is a golden opportunity for us to protect the identity of the indigenous communities and hence I appeal the AASU to take a bold step and give suggestions on this,” he added.\nIt is significant that a day before the controversial Citizenship Bill was passed in Lok Sabha on January 8, the Centre had proposed a nine-member panel headed by a former IAS officer, M.P. Bezbar-uah, to suggest measures within six months to implement the Clause VI.\nHowever, Mr Bezbaruah refused to head the panel in view of strong protests in Assam against the Citizenship Bill.\nMr Bezbarauah, a former bureaucrat, wrote to the ministry that most of the public representatives in the committee have decided to pull out after the Centre passed the controversial Citizenship Amendment Bill in Lok Sabha. And since the Bill was passed, there has been a series of protests in Assam. Mr Bezbaruah said that he supports the public opinion and hence cannot be part of the committee.\nEarlier, noted educationist Mukunda Rajbangshi had also expressed his reluctance to be part of committee.\nFormer president of the Assam Sahitya Sabha Nagen Saikia, and Rongbong Terang, too, has announced that he will pull out. AASU was the first to withdraw from the committee.\nThe committee was notified on January 7 last and it was to have senior Guwahati-based journalist D.N. Bezbaruah, litterateurs Nagen Saikia and Rongbong Terang, educationist Mukunda Rajbong-shi, retired IAS officer Subash Das, Assam’s advocate general R.B. Gohain and a representative of AASU as members.\nThe Central government was to have been represented by joint secretary (Northeast) in the MHA, Satyendra Garg.\nExpressing his concern over the resignation from the high-powrer committee, Mr Sonowal said that none of the previous state governments had implemented or tried to implement the clause VI. However, now everyone is trying to disrupt the present government. He also reminded the All Assam Students Union (AASU) that he respects the organisation as he also comes from the same platform.\nThe AASU is in the forefront of agitation against the citizenship amendment bill and accusing Mr Sonowal of betraying the peoples’ mandate by supporting citizenship amendment bill, which seeks to amend the Citizenship Act, 1955, by providing citizenship to persecuted Hindus, Sikhs, Parsis, Buddhists, Jains and Christians from Bangladesh, Pakistan, and Afghanistan. It will allow those entering India till December 31, 2014 to be eligible for citizenship and thus pushes the cut-off date from March 24, 1971, as agreed under Assam Accord. The bill categorically excludes Muslims.", "url": "https://www.asianage.com/india/all-india/170119/cm-sonowal-breaks-silence-says-wont-betray-assamese.html", "label": 1}