{"authors": [], "date_download": "2019-03-27 14:18:14", "date_modify": "2019-03-27 14:18:14", "date_publish": "2017-08-05 20:47:52", "description": "The legislators, who have been confined in a resort near the state capital, visited the Raj Bhavan and assembly in the company of state energy minister D K Shivakumar.", "filename": "india-news_the-gujarat-conn_25e23190d56a391e68a1a7a31d2be8d8_story-OZbv8qcgB7h4nl6F8tQ4zH_1553696294.html", "image_url": "https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2017/08/05/Pictures/gujarat-congress-mlas_f4bd0244-79ef-11e7-83e1-68866f5cbeee.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/hindustantimes.com/india-news_the-gujarat-conn_25e23190d56a391e68a1a7a31d2be8d8_story-OZbv8qcgB7h4nl6F8tQ4zH_1553696294.html", "title": "The Gujarat connection: When Congress MLAs met Karnataka governor Vajubhai Vala ‘from home’", "title_page": "The Gujarat connection: When Congress MLAs met Karnataka governor Vajubhai Vala ‘from home’ | india news | Hindustan Times", "title_rss": "NULL", "source_domain": "hindustantimes.com", "text": "The 44 Congress MLAs from Gujarat, shifted to Bengaluru to avoid break in ranks ahead of Rajya Sabha elections, visited the Raj Bhavan on Saturday and met Karnataka governor Vajubhai Vala, who hails from their state.\nThe legislators, who have been confined in a resort near the state capital to ensure the RS re-election of senior Congress leader Ahmed Patel from Gujarat, told Vala about the BJP’s alleged attempts to lure them with bribes of Rs 15 crore, said Shaktisinh Gohil, spokesperson of the party.\nOn why they met Vala, a former BJP leader and Gujarat assembly speaker, Gohil said “the governor is above party politics, and is a protector of the Constitution”.\nAfter Raj Bhavan, the MLAs visited the assembly here, in the company of state energy minister D K Shivakumar, hours after income tax raids at his residence came to an end.\nGujarat Congress MLAs and Karnataka energy minister D K Shivakumar stage a protest in front of the statue of Mahatama Gandhi at Karnataka assembly in Bengaluru on Saturday. ( PTI )\nThe legislators held a protest in front of the Mahatma Gandhi statue there against the raids on Shivakumar’s properties, calling it a BJP ploy to threaten them.\n“There have been many attempts to spread false information,” Gohil said. “Some news organisations have said that the MLAs are being kept at the resort against their will, that some have expressed a desire to leave. But there is no such thing,” Gohil said.\nThe legislator said the MLAs had come to state with the only aim of protecting democracy. “The BJP wants to spread an atmosphere of fear,” he added.\nI-T Raids End at Minister’s House\nEarlier in the day, Shivakumar, who came out of his house after the four-day long raid, thanked party leaders for their support.\n“I will speak as soon as the I-T department releases its report on the raids,” he said, adding that he would head to the resort where the Gujarat MLAs are staying.\nKarnataka energy minister D K Shivakumar speaks to media after income tax sleuths completed a four-day long raid at his residence in Bengaluru, on Saturday. ( Arijit Sen/HT Photo )\nLater in the day, the minister also apologised for adverse remarks made by his mother against chief minister Siddarmaiah on Thursday. Shivakumar’s mother had accused Siddarmaiah of targeting her son.\nIn a letter, Shivakumar apologised on behalf of his “uneducated” mother, saying she was unaware about whose jurisdiction the I-T department came under.\n“I would like to tender my apology to the chief minister and the people of the state for the remarks made by my mother,” Shivakumar’s letter says. “Some media organisations used my mother’s innocence to make her say these things,” he alleged.\nMeanwhile, Siddaramaiah criticised the BJP over the raids, saying they were politically motivated. “The Central Reserve Police Force being used for raids at the house of our cabinet minister is against the Constitution. This should have been done only if there was a collapse of the law and order situation in the state,” he said.\nSiddarmaiah said the I-T department was free to raid anybody. “Let them also raid BJP leaders. Are there no cases against [BJP state president] BS Yeddyurappa, [Union ministers] DV Sadananda Gowda and Ananth Kumar?” he asked.\n“We will politically oppose moves done with a political vendetta,” the chief minister said.\nFirst Published: Aug 05, 2017 20:47 IST", "url": "https://www.hindustantimes.com/india-news/the-gujarat-connection-when-congress-mlas-met-karnataka-governor-vajubhai-vala/story-OZbv8qcgB7h4nl6F8tQ4zH.html", "label": 1}