{"authors": ["- Kapil Sibal", "Congress Leader", "Twiiter"], "date_download": "2019-03-27 14:34:53", "date_modify": "2019-03-27 14:34:53", "date_publish": "2018-05-24 15:00:00", "description": "Here's a five-point explainer which will bring you up to speed on what's been happening in Tuticorin, a southern coastal city in Tamil Nadu.", "filename": "india_story_tuticorin-protest-thoothukudi-sterlite-copper-plant-vedanta-1240433-2018-05-24_1553697293.html", "image_url": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/201805/stalin_1_0.jpeg?NA9tCvO.8ekMtEZGiBFPH6FartN2ehXi", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/indiatoday.in/india_story_tuticorin-protest-thoothukudi-sterlite-copper-plant-vedanta-1240433-2018-05-24_1553697293.html", "title": "The crisis roiling Tuticorin: Here's your 5-point briefing", "title_page": "The crisis roiling Tuticorin: Here's your 5-point briefing - India News", "title_rss": "NULL", "source_domain": "indiatoday.in", "text": "If you live outside Tamil Nadu, you may not have heard of Tuticorin - known locally as Thoothukudi - until Tuesday.\nViolent protests have rocked this medium-sized port city, which dots the southernmost stretch of the state's coastline, and 13 people have been killed in police firing. The protesters' demand was fairly simple: Don't expand the Sterlite Copper plant (A Vedanta-owned copper smelting unit which locals say pollutes groundwater), and shut it down.\nThe scope of the tragedy has earned Chief Minister Edappadi K Palaniswami's administration (and the Centre) severe censure. \"#TNJallianwallahBagh,\" read a handwritten poster dispayed at a trade union's protest in Delhi. \"A brutal example of state-sponsored terrorism,\" said Rahul Gandhi.\nBut Palaniswami has taken the side of the state police. In comments published by a leading news agency, the chief minister said they were defending themselves while under attack.\nCitizens have a fundamental right to protest. The police neither have the right nor a duty to kill. In Tuticorin the State did that: killed 9/10 peaceful protesters. We watch in silence when citizens [are] silenced forever by the State. Desh badal chuka hai [The country has changed]. - Kapil Sibal, Congress leader | Twiiter/@KapilSibal\nThe Tuticorin story is far from over -- lives and jobs are at stake, as is the reputation of Tamil Nadu's plethora of political parties. As you stay tuned for more updates, here's a five-point briefing on what's been happening in the place they call the Pearl City.\nCENTRE STEPS IN | The Union Ministry of Home Affairs, headed by Rajnath Singh, has asked the Tamil Nadu government for a detailed report on the events and circumstances leading to the loss of lives on May 22 -- as well as details on the Sterlite plant, and on the action taken to restore peace and normalcy. In an interview with ANI, Singh said Prime Minister Narendra Modi is pained by the deaths, and expressed his own grief. As of Thursday morning, over 70 people were still undergoing treatment.\nAnother poster displayed at the New Trade Union initiative protest in Delhi (Photo: Getty Images)\nHIGH COURT ORDER | On Wednesday, the Madurai bench of the Madras High Court stayed plans to double the Sterlite plant's capacity from four lakh tonnes to eight lakh tonnes.\nJOBS IN PERIL | Sterlite Copper says it's currently on a \"planned and extended\" shutdown for several weeks -- to carry out repairs and maintenance activities. The jobs of thousands of 'indirect' employees -- who do work associated with the plant, such as supply, logistics, and transport -- will remain suspended as long as the plant is shut.\nSterlite Industries Ltd's copper plant in Tuticorin (File photo: Reuters)\nCANCER-CAUSING WASTE? | The pollution control board has declined to renew the license issued to Sterlite Copper to operate its plant, saying it failed to comply with environmental laws. The firm denied the charges and says it will appeal the board's order. What about allegations that its plant produces cancer-causing waste? Sterlite Copper's CEO says these are \"unfounded rumours\".\nCASES AGAINST OPPOSITION LEADERS | Opposition leaders who visited victims in Tuticorin on Wednesday were booked for violating Section 144. DMK Working President MK Stalin, Makkal Needhi Maiam chief Kamal Haasan, and Congress leader Thirunavukkarasar were among them. Today, Stalin was detained in Chennai while he protested outside the Tamil Nadu secretariat.\nMK Stalin being detained in Chennai.\nInputs from Kamaljit Sandhu, Lokpria, and ANI\nWATCH | Who is to be blamed for inciting violence in Tuticorin?", "url": "https://www.indiatoday.in/india/story/tuticorin-protest-thoothukudi-sterlite-copper-plant-vedanta-1240433-2018-05-24", "label": 1}