{"authors": [], "date_download": "2019-03-27 14:40:50", "date_modify": "2019-03-27 14:40:50", "date_publish": "2016-07-10 15:19:43", "description": "It seems Pankaja-Fadnavis alleged tiff is now spilling onto the streets. Angered by Pankaja's ouster from the Water Resources Ministry, her supporters in Ahmednagar district's Pathardi locality burnt an effigy of Chief minister Devendra Fadnavis.", "filename": "india_story_maharashtra-cabinet-rejig-outraged-pankaja-supporters-burn-effigy-of-fadnavis-328397-2016-07-10_1553697650.html", "image_url": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/201607/fadnavis_story_647_071016031804.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/indiatoday.in/india_story_maharashtra-cabinet-rejig-outraged-pankaja-supporters-burn-effigy-of-fadnavis-328397-2016-07-10_1553697650.html", "title": "Maharashtra Cabinet rejig: Outraged Pankaja supporters burn effigy of Fadnavis", "title_page": "Maharashtra Cabinet rejig: Outraged Pankaja supporters burn effigy of Fadnavis - India News", "title_rss": "NULL", "source_domain": "indiatoday.in", "text": "It seems Pankaja-Fadnavis alleged tiff is now spilling onto the streets. Angered by Pankaja's ouster from the Water Resources Ministry, her supporters in Ahmednagar district's Pathardi locality burnt an effigy of Chief minister Devendra Fadnavis.\nIn a major rejig of his Cabinet, chief minister taken away Pankaja's Water Resources Ministry and handed it over to Ram Shinde. Pankaja who is in Singapore to attend the World Water leader's Summit had earlier expressed her displeasure by tweeting that she won't be attending the Summit now as she is not the in charge of the Ministry anymore.\nPANKAJA, FADNAVIS TWITTER SPAT\nUpset by Pankaja's remarks in the public domain, CM had asked her to attend the Summit as a representative of the state govt. But Now Pankaja supporters have taken this war of words to another level by burning the CMs effigy.\nPankaja has been stripped of the Water Conservation Ministry. The Jalyukt Shivar program introduced to tackle drought under the Ministry was a flagship program of the state government under he tenure. Pankaja was quick to express her displeasure with the Cabinet rejig.\nPANKAJA SELFIE ROW\nPankaja courted controversy recently after she posted selfies on Twitter clicked in Latur which is reeling under drought. She has been accused of gross insensitivity by the opposition for posting the selfies. Her pictures also triggered an online outrage.\nAlso read:\nPankaja, Tawade's wings clipped in Maharashtra Cabinet rejig", "url": "https://www.indiatoday.in/india/story/maharashtra-cabinet-rejig-outraged-pankaja-supporters-burn-effigy-of-fadnavis-328397-2016-07-10", "label": 1}