{"authors": [], "date_download": "2019-03-27 14:34:59", "date_modify": "2019-03-27 14:34:59", "date_publish": null, "description": "Stalin made the headlines when hen was jailed under Maintenance of Internal Security Act (MISA) for protesting against the emergency.", "filename": "india_article_m-k-stalin-dm_f306b8e83286287f1e2af83b23d0f856_373379_1553697299.html", "image_url": "https://img.timesnownews.com/story/1551250890-stalin.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/timesnownews.com/india_article_m-k-stalin-dm_f306b8e83286287f1e2af83b23d0f856_373379_1553697299.html", "title": "MK Stalin: The new charioteer of Dravida Munnetra Kazagham", "title_page": "MK Stalin: The new charioteer of Dravida Munnetra Kazagham | India News", "title_rss": "NULL", "source_domain": "timesnownews.com", "text": "DMK chief M K Stalin | Photo Credit: PTI\nDravida Munnetra Kazagham (DMK) chief MK Stalin, the third son of former Tamil Nadu chief minister M Karunanidhi, took over the reins of the DMK after Karunanidhi died in August 2018. There were speculations about the fate of the DMK following the demise of the former chief minister as Stalin faced a challenge to his leadership from his brother MK Alagiri. Fighting the odds Stalin has emerged as a strong leader in the state with his party completely behind him.\nStalin began his political career when he was 14 by campaigning in the 1967 elections. At the age of 20, he was elected to the General Committee of the DMK. He made it to the headlines when he was jailed under the Maintenance of Internal Security Act (MISA) for protesting against the emergency. Stalin became the first deputy chief minister of Tamil Nadu in 2009 and remained in office till 2011. He was the 37th mayor of Chennai from 1996 to 2002. He contests Assembly elections from Thousand Lights constituency.\nThe DMK has signed a seat-sharing agreement with the Congress for the upcoming Lok Sabha polls. The grand old party will contest on nine seats in Tamil Nadu and one seat in Puducherry. The agreement came a day after the ruling AIADMK cobbled alliances with the BJP and the PMK, alloting them five and seven parliamentary seats respectively.\nThe DMK chief constantly targets Narendra Modi government over communal issues and reservation bill in his rallies and public addresses. Addressing the social justice conference of Dravidar Kazhagam (DK) in February, Stalin said social justice has been buried during the BJP rule. “Social injustice being meted out indirectly by the ruling BJP, reservation in education and employment for the underprivileged section in the society is social justice,” Stalin added. Addressing a gram sabha meeting in Tamil Nadu, he promised to waive off education loans across the country if UPA was voted to power.\nStalin recently joined ranks with the anti-BJP parties at a mega rally organised by West Bengal Chief Minister Mamata Banerjee in her state. He also endorsed Rahul Gandhi as opposition's PM candidate for the upcoming parliamentary elections. He has cornered the AIADMK over former CM Jayalalithaa's death and open firing on protestors in Thoothukudi. Stalin exuded confidence in a sweeping victory in the state in the upcoming general elections, claiming to win 35 of the 39 parliamentary seats.\nThe views expressed by the author are personal and do not in any way represent those of Times Network.", "url": "https://www.timesnownews.com/india/article/m-k-stalin-dmk-congress-bjp-aiadmk-pmk-narendra-modi-lok-sabha-elections-2019-mmamata-banerjee-karunanidhi/373379", "label": 1}