{"authors": [], "date_download": "2019-03-27 14:18:22", "date_modify": "2019-03-27 14:18:22", "date_publish": "2017-11-16 23:31:07", "description": "Several private doctors are protesting against Karnataka Private Medical Establishments Act which led to the death of a 24-year-old man when private nursing homes refused to admit him.", "filename": "india_story_karnataka-private-doctors-protest-nursing-homes-medical-establishments-act-1088251-2017-11-16_1553696302.html", "image_url": "https://akm-img-a-in.tosshub.com/indiatoday/bengaluru-doctors-strike-647_111617112442.jpg?xjFO8oG_.TMkOimBiluw83dDT8SPM9jb", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/indiatoday.in/india_story_karnataka-private-doctors-protest-nursing-homes-medical-establishments-act-1088251-2017-11-16_1553696302.html", "title": "Karnataka private doctors protest: Man dies after nursing homes deny him medical attention", "title_page": "Karnataka private doctors protest: Man dies after nursing homes deny him medical attention - India News", "title_rss": "NULL", "source_domain": "indiatoday.in", "text": "Government's controversial Karnataka Private Medical Establishments Act is not being entertained by private doctors across the state.\nThe private doctors protested against the government and the act, leaving several patients unattended.\nKarthik Rokade had a heart attack and because of a protesting private doctors, the 24-year-old died in Dhward district.\nAccording to the locals, Karthik lost his life because the private hospitals refused to admit him. According to a few media reports, Karthik was taken to about three private nursing homes in the district but not a single one was willing to give the medical attention he desperately needed.\nPhoto Courtesy: Nagarjun Dwarkanath Photo Courtesy: Nagarjun Dwarkanath\nKarthik died on the way to a government hospital.\nMore than 22,000 private doctors stayed away from work on Thursday protesting against the Karnataka Private Medical Act.\nKarnataka High Court while hearing a PIL on doctors strike, observed that the doctors should call off the strike immediately as they have a duty towards the society.\nKPME ACT\nThe Karnataka Private Medical Establishments Act was passed in 2007. The act is to \"to bring a comprehensive legislation in place of the Karnataka Private Nursing Home (Regulation) Act, 1976\" that will be the legal control over private medical establishments (PMEs) in the Karnataka.\nAmong several other points, the Bill made the registration of PMEs mandatory and laid down guidelines to ensure their quality.\nThe Karnataka Private Medical Establishments (Amendment) Bill 2017, proposed by the current Health Minister KR Ramesh Kumar, is an amendment to the existing KPME Bill that intends to bring the PMEs under the purview of the government.\nPRIVATE DOCTORS PROTEST\nThe Indian Medical Association State-unit president Dr HN Ravindra has called the very amendments as \"draconian\".\n\"We will go ahead with our protest till our demands for dropping the contentious provisions, including that of price capping of various procedures, imprisonment of doctors and setting up of a grievance redressal cell, are met. Otherwise, let the government accept the Vikramjit Sen committee's report in toto,\" The Hindu quoted Dr Ravindra.\nAmong other points, the Vikramjit Sen report had suggested that the Act be made applicable to the government hospitals too. However, this has not been considered as of now.\nAs protests by private doctors picked up strength, over 500 doctors including private healthcare industry leaders such as Devi Shetty, the founder of Narayana Health, Bhujang Shetty the Chairman of Narayana Netralaya and S.C. Nagendra Swamy, the President of Federation of Private Association Karnataka had assembled in front of Indian Medical Association in Chamrajpet opposing the KPME Act, according to a Hindu report.", "url": "https://www.indiatoday.in/india/story/karnataka-private-doctors-protest-nursing-homes-medical-establishments-act-1088251-2017-11-16", "label": 1}