{"authors": [], "date_download": "2019-03-27 14:18:13", "date_modify": "2019-03-27 14:18:13", "date_publish": "2018-05-19 00:26:00", "description": "Congress workers in Pune on Friday held a demonstration slamming the BJP for the political slugfest in Karnataka", "filename": "india_story_congress-organises-protest-march-in-pune-calls-karnataka-governor-biased-1236557-2018-05-19_1553696293.html", "image_url": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/201805/IMG-20180518-WA0224__1_.jpeg?ePw2EhfTs1knA3q_fnFI5DHnmPDwMy0D", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/indiatoday.in/india_story_congress-organises-protest-march-in-pune-calls-karnataka-governor-biased-1236557-2018-05-19_1553696293.html", "title": "Congress organises protest march in Pune, calls Karnataka Governor biased", "title_page": "Congress organises protest march in Pune, calls Karnataka Governor biased - India News", "title_rss": "NULL", "source_domain": "indiatoday.in", "text": "Pune city Congress held a protest march against BJP on Friday alleging foul play while forming government in Karnataka. The protest took place at Belbaug Chowk in Pune.\nThe party held demonstrations against BJP and Karnataka Governor Vajubhai Vala. Former minister of state (Home) Ramesh Bagwe and former Member of Maharashtra's legislative council Mohan Joshi were present at the time of the protest march.\nBagwe lambasted BJP and criticised Karnataka Governor Vajubhai Vala for ignoring Congress-JDS combine and inviting BJP to form government in Karnataka. He said that the move by the Governor is against the constitution and deserves to be severely condemned.\nBagwe, a strong supporter of former Pune MP Suresh Kalmadi, alleged that BJP threatened Karnataka voters of violence if they did not vote. He also alleged that Modi government is leaving no stone unturned in misusing power.\nFormer MLC Mohan Joshi felt that BJP made a mockery of the constitution as it tried to grab power in Karnataka with the help of the Governor. Ramesh Bagwe went a step ahead and alleged that the Governor acted in a biased manner.\nBoth the leaders pointed out that as Congress-JDS combine had more seats, they should have been called to form the government first.\nAlleging that EVM tampering took place at Hubli during Karnataka elections, Joshi recalled that in spite of being single largest party in Goa, Manipur and Meghalaya, Congress was not called to form the government. This, he said pointed to BJP tweaking the rules according to its whims and fancies.", "url": "https://www.indiatoday.in/india/story/congress-organises-protest-march-in-pune-calls-karnataka-governor-biased-1236557-2018-05-19", "label": 1}