{"authors": [], "date_download": "2019-03-27 14:40:26", "date_modify": "2019-03-27 14:40:26", "date_publish": "2017-06-16 06:30:10", "description": "Vadodara (Gujarat) [India], June 16 (ANI): After Madhya Pradesh and Maharashtra, now farmers in Vadodara will stage a protest on Friday demanding the implementation of the Dr. Swaminathan Committee", "filename": "india-news_vadodara-farmers-to-protest-demanding-implementation-of-swaminathan-committee-report-540170_1553697626.html", "image_url": "https://images.abplive.in/v2/aHR0cDovL3N0YXRpYy5hYnBsaXZlLmluL2FuaS1pbWFnZXMvNTk0MzI2ODkzZmFjNDYwMjQwOGI0NTc0LmpwZyM2NDA6NDgwI3Jlc2l6ZSNqcGVn/594326893fac4602408b4574.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/abplive.in/india-news_vadodara-farmers-to-protest-demanding-implementation-of-swaminathan-committee-report-540170_1553697626.html", "title": "Vadodara: Farmers to protest demanding implementation of Swaminathan Committee report", "title_page": "Vadodara: Farmers to protest demanding implementation of Swaminathan Committee report", "title_rss": "NULL", "source_domain": "abplive.in", "text": "Vadodara (Gujarat) [India], June 16 (ANI): After Madhya Pradesh and Maharashtra, now farmers in Vadodara will stage a protest on Friday demanding the implementation of the Dr. Swaminathan Committee report.\nMore than 1000 farmers will gather across the district and will move for road blocking which may affect the traffic adversely in the area.\nThey are demanding to implement Dr Swaminathan Committee report in order for the betterment of farmers.\nThe Swaminathan Committee report made several recommendations for improvement in the situation of farmers in India.The National Commission on Farmers, chaired by Prof. M. S. Swaminathan, submitted five reports through the period December 2004 - October 2006.\nThe agrarian crisis in the country has become a matter of concern for the government recently, especially amid escalated violence emerging from parts of the country over the matter.\nThe recent farmers' protest in the Mandsaur district of Madhya Pradesh that claimed lives of six farmers, was the testimony of the worsening situation.(ANI)", "url": "https://www.abplive.in/india-news/vadodara-farmers-to-protest-demanding-implementation-of-swaminathan-committee-report-540170", "label": 1}