{"authors": [], "date_download": "2019-03-27 14:40:53", "date_modify": "2019-03-27 14:40:53", "date_publish": "2019-02-04 14:44:00", "description": null, "filename": "india_politics_040219_live-kolkata-police-cbi-face-off-more-than-12-hrs-wb-cm-contines-dharna_1553697653.html", "image_url": "https://s3.ap-southeast-1.amazonaws.com/images.asianage.com/images/aa-Cover-g7f0eaugr4a9e78qfklkbk8qs4-20190204152549.jpeg", "language": null, "localpath": "/home/raj/news-please-repo//data/2019/03/27/asianage.com/india_politics_040219_live-kolkata-police-cbi-face-off-more-than-12-hrs-wb-cm-contines-dharna_1553697653.html", "title": "Kolkata Police-CBI face-off: WB Guv prepares confidential report, sends to MHA", "title_page": "Kolkata Police-CBI face-off: WB Guv prepares confidential report, sends to MHA", "title_rss": "NULL", "source_domain": "asianage.com", "text": "Mamata Banerjee began her sit-in at 8.30 pm, calling it a 'satyagraha to save the constitution' and rallying other parties.\nWest Bengal chief minister Mamata Banerjee sits on her ‘Save the Constitution’ dharna at Metro Channel, Kolkata. (Photo: ANI | Twitter)\nKolkata: West Bengal Chief Minister Mamata Banerjee launched dharna on Sunday to protest the move of the CBI to question Kolkata Police commissioner Rajeev Kumar over two ponzi scams.\nBanerjee accused Prime Minister Narendra Modi and BJP president Amit Shah of plotting a ‘coup’.\nMamata Banerjee began her sit-in at 8.30 pm, calling it a \"satyagraha to save the constitution\" and rallying other parties. Months before the national election, this has become another flashpoint in the BJP versus opposition bust-up with several leaders, from Rahul Gandhi to Chandrababu Naidu, Arvind Kejriwal and Tejashwi Yadav, pledging their support to Mamata Banerjee.\n06:15 pm: CBI has filed a contempt plea in the Supreme Court against West Bengal's Chief Secretary, Director General of Police and Kolkata Police Commissioner for wilful and deliberate violation of apex court's orders.\n04:05 pm: TMC workers protest against PM Narendra Modi and Central govt over CBI issue in Kolkata.\nWest Bengal: TMC workers protest against PM Narendra Modi and Central govt over CBI issue in Kolkata. pic.twitter.com/gg7w2MLusR — ANI (@ANI) February 4, 2019\n03:20 pm: West Bengal Chief Minister said, \"Our satyagraha is not against any agency, it is against Modi government's atrocities.\"\n02:40 pm: A confidential report prepared by West Bengal Governor Keshari Nath Tripathi has been sent to Ministry of Home Affairs (MHA).\n01:40 pm: Former J&K CM M Muft said, \"Manner in which constitutional institutions in this country, like CBI, are being misused to settle scores with opponents is unfortunate...We stand with Mamata ji. If institutions continue being discredited like this federal structure will be fractured.\"\nPhoto: ANI | Twitter\n01:30 pm: \"This isn't a good development. I think central govt must behave properly and take confidence of state govts. Central govt is misusing constitutional institutions. It's not good for future. How central govt is behaving with opposition leaders is disastrous,\" said HD Kumaraswamy.\n1:20 pm: Gorkha Janmukti Morcha took out a rally in Darjeeling today in support of Chief Minister Mamata Banerjee.\nPhoto: ANI | Twitter\n01:14 pm: \"In interest of wanting free and fair environment in which Lok Sabha polls can be conducted, we have come to bring to the notice of Election Commission certain happenings in West Bengal which has complete cooperation of TMC. Instances we highlighted point out that TMC doesn't believe in democracy,\" said Nirmala Sitharaman.\nDelhi: BJP delegation including Defence Minister Nirmala Sitharaman, Mukhtar Abbas Naqvi & Bhupendra Yadav met Election Commission today on West Bengal issue. pic.twitter.com/hYIbAyf6RI — ANI (@ANI) February 4, 2019\n01:00 pm: Additional Director Intelligence Bureau (SIB) West Bengal Manoj Lal, has met West Bengal Governor Keshari Nath Tripathi at Raj Bhawan.\n12:50 pm: Visuals from 'Save the Constitution' dharna in Kolkata, as Chief Minister Mamata Banerjee goes through documents continuing her routine work as the CM.\nPhoto: ANI | Twitter\n12:20 pm: While addressing the Lok Sabha, Home Minister Rajnath Singh said that stopping CBI from performing duty is “unprecedented” and the face-off is “unfortunate”.\nSingh said Centre has the power to maintain normalcy in any part of the country and the incident in Kolkata is threat to federal political system of country.\nRajnath addressed the Lok Sabha amid ‘CBI tota hain (CBI is a caged parrot)’ slogans by opposition members.\nThe action was taken after the Supreme Court had ordered an investigation into Saradha chit fund case, he said.\nPhoto: ANI | Twitter\n12:09 pm: Saugata Roy, TMC in Lok Sabha said, “Satyagrah by West Bengal CM is against the misuse of CBI by central government. We strongly protest against the CBI and BJP leadership led by PM Modi and Amit Shah who have damaged the constitutional structure. The PM should answer in the House.”\n11:45 am: Akhilesh Yadav, the Samajwadi Part chief said, “Besides West Bengal, such things have been heard from other states too. BJP and the Central government have started misusing CBI as elections are approaching. Not only I, not only Samajwadi Party, but all political parties are saying this. There was CBI row, centre was scared of a CBI director, now they are trying to scare everyone using CBI. Who has misused the institutions? If someone has politicised the institutions, it is BJP.”\nPhoto: ANI | Twitter\n11:35 am: “From the day BJP has come to power at the Centre, they have paid very less attention towards working for the country but towards eliminating opposition parties, this has been their focus for the past 5 years. There is no other party more corrupt than BJP,” said Ghulam Nabi Azad.\n11:30 am: Farooq Abdullah said, “Her (Mamata Banerjee) allegation is right. This country is in danger as its becoming dictatorial. They (Central govt) are not masters of this country, people are.”\n11:20 am: Amid uproar by TMC members, Rajya Sabha was adjourned for the day, while Lok Sabha has been adjourned till 12 noon.\n11:00 am: Union Home Minister Rajanth Singh has spoken to West Bengal Governor Keshari Nath Tripathi to take stock of the situation in the wake of a CBI team being allegedly obstructed by the state police.\nWest Bengal Governor Keshari Nath Tripathi apprised Home Minister Rajnath Singh that he had summoned Chief Secretary and Director General of Police and asked them to take immediate action to resolve the situation.\n10:50 am: The Supreme Court will hear the matter on Tuesday. The Chief Justice of India Ranjan Gogoi said, \"If Kolkata Police Commissioner even remotely thinks of destroying evidence, bring the material before this Court. We will come down so heavily on him that he will regret.\"\nAlso Read: ‘Will come down heavily’: SC's stern warning to Kolkata top cop on CBI plea\n10:34 am: Derek O'Brien said, \"We have spoken to all opposition parties, we all will go forward. We have to save the Constitution, the country and the federal structure. Later today, all opposition parties will go to the Election Commission.\"\n10:15 am: TMC including all 22 opposition parties to go the Election Commission today over the EVM issue.\n10:00 am: Kolkata Commissioner Rajeev Kumar leaves from the sight of Mamata Banerjee’s ‘Save the Constitution’ dharna. The CM is back at the dharna after taking a short break.\nPhoto: ANI:Twitter\n09:15 am: A memorandum has been signed by all the opposition parties and will be submitted to the Election Commission.\nAlso Read: All Oppn parties have signed memorandum, will submit to EC: Banerjee\n08:45 am: Mamata Banerjee continues to sit on her ‘dharna’.\nKolkata: West Bengal Chief Minister Mamata Banerjee continues her 'Save the Constitution' dharna with her supporters at Metro Channel, over the ongoing CBI issue. She is sitting there since 9 pm. pic.twitter.com/9nIflitip2 — ANI (@ANI) February 3, 2019\n08:30 am: The BJP high-level delegation includes Defence Minister Nirmala Sitharaman, Mukhtar Abbas Naqvi and Bhupender Yadav to meet Election Commission on West Bengal issue.\n06:30 am: Visuals from near Metro Channel where West Bengal Chief Minister Mamata Banerjee is holding her 'Save the Constitution' dharna over the ongoing CBI issue.\nKolkata: Latest visuals from near Metro Channel where West Bengal Chief Minister Mamata Banerjee is holding her 'Save the Constitution' dharna over the ongoing CBI issue pic.twitter.com/jNA3mTDb6N — ANI (@ANI) February 4, 2019\n11:45 pm: Mamata Banerjee continues her ‘Save the Constitution’ dharna with her supporters at Metro channel.\nPhoto: ANI:Twitter\n11:10 pm: The Central Bureau of Investigation will approach the Supreme Court on the matter as the West Bengal government is not cooperating.\n11:00 pm: Rahul Gandhi, Omar Abdullah, Tejashwi Yadav, Akhilesh Yadav, Chandrababu Naidu, Mayawati, Sharad Pawar and Arvind Kejriwal spoke to Mamata Banerjee over phone and expressed solidarity.\n10:40 pm: Babul Supriyo tweets over the ongoing situation in West Bengal\nPresident’s Rule should be imposed on West Bengal to control this ‘Rogue’ #TMchhi Govt under a corrupt CM MamtaBanerjee•This is a constitutional crisis ‘created’ by Mamta to shield her corrupt & tainted accomplices — Babul Supriyo (@SuPriyoBabul) February 3, 2019\nAlso Read: Kolkata Police-CBI face-off: BJP to address press conference today\n10:30 pm: TMC workers stage a protest in Asansol over the ongoing CBI issue\n09:20 pm: Interim CBI chief M Nageshwar Rao said that they are investigating these chit fund cases as per the directions of the Supreme Court.\nAn SIT has been constituted by the West Bengal government prior to Supreme Court's direction under the chairmanship of Rajeev Kumar, who is currently the Kolkata police commissioner.\nThey have taken charge of all the evidence, seized all the documents. They have not been cooperating with us in handing over all the documents and a lot of evidence has been destroyed or caused to disappear.\n09:15 pm: All 5 CBI officers that were detained by police have been released\n09:00 pm: West Bengal chief minister Mamata Banerjee sits on her ‘Save the Constitution’ dharna at Metro Channel, Kolkata.", "url": "https://www.asianage.com/india/politics/040219/live-kolkata-police-cbi-face-off-more-than-12-hrs-wb-cm-contines-dharna.html", "label": 1}