{"authors": [], "date_download": "2019-03-27 14:40:26", "date_modify": "2019-03-27 14:40:26", "date_publish": "2017-06-27 00:00:00", "description": "Madhya Pradesh Home Secretary Madhu Khare was transferred today to the Khadi and Gramodyag department. While the government is yet to comment on the transfer, it comes after six farmers were killed in Mandsaur last week after the police opened fire to control crowds during a farmers' protest.", "filename": "india-news_madhya-pradesh-home-secretary-madhu-khare-transferred-after-six-farmers-were-killed-in-violence-hit-1711302_1553697626.html", "image_url": "https://i.ndtvimg.com/i/2017-06/mandsaur-farmers-protest_650x400_81497045529.jpg", "language": null, "localpath": "/home/raj/news-please-repo//data/2019/03/27/ndtv.com/india-news_madhya-pradesh-home-secretary-madhu-khare-transferred-after-six-farmers-were-killed-in-violence-hit-1711302_1553697626.html", "title": "Days After Madhya Pradesh Farmer Deaths, State Home Secretary Transferred", "title_page": "Madhya Pradesh Home Secretary Madhu Khare transferred after six farmers were killed in violence-hit Mandsaur", "title_rss": "NULL", "source_domain": "ndtv.com", "text": "Six farmers had died in police firig in Madhya Pradesh's Mandsaur following firing by police.\nMadhya Pradesh Home Secretary Madhu Khare was transferred today to the Khadi and Gramodyag department. While the government is yet to comment on the transfer, it comes after six farmers were killed in Mandsaur last week after the police opened fire to control crowds during a farmers' protest.Ms Khare will be the state's managing director of Khadi in place of Renu Tiwari. Kedar Sharma, who is the Officer on Special Duty-cum-Director (Scheduled Caste Regional Development Schemes) will replace Ms Khare.The state government initially claimed it was not the police who opened fire and admitted it only much later -- triggering more protests across the state.Chief Minister Shivraj Singh Chouhan, who undertook a 28-hour fast for peace on Saturday and Sunday, had promised that action would be taken against the guilty.Those instigating violence would not be spared, Mr Chouhan had also said. \"Justice will be done and the culprits would be punished,\" he said.While no case has been lodged yet against the police, the government has ordered an inquiry into the matter by Retired High Court judge JK Jain.The state government had come under sharp attack from the opposition Congress over the deaths. The party has called the deaths \"cold-blooded murders\".The farmers in Madhya Pradesh had started protests earlier this month, demanding better prices for their crops and a loan waiver. Mandsaur region had been the epicenter of the protests. The Chief Minister has assured that the state will provide profitable prices to farmers. He is also believed to be considering waiving interest on farm loans, which could benefit more than six lakh farmers.\nGet the latest election news, live updates and election schedule for Lok Sabha Elections 2019 on ndtv.com/elections. Like us on Facebook or follow us on Twitter and Instagram for updates from each of the 543 parliamentary seats for the 2019 Indian general elections.", "url": "https://www.ndtv.com/india-news/madhya-pradesh-home-secretary-madhu-khare-transferred-after-six-farmers-were-killed-in-violence-hit-1711302", "label": 1}