{"authors": [], "date_download": "2019-03-27 14:35:20", "date_modify": "2019-03-27 14:35:20", "date_publish": "2016-10-18 11:55:06", "description": "Opposition parties in Tamil Nadu block trains to push for setting up of Cauvery Water Board", "filename": "india_story_cauvery-water-management-board-tamil-nadu-pwf-dmk-stalin-farmers-stalin-rail-roko-347091-2016-10-18_1553697320.html", "image_url": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/201610/tn-opposition-protest_647_101816101432.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/indiatoday.in/india_story_cauvery-water-management-board-tamil-nadu-pwf-dmk-stalin-farmers-stalin-rail-roko-347091-2016-10-18_1553697320.html", "title": "Tamil Nadu: Opposition parties' rail roko protest to press for Cauvery Board enters 2nd day", "title_page": "Tamil Nadu: Opposition parties' rail roko protest to press for Cauvery Board enters 2nd day - India News", "title_rss": "NULL", "source_domain": "indiatoday.in", "text": "Opposition parties in Tamil Nadu are holding a rail roko protest for the second consecutive day today demanding constitution of the Cauvery Water Management Board.\nYesterday, Chennai came to a standstill as major Opposition parties in Tamil Nadu held the protest demanding constitution of the Cauvery Water Management Board by the Centre.\nAlthough the rail roko agitation was planned and conducted across the state, Chennai was hit particularly by the protest.\n3 RAILWAY STATIONS CAME TO A HALT\nRailway stations like Perambur, Chennai Central and Saidaipet, which witness large crowds usually, came to a total halt due to the protest.\nAlso read: Tamil Nadu's farmers, parties protest for Cauvery board, stop trains\nDMK cadres, in thousands of numbers, flocked to the Perambur railway station blocking the entire zone. Busy roads across the station were paralysed subjecting Monday morning commuters to extreme inconvenience.\nDMK cadres were led by MK Stalin, who reached the spot around 9.15 am. Around 10.30, Stalin tried to break-in through the barricades with his followers and forcibly enter the station. His partymen jumped over the compound walls to protect him.\nCOPS FAIL TO CONTROL CROWD\nAlthough a large number of policemen were deployed, they were unable to control the crowd, which numbered in thousands. Commuters, who wanted to board the train, were stranded for nearly two hours until Stalin was arrested.\nAlso read: Cauvery row: Committee submits report, says farmers suffering in both states\nCentral Railway Station, also faced the ire of the protestors as Vaiko led cadres of the 'People's Welfare Front' to the spot. The PWF cadres tried to block the 'Mangalore Express'.\nHe said, \"The Centre backed off from the promise of constituting the Cauvery water Management board. This is not fair. Tamil Nadu farmers are suffering here\".\nPOLITICAL AGENDA BEHIND CENTRE'S MOVE: VAIKO\nVaiko added that he could see a political agenda behind the Centre's decision and that the technical high committee team that visited the Cauvery basin couldn't be expected to make any difference to the situation. \"The only way to resolve the issue would be by constituting the Cauvery Water Management Board,\" he added.\nThe protests were seen as a crucial move of showing strength as AIADMK Chief Jayalalithaa was admitted to the hospital and was not in a condition to take any action. The opposition leaders claimed that the move was to produce pressure on the Centre to come out with the date when the Cauvery Water Management Board would submit its report to the Supreme Court.", "url": "https://www.indiatoday.in/india/story/cauvery-water-management-board-tamil-nadu-pwf-dmk-stalin-farmers-stalin-rail-roko-347091-2016-10-18", "label": 1}