{"authors": [], "date_download": "2019-03-27 14:40:50", "date_modify": "2019-03-27 14:40:50", "date_publish": "2015-08-24 00:00:00", "description": "Jains in Rajasthan, Maharashtra and Madhya Pradesh protest Santhara ban - In Mumbai, members of the community took out a march from a Jain temple in Walkeshwar. The participants were dressed in white.", "filename": "india_report-jains-in-rajasthan-maharashtra-and-madhya-pradesh-protest-santhara-ban-2118059_1553697650.html", "image_url": "https://cdn.dnaindia.com/sites/default/files/styles/full/public/2015/08/24/368880-santhara.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/dnaindia.com/india_report-jains-in-rajasthan-maharashtra-and-madhya-pradesh-protest-santhara-ban-2118059_1553697650.html", "title": "Jains in Rajasthan, Maharashtra and Madhya Pradesh protest Santhara ban", "title_page": "Jains in Rajasthan, Maharashtra and Madhya Pradesh protest Santhara ban", "title_rss": "NULL", "source_domain": "dnaindia.com", "text": "The Jain community on Monday took out marches in Mumbai, Bhopal and other parts of Maharashtra and Madhya Pradesh to protest against the Rajasthan High Court's verdict holding as illegal the custom of `Santhara' -- a ritual of self-starvation to death. In many places, Jains chose to tonsure their heads. The protest also affected auctions of onion in Nashik district.\n\"The movement against the court's decision, launched by the community members in Lalitpur (in UP) by tonsuring their heads, has spread across the entire country,\" Digamber Jain Mahasamiti president Ravindra Jain told PTI in Bhopal. Across India nearly 15,000 Jains tonsured their heads, he claimed.\nA petition has been filed in the Rajasthan High Court seeking a review of the August 10 order directing the state to book Jain community members for attempting suicide if they resort to the ritual of Santhara (fast unto death). The application, filed a week ago, has been moved by one P C Bhandari claiming to be a follower of Jain religion.\nThe members of both Digamber and Shwetamber sects were protesting the HC ruling, he said. In Madhya Pradesh, protests were held in Bhopal, Indore, Jabalpur, Gwalior, Guna, Shivpuri, Ashoknagar, Betul, Sironj, Ratlam, Mandsaur and Neemuch. The community members shared their photos with tonsured heads on the social media.\nThe Rajasthan High Court earlier this month held the age-old custom as illegal, making it punishable under sections 306 and 309 of IPC (abetment of suicide and attempt to commit suicide, respectively).\n\"Santhara or fast unto death is not an essential tenet of Jainism,\" the HC said.\nIn Mumbai, members of the community took out a march from a Jain temple in Walkeshwar. The participants were dressed in white. Sakal Jain Samaaj, a local Jain group, had appealed the community members to participate in the protest. Protests were held at Aurangabad and Nashik in Maharashtra too. In Nashik, a memorandum was submitted to the collector after a march, said Manoj Jain, deputy president of Maharashtra unit of All India Sudharna Jain Rakshak Sangh. Several shops and businesses remained closed.\nThe protest also affected the onion markets in Nashik district. It was decided not to hold the auctions at APMCs at Lasalgaon, Pimpalgaon, Nashik, Dindori, Kalwan and Yeola on account of the protesting Jain traders, district onion traders association president Sohanlal Bhandari said.", "url": "https://www.dnaindia.com/india/report-jains-in-rajasthan-maharashtra-and-madhya-pradesh-protest-santhara-ban-2118059", "label": 1}