{"authors": ["Oi-Oneindia Staff"], "date_download": "2019-03-27 14:35:10", "date_modify": "2019-03-27 14:35:10", "date_publish": "2018-05-23 11:39:17", "description": "Several people took to Twitter to express their shock, anger and bereavement over the loss of innocent lives in Tamil Nadu.", "filename": "india_is-gunning-down-protesters-tn-s-thoothukudi-state-sponsored-2701847_1553697310.html", "image_url": "https://www.oneindia.com/img/2018/05/sterliteprotest-1527055604.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/oneindia.com/india_is-gunning-down-protesters-tn-s-thoothukudi-state-sponsored-2701847_1553697310.html", "title": "Is gunning down of protesters in TN’s Thoothukudi state-sponsored terrorism?", "title_page": "Is gunning down of protesters in TN’s Thoothukudi state-sponsored terrorism? - Oneindia News", "title_rss": "NULL", "source_domain": "oneindia.com", "text": "Why gunning down of protesters in Tamil Nadu’s Thoothukudi is state-sponsored terrorism\nIndia\noi-Oneindia Staff\nBy oneindia staff\nChennai, May 23: In a democracy, masses have only one tool to voice their dissent against ruling governments. They come out on the streets and protest against any wrongdoings.\nIn today's India, protests are fast turning into violent episodes of mass killings. The latest is the case of deaths of at least 10 innocent persons due to indiscriminate firing by the police during an anti-Sterlite rally in Tamil Nadu's Thoothukudi on Tuesday.\nCongress president Rahul Gandhi termed the deaths of several people in police firing during protests against the Sterlite copper plant in the southern state a \"brutal example of state-sponsored terrorism.\"\n\"The gunning down by the police of 9 people in the Sterlite protest in Tamil Nadu is a brutal example of state sponsored terrorism. These citizens were murdered for protesting against injustice. My thoughts and prayers are with the families of these martyrs and the injured,\" Rahul wrote on Twitter.\nThe gunning down by the police of 9 people in the #SterliteProtest in Tamil Nadu, is a brutal example of state sponsored terrorism. These citizens were murdered for protesting against injustice. My thoughts & prayers are with the families of these martyrs and the injured. — Rahul Gandhi (@RahulGandhi) May 22, 2018\nTamil Nadu chief minister Edappadi K Palaniswami has ordered a judicial inquiry into the police action.\nThe police action followed months-long protests for the closure of Vedanta's Sterlite copper unit in Thoothukudi over pollution concerns. The agitation turned violent on Tuesday, with protesters fighting pitched battles with police, prompting it to open fire.\nSeveral people took to Twitter to express their shock, anger and bereavement over the loss of innocent lives. Many have termed the whole macabre episode as genocide, well-planned to help big corporates to carry on with their money-minting projects without any hiccups.\nSeveral raised questions over the decision of the police to use assault rifles to open fire against unarmed Sterlite protesters. The deaths of so many people in Tamil Nadu reminded others of Kashmir, where protesters have often been silenced by bullets.\nHere we bring you a few tweets highlighting the police brutality:\nRapist Ram Rahim supporters\nburned down Panchkula - No firing\nKarni Sena goons went on a rampage and burned down vehicles and even attacked school buses - No firing\nPublic protest over environmental pollution : Police shot & killed 9 !\n#SterliteProtest — FYI (@_NairFYI) May 22, 2018\nSLR & AK47 used to open fire against #Sterlite protesters???? Clear violation by Tamil Nadu police. This is NOT crowd control happens? This is brutal use of force & indiscriminate killing of innocent people #SterliteProtest #EPSMustGo #DGPMustGo #OPSMustGo pic.twitter.com/UPEpSqKJuR — Shabbir Ahmed (@Ahmedshabbir20) May 22, 2018\nsaddened and im angered .firing innocent lives who strived only for everyones wellbeing . just because they dont create violence doesn't mean they dont know and you'll take it for granted.\nmy deepest condolences to the families that lost their loved ones #SterliteProtest — Vijay Sethupathi ◽️ (@i_vijaysethu) May 22, 2018\nWar of India's poor against Modi led corporates reaches Tamil Nadu. Police kills 13 protesting against Vedanta Copper Unit! Now the corporate controlled media will brand the protestors as Urban Naxalites.😠#SterliteProtest — Sanjiv Bhatt (IPS) (@sanjivbhatt) May 22, 2018\nEach and every bullet in the chests of dead protestors will come back to haunt this sham of a govt in Tamil Nadu. Deepest condolences and prayers for the murdered innocents and their families. What a dark day in our history. #SterliteProtest — Siddharth (@Actor_Siddharth) May 22, 2018", "url": "https://www.oneindia.com/india/is-gunning-down-protesters-tn-s-thoothukudi-state-sponsored-2701847.html", "label": 1}