{"authors": ["Fe Online"], "date_download": "2019-03-27 14:34:57", "date_modify": "2019-03-27 14:34:57", "date_publish": "2018-05-26 14:19:41", "description": "The Thoothukudi district administration is likely to restore the Internet services imposed in the city from tonight. The administration is also likely to withdraw the imposition of Section 144 (prohibits assembly of more than four people).", "filename": "india-news_anti-sterlite-pr_e04e047221448d3ff29f316d7a896330__1553697297.html", "image_url": "https://images.financialexpress.com/2018/05/SterliteCopper.jpg", "language": null, "localpath": "/home/raj/news-please-repo//data/2019/03/27/financialexpress.com/india-news_anti-sterlite-pr_e04e047221448d3ff29f316d7a896330__1553697297.html", "title": "Anti-Sterlite protests: Suspension of Internet services, Imposition of Section 144 likely to lift tonight, says Thoothukudi Collector", "title_page": "Anti-Sterlite protests: Suspension of Internet services, Imposition of Section 144 likely to lift tonight, says Thoothukudi Collector - The Financial Express", "title_rss": "NULL", "source_domain": "financialexpress.com", "text": "Vedanta’s Sterlite Copper unit in Tuticorin. (PTI Photo)\nThe Thoothukudi district administration is likely to restore the Internet services imposed in the city from tonight. The administration is also likely to withdraw the imposition of Section 144 (prohibits assembly of more than four people). “Internet suspension & Section 144 (prohibits assembly of more than 4 people) were to remain in effect till tomorrow, but we are thinking of lifting them tonight,” Sandeep Nanduri, Collector, Thoothukudi told news agency ANI.\nSection 144 was imposed on Wednesday after 13 people were killed and over 60 injured in a violent protest against Sterlite Industries in Tamil Nadu’s Thoothukudi. After the incident, security was strengthened and police personnel were directed to keep a tight vigil in several parts of the city.\nThe protests were going on since last three months but violence took place on May 22 (Tuesday) when agitators allegedly hurled stones at police forces, prompting it to open fire. The locals have alleged that the Sterlite copper plant is responsible for pollution and they have been demanding its closure.\nOn Thursday, the Madras High court in its interim order had stayed the expansion plans of the plant. It also asked the state government to preserve the bodies of those killed on May 22 protests. A Public Interest Litigation (PIL) was also filed in the Supreme court seeking a court-monitored CBI probe into the deaths of the protestors. The apex court is scheduled to hear the matter on May 28.\nThe state government had formed a judicial commission headed by retired High court judge Justice Aruna Jagadeesanto probe the police firing. Meanwhile, National Human Rights Commission (NHRC) has also issued a notice to the Tamil Nadu government over the death of people killed in police firing. The commission has asked the Chief Secretary and Director General of Police (DGP) to file a reply within two weeks. Apart from this, Home Ministry has also sought a report from the state government to provide details of the incident.", "url": "https://www.financialexpress.com/india-news/anti-sterlite-protests-suspension-of-internet-services-imposition-of-section-144-likely-to-lift-tonight-says-thoothukudi-collector/1182039/", "label": 1}