{"authors": ["Fe Online"], "date_download": "2019-03-27 14:35:09", "date_modify": "2019-03-27 14:35:09", "date_publish": "2018-05-28 17:48:51", "description": "Sterlite plant shut down: Tamil Nadu government has issued an order for \"closure\" of the operation of Sterlite Copper plant in Tuticorin.", "filename": "india-news_sterlite-plant-s_56dea0853ea5cb85d9726a6928dfe5c4__1553697309.html", "image_url": "https://images.financialexpress.com/2018/05/SterliteCopper.jpg", "language": null, "localpath": "/home/raj/news-please-repo//data/2019/03/27/financialexpress.com/india-news_sterlite-plant-s_56dea0853ea5cb85d9726a6928dfe5c4__1553697309.html", "title": "Sterlite plant shut down: Days after Thoothukudi deaths, Tamil Nadu government orders closure of Vedanta group's unit", "title_page": "Sterlite plant shut down: Days after Thoothukudi deaths, Tamil Nadu government orders closure of Vedanta group's unit - The Financial Express", "title_rss": "NULL", "source_domain": "financialexpress.com", "text": "Vedanta’s Sterlite Copper unit in Tuticorin. (PTI Photo)\nSterlite plant shut down: Tamil Nadu government on Monday issued an order for “permanent closure” of the operation of Sterlite Copper plant in Tuticorin. The move comes after Deputy Chief Minister O Paneerselvam asserted the government will take resolute steps for the permanent closure of Vedanta group’s plant. “Tamil Nadu government orders closure of Sterlite plant following the death of 13 people in police firing during Anti-Sterlite protests in Thoothukudi,” ANI reported. The government also asked the state Pollution Control Board to seal Vedanta’s copper plant.\n“Today, the main demand of people is that the copper plant should be permanently closed. In keeping with their demand, it is shut now. I would like to make it clear that Sterlite plant will be permanently shut,”Paneerselvam told PTI.\nThe Deputy Chief Minister also asserted that if there were any legal challenges in the closure of the plant, it will be faced and the government will take an immediate action. He also recalled the steps taken by late Chief Minister J Jayalalitha in 2013. Paneerselvam also met 47 injured people and consoled them. He further said that district administration is working to return back normalcy in the area.\n“Peace has returned to Tuticorin and it will continue and the district administration is working towards that,” Dy CM told PTI.\nMeanwhile, as per media reports, the directions to open fire at a group of protesters came from a government official in the rank of ‘Deputy Tehsildar’. According to India Today, it was the ‘Deputy Tehsildar’ who issued the orders to open fire after the crowd turned violent.\nEarlier in the day, the Supreme court refused an urgent hearing over alleged police atrocities during protests. In its order, the court said, “We would hear it after the vacation,” reports ANI. A total of 13 people were killed and over 60 injured in a violent protest against Sterlite Industries in Tamil Nadu’s Thoothkudi.\nOn Sunday, Thoothukudi district administration restored Internet services imposed in the city. “We assessed the existing situation and the officers and strength deployment, accordingly we are withdrawing some officer and strength but we are keeping the adequate strength to take care of peace in the entire district. I request people to cooperate in bringing back normalcy in the entire district,” TK Rajendran, DGP, Tamil Nadu told ANI.\nOn Saturday, the district administration had lifted the imposition of Section 144 (prohibits assembly of more than four people) from the district. Section 144 and suspension of Internet services were imposed on May 23 after the violence.\nThe protests that were continuing for the last three months turned violent on May 22 when protestors allegedly hurled stones at police forces, prompting them to open fire. The locals have alleged that the plant of Sterlite Copper is responsible for rising levels of pollution and they have been demanding its closure.\nLast week, the Madras High court in its interim order had stayed the expansion plans of the plant. The court also asked the state government to protect the bodies of those killed on May 22 protests.\nThe state government has formed a judicial commission headed by retired High Court judge Justice Aruna Jagadeesan to probe the police firing. Meanwhile, NHRC (National Human Rights Commission) has also issued a notice to the state government over the death of people killed in police firing. The commission has asked the Chief Secretary and Director General of Police (DGP) to file a reply within two weeks. Apart from this, Home Ministry has also sought a report from the state government to provide details of the incident.", "url": "https://www.financialexpress.com/india-news/sterlite-plant-shut-down-days-after-thoothukudi-deaths-tamil-nadu-government-orders-closure-of-vedanta-groups-unit/1184188/", "label": 1}