{"authors": ["Fe Online"], "date_download": "2019-03-27 14:40:24", "date_modify": "2019-03-27 14:40:24", "date_publish": "2019-01-21 12:48:55", "description": "Alleging that the Congress government in the state was refusing to take the incident seriously, Chouhan also sought a CBI inquiry into Manoj Thackeray's killing in Barwani.", "filename": "india-news_mp-on-the-boil-b_aac5442556ca8d73dd7558781ecb6b71__1553697624.html", "image_url": "https://images.financialexpress.com/2019/01/kamal-2.jpg", "language": null, "localpath": "/home/raj/news-please-repo//data/2019/03/27/financialexpress.com/india-news_mp-on-the-boil-b_aac5442556ca8d73dd7558781ecb6b71__1553697624.html", "title": "MP on the boil: BJP ups ante against Kamal Nath govt after murder of two party leaders within days", "title_page": "MP on the boil: BJP ups ante against Kamal Nath govt after murder of two party leaders within days - The Financial Express", "title_rss": "NULL", "source_domain": "financialexpress.com", "text": "The protesters raised slogans against the government and also burnt an effigy of CM Kamal Nath.\nAlleging a complete breakdown of law and order, former Chief Minister Shivraj Singh Chouhan has alleged that the Congress-led Kamal Nath government is refusing to take the matter seriously and sought a CBI probe into the killing of BJP leaders.\nOpposition Bharatiya Janata Party has launched a fierce attack on the newly elected Congress government led by Chief Minister Kamal Nath after two of its leaders were found dead in a span of a few days. The BJP’s onslaught comes after party leader Manoj Thackeray was found dead in an open field in Barwani on Sunday.\nThis came barely days after another BJP leader, civic body chairman of Mandsaur, Prahlad Bandhwar, 50, was shot in full public view on Thursday.\nFormer Chief Minister Shivraj Singh Chouhan launched a scathing attack on the Kamal Nath government and accused it of turning the killing of BJP leaders in the state into a “cruel joke”.\n“One after the other, the killing of BJP leaders is a serious matter. The state government is not taking it seriously and making a cruel joke of it. Popular BJP leader Manoj Thackeray was killed in broad daylight in the state home minister’s backyard,” Chouhan tweeted.\nA day after Thackeray’s killing, BJP leaders and workers took to the streets in the state capital of Bhopal to protest against the alleged collapse of law and order in the current government. The protesters raised slogans against the government and also burnt an effigy of CM Kamal Nath.\nMadhya Pradesh: BJP workers and party leaders protest against Chief Minister Kamal Nath in Bhopal, against the recent murders of BJP leaders Prahlad Bandhwar in Mandsaur and Manoj Thackeray in Barwani. pic.twitter.com/KqILxolHUR — ANI (@ANI) January 21, 2019\nSpeaking to reporters on Sunday, Chouhan slammed the Kamal Nath government for the promise of change it had made in the run up to the elections. “Is this the change that they had promised?” Chouan asked. “Criminals are roaming free and innocent people are being killed. There is a complete collapse of law and order in the state,” the former three-time CM said.\nAlleging that the Congress government in the state was refusing to take the incident seriously, Chouhan also sought a CBI inquiry into Manoj Thackeray’s killing in Barwani.\n“There seems to be a larger conspiracy behind this. I demand a CBI inquiry. BJP leader was killed in Barwani, I am warning the government that they put an end to such incidents or else BJP will come out on streets,” Chouhan said.", "url": "https://www.financialexpress.com/india-news/mp-on-the-boil-bjp-ups-ante-against-kamal-nath-govt-after-murder-of-two-party-leaders-within-days/1450156/", "label": 1}