{"authors": [], "date_download": "2019-03-27 14:35:40", "date_modify": "2019-03-27 14:35:40", "date_publish": "2019-01-02 15:57:36", "description": "The protests come after the Kamal Nath-led Congress government decided to stop the previous government's tradition of reciting Vande Mataram on the first working day of every month. Nath had said that reciting the national song, Vande Mataram cannot validate one's patriotism.", "filename": "india_bjp-protest-against-kamal-nath-after-announcement-to-end-singing-of-vande-mataram-on-first-working-day-of-every-month-5822531_1553697340.html", "image_url": "https://images.firstpost.com/wp-content/uploads/2019/01/ani-1.jpg", "language": null, "localpath": "/home/raj/news-please-repo//data/2019/03/27/firstpost.com/india_bjp-protest-against-kamal-nath-after-announcement-to-end-singing-of-vande-mataram-on-first-working-day-of-every-month-5822531_1553697340.html", "title": "BJP protest against Kamal Nath after announcement to end singing of Vande Mataram on first working day of every month", "title_page": "BJP protest against Kamal Nath after announcement to end singing of Vande Mataram on first working day of every month - Firstpost", "title_rss": "NULL", "source_domain": "firstpost.com", "text": "Bhopal: Bharatiya Janata Party (BJP) workers held a protest outside the Madhya Pradesh Secretariat against Chief Minister Kamal Nath over the Vande Mataram row.\nOn Tuesday, the Kamal Nath-led Congress government in Madhya Pradesh decided to stop the previous BJP government's tradition of reciting Vande Mataram on the first working day of every month. Nath had said that reciting the national song, Vande Mataram cannot validate one's patriotism.\nWhile defending the move to put on hold the recital of Vande Mataram, Nath said on Tuesday: \"We have no intentions of breaking or protesting against the national song. The order to recite Vande Mataram in the Secretariat on the first day of the month has been put on hold. A decision has been taken to implement the order in a new form. Those who do not recite Vande Mataram are not patriots?\"\n\"We believe that we are nationalists by hearts. One cannot become patriotic by reciting Vande Mataram for one day,\" he added.\nThe Madhya Pradesh assembly session is slated to begin on 7 January, with the oath-taking by the newly-elected MLAs.\nEarlier in the day, former Madhya Pradesh chief minister Shivraj Singh Chouhan said that the 109 MLAs from the BJP will recite Vande Mataram at the Secretariat and then take oath on 7 January.\nFirstpost is now on WhatsApp. For the latest analysis, commentary and news updates, sign up for our WhatsApp services. Just go to Firstpost.com/Whatsapp and hit the Subscribe button.", "url": "https://www.firstpost.com/india/bjp-protest-against-kamal-nath-after-announcement-to-end-singing-of-vande-mataram-on-first-working-day-of-every-month-5822531.html", "label": 1}