{"authors": [], "date_download": "2019-03-27 14:34:55", "date_modify": "2019-03-27 14:34:55", "date_publish": "2018-05-27 20:38:34", "description": "The internet services, which were suspended in violence-hit Thoothkudi on Wednesday (May 23), would resume tonight, said reports. Over a dozen people were killed in Thoothkudi (Tuticorin) in the last week over protests against the Sterlite copper plant.", "filename": "india_anti-sterlite-protests-internet-services-thoothukudi-resume-tonight-2704656_1553697295.html", "image_url": "https://www.oneindia.com/img/2018/05/tuticorin-violence-1527433471.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/oneindia.com/india_anti-sterlite-protests-internet-services-thoothukudi-resume-tonight-2704656_1553697295.html", "title": "Anti Sterlite protests: Internet service in Thoothukudi resumes", "title_page": "Anti Sterlite protests: Internet service in Thoothukudi resumes - Oneindia News", "title_rss": "NULL", "source_domain": "oneindia.com", "text": "Anti Sterlite protests: Internet service in Thoothukudi resumes\nIndia\noi-Vikas\nBy Vikas\nThe internet services, which were suspended in violence-hit Thoothukudi on Wednesday (May 23), would resume on Sunday night, said reports. Over a dozen people were killed in Thoothukudi (Tuticorin) in the last week over protests against the Sterlite copper plant.\nEarlier today (May 27), the Thoothukudi district administration lifted Section 144 which was imposed in the city after the Sterlite Protest.\n\"Internet facility will be restored from tonight. People can avail services without any problem. We are also withdrawing some officers from some areas, but we are keeping adequate forces on the ground. I request the people to co-operate,\" news agency ANI quoted TK Rajendran, DGP Tamil Nadu, as saying.\nSection 144 was imposed on Wednesday after 13 people were killed and over 60 injured in a violent protest against Sterlite Industries in Tamil Nadu's Thoothukudi. After the incident, security was strengthened and police personnel were directed to keep a tight vigil in several parts of the city.\nThe protests have been going on for the last three months but it took a violent turn on May 22 (Tuesday) when agitators allegedly hurled stones at police forces, prompting the cops to open fire.\nThe locals allege that the Sterlite copper plant is responsible for pollution and they have been demanding its closure.\nOn Thursday, the Madras High court in its interim order had stayed the expansion plans of the plant. It also asked the state government to preserve the bodies of those killed on May 22 protests. A Public Interest Litigation (PIL) was also filed in the Supreme court seeking a court-monitored CBI probe into the deaths of the protestors. The apex court is scheduled to hear the matter on May 28.", "url": "https://www.oneindia.com/india/anti-sterlite-protests-internet-services-thoothukudi-resume-tonight-2704656.html", "label": 1}