{"authors": [], "date_download": "2019-03-27 14:41:02", "date_modify": "2019-03-27 14:41:02", "date_publish": "2017-07-27 14:55:17", "description": "LIVE UPDATES: RJD chief Lalu Yadav today blasted Nitish Kumar for dumping Bihar grand alliance and joining hands with the BJP again. The former Bihar CM called Nitish an opportunist and said that he has cheated the people of Bihar.", "filename": "india_story_bihar-live-updates-nitish-kumar-lalu-yadav-rjd-jdu-tejashwi-1026508-2017-07-27_1553697662.html", "image_url": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/201707/nitish-sushil-story_647_072717101515.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/indiatoday.in/india_story_bihar-live-updates-nitish-kumar-lalu-yadav-rjd-jdu-tejashwi-1026508-2017-07-27_1553697662.html", "title": "LIVE: Nitish Kumar has betrayed Bihar mandate which had thrown Modi-Shah out, says Lalu Prasad", "title_page": "LIVE: Nitish Kumar has betrayed Bihar mandate which had thrown Modi-Shah out, says Lalu Prasad - India News", "title_rss": "NULL", "source_domain": "indiatoday.in", "text": "Nitish Kumar broke off ties with Lalu's RJD and Congress to join hands with the BJP again.\nLess than 16 hours after he resigned from the post in a dramatic change of stance, Nitish Kumar took oath as the chief minister of Bihar for the sixth time today. BJP's Sushil Modi will be his deputy.\nEarlier, Lalu Prasad Yadav's Rashtriya Janata Dal (RJD) hit the streets across Bihar in protest against Nitish Kumar's decision to dump Mahagathbandhan for the Bharatiya Janata Party (BJP). Nitish Kumar walked out of the 20-month-old grand alliance on Wednesday evening bringing a dramatic end to days of political uncertainty in the state.\nFROM INDIA TODAY MAGAZINE: NITISH KUMAR - GIANT SLAYER\nMoments after Nitish tendered his resignation to Governor Keshari Nath Tripathi, he was once again at the Governor's House later in the night to claim support of 132 MLAs of the JD-U and the BJP. He will have to take the floor test in the Assembly on Friday (July 28).\nLATEST UPDATES:\nSharad Yadav meets Congress Vice-President Rahul Gandhi.\nFormer JD-U chief Sharad Yadav calls meeting of party MPs at his house in Delhi at 5pm. MP Ali Anwar, MP Virendra Singh, who are upset with Nitish Kumar, likely to attend meeting.\nLalu treated Nitish as his younger brother. Gave him full freedom to run the government but Nitish backstabbed him: Rabri Devi\nDuring the day Nitish Kumar used to talk to us in the night he called BJP leaders: Rabri Devi.\nNitish Kumar is a cheater. He betrayed us. People of Bihar will teach Nitish a lesson soon, says Rabri Devi.\nNitish Kumar's political career is nearing its end, says Lalu Yadav.\nOpposition is united in the fight against BJP. I invite all political parties and leaders Mayawati, Akhilesh, Mamta didi for the August 27 rally in Patna.\nJD-U MLAs were confined inside Nitish's residence for the whole night yesterday: Lalu.\nConsidering to go to Supreme Court against Governor's decision to invite Nitish Kumar first to form government: Lalu Yadav\nI am ready to explain. Charges against me might be serious but Nitish Kumar is also accused in a murder case: Tejashwi\nWe are ready for election. Dare Nitish Kumar to go to people's court. BJP will show Nitish the mirror soon: Tejashwi Yadav.\nWe were used as bait to gain power, says Tejashwi Yadav.\nI was ready to explain graft charges. Even asked Nitish to draft my reply, I trusted him: Tejashwi.\nThis was well-planned plot: Tejashwi Yadav.\nIt is obvious that all the drama was scripted: Tejashwi Yadav tells India Today's Rajdeep Sardesai in Patna.\nNitish Kumar is greedy for power, I am not: Lalu.\nRaids were conducted at out houses but nothing was found: Lalu.\nSushil Modi was asked to malign my image, it all happened under Narendra Modi, Amit Shah's watch. Amit Shah is super editor, says Lalu Yadav.\nHumne Nitish ko tilak laga ke kaha jao raaj karo, lekin wo to Bhashmashur nikla: Lalu\nLalu Nitish prohibited liquor in Bihar but it was a big sham. Liquor is being home-delivered in state: Lalu.\nNitish Kumar is an opportunist leader. His anti-BJP drive was all drama, says Lalu.\nBJP is fooling people of India: Lalu.\nBihar's mandate was against Narendra Modi and BJP and now Nitish has joined hands with the BJP: Lalu.\nNitish Kumar behind my conviction by the lower court, says Lalu Prasad.\nSad that there is no Bapu in the country today. BJP worships Mahatma Gandhi's killers and now Nitish has joined hands with them: Lalu\nNitish betrayed us. Leaders do anything for power: Lalu Yadav.\nLalu Yadav addressing the media in Ranchi, where he had to appear before court in a fodder scam case.\nREAD: As Nitish Kumar takes oath, Tejashwi Yadav cries foul, calls ex-boss opportunist rival\nThe decision was taken for the development and benefit of Bihar and its people. We remain committed to region's development: Nitish Kumar.\nPM Modi congratulates Nitish Kumar and Sushil Modi on Twitter.\"Congratulations to @NitishKumar ji & @SushilModi ji. Looking forward to working together for Bihar's progress & prosperity,\" he said.\nCongratulations to @NitishKumar ji & @SushilModi ji. Looking forward to working together for Bihars progress & prosperity. - Narendra Modi (@narendramodi) July 27, 2017 Nitish Kumar has betrayed us, we were knew something was going on between him and the BJP: Rahul Gandhi.\nRahul Gandhi reacts to Nitish Kumar decision to dump Bihar grand alliance.\nNitish Kumar takes oath as Bihar CM for the sixth time. Sushil Kumar Modi will be deputy CM.\nNitish Kumar, Sushil Modi reach Governor House for oath taking.\nNitish should go to people to seek support, says Digvijaya Singh.\nShame on Governor for not inviting the RJD, single largest party, first to form government: Digvijaya Singh\nScene outside Raj Bhawan in Patna; preparations underway as Nitish Kumar set to be sworn in as Bihar Chief Minister for the 6th time today pic.twitter.com/0R5knvMC0L - ANI (@ANI_news) July 27, 2017 People gave mandate to Mahagathbandhan in Bihar. People's mandate was against the BJP and NDA: Digvijaya Singh\nSenior Congress leader Digivijaya Singh slams Nitish Kumar for joining hands with BJP.\nNitish kumar has commited historical mistake: Ali Anwar.\nNitish Kumar decided to follow his inner conscience to support BJP. But my inner conscience doesn't allow me to support his decision, says Ali Anwar.\nFirst signs of revolt in JD-U. MP Ali Anwar comes out in open criticising Nitish Kumar for dumping the grand alliance Patna: Vehicles stuck in traffic jam as RJD supporters block Mahatma Gandhi Setu, connecting north Bihar with Patna #NitishKumar pic.twitter.com/euXG3ZkrLE - ANI (@ANI_news) July 27, 2017\nRJD supporters block Mahatma Gandhi Setu in Patna. Heavy traffic on the bride connecting Patna with north Bihar since 4am.\nTEJASHWI DECIDES TO FIGHT\nIn no mood to give up without a fight, Tejashwi Yadav earlier said the RJD being the single largest party in the state would stake claim to form the government.\n\"Have sought appointment with the governor. Will stake claim to form government as the the single largest party. Will also get the support of JD(U) MLAs who have won after defeating BJP candidates,\" Tejashwi tweeted.\nHowever, the numbers are stacked against him. The JD-U, BJP, their allies and supporting independent MLAs together account for 132 seats in the 243-member Bihar Assembly, 10 more than the magic figure of 122.\nRJD has 81 MLAs and even if Congress with 27 MLAs and CPI-ML (03) decide to back Tejashwi, their number would add up to 110.\nReacting sharply to the governor inviting Nitish Kumar for the swearing-in at 10 am after giving him an appointment for 11 am, Tejashwi said RJD would stage a dharna outside Raj Bhavan against it.\n\"Governor gv us time of 11AM and now suddenly has asked NDA for oath ceremony at 10AM. Why so much hurry & rush Mr. Honest & Moral?\" he tweeted well past midnight.\nALSO READ:\nNitish Kumar resigns, but not really: Bihar Game of Thrones starring BJP isolates Lalu Yadav?\nTrusted Nitish Kumar blindly but he betrayed me, says Lalu Prasad\nCall of my soul: 10 quotes of Nitish Kumar after his resignation as Bihar Chief Minister\nLalu goes for the jugular, says murder-accused Nitish is BJP's puppet\nNitish Kumar to be back as chief minister with BJP support: Bihar political drama as it unfolded\nWATCH: Impossible to work under current circumstances: Bihar CM Nitish Kumar after resignation", "url": "https://www.indiatoday.in/india/story/bihar-live-updates-nitish-kumar-lalu-yadav-rjd-jdu-tejashwi-1026508-2017-07-27", "label": 1}