{"authors": [], "date_download": "2019-03-27 14:28:58", "date_modify": "2019-03-27 14:28:58", "date_publish": "2018-05-27 00:00:00", "description": "A farmer said to be demonstrating against the Uttar Pradesh government with 50 others since May 21 died of a heatstroke on Saturday, the fourth anniversary of Narendra Modi's government and a day before the Prime Minister addresses a rally 20km from the spot.", "filename": "india_farmer-death-before-modi-s-visit-to-up_cid_1346407_1553696938.html", "image_url": "https://www.telegraphindia.com/assets/images/default_social_image.png?v=57", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/telegraphindia.com/india_farmer-death-before-modi-s-visit-to-up_cid_1346407_1553696938.html", "title": "Farmer death before Modi's visit to UP", "title_page": " Farmer death before Modi's visit to UP ", "title_rss": "NULL", "source_domain": "telegraphindia.com", "text": "Farmers on dharna in Baraut, Baghpat\nLucknow: A farmer said to be demonstrating against the Uttar Pradesh government with 50 others since May 21 died of a heatstroke on Saturday, the fourth anniversary of Narendra Modi's government and a day before the Prime Minister addresses a rally 20km from the spot.\nUday Veer Singh, 60, died while protesting before the Baraut tehsil office in Baghpat district a day after chief minister Yogi Adityanath visited Modi's rally venue to review the preparations but ignored the farmers' demand to meet them.\nAgitated at Uday Veer's death, over 10,000 farmers joined the dharna at the site within hours, declaring they would stay put till the state government met their demands to cut the power tariff for tube-wells and get sugar mills to pay their dues.\nFarmers' unpaid sugarcane dues, allegedly running into Rs 1,000 crore, is the principal issue for Monday's by-election to the Kairana Lok Sabha seat, 60km from the stadium in Mawikalan village where Modi is to hold his rally.\nOfficially, the Prime Minister is to inaugurate the much-awaited Eastern Peripheral Expressway but BJP sources had conceded that the rally would virtually serve as a campaign meeting a day before the vote.\nA BJP politician in Lucknow said that Modi had been expected to focus his speech on farmers with an eye on the by-election but, after Uday Veer's death, \"he has to speak about development in general\".\nIn Baraut, the farmers dismissed the local administration's claim that Uday Veer had not been part of the protest and decided to highlight the farmer suicides that had occurred in the district during the Modi government's tenure.\n\"Half-a-dozen farmers have committed suicide in Baghpat since Modi became Prime Minister,\" said Balroj Singh, a protesting farmer.\n\"Most recently, Deshraj Singh, 40, of village Daha hanged himself on April 19. He had a loan of Rs 6 lakh and the banks had sent him a recovery notice.\"\nThousands of farmers from elsewhere in Baghpat and adjoining districts - from where the BJP plans to ferry crowds to Modi's rally - arrived in Baraut to join the protest, being organised under the banner of the Kisan Sangharsh Samiti.\nThey held an impromptu \" panchayat\", attended also by khap (caste) elders and local politicians, in the evening and decided the agitation would go on till all the demands had been met.\nAt night, 30 farmers were continuing the dharna. \"We can't let the death of one of us go in vain,\" Balroj said.\nEarlier, additional district magistrate Lokpal Singh met the protesters, announced Rs 12 lakh for Uday Veer's family and said he had applied to the state government to grant them another Rs 38 lakh. He said all the demands would be met.\n\"The state government has raised electricity rates for tube-wells from Rs 100 per horsepower to Rs 150, whereas the rate is only Rs 35 per horsepower in Haryana,\" Jile Singh, a farmer leader, said.\n\"The sugar mills in western Uttar Pradesh have refused to clear the Rs 1,000 crore worth of dues they owe the sugarcane growers anytime soon. Adityanath is ignoring farmers' interests.\"\nAdityanath had repeatedly denied the farmers' allegation about unpaid dues over the past six months but is now trying to assuage them with assurances that few are willing to bank on.\nArvind Dwivedi, subdivisional magistrate of Baraut, claimed Uday Veer \"had come from somewhere on some business and was not part of the dharna\".\nBut Jile Singh said Uday Veer had been part of the dharna since it began and accused the administration of \"playing ugly politics against us\".\nOn Monday, a by-election would be held also for the Noorpur Assembly seat in western Uttar Pradesh. Both at Kairana and Noorpur, the BJP is up against the combined strength of the Samajwadi Party, Rashtriya Lok Dal, Bahujan Samaj Party and the Congress.", "url": "https://www.telegraphindia.com/india/farmer-death-before-modi-s-visit-to-up/cid/1346407", "label": 1}