{"authors": [], "date_download": "2019-03-27 14:40:29", "date_modify": "2019-03-27 14:40:29", "date_publish": "2018-09-05 08:23:42", "description": "Some organisations have also given a call for 'Bharat bandh' against the SC/ST Amendment Bill passed in the Parliament last month. The administration has imposed prohibitive orders under CrPC in four districts", "filename": "india_madhya-pradesh-ups-security-ahead-of-6-sept-bandh-protesting-scst-act-prohibitory-orders-issued-in-sensitive-morena-shivpuri-bhind-5116461_1553697629.html", "image_url": "https://images.firstpost.com/wp-content/uploads/2018/09/reservation-PTI-e1494295976624-1.jpeg", "language": null, "localpath": "/home/raj/news-please-repo//data/2019/03/27/firstpost.com/india_madhya-pradesh-ups-security-ahead-of-6-sept-bandh-protesting-scst-act-prohibitory-orders-issued-in-sensitive-morena-shivpuri-bhind-5116461_1553697629.html", "title": "Madhya Pradesh ups security ahead of 6 Sept bandh protesting SC/ST Act; sensitive Morena, Shivpuri, Bhind on high alert", "title_page": "Madhya Pradesh ups security ahead of 6 Sept bandh protesting SC/ST Act; sensitive Morena, Shivpuri, Bhind on high alert - Firstpost", "title_rss": "NULL", "source_domain": "firstpost.com", "text": "Bhopal: The Madhya Pradesh police have stepped up security across the state in view of the ongoing protests against the amendments in the SC/ST (Prevention of Atrocities) Act.\nSome organisations have also given a call for 'Bharat bandh' against the SC/ST Amendment Bill passed in the Parliament last month. The administration has imposed prohibitive orders under CrPC in four districts- Morena, Shivpuri and Bhind, all three in Gwalior-Chambal region, as well as in Ashok Nagar\ndistrict in view of the proposed bandh.\nGwalior-Chambal region, one of the sensitive areas, had witnessed a large-scale violence on 2 April this year during the 'Bharat bandh' called by Dalit groups. Makrand Deuskar, inspector general of police (Intelligence) told reporters on Tuesday, \"Police headquarters have alerted all the superintendents of police in view of proposed bandh on 6 September.\"\nHe said the police force allotted to the districts on the occasion of Krishna Janmashtami on Monday, would continue to remain deployed. Madhya Pradesh has witnessed protests against the ruling party leaders at various places in the past few days. \"In view of proposed Bharat Bandh on 6 September, the prohibitive orders under CrPC section 144 have been imposed in the district,\" Bhind District Collector Ashish Gupta said in a press note.\n\"It is necessary to impose section 144 this time as the law and order situation in the district was disturbed on 2 April this year when some organisations had given the call of 'Bharat bandh',\" he said. The collectors in Shivpuri and Morena districts have also imposed prohibitive orders under CrPC section 144. Brahma Samagam Sawarna Jankalyan Sangathan's national president Dharmendra Sharma said that about 150 organisations of upper castes and OBCs would participate in the Bharat bandh against the amendments in SC/ST Act.\n\"We will protest peacefully on 6 September. Through this protest, we will demand withdrawal of this black law. All the sections except SC/ST are affected due to this amendment. We will also write letters to all MPs of the country,\" Sharma said.\nFormer Union Minister and senior BJP OBC leader Prahlad Patel expressed his displeasure over the protests. \"The role of people from the OBC community has become all the more important in this scenario. For centuries, the OBCs have been acted as a bridge between upper castes and scheduled castes and they will continue to play this role actively in future,\" he said.\nProtests have been going on against the amendments in SC/ST Bill in parts of the state since the past one week. The protesters staged a demonstration outside the bungalows of union minister Narendra Singh Tomar at Gwalior and Member of Parliament (MP) Bhagirath Prasad at Bhind. The protesters also staged a demonstration at Higher Education Minister Jaibhan Singh Pawaiya's bungalow at Gwalior.\nThe protesters also showed black flags to Union ministers Thawar Chand Gehlot and MJ Akbar at Guna and Vidisha respectively. Several other protests were also organised across the state. Earlier this year, the apex court had removed the strict provision of mandatory arrests under the Act. This decision had triggered nationwide protests by Scheduled Castes organisations, forcing the Centre to bring an amendment to the Act during the Monsoon Session to overrule the SC order.\nFirstpost is now on WhatsApp. For the latest analysis, commentary and news updates, sign up for our WhatsApp services. Just go to Firstpost.com/Whatsapp and hit the Subscribe button.", "url": "https://www.firstpost.com/india/madhya-pradesh-ups-security-ahead-of-6-sept-bandh-protesting-scst-act-prohibitory-orders-issued-in-sensitive-morena-shivpuri-bhind-5116461.html", "label": 1}