{"authors": ["Fe Online"], "date_download": "2019-03-27 14:29:17", "date_modify": "2019-03-27 14:29:17", "date_publish": "2017-04-03 15:23:36", "description": "In more trouble for beleaguered Himachal Pradesh chief minister Virbhadra Singh, the Enforcement Directorate today seized a farmhouse belonging to his family in Delhi under the Prevention of Money Laundering Act, 2002.", "filename": "india-news_disproportionate_062ba4d310cfa5a9391e1e4a4c82fa83__1553696957.html", "image_url": "https://images.financialexpress.com/2017/03/virbhadra.jpg", "language": null, "localpath": "/home/raj/news-please-repo//data/2019/03/27/financialexpress.com/india-news_disproportionate_062ba4d310cfa5a9391e1e4a4c82fa83__1553696957.html", "title": "Disproportionate assets case: Big setback for Himachal Pradesh CM Virbhadra Singh, ED seizes Delhi farm house", "title_page": "Disproportionate assets case: Big setback for Himachal Pradesh CM Virbhadra Singh, ED seizes Delhi farm house - The Financial Express", "title_rss": "NULL", "source_domain": "financialexpress.com", "text": "The Central Bureau of Investigation (CBI) on March 31 filed a charge sheet against HP CM Virbhadra Singh and others in connection with a disproportionate assets case. (PTI)\nIn more trouble for beleaguered Himachal Pradesh chief minister Virbhadra Singh, the Enforcement Directorate (ED) today seized a farmhouse belonging to his family in Delhi under the Prevention of Money Laundering Act, 2002. The agency has issued a provisional order attaching the farmhouse located in south Delhi’s Mehrauli area in connection with the ongoing money laundering probe against him. It said the book value of the Delhi farmhouse is Rs 6.61 crore but its market value is worth around Rs 27 crore and is in the name of “Maple Destinations & Dreambuild”. The ED added that the property was purchased by funding done through shell companies. The latest action of Ed comes in wake of the Central Bureau of Investigation (CBI) chargesheet. The CBI on March 31 filed a charge sheet against HP CM Virbhadra Singh and others in connection with a disproportionate assets case for allegedly amassing assets worth around Rs 10 crore which are reportedly not tallying with their known sources of income. The CBI filed the charge sheet before Special Judge Virender Kumar Goyal. The charge sheet also contains the name of Singh’s wife Pratibha along with others, bringing the total up to nine. Life Insurance Corporation agent Anand Chauhan, his associate Chunni Lal, Joginder Singh Ghalta, Prem Raj, Lawan Kumar Roach, Vakamullah Chandrashekhra and Ram Prakash Bhatia have been named in the charge sheet.\nWATCH | BJYM protests against Himachal Pradesh CM Virbhadra Singh near Congress office\nHowever, soon after seizing the farm house, HP CM Virbhadra Singh called it a “political vendetta”. Asked about the case, Singh told news agency ANI that he will face the case. In the latest development, the Delhi court has adjourned the matter for April 6.\nThe ED had filed a criminal case under PMLA against the CM and others in 2015 based on a CBI FIR.\nMeanwhile, the opposition BJP in the state demanded the immediate resignation of the CM on moral grounds. “Virbhadra Singh, who used all the legal options to delay the filing of the charge sheet must resign on moral grounds immediately,” Suresh Bharadwaj, senior BJP leader and chief whip of the party told media.", "url": "https://www.financialexpress.com/india-news/disproportionate-assets-case-big-setback-for-himachal-pradesh-cm-virbhadra-singh-ed-seizes-delhi-farm-house/612821/", "label": 1}