{"authors": ["Sivakumar B"], "date_download": "2019-03-27 14:35:18", "date_modify": "2019-03-27 14:35:18", "date_publish": "2016-07-01 17:22:46", "description": "Tamil Nadu has objected to Andhra Pradesh constructing a check dam across Palar River. Following media reports on the construction of the dam, chief m", "filename": "india_Jayalalithaa-to-AP-CM_51c585b365952d6edad9d2fffdcce22f_53007859_1553697318.html", "image_url": "https://static.toiimg.com/thumb/msid-53007815,width-1070,height-580,imgsize-114430,resizemode-6,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "language": null, "localpath": "/home/raj/news-please-repo//data/2019/03/27/timesofindia.indiatimes.com/india_Jayalalithaa-to-AP-CM_51c585b365952d6edad9d2fffdcce22f_53007859_1553697318.html", "title": "Jayalalithaa to AP CM: Stop dam construction on Palar River", "title_page": "Jayalalithaa to AP CM: Stop dam construction on Palar River | Chennai News - Times of India\n\t\t\t", "title_rss": "NULL", "source_domain": "timesofindia.indiatimes.com", "text": "CHENNAI: Tamil Nadu has objected to Andhra Pradesh constructing a check dam across Palar River. Following media reports on the construction of the dam, chief minister J Jayalalithaa has urged AP chief minister N Chandrababu Naidu to direct his officials to immediately stop the work.“The government of Tamil Nadu registers its strong protest against the action of Andhra Pradesh in having unilaterally increased the height of the existing check dam at Perumballam, in violation of the agreement. I also request you to immediately intervene in the matter and issue instructions to officials to take urgent steps to reduce the level of the check dam to its original level. I look forward to your immediate positive response in the matter,” said Jayalalithaa.Andhra Pradesh is increasing the height of the check dam from 5ft to 12ft across Palar river at Perumballam village in Chithoor district on the Andhra Pradesh-Tamil Nadu border. “Farmers in the northern districts of Tamil Nadu solely depend upon the river for irrigation. The Palar river with its sand strata is the only major source of drinking water supply to several towns and villages in the northern districts of the state. Further, water from Palar is also supplied to the Atomic Power Station at Kalpakkam,” said Jayalalithaa.“As you are aware, Palar is an inter-state river and this unilateral action of the authorities in Andhra Pradesh has caused great alarm and apprehension in Tamil Nadu. You will appreciate that Palar is a river which is already in deficit of water supply. This river supports an ayacut of about 4.20 lakh acres in Tamil Nadu,” said Jayalalithaa.The Tamil Nadu chief minister stated that the inter-state Palar River is mentioned in Schedule “A” annexed to the Madras-Mysore Agreement, 1892. “As per Clause II of the agreement, the upstream state should not build any ayacut or any structure to obstruct, divert or store the waters of the river across any part of the fifteen main rivers, named in Schedule “A” appended to the agreement without the previous consent of the downstream state of Tamil Nadu,” she said.The government of Tamil Nadu moved the Supreme Court on February 10, 2006 seeking to restrain the AP government from constructing any structure/works across the river Palar or at any other place through which the river and its tributaries flow or impounding/diverting water therein in violation of the Madras-Mysore Agreement, 1892, the chief minister said.", "url": "https://timesofindia.indiatimes.com/india/Jayalalithaa-to-AP-CM-Stop-dam-construction-on-Palar-Rivercity/chennai/Jayalalithaa-to-AP-CM-Stop-dam-construction-on-Palar-River-/articleshow/53007859.cms", "label": 1}