{"authors": [], "date_download": "2019-03-27 14:25:38", "date_modify": "2019-03-27 14:25:38", "date_publish": "2015-05-19 08:03:29", "description": "Get all the latest news updates of the day:", "filename": "india_narendra-modi-south-korea-india-aap-arvind-kejriwal-news-updates-of-may-19-1751155_1553696738.html", "image_url": "https://www.oneindia.com19-1432036223-afghanistan-600.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/oneindia.com/india_narendra-modi-south-korea-india-aap-arvind-kejriwal-news-updates-of-may-19-1751155_1553696738.html", "title": "Get all the latest news updates of the day", "title_page": "Get all the latest news updates of the day - Oneindia News", "title_rss": "NULL", "source_domain": "oneindia.com", "text": "News Flash: Encounter between security forces and militants in Shopian\nIndia\noi-Oneindia\nBy Oneindia Staff Writer\nBengaluru, May 19: Prime Minister Narendra Modi on Tuesday, May 19, left for home after wrapping up his six-day tour that took him to China, Mongolia and South Korea where he held bilateral talks and signed several pacts to bolster India's relations with the three countries.\nGet all the latest news updates of the day:\n10:35 pm: Encounter underway btw militants & security forces in Shopian district (J&K), 2 jawans injured,2 militants believed to be trapped in house.\n9:45 pm:\n9:30 pm:\n8:15 pm: Najibabad (Bijnor): Kotdwar passenger train ran into tractor trolley at unmanned railway crossing.\n8:02 pm:\n7.15 pm: The Badals spend Rs. 29 crore in a special road project for their luxury resort.\n7.00 pm: FDI increased by USD 8.8 billion, 40 per cent over previous year, under Modi rule, says Finance Minister Arun Jaitley.\n6.35 pm: \"We had a good meeting with the President, We've apprised him of recent developments, he heard the matter carefully\", says Manish Sisodia.\n6.15 pm: Rajasthan High Court judge justice Vijay Bishnoi recuses himself from the Salman Khan's arms act case.\n6.00 pm: Japan provides $3 million assistance to Nepal as its emergency response in the aftermath of the earthquake\n5.55 pm: Delhi Chief Minister Arvind Kejriwal meets President Pranab Mukherjee on appointments of bureaucrats by LG without consulting him.\n5.45 pm: UP govt to challenge verdict of a Delhi court in the 1987 Hashimpura massacre case in Delhi High Court: Additional Advocate General.\n5.20 pm: Loud explosion of stron intensity rocks Afghanistan capital, Kabul.\n5.00 pm: No going back on land bill. Open to changes in land bill in farmers' interests, says Nitin Gadkari.\n4.30 pm: Lt. Governor of Delhi Najeeb Jung meets Home Minister Rajnath Singh.\n4.15 pm: \"He is more concerned about non- resident Indians, than resident Indians\", says Kapil Sibal, Congress leader on PM Modi's foreign visits.\n4.00 pm: PM Narendra Modi leaves for New Delhi, after his 3 nation visit.\n3.52 pm: AAP govt appoints Arvind Ray as Principal Secretary in General Administration Dept replacing Rajendra Kumar.\n3.45 pm: LG Najeeb Jung meets Home Minister Rajnath Singh, informs him about the stand-off on appointment of bureaucrats.\n3.20 pm: LG Najeeb Jung leaves from the President's House after meeting the President Pranab Mukherjee.\n2.55 pm: LG Najeeb Jung arrived at the President's House.\n2.38 pm: I had no wrong intentions, I was at the exit gate to receive someone: Ram Kripal Yadav on Airport issue\nI had no wrong intentions, I was at the exit gate to receive someone: Ram Kripal Yadav on Airport issue pic.twitter.com/GdRSR3lzKO — ANI (@ANI_news) May 19, 2015\n2.27 pm: Union minister Ram Kirpal Yadav stopped by a CISF lady official at Patna airport.\n1.50 pm: Air India Airbus with 169 passengers on board makes emergency landing at Lucknow Airport after windshield crack: PTI\n12.58 pm: Protests outside Delhi Secretariat in support of acting chief-secy Shakuntala Gamlin after her appointment was opposed by CM Arvind Kejriwal\nMembers of the North-East community protest outside Delhi Secretariat over Shakuntala Gamlin issue. pic.twitter.com/qRJAMehtYU — ANI (@ANI_news) May 19, 2015\n12.50 pm: Clashes in Birbhum between factions of TMC leaders, 6 injured\n12.12 pm: Delhi is a Union Territory, Home Ministry functions through LG. In past never did anyone insult Constitution this way: Dr.Harsh Vardhan, BJP\n11.54 am: Lieutenant Governor vs Delhi Government: Lieutenant Governor to meet President Pranab Mukherjee around 2:30 p.m. today\n11.40 am: Delhi Police to transfer special cell team that conducted encounter on Manoj Vashishtha\n10.54 am: Seoul (South Korea): PM Narendra Modi meets CEO & President of Samsung Electronics\nSeoul (South Korea): PM Narendra Modi meets CEO & President of Samsung Electronics pic.twitter.com/iwzr0jZhHA — ANI (@ANI_news) May 19, 2015\n10.35 am: PM Narendra Modi addresses the Friends of India in the Republic of Korea conference\n10.05 am: 23-year-old woman smashes SP leaders's car after being winked at by his guard\n9.50 am: Rajendra Nagar encounter case: Family members of the deceased reach Delhi Police Headquarters\nRajendra Nagar encounter case: Family members of the deceased reach Delhi Police Headquarters. pic.twitter.com/uMjCnkT1BP — ANI (@ANI_news) May 19, 2015\n9.23 am: Delhi CM Arvind Kejriwal to meet President today over tussle with LG Najeeb Jung\n8.39 am: Trivandrum: BJP stage a protest against Kerala Finance Minister KM Mani outside the Secretariat.\nTrivandrum: BJP stage a protest against Kerala Finance Minister KM Mani outside the Secretariat. pic.twitter.com/QgIowkhXmF — ANI (@ANI_news) May 19, 2015\n8.30 am: FDI will not come without a globally competitive business environment; working aggressively to make India a easy place to do business: PM Narendra Modi\n8.08 am: India was, and is a land of potential: PM Narendra Modi\nIndia was, and is a land of potential: PM #ModiInSouthKorea at the CEO’s forum in Seoul pic.twitter.com/g5jUioM9LF — ANI (@ANI_news) May 19, 2015\n8.00 am: Korea has given exemplary products to the world: PM Narendra Modi.\nOneIndia News", "url": "https://www.oneindia.com/india/narendra-modi-south-korea-india-aap-arvind-kejriwal-news-updates-of-may-19-1751155.html", "label": 1}