{"authors": [], "date_download": "2019-03-27 14:40:30", "date_modify": "2019-03-27 14:40:30", "date_publish": null, "description": "Meanwhile, the raging debate on the caste of Lord Hanuman reached new heights of hilarity with PSP(L) demanding a caste certificate for the Hindu deity.", "filename": "india_article_mulayam-singh_4d206d409ce1cfe9a1716943481c73d5_328247_1553697630.html", "image_url": "https://img.timesnownews.com/story/1544297983-Shivpal_Yadav.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/timesnownews.com/india_article_mulayam-singh_4d206d409ce1cfe9a1716943481c73d5_328247_1553697630.html", "title": "Mulayam Singh Yadav’s brother Shivpal to hold massive PSP(L) rally today", "title_page": "Mulayam Singh Yadav’s brother Shivpal to hold massive PSP(L) rally today | India News", "title_rss": "NULL", "source_domain": "timesnownews.com", "text": "Shivpal Yadav | Photo Credit: IANS\nLucknow: In a display of strength, Shivpal Yadav, uncle of Samajwadi Party supremo and former Uttar Pradesh chief minister Akhilesh Yadav, is expected to hold a big rally of his recently-floated Pragatisheel Samajwadi Party (Lohia) in Lucknow on Sunday.\nAccording to sources in PSP(L), many SP leaders are believed to have given their confirmation to attend the event. Shivpal had a bad break-up with SP after his brother Mulayam Singh Yadav and nephew Akhilesh sidelined him from the party’s ranks. It is, however, still not known whether Mulayam will attend the rally today.\n“The rally today will act as a launchpad for the PSP (L) in the political spectrum, an alternative to the people of Uttar Pradesh ahead of the upcoming Lok Sabha elections in 2019,” party spokesperson Deepak Misra said yesterday.\nMisra claimed that at least 2 lakh supporters of PSP(L) are expected to be present at the rally, where the numbers come from UP as well as Madhya Pradesh, Rajasthan and Bihar.\nMeanwhile, the raging debate on the caste of Lord Hanuman reached new heights of hilarity with PSP(L) demanding a caste certificate for the Hindu deity. Shivpal’s party even threatened a sit-in if the district administration failed to provide one within a week.\n“We have applied for the caste certificate of Lord Hanuman at the office of the Varanasi district magistrate. As the CM has termed him as a Dalit and dragged the deity in petty caste politics, we want his caste certificate,” news agency PTI quoted Yadav as saying.", "url": "https://www.timesnownews.com/india/article/mulayam-singh-yadav-s-brother-shivpal-to-hold-massive-pspl-rally-lucknow/328247", "label": 1}