{"authors": [], "date_download": "2019-03-27 14:18:29", "date_modify": "2019-03-27 14:18:29", "date_publish": "2015-02-28 08:19:55", "description": "Union Budget 2015 presented; more news updates on Feb 28", "filename": "india_news-in-brief-feb-28-national-international-updates-1668646_1553696309.html", "image_url": "https://www.oneindia.com/img/2015/02/28-1425091760-arun-jaitley.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/oneindia.com/india_news-in-brief-feb-28-national-international-updates-1668646_1553696309.html", "title": "Union Budget 2015 presented; more news updates on Feb 28", "title_page": "Union Budget 2015 presented; more news updates on Feb 28 - Oneindia News", "title_rss": "NULL", "source_domain": "oneindia.com", "text": "It is a pro-poor and pro-growth budget, says PM Modi; more news updates on Feb 28\nIndia\noi-Oneindia\nBy Oneindia Staff Writer\nNew Delhi, Feb 28: Finance Minister Arun Jaitley on Saturday, Feb 28 presented India's national budget for the next fiscal, saying the state of the country's economy was better placed today with its credibility re-established by a series of measures taken by his government.\n62-year-old Jaitley sat down in between his budget speech in the Lok Sabha and then continued reading out the text.\nGet the top and the latest national and international news updates here:\n10.25 pm: Swine flu claims nine more lives in Gujarat; toll reaches 265\n10.00 pm: Amrut Mahotsav will be a true and meaningful tribute to our freedom fighters, says Jaitley\n8.20 pm: Uttar Pradesh Minister Kailash Chaurasiya minister sentenced to jail, released on bail\n7.4 2pm: Jitan Ram Manjhi forms 'HAM', alleges Nitish got Bihar Nivas washed with Ganga water\n7.00 pm: FIR against Digvijay over appointments in Congress regime\n6.00 pm: Budget must also acknowledge and attempt to address the concerns of class that doesn't pay Income tax\", says Congress leader and former finance minister P Chidambaram.\n5.45 pm: We welcome the announcement of AIIMS to be set up in Himachal: Virbhadra Singh, Himachal Pradesh CM.\n5.40 pm: \"It is a pro-poor and pro-growth budget\", says PM Narendra Modi.\n5.30 pm: Budget has been disappointing for common man,working class, business class and youth of nation\", says AAP leader Sanjay Singh.\n5.15 pm: \"Mukul Roy used to be Mamata ji's close aide, she neither trusts her party nor party leaders now\", says BJP spokesperson Shahnawaz Hussain.\n5.00 pm: PM Narendra Modi accepts resignation of Dr RK Pachauri from PM's council on climate change.\n4.45 pm: Mukul Roy has been dropped as the All India General Secretary of the Trinamool Congress. Subrata Bakshi to be new All India Trinamool Gen Secy.\n4.15 pm: \"If development happens in a nation,it affects all sectors, including the middle class\", says Finance Minister Arun Jaitley.\n4.00 pm: Farmers leaders criticized the Union budget saying Finance Minister Arun Jaitley has \"failed to give the much-needed healing touch\" to the agriculture fraternity.\n3.50 pm: BJD leaders talked in different voices on Union Budget, with senior party members including its leader in Lok Sabha slamming it as \"pro-rich\" and \"pro-corporate\", while another leader lauded it as a \"big bang\" initiative that will boost economy.\n3.40 pm: The West Bengal government described the Union budget presented by Finance Minister Arun Jaitley in Parliament as \"anti-people\" and claimed that allocations for some major centrally sponsored schemes have been reduced.\n3.30 pm: National Bank for Agriculture and Rural Development (Nabard) has welcomed the Budget by terming it as a very positive and reformist with a long-term view for the rural and farm sector.\n3.15 pm: The government's move to extend visas on arrival facility to 150 countries and make world heritage sites more tourist friendly has been welcomed by the industry.\nThey continue to please & work for benefit of businessmen & corporate houses: Ambika Soni, Cong on #Budget2015 pic.twitter.com/cZ0EQg7dBO — ANI (@ANI_news) February 28, 2015\n3.00 pm: Former Prime Minister Manmohan Singh said the budget reflected lot of \"good intentions\" of the NDA government but it lacked any clear roadmap to achieve the goals.\nIt's a mix budget. There are positive initiatives but historic cuts in corporate taxes have been given: Deepender Hooda, Cong on #Budget2015 — ANI (@ANI_news) February 28, 2015\n#Budget2015 is high in intent, low on delivery : Manish Tewari, Cong pic.twitter.com/Lwryz5xN7A — ANI (@ANI_news) February 28, 2015\n2.30 pm: Leader of Congress in Lok Sahba Mallikarjun Kharge slammed the Union budget 2015-16 saying it was \"pro-industrialist\", \"pro-corporate\" and not meant for the poor.\nIt is very disappointing,they have neglected Kerala,corporate friendly budget: Kerala Finance Min KM Mani #Budget2015 pic.twitter.com/7TapO5FJAt — ANI (@ANI_news) February 28, 2015\n#Budget2015 will provide social security, would like to congratulate PM & Finance Minister: BJP President Amit Shah pic.twitter.com/olOYslWjVV — ANI (@ANI_news) February 28, 2015\n2:00 pm: Opposition believes that the Budget was \"high on intent\" and \"low on delivery\"\n1:11 pm: I congratulate FM for doing an excellent job in respecting aspirations of the States & at the same time delivering on National priorities:PM\n12:43 am: Union Budget comes to an end; Experts call it progressive and positive\n11:37 am: Universal Social Security Scheme to be introduced, says FM while presenting Union Budget 2015.\n11:22 am: Accident insurance of Rs 2 Lakh for poor, at a premium of Re 1 per month, says FM.\n11:05 am: Union Finance Minister Arun Jaitley has begun presenting Union Budget 2015 in Lok Sabha.\n10:03 am: Public expects high from the Finance Minister\nKanpur : People conduct 'hawan' ahead of the Union Budget #Budegt2015 pic.twitter.com/RFXJ5PTB3y — ANI (@ANI_news) February 28, 2015\n9:30 am: People conduct 'havan' ahead of the Union Budget\n9:14 am: Uber says security breach affected about 50,000 drivers\n8:45 am: British PM David Cameron vows to hunt down 'Jihadi John'\n8:19 am: Finance Minister Arun Jaitley will present Narendra Modi-led Government's maiden Union Budget 2015-16 today\nKutch (Gujarat): BSF organize all women camel safari from Kutch to Attari. pic.twitter.com/tFzTFwILFH — ANI (@ANI_news) February 27, 2015\n8:00 am:\nOneIndia News", "url": "https://www.oneindia.com/india/news-in-brief-feb-28-national-international-updates-1668646.html", "label": 1}