{"authors": ["Fe Online"], "date_download": "2019-03-27 14:25:44", "date_modify": "2019-03-27 14:25:44", "date_publish": "2019-01-09 15:40:33", "description": "A group of miscreants on Wednesday ransacked the treasury branch of State Bank of India (SBI) in Thiruvananthapuram. The attack comes on the second day of the ongoing two-day Bharat Bandh.", "filename": "india-news_bharat-bandh-sbi_1050453d3c0f7d4aba61144edc120361__1553696744.html", "image_url": "https://images.financialexpress.com/2019/01/SBI-1.jpg", "language": null, "localpath": "/home/raj/news-please-repo//data/2019/03/27/financialexpress.com/india-news_bharat-bandh-sbi_1050453d3c0f7d4aba61144edc120361__1553696744.html", "title": "Bharat Bandh: SBI treasury branch ransacked by protesters in Thiruvananthapuram on day 2 of strike", "title_page": "Bharat Bandh: SBI treasury branch ransacked by protesters in Thiruvananthapuram on day 2 of strike - The Financial Express", "title_rss": "NULL", "source_domain": "financialexpress.com", "text": "Bharat Bandh: SBI treasury branch ransacked by protesters in Thiruvananthapuram on day 2 of strike\nA group of miscreants on Wednesday ransacked the treasury branch of State Bank of India (SBI) in Thiruvananthapuram. The attack comes on the second day of the ongoing two-day Bharat Bandh call by the Central Trade Unions (CTUs) across the country.\nAccording to a report in local news website Mathrubhumi, the incident took place at around 10:30 am. It said that a group of seven people came to the branch and threatened the manager and staff.\nThe report said that protesters attacked the office for non-participation of branch staff in the strike. The manager’s office was also attacked. His computer and table were destroyed by the miscreants.\nLeft parties members and supporters block the Dak Bungalow road during a protest in Patna (PTI Photo)\nThe branch manager informed that he later filed a complaint with Assistant Commissioner, Cantonment. Meanwhile, additional security officials have been deployed to the branch.\nToday is the second day of Bharat Bandh. As many as 10 central trade unions are observing nationwide shutdown against the poor policies of the Modi government. State-run banks are also participating in the strike demanding hike in their wages.\nIn Kerala, protesters also blocked the movement of trains in various parts of the state.", "url": "https://www.financialexpress.com/india-news/bharat-bandh-sbi-treasury-branch-ransacked-by-protesters-in-thiruvananthapuram-on-day-2-of-strike/1438581/", "label": 1}