{"authors": [], "date_download": "2019-03-27 14:40:53", "date_modify": "2019-03-27 14:40:53", "date_publish": null, "description": "Filmmaker Aribam Shyam Sharma returned his 2006 Padma Shri award in protest against the Citizenship Amendment Bill, 2016 that seeks to grant Indian citizenship to non-Muslim immigrants.", "filename": "india_article_citizenship-b_9d6eb08dadbe0581b24189a2acb3f1df_359122_1553697653.html", "image_url": "https://img.timesnownews.com/story/1549193500-Aribam_Sharma.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/timesnownews.com/india_article_citizenship-b_9d6eb08dadbe0581b24189a2acb3f1df_359122_1553697653.html", "title": "Filmmaker Aribam Shyam Sharma returns Padma Shri in protest against Citizenship Bill", "title_page": "Filmmaker Aribam Shyam Sharma returns Padma Shri in protest against Citizenship Bill", "title_rss": "NULL", "source_domain": "timesnownews.com", "text": "File Image of filmmaker Aribam Shyam Sharma | @AribamSyamSharma | Photo Credit: Facebook\nNew Delhi: Veteran filmmaker Aribam Shyam Sharma, on Sunday, returned his Padma Shri award in protest against the Citizenship Amendment Bill, 2016.\nThe Bill seeks to amend the Citizenship Act 1955 to grant Indian citizenship to Hindus, Buddhists, Jains, Christians, Sikhs, Parsis who fled religious persecution in Afghanistan, Pakistan and Bangladesh and came to India before December 31, 2014.\nThe 83-year-old filmmaker said that the Bill was not in the interest of the people of north-east and the indigenous people of Manipur.\n\"The Bill is against the interest of the people of north-east and the indigenous people of Manipur. Several people here have opposed the Bill, but it seems they (the Central government) are determined to pass it,\" Sharma told IANS.\nSharma, who is known for films like ‘Leipaklei’, Ishanou, was bestowed with the Padma Shri award in 2006. The filmmaker has also won several national film awards for his contribution to the film industry.\nThe Bill, which was passed in the Lok Sabha on January 8 has led to several protests across the northeastern states.\nEarlier on February 1, Assam Students’ Union (AASU) held a candlelight protest in Assam against the Bill. Several organisations including Krishak Mukti Sangram Samiti (KMSS) also staged a protest in the state against the Bill in January.\nLast month, Asom Gana Parishad (AGP) snapped its ties with the ruling Bharatiya Janata Party (BJP) in Assam over the Bill.", "url": "https://www.timesnownews.com/india/article/citizenship-bill-filmmaker-aribam-shyam-sharma-returns-padma-shri/359122", "label": 1}