{"authors": [], "date_download": "2019-03-27 14:29:17", "date_modify": "2019-03-27 14:29:17", "date_publish": "2016-06-16 08:56:13", "description": "Congress leader Kamal Nath has resigned from the post of general secretary in-charge of Punjab which will go for Assembly Elections next year. In his letter to party chief Sonia Gandhi he has urged to relive him from the post so that attention isnot diverted from the real issues facing Punjab. Sonia Gandhi has accepted his resignation.", "filename": "india_story_congress-leader-kamal-nath-resigns-as-general-secretary-in-charge-of-punjab-14421-2016-06-15_1553696957.html", "image_url": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/201606/kamal-nath_647_052116082119_061616084938.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/indiatoday.in/india_story_congress-leader-kamal-nath-resigns-as-general-secretary-in-charge-of-punjab-14421-2016-06-15_1553696957.html", "title": "1984 riots row forces Kamal Nath to quit as Congress in-charge of poll-bound Punjab", "title_page": "1984 riots row forces Kamal Nath to quit as Congress in-charge of poll-bound Punjab - India News", "title_rss": "NULL", "source_domain": "indiatoday.in", "text": "Congress leader Kamal Nath has resigned from the post of general secretary in-charge of Punjab, which goes to polls next year, amid renewed criticism of his alleged role in the 1984 riots. In his letter to party chief Sonia Gandhi he has urged to relive him from the post so that attention isn't diverted from the real issues facing Punjab. Sonia Gandhi has accepted his resignation.\n\"I request, I may be relieved of my charge to ensure that attention isn't diverted from the real issues facing Punjab,\" said Kamal Nath in his letter to Sonia Gandhi.\nHe added, \"Till 2005 not single public statement or FIR was made against me and 1st time my name was mentioned in any forum was 21 years after 1984.\" \"I've been hurt by developments of past few days wherein unnecessary controversy has been created around the 1984 riots in Delhi.\"\nEarlier, former Union minister MS Gill had said Kamal Nath's selection for the coveted post in the state was akin to \"rubbing salt on wounds\".\nKamal Nath in his letter to Sonia Gandhi said, \"This canard is nothing but a cheap political ploy to gain traction ahead of the elections.\"\nCaptain Amarinder Singh had absolved Kamal Nath of having any role in the anti-Sikh riots.\nMURMURS IN THE PARTY\nRumblings in the Punjab Congress had started Sunday evening itself. There was a candle light march against Kamal Nath in Chandigarh. Incidentally, on Monday when Congress Vice President Rahul Gandhi addressed an anti-drug rally, Kamal Nath was absent.\nThe entire episode has raised serious questions on political farsightedness of the Congress and also of Kamal Nath. Firstly, why was Kamal Nath appointed in the first place and secondly, why was he allowed to leave.", "url": "https://www.indiatoday.in/india/story/congress-leader-kamal-nath-resigns-as-general-secretary-in-charge-of-punjab-14421-2016-06-15", "label": 1}