{"authors": [], "date_download": "2019-03-27 14:35:42", "date_modify": "2019-03-27 14:35:42", "date_publish": "2017-06-11 13:40:10", "description": "Madhya Pradesh chief minister Shivraj Singh Chouhan has been urged by his ministers and the kin of deceased peasants to end the hunger strike.", "filename": "india_madhya-pradesh-farmers-strike-shivraj-singh-chouhan-urged-to-end-indefinite-fast-3541173_1553697342.html", "image_url": "https://images.firstpost.com/wp-content/uploads/2017/05/shivraj-singh-chouhan.jpg", "language": null, "localpath": "/home/raj/news-please-repo//data/2019/03/27/firstpost.com/india_madhya-pradesh-farmers-strike-shivraj-singh-chouhan-urged-to-end-indefinite-fast-3541173_1553697342.html", "title": "Madhya Pradesh farmers' protest: Shivraj Singh Chouhan urged to end indefinite fast", "title_page": "Madhya Pradesh farmers' protest: Shivraj Singh Chouhan urged to end indefinite fast - Firstpost", "title_rss": "NULL", "source_domain": "firstpost.com", "text": "Bhopal: Madhya Pradesh chief minister Shivraj Singh Chouhan, who continued his indefinite fast for peace in the state amid farmers' agitation for the second day on Sunday, has been urged by his ministers and the kin of deceased peasants to end the hunger strike.\nOn Saturday night, Chouhan met the family members of the farmers killed in a police firing. Madhya Pradesh Home Minister Bhupendra Singh said, \"Everyone is concerned about the Chief Minister's health\".\n\"The state is peaceful now. Hence, it's an appeal by everyone (to Chouhan) to end the fast,\" Bhupendra Singh said.\nChouhan began his indefinite fast on Saturday, asserting he would lay down his life for farmers.\nChouhan, who is on a fast at Dussehra Maidan here, also met several representatives of farmers' organisations and listened to their problems on Saturday.\nHowever, as the Chief Minister and Agriculture Minister Gauri Shankar Bisen ruled out any loan waiver, a group of farmers started a counter-protest at the same site opposite him.\nThe Chief Minister will hold talks with farmers on Sunday as well. His wife Sadhna Singh, Higher Education Minister Jaibhan Singh Pawaiya, Home Minister Bhupendra Singh, Women and Child Welfare Minister Archana Chitnis and senior BJP leader Raghunandan Sharma are present with him.\nThe farmers in Madhya Pradesh have been on strike since 1 June to press their demand for loan waivers and fair price for their produce.\nThe farmers' agitation was marred by violence on 6 June when they pelted stones at the police.\nIn retaliation, the police opened fire at the farmers, leaving five dead, according to official count. However, farmer leaders claim eight were killed that day in police firing.\nFirstpost is now on WhatsApp. For the latest analysis, commentary and news updates, sign up for our WhatsApp services. Just go to Firstpost.com/Whatsapp and hit the Subscribe button.", "url": "https://www.firstpost.com/india/madhya-pradesh-farmers-strike-shivraj-singh-chouhan-urged-to-end-indefinite-fast-3541173.html", "label": 1}