{"authors": ["Naresh Mitra"], "date_download": "2019-03-27 14:40:34", "date_modify": "2019-03-27 14:40:34", "date_publish": "2018-09-10 21:47:50", "description": "India News: GUWAHATI: Several doubtful \"D\" voters from have decided to stage protest in New Delhi on the occasion of Gandhi Jayanti on October 2, to highlight the.", "filename": "india_d-voters-of-assam-to-_b51df933a192e514d5f51d02b6201d63_65758902_1553697634.html", "image_url": "https://static.toiimg.com/photo/msid-47529300/47529300.jpg", "language": null, "localpath": "/home/raj/news-please-repo//data/2019/03/27/timesofindia.indiatimes.com/india_d-voters-of-assam-to-_b51df933a192e514d5f51d02b6201d63_65758902_1553697634.html", "title": "'D' voters of Assam to stage protest on Gandhi Jayanti in Delhi", "title_page": "'D' voters of Assam to stage protest on Gandhi Jayanti in Delhi | India News - Times of India\n\t\t\t", "title_rss": "NULL", "source_domain": "timesofindia.indiatimes.com", "text": "GUWAHATI: Several doubtful \"D\" voters from have decided to stage protest in New Delhi on the occasion of Gandhi Jayanti on October 2, to highlight their plight after years of delay in redressing curtailment of their rights as \"citizens\".\"Our target is to take 5000 \"D\" voters from different parts of the state to New Delhi. Year after year people with D voter tag are suffering in silence. They have now resolved to speak out their sufferings they have been going through after their rights as citizens have been stripped. The burden of D voter tag is too much,\" secretary general of the newly floated Association for Protection of Citizenship Rights (APCR), Shajahan Ali Ahmed said.APCR has been floated during a meeting of \"D\" voters and their descendants at Barpeta district’s Sorbhog on Sunday. Ahmed, whose uncle Abu Bakkar Siddik is a \"D\" voter, said that the body is exclusively for the \"D\" and their descendants to spearhead justice for them.Ahmed said that sufferings after being tagged \"D\" voters are also passed down to their family members as the NRC updating process has barred descendants from getting included in the draft registry.\"My name was also excluded from the draft NRC. I suspect because of my uncle having the D voter tag. Are ‘D\" voters and their family members foreigners? If they are non-citizens why then the government don’t deport us? But they cannot be deported because many of them have documents related to citizenship. So, why not resolve it fast so that they are not made to suffer year after year,\" Ahmed said.In 1997 the Election Commission of India decided that letter ‘D' be marked against persons in electoral rolls whose citizenship is doubtful or disputed. Persons marked as ‘D' are neither allowed to cast their votes at elections nor allowed to contest any elections till their names are cleared by foreigner’s tribunals.An estimated 2, 44,144 D-voter cases were referred to the tribunals. But over the years, the number has come down to 1, 25,333 D-voters with over 60,000 of them were found to be Indian citizens.There are allegations that many people were \"arbitrarily\" tagged as \"D\" voter, cutting cross communities, despite possessing documents related to their citizenship.Ahmed said that under Sarbhog assembly constituency alone there are estimated 6000 \"D\" voters, one of the highest among 126 assembly constituencies in the state.\"Many of the D voters are poor and unable to fight legal battles. In last couple of years about 17 D voters have committed suicide after they are unable to meet expenditure of legal battles or out of frustration,\" Ahmed added.", "url": "https://timesofindia.indiatimes.com/india/d-voters-of-assam-to-stage-protest-on-gandhi-jayanti-in-delhi/articleshow/65758902.cms", "label": 1}