{"authors": [], "date_download": "2019-03-27 14:29:18", "date_modify": "2019-03-27 14:29:18", "date_publish": "2016-08-12 18:49:55", "description": "The Bishnoi community today staged a protest here to demand a Special Leave Petition by the Rajasthan government in the Supreme Court on the Salman Khan case", "filename": "india_bishnoi-community-wan_3a5aff0a2cf9d49b15f895f05695c22b_909405_1553696958.html", "image_url": "https://www.freepressjournal.in/wp-content/uploads/2016/07/c-salman-799x533.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/freepressjournal.in/india_bishnoi-community-wan_3a5aff0a2cf9d49b15f895f05695c22b_909405_1553696958.html", "title": "Bishnoi community wants SLP in SC against Salman's acquittal", "title_page": "Bishnoi community wants SLP in SC against Salman's acquittal", "title_rss": "NULL", "source_domain": "freepressjournal.in", "text": "Jodhpur: Mounting pressure against actor Salman Khan’s acquittal in Chinkara poaching case, the Bishnoi community today staged a protest here to demand a Special Leave Petition (SLP) by the Rajasthan government in the Supreme Court against the High Court order. The community also sought a well-structured policy keeping in mind the growing incidents of poaching.\nThe community members, including some political and social leaders, assembled at ‘Ravan Ka Chabootara’ ground this morning under the banner of Akhil Bhartiya Bishnoi Mahasabha. The contention of the community is that Salman had not killed the Chinkaras, who else had done it.\nIn a memorandum addressed to the President of India and sbumitted to the district administration later, they demanded that the state government be directed to move an SLP in the Supreme Court against the High Court’s order to acquit Khan in two cases of poaching.\nThey hoped that “good sense” will prevail on the government so that it moves the Supreme Court and does “not let go” Salman with the acquittal by the High Court. “Besides this, we have also urged the President to frame a suitable policy with stern punitive measures in keeping with the growing incidents of wildlife poaching,” said the Mahasabha’s spokesperson Kishan Bishnoi.", "url": "https://www.freepressjournal.in/india/bishnoi-community-wants-slp-in-sc-against-salmans-acquittal/909405", "label": 1}