{"authors": [], "date_download": "2019-03-27 14:40:57", "date_modify": "2019-03-27 14:40:57", "date_publish": "2015-05-29 07:50:44", "description": "A bit over 18 years after AFSPA was enforced in Tripura, the state government on Wednesday decided to withdraw the Act. Here's why it's important.", "filename": "india_afspa-removed-in-tripura-after-18-years-heres-why-it-was-enforced-and-why-its-gone-now-2266770_1553697657.html", "image_url": "https://images.firstpost.com/wp-content/uploads/2015/05/tripura-election-afp.gif", "language": null, "localpath": "/home/raj/news-please-repo//data/2019/03/27/firstpost.com/india_afspa-removed-in-tripura-after-18-years-heres-why-it-was-enforced-and-why-its-gone-now-2266770_1553697657.html", "title": "AFSPA removed in Tripura after 18 years: Here's why it was enforced and why it's gone now", "title_page": "AFSPA removed in Tripura after 18 years: Here's why it was enforced and why it's gone now - Firstpost", "title_rss": "NULL", "source_domain": "firstpost.com", "text": "A bit over 18 years after the Armed Forces Special Powers Act (AFSPA) was enforced in Tripura, the state government on Wednesday decided to withdraw the Act.\n\"In view of the significant taming of terrorism in Tripura, the council of ministers today (Wednesday) decided to withdraw the AFSPA from the entire state,\" Chief Minister Manik Sarkar told reporters.\n\"The security forces recently exhaustively reviewed the law and order situation in the state. Considering the reports of the security forces, the council of ministers decided to recommend to the union home ministry to issue a notification to withdraw the AFSPA,\" he said.\n\"The decisions were taken in view of the decrease of militancy-related incidents in Tripura over the last few years. However, the security forces would be watchful over the situation,\" Sarkar said.\nAFSPA provides unlimited powers to security forces to shoot at sight, arrest anybody without a warrant, and carry out searches without consent . All this knowing that they wouldn't face any legal action for any action undertaken under the act.\nThe central act was first enforced in Tripura on 16 February, 1997 when terrorism was at its peak in the state, which shares an 856-km border with Bangladesh.\nMembers of two separatist groups - National Liberation Front of Tripura (NLFT) and All Tripura Tiger Force (ATTF) - are still sheltered and accused of getting arms training in Bangladesh. These two groups have been demanding the secession of Tripura from India.\nLocal rights groups and political parties in Tripura had described the act as \"draconian\" and wanted it repealed. \"Tribal parties such as the Indigenous Nationalist Party of Tripura and the Indigenous Peoples Front of Tripura had been demanding the withdrawal of the Act, saying it was aimed at suppressing the State’s 33 percent tribal population,\" said a report in The Hindu.\nEver since it was enforced in Tripura, the Act, as per its provisions, was reviewed and extended after every six months.\n\"When the Act was imposed there were only 42 police stations and two-third of the entire police station areas were under this act,\" CM Sarkar said on Wednesday.\nHowever, in view of the improvement in the situation and fewer terrorist activities being reported, the Tripura government in June 2013 reduced operational areas of the AFSPA to 30 police station areas. Before that, out of 72 police stations in Tripura, AFSPA had been force in 40. The total number of police stations in Tripura is 74 now.\nAccording to a Deccan Herald report, Tripura saw a rapid decline in militancy over the past five years as hundreds of militants surrendered. The ruling Left Front, which has been in power in Tripura since 1993, has been contemplating the withdrawal of the law and had the support from opposition parties like the Congress and BJP, who were also in favour the move.\nThe report quoted unnamed sources in the Home Ministry as saying that talks on the issue of withdrawal of AFSPA from Tripura had been on for the last few months.\nThe last six-month extension to AFSPA was given in November 2014, when police had said militants had killed two BSF troopers, a civilian driver and had abducted several people in six different incidents in the state.\nHowever, perhaps the most prominent evidence of the decline of militancy and separatism in Tripura came when the state recorded over 84 percent voter turnout in the 2014 Lok Sabha elections, one of the highest voter turnouts in the country, according to the Election Commission.\nOn Wednesday, when the state government decided to withdraw the Act, an official with the home department said: \"Though the four-and-half-decade-old terrorism has been tamed in Tripura, the state government is always cautious about the terror outfits and their activities.\"\nIn one of the first political reactions, Congress leader and former Finance Minister P Chidambaram welcomed the withdrawal of AFSPA.\nMy plea to repeal #AFSPA heard in Tripura. AFSPA withdrawn. Victory for sanity and humanity. — P. Chidambaram (@PChidambaram_IN) May 28, 2015\nBesides Tripura, AFSPA is also in force in Manipur (excluding the Imphal Municipal Council area), Assam and Nagaland and in the Tirap and Changlang districts of Arunachal Pradesh. Manipur's human rights activist Irom Sharmila has been on an indefinite hunger strike for over 15 years, demanding the withdrawal of the act in her home state.\n(With agency inputs)\nFirstpost is now on WhatsApp. For the latest analysis, commentary and news updates, sign up for our WhatsApp services. Just go to Firstpost.com/Whatsapp and hit the Subscribe button.", "url": "https://www.firstpost.com/india/afspa-removed-in-tripura-after-18-years-heres-why-it-was-enforced-and-why-its-gone-now-2266770.html", "label": 1}