{"authors": [], "date_download": "2019-03-27 14:35:41", "date_modify": "2019-03-27 14:35:41", "date_publish": "2016-06-05 00:00:00", "description": "Ramesh said the Congress vice-president had “a lot of ideas on organisational restructuring and I hope he gets into position very soon. He is de facto, but he should become de jure”.", "filename": "india-news_rahul-is-de-fact_72d8c616822ec3f6482bf133f9f6dc79_story-ePz94rkPPOThIrnHRjw9yK_1553697341.html", "image_url": "https://www.hindustantimes.com/rf/image_size_640x362/HT/p2/2016/06/05/Pictures/rahul-gandhi-govt-congress-protest-against-delhi_071657d6-2af7-11e6-8f5f-7ac8be343499.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/hindustantimes.com/india-news_rahul-is-de-fact_72d8c616822ec3f6482bf133f9f6dc79_story-ePz94rkPPOThIrnHRjw9yK_1553697341.html", "title": "Rahul is de facto Cong chief, should take over formally, says Jairam Ramesh", "title_page": "Rahul is de facto Cong chief, should take over formally, says Jairam Ramesh\n | india news | Hindustan Times", "title_rss": "NULL", "source_domain": "hindustantimes.com", "text": "Rahul Gandhi is de facto Congress chief “but he should become de jure” and make the party battle-ready without waiting for anti-incumbency to build up against Prime Minister Narendra Modi, senior party leader Jairam Ramesh said on Sunday.\nRamesh also said it was high time the Congress changed in keeping with a changing India as “our communication strategy is not very effective” and “we need an aggressive outreach” following successive poll debacles.\n“Challenges are very heavy but there is no room for despondency. Those who are writing off the Congress party are writing its premature obituary,” the former minister told PTI, an apparent reference to Modi’s repeated calls for a “Congress-mukt Bharat (Congress-free India) “.\nMaking a strong pitch for Rahul’s leadership, Ramesh said “uncertainty does not help”. He said the challenges facing the Congress were similar to those that confronted Sonia Gandhi when she took over as the party chief in March 1998.\nRamesh said the Congress vice-president had “a lot of ideas on organisational restructuring and I hope he gets into position very soon. He is de facto, but he should become de jure”.\nRead | Congress rejig on the cards? Buzz over Rahul Gandhi’s elevation, but no date yet\nThe Congress presidentship had its institutional importance and Rahul should take charge “as soon as possible”, Ramesh said.\n“He has got a clear concept of strategy. He knows people he wants to bring. One thing should be clear that when Rahul Gandhi takes over, a team takes over. When? That is the big question,” he said.\nHe recalled that when Sonia took over, the Congress was in power in only two states. Digvijaya Singh was the chief minister of Madhya Pradesh and Giridhar Gamang of Orissa (now Odisha). But, at that time the Congress had 140 members in the Lok Sabha.\nRead | Rahul Gandhi as Cong chief? 5 challenges he will face in the hot seat\nFor the first time, the party was very weak in the Lok Sabha, had reduced strength in the Rajya Sabha and was in power in very few states, the former minister said. “It is a difficult situation,” he said.\nThe former environment minister’s comments come at a time when opinion appears to be divided within the party over the timing of Rahul taking over the party top job.\nPunjab Congress chief Capt Amarinder Singh recently made a case for the change, saying Sonia was approaching 70 and Rahul could get into her shoes if she was feeling tired.\nSenior leader Ambika Soni, however, said Sonia was working tirelessly and should continue -- a view shared by another party leader Kamal Nath.\nFirst Published: Jun 05, 2016 13:59 IST", "url": "https://www.hindustantimes.com/india-news/rahul-is-de-facto-cong-chief-should-take-over-formally-says-jairam-ramesh/story-ePz94rkPPOThIrnHRjw9yK.html", "label": 1}