{"authors": [], "date_download": "2019-03-27 14:35:17", "date_modify": "2019-03-27 14:35:17", "date_publish": "2018-11-15 00:00:00", "description": "They were among the thousands of farmers, who will march to Ramlila Ground on Thursday and to Parliament Street on Friday, to press for their demands, including debt relief and remunerative prices for their produce.", "filename": "india_kisan-march-in-delhi-from-carrying-skulls-to-threatening-naked-protest-tamil-nadu-farmers-warn-of-bizarre-steps-if-kept-away-from-parliament-5639261_1553697317.html", "image_url": "https://images.firstpost.com/wp-content/uploads/large_file_plugin/2018/11/1543478980_farmersmarch12.jpg", "language": null, "localpath": "/home/raj/news-please-repo//data/2019/03/27/firstpost.com/india_kisan-march-in-delhi-from-carrying-skulls-to-threatening-naked-protest-tamil-nadu-farmers-warn-of-bizarre-steps-if-kept-away-from-parliament-5639261_1553697317.html", "title": "Kisan march in Delhi: From carrying skulls to naked protest threats, bizarre steps Tamil Nadu farmers warned of if stopped", "title_page": "Kisan march in Delhi: From carrying skulls to naked protest threats, bizarre steps Tamil Nadu farmers warned of if stopped - Firstpost", "title_rss": "NULL", "source_domain": "firstpost.com", "text": "New Delhi: A group of farmers from Tamil Nadu arrived here on Thursday for the two-day Kisan rally, carrying skulls of two of their colleagues who had committed suicide and threatening to march naked if they are not allowed to go to Parliament on Friday.\nAbout 1,200 members of the National South Indian River Interlinking Agriculturalists Association reached the national capital in the early hours of Thursday, said their leader P Ayyakannu.\nThey were among the thousands of farmers, who will march to Ramlila Ground on Thursday and to Parliament Street on Friday, to press for their demands, including debt relief and remunerative prices for their produce. Ayyakannu said he was expecting more farmers affiliated with his association to arrive from Trichy and Karur.\nHe said their main demands include removal of all farmer loans, profitable price for their agricultural products and a Rs 5,000 pension for farmers per month. The farmer leader and his associates are carrying two human skulls. which they claimed were of their two colleagues who ended their lives because they were unable to replay their debts.\n\"Our main agricultural activities include paddy cultivation, cotton farming, horticultural activities like coconut cultivation, banana cultivation. More than 700 farmers have committed suicide in Tamil Nadu due to loans that they could not repay. We have no water and have been suffering from drought like situations for the last five years. This year, too, we suffered due to storms.\n\"Tomorrow, we will stage naked protests if police stop us from going to Parliament,\" he said. The 20 women farmers in his group will not be part of the naked protests, he clarified. Last year, the group staged protests at Jantar Mantar with the skulls of eight farmers who killed themselves owing to farm losses.\nFirstpost is now on WhatsApp. For the latest analysis, commentary and news updates, sign up for our WhatsApp services. Just go to Firstpost.com/Whatsapp and hit the Subscribe button.", "url": "https://www.firstpost.com/india/kisan-march-in-delhi-from-carrying-skulls-to-threatening-naked-protest-tamil-nadu-farmers-warn-of-bizarre-steps-if-kept-away-from-parliament-5639261.html", "label": 1}