{"authors": [], "date_download": "2019-03-27 14:40:59", "date_modify": "2019-03-27 14:40:59", "date_publish": "2019-02-13 08:10:00", "description": "Lal Thanhawla attended an agitation programme organized by civil society groups and held a black banner which read, \"Hello independent republic of Mizoram\".", "filename": "india_story_citizenship-bill-former-cm-lal-thanhawla-sparks-row-with-independent-mizoram-banner-1454719-2019-02-13_1553697659.html", "image_url": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/201902/9-647x363.jpeg?nDkkKo5a2ve0yf0DL66PDgD8vPn4YUVu", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/indiatoday.in/india_story_citizenship-bill-former-cm-lal-thanhawla-sparks-row-with-independent-mizoram-banner-1454719-2019-02-13_1553697659.html", "title": "Citizenship Bill: Former CM Lal Thanhawla sparks row with independent Mizoram banner", "title_page": "Citizenship Bill: Former CM Lal Thanhawla sparks row with independent Mizoram banner - India News", "title_rss": "NULL", "source_domain": "indiatoday.in", "text": "Former Mizoram Chief Minister Lal Thanhawla further sparked the Citizenship Citizenship Bill row on Tuesday after he was seen holding a banner that sought an 'independent' Mizoram, during a protest against the bill in state's Aizawl.\nThe veteran Congress leader who attended an agitation programme organized by civil society groups held a black banner which read, \"Hello independent republic of Mizoram\".\nMizoram PCC chief Lal Thanhawla and his wife join Thousands of protestors to the streets against Citizenship Amendment Bill-2016. The protest was organised by NGOs Co-Ordination Committee of Mizoram. pic.twitter.com/pieGnfReRW CS Thanga (@CSThanga) February 12, 2019\nThe protests in Northeast come at a time when the union government led by the Bharatiya Janta Party (BJP) is trying to pass the contentious bill. Last month, thousands of protesters, mostly students, marched in Aizawl with posters that read, \"Hello China, bye bye India\"!\nThe new bill seeks to amend the existing Citizenship Act of 1955 in order to grant citizenship to persecuted Hindus, Jains, Sikhs, Buddhist, Parsis and Christians from three Muslim-majority countries in South Asia - Pakistan, Afghanistan and Bangladesh. The bill has already been passed in Lok Sabha but is yet to be cleared by the upper house.\nNot just the Mizoram Congress, even the ruling Mizo National Front (MNF), an ally of the BJP has vehemently opposed the bill. Last month, MNF chief and Chief Minster Zoramthanga had met other Northeastern political parties at a meeting convened by his Meghalaya counterpart Conrad Sangma in Guwahati to lend support to the protest against the bill.", "url": "https://www.indiatoday.in/india/story/citizenship-bill-former-cm-lal-thanhawla-sparks-row-with-independent-mizoram-banner-1454719-2019-02-13", "label": 1}