{"authors": [], "date_download": "2019-03-27 14:18:31", "date_modify": "2019-03-27 14:18:31", "date_publish": "2016-05-22 01:01:28", "description": "New Delhi: The Bharatiya Janata Party (BJP) members staged a protest on Sunday against the killing of their colleague by the CPI (M) workers in Kerala last week and alleged that 'jung", "filename": "india-news_delhi-bjp-workers-protest-outside-cpm-office-against-murder-of-party-worker-in-kerala-347214_1553696311.html", "image_url": "https://images.abplive.in/v2/aHR0cHM6Ly9zdGF0aWMuYWJwbGl2ZS5pbi93cC1jb250ZW50L3VwbG9hZHMvMjAxNi8wNS8yMjEzMDExNi9CSlAtUHJvdGVzdC5qcGcjNjQwOjQ4MCNyZXNpemUjanBlZw==/BJP-Protest.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/abplive.in/india-news_delhi-bjp-workers-protest-outside-cpm-office-against-murder-of-party-worker-in-kerala-347214_1553696311.html", "title": "Delhi: BJP workers protest outside CPM office against murder of party worker in Kerala", "title_page": "Delhi: BJP workers protest outside CPM office against murder of party worker in Kerala", "title_rss": "NULL", "source_domain": "abplive.in", "text": "The Bharatiya Janata Party (BJP) members staged a protest on Sunday against the killing of their colleague by the CPI (M) workers in Kerala last week and alleged that 'jungle raj' has begun in the state which voted for the Left Democratic Front (LDF).\"Jungle Raj has begun in Kerala. Many of our people have been killed by the CPI (M) workers. We are protesting against that,\" one of the BJP protestors said.The BJP workers, who were protesting outside the CPI (M) office in Gole Market, were later detained by the police.A BJP delegation led by Union Road Transport, Highways and Shipping Minister Nitin Gadkari will meet President Pranab Mukherjee this afternoon to lodge a formal protest with regard to the violence, which took place in Kerala on May 19-20 during the celebration of the LDF's victory.CPI (M) worker K. Raveendran died in Pinarayi village of Kannur district in Kerala in the evening of May 19, when the party brought out a procession to mark the LDF's victory in the polls.On the other hand, a BJP worker V. R. Pramod of Kodungalloor in Thrissur district of Kerala was allegedly attacked by CPI (M) workers during a victory procession following which he succumbed to his injuries.The BJP and RSS workers took out celebratory processions across Kerala after O. Rajagopal won from the Nemom constituency, giving the saffron party its first seat ever in the state.Several activists from both parties were also injured in the clashes.", "url": "https://www.abplive.in/india-news/delhi-bjp-workers-protest-outside-cpm-office-against-murder-of-party-worker-in-kerala-347214", "label": 1}