{"authors": [], "date_download": "2019-03-27 14:35:13", "date_modify": "2019-03-27 14:35:13", "date_publish": "2017-06-02 17:36:00", "description": "Centre today issued a notice to Bihar government, directing them to stop the construction work of an upcoming mall in Patna that belongs to RJD chief Lalu Prasad Yadav's family.", "filename": "india_story_lalu-prasad-yadav-environmental-laws-bihar-biggest-mall-978081-2017-05-19_1553697313.html", "image_url": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/201705/lalu-mall-story_647_051917070742.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/indiatoday.in/india_story_lalu-prasad-yadav-environmental-laws-bihar-biggest-mall-978081-2017-05-19_1553697313.html", "title": "Centre halts construction of Lalu Prasad Yadav's family mall over violation of environmental laws", "title_page": "Centre halts construction of Lalu Prasad Yadav's family mall over violation of environmental laws - India News", "title_rss": "NULL", "source_domain": "indiatoday.in", "text": "Centre today issued a notice to Bihar government, directing them to stop the construction work of an upcoming mall in Patna that belongs to RJD chief Lalu Prasad Yadav's family.\nThe controversial mall came into light last month, when BJP leader Sushil Kumar Modi in a sensational expose alleged that the land and the upcoming mall, worth Rs 750 core, was part of the \"benami\" property acquired by Lalu and his family.\nThe Centre, in a letter dated May 15, maintained that the mall which was being built over 71,214 sq mt was violating environmental laws.\nAccording to environmental rules and guidelines, prior clearance is needed for building projects with built up area equal to or more than 20,000 sq mt. However, work on Lalu's mall started last year without getting any clearance.\n\"I had complained to the Centre over the violation of environmental laws, and taking cognizance of the matter, it has stopped work on Lalu's mall,\" said senior BJP leader Sushil Kumar Modi.\nLalu's son Tejashwi Yadav applied for a clearance on April 20, after the case came to light.\n\"Since Lalu's elder son Tej Pratap is the Forest and Environment Minister, therefore no kind of clearance was taken before starting work on the mall. An FIR should be registered against Tejaswi and Tej Pratap for starting construction of work on mall without getting clearance\", said Sushil Modi, former deputy Chief Minister of Bihar.\nThe Centre has given state government three weeks to submit a report on the compliance of the orders.\nThe land is in the name of LARA Projects LLP, a company where Rabri Devi, Tejashwi Yadav and Tej Pratap Yadav hold 2,402, 800 and 800 shares respectively.\nAlso Read\nLalu Prasad Yadav burns Sushil Kumar Modi with a single tweet More trouble for Lalu Prasad? Income Tax raids at 22 locations in Delhi, Gurgaon linked to benami land deals", "url": "https://www.indiatoday.in/india/story/lalu-prasad-yadav-environmental-laws-bihar-biggest-mall-978081-2017-05-19", "label": 1}