{"authors": [], "date_download": "2019-03-27 14:34:54", "date_modify": "2019-03-27 14:34:54", "date_publish": "2016-10-18 14:07:07", "description": "A 31-year-old man set himself on fire today as he was troubled by Tamil Nadu Chief Minister Jayalalithaa's health condition.", "filename": "india_story_chennai-jayalalithaas-man-fire-346231-2016-10-12_1553697294.html", "image_url": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/201610/self-immolation_-story_647_101216115714.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/indiatoday.in/india_story_chennai-jayalalithaas-man-fire-346231-2016-10-12_1553697294.html", "title": "Chennai: Troubled by Jayalalithaa's health, man sets himself on fire", "title_page": "Chennai: Troubled by Jayalalithaa's health, man sets himself on fire - India News", "title_rss": "NULL", "source_domain": "indiatoday.in", "text": "A 31-year-old man set himself on fire today as he was troubled by Tamil Nadu Chief Minister Jayalalithaa's health condition.\nSargunam later claimed that he was extremely depressed about Jayalalithaa still being in the hospital. The chief minister was admitted to Apollo hospital on September, 22. Periodical health bulletins have been released by the hospital which served as the only way of knowing about her health.\nOn Wednesday afternoon, Sargunam poured petrol and set himself on fire in front of Tambaram Sanitorium in Chennai. The cops who were on patrol tried to put the fire off but Sargunam tried to evade them. He was seen yelling, \"There is no news about Amma's health. She should get well soon.\" Cops finally manged to handle him and put out the fire. Sargunam was immediately rushed to the hospital.\nAlso read: Katju's love note for Jayalalithaa: You are a fearless lioness, your opponents are langurs\nLIFE FOR AMMA\nSargunam's wife, Sheela said that he used to drink and rant such things often, so she didn't take it seriously but was taken back to hear that he set himself on fire. Sargunam who has severe burns in his hands, legs and chest, groaning in pain said, \"I want to give my life and save Amma. Tamil Nadu needs her and she must get well soon.\"\nSargunam works as a security officer in a private company and has a 4-year-old daughter.\nAlso read: Man killed in shooting inside bus in Tamil Nadu's Virudhunagar district, motive unclear\nThe incident created tension and drama on the busy road and disrupted traffic movement, while the commuters were shocked.", "url": "https://www.indiatoday.in/india/story/chennai-jayalalithaas-man-fire-346231-2016-10-12", "label": 1}