{"authors": [], "date_download": "2019-03-27 14:25:46", "date_modify": "2019-03-27 14:25:46", "date_publish": "2016-10-11 00:00:00", "description": "The BJP today organised a march here to protest the recent killing of an RSS worker in Kerala allegedly by the CPM and the CPM politburo issued a statement slamming the RSS for the murder of a party member this morning.", "filename": "india_kerala-cpm-rss-clash-echo-in-delhi_cid_1513698_1553696746.html", "image_url": "https://www.telegraphindia.com/assets/images/default_social_image.png?v=46", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/telegraphindia.com/india_kerala-cpm-rss-clash-echo-in-delhi_cid_1513698_1553696746.html", "title": "Kerala CPM-RSS clash echo in Delhi", "title_page": " Kerala CPM-RSS clash echo in Delhi ", "title_rss": "NULL", "source_domain": "telegraphindia.com", "text": "New Delhi, Oct. 10: The BJP today organised a march here to protest the recent killing of an RSS worker in Kerala allegedly by the CPM and the CPM politburo issued a statement slamming the RSS for the murder of a party member this morning.\nThe CPM said the party member was hacked to death.\nToday, the BJP supporters carried placards that said: \"CPM goons, stop killing of BJP workers in Kerala\".\nIt is the second such protest organised by the BJP here this year. The BJP had organised an agitation in May and a delegation had called on the President to protest against the alleged killing of their leaders by the CPM.\nTwo days ago, BJP president Amit Shah had tweeted: \"BJP's Kerala unit is holding a protest against this institutional killing of BJP workers in Kerala. CM Pinarayi Vijayan must ensure justice\".\nThe CPM politburo today issued a statement saying: \"The Polit Bureau of the CPI(M) strongly condemns the brutal murder of its Paduvilai Local Committee member, K Mohanan, by RSS hoodlums this morning. A group of heavily armed RSS goons entered the toddy shop where the 52 year old Mohanan was working and hacked him to death. There were around 30-40 sharp wounds inflicted on his body\".\nThe CPM claimed that the party and other constituents of the LDF have been at the receiving end of the attacks by the RSS and its outfits.\n\"In the short duration that the current LDF government has been in office as many as six CPI(M) workers have been killed and around 300 of its members injured in brutal attacks launched by the RSS\", the CPM said.", "url": "https://www.telegraphindia.com/india/kerala-cpm-rss-clash-echo-in-delhi/cid/1513698", "label": 1}