{"authors": [], "date_download": "2019-03-27 14:18:16", "date_modify": "2019-03-27 14:18:16", "date_publish": "2016-03-04 19:20:54", "description": "When about 10,000 farmers parked their tractors willy-nilly on the busy thoroughfares of Bengaluru on Thursday during peak school closing hours, it brought the city to a standstill.", "filename": "india_farmers-protest-in-bengaluru-how-a-severe-water-crisis-caused-an-agitation-2657390_1553696296.html", "image_url": "https://images.firstpost.com/wp-content/uploads/2016/03/FarmerDrought_AFP.jpg", "language": null, "localpath": "/home/raj/news-please-repo//data/2019/03/27/firstpost.com/india_farmers-protest-in-bengaluru-how-a-severe-water-crisis-caused-an-agitation-2657390_1553696296.html", "title": "Farmers' protest in Bengaluru: How a severe water crisis caused an agitation", "title_page": "Farmers' protest in Bengaluru: How a severe water crisis caused an agitation - Firstpost", "title_rss": "NULL", "source_domain": "firstpost.com", "text": "By Janaki Murali\nWhen about 10,000 farmers parked their tractors willy-nilly on the busy thoroughfares of Bengaluru on Thursday during peak school closing hours, it brought the city to a standstill. Several commuters and school children were stranded for hours on the main arterial roads and some Bengalureans missed their flights too.\nThe farmers came on their tractors to the city from the districts of Kolar and Chikkaballapur, leading a procession to the Chief Minister K Siddaramaiah’s residence. Trouble began around mid-morning, when some 250 tractors driven by angry farmers tried to get into the city, but were stopped by police barricades at Devanahalli, a suburb, that also houses the international airport. It didn't take long for the protesters to break through the barricades, to continue their march to Vidhana Soudha, the seat of power. A lathi-charge followed and many farmers were injured.\nThe farmer leaders, Kodihalli Chandrashekhar and R Anjaneya, told the media that the government had promised water supply from the Yettinahole lift irrigation project, but that they had learnt from scientists that this would not be feasible and had come to the state’s capital looking for a permanent solution.\nWhile the agitating farmers have called for a bandh in Kolar and Chikkaballapur on Friday to protest the lathi-charge, the opposition was quick to condemn the police action. As reported by the Indian Express, JDS Leader, HD Kumaraswamy said, “The government should have allowed the farmers to protest and assured them on their demands.”\nAccording to the Bangalore Mirror, the issue was also raised on the floor of the House later in the evening, and BJP party leader Vishveshwara Hegde Kageri demanded an answer from the state government as to why the farmers were lathi-charged.\nBut let’s take a step back.\nThe farmers’ protest in Bengaluru on Thursday, was just waiting to happen. The farmers’ plight has been ignored for too long.\nKarnataka farmers launched their protest as early as September last year, demanding a solution to the severe water crisis they were facing. Their demands included irrigation projects, increasing ground level water and rejuvenation of tanks and lakes in their region. All tanks, wells and bore wells had gone dry in the region by then.\nAccording to a Deccan Herald report, the irrigation minister, MB Patil had met protesters and promised to discuss with representatives in November last year. When nothing happened, farmers of Kolar and Chikkaballapur called for a bandh on 21 December, 2015. The Chief Minister then called for a meeting, but failed to find a solution.\nWhat is appalling is that nearly 1000 farmers have been estimated to have committed suicide in Karnataka last year alone. Crop loss and severe drought conditions were said to have led to the deaths.\nSo now, many more lives do we need to see being snuffed out before our leaders take action.\nIn north Karnataka alone, several districts received less rainfall last monsoon. Many farmers had even suspended sowing operations for the Rabi season.\nKarnataka was the first state to declare its 136 taluks across 27 of its 30 districts as drought-hit as early as August last year. Farmers of drought-hit areas are eligible for crop loss compensation and loan restructuring.\nYet sadly, the state’s farmers continue to wait for relief seven months later.\nAccording to a report in Livemint, the Karnataka government had stated that it would allocate Rs 1 crore per taluk. The state government had in turn asked the Centre in August last year for Rs 3500 crore to compensate the farmers. An inter-ministerial team from the Centre had even visited Karnataka in September last year.\nBut sadly, nothing has moved on the ground.\nThe states of Maharashtra, Madhya Pradesh, Karnataka, Odisha and Andhra Pradesh have already declared drought in their districts. Other states like Uttar Pradesh, Bihar, Gujarat, Telangana, Jharkhand, Rajasthan and Haryana are expected to join the line of drought hit states too.\nSo isn’t it time our politicians stopped playing the blame game – the Karnataka Opposition blames the state government and the Karnataka government blames the Centre - for a change, why don’t our elected leaders sit together and find a solution?\nIt’s not going to be easy, for drought and farmers’ suicides do not beg for an easy answer.\nBut, if we have to prevent the brewing farmers’ unrest from metamorphosing into water waters between the states next, our leaders have to act fast.\nFirstpost is now on WhatsApp. For the latest analysis, commentary and news updates, sign up for our WhatsApp services. Just go to Firstpost.com/Whatsapp and hit the Subscribe button.", "url": "https://www.firstpost.com/india/farmers-protest-in-bengaluru-how-a-severe-water-crisis-caused-an-agitation-2657390.html", "label": 1}