{"authors": [], "date_download": "2019-03-27 14:40:32", "date_modify": "2019-03-27 14:40:32", "date_publish": "2015-11-03 22:48:19", "description": "Senior BJP leader and MP Murli Manohar Joshi is getting an unusual attention for his marked absence from his constituency in Kanpur.", "filename": "india_story_unique-protest-in-kanpur-against-bjp-leader-murli-manohar-joshi-271297-2015-11-03_1553697632.html", "image_url": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/201511/joshi-story_647_110315103628.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/indiatoday.in/india_story_unique-protest-in-kanpur-against-bjp-leader-murli-manohar-joshi-271297-2015-11-03_1553697632.html", "title": "Unique protest in Kanpur against BJP leader Murli Manohar Joshi", "title_page": "Unique protest in Kanpur against BJP leader Murli Manohar Joshi - India News", "title_rss": "NULL", "source_domain": "indiatoday.in", "text": "Senior BJP leader and MP Murli Manohar Joshi is getting an unusual attention for his marked absence from his constituency in Kanpur. The local protesters on Tuesday put up big posters that say 'Atithee tum kab aaoge? [Visitor, when will you grace us with your presence?] and sang bhajans that said: 'When will you give us your divine presence?'\nWhat was unique and surprising about the protest was that the local women came out with harmonium and dholaks, and sang bhajans to \"wake him up\". The protesters also promised to distribute sweets if the MP did visit their area.\n\"We gave him our votes hoping that he will present the city's problems to the central government. However, he hasn't been able to do it even in front of the PM. If he visits Kanpur again, we will distribute 51 kg of sweets,\" said resident Sanjay Srivastava.\nJoshi won the Lok Sabha seat from the Kanpur with a record margin of 2,22,946 votes in the 2014 elections. He defeated coal minister Sriprakash Jaiswal, a three-time Congress MP from the same seat.\nBefore that, in 2009, Joshi had won from Varanasi, from where Bharatiya Janata Party's prime ministerial candidate Narendra Modi fought this time.", "url": "https://www.indiatoday.in/india/story/unique-protest-in-kanpur-against-bjp-leader-murli-manohar-joshi-271297-2015-11-03", "label": 1}