{"authors": [], "date_download": "2019-03-27 14:29:16", "date_modify": "2019-03-27 14:29:16", "date_publish": "2017-01-18 19:43:00", "description": "Bhangar has been tense since Monday when police arrested a local leader. By Tuesday, the violence escalated leading to the death of two people.", "filename": "india_story_bhangar-violence-mamata-banerjee-outsiders-provoked-955759-2017-01-18_1553696956.html", "image_url": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/201701/mamata-banerjee-story_647_011817071923_0.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/indiatoday.in/india_story_bhangar-violence-mamata-banerjee-outsiders-provoked-955759-2017-01-18_1553696956.html", "title": "West Bengal: Day after Bhangar violence kills 2, Mamata blames outsiders for provoking locals", "title_page": "West Bengal: Day after Bhangar violence kills 2, Mamata blames outsiders for provoking locals - India News", "title_rss": "NULL", "source_domain": "indiatoday.in", "text": "A day after violent protests erupted in West Bengal's Bhangar over \"forced\" land acquisition for a power project, Chief Minister Mamata Banerjee today blamed outsiders for provoking locals.\nAccording to PTI, the Chief Minister has asked the police to identify the \"outsiders\" who provoked the villagers.\nBhangar, a block in South 24 Parganas district in the state, has been witnessing protests by locals over forced acquisition of 16 acres of farmland by the state government for Power Grid Corporation of India Ltd (PGCIL).\nBhangar has been tense since Monday when police arrested a local leader. By Tuesday, the violence escalated leading to the death of two people.\nPolice, however, refused to divulge details on whether the two people died of bullet injuries.\nALSO READ: Anti-land acquisition stirs in Nandigram, Singur help Mamata win\nMAMATA BUCKLES UNDER PRESSURE?\nChief Minister Mamata Banerjee, who rode to power following the Singur agitation, reportedly felt the pressure in the wake of the protests in Bhangar.\nAs a result, on Tuesday night, she declared that the power grid will not come up in the region. \"No land will be acquired if people don't want to give away land. The proposed power grid will be relocated if required,\" Banerjee tweeted.\nSubsequently, she held a high-level meeting at the state police headquarters with senior officers to assess the situation and prevent any recurrence of violence.\nMeanwhile, state Congress chief Adhir Ranjan Chowdhury went to the house of the two villagers who lost their lives during the protests.\nALSO READ: Will we get our land back, Singur asks Mamata Banerjee\nVILLAGERS CLASH WITH POLICE\nAngry villagers today blocked the roads in the South 24 Parganas district and felled trees to stop security forces from entering the area.\nIn Padmapukur and Machi Bhanga, villagers clashed with police with the latter forced to beat a retreat. Some police personnel were also injured in the clash.\nAccording to villagers, at least six men have been missing since Tuesday's clash and several others have sustained serious injuries.\n\"Who will take the responsibility of the two men who were shot dead on Tuesday. Also six people from our village are missing. We want an answer from the government,\" a villager said.\n(with inputs from IANS)\nALSO READ: Singur farmers to get their land in 2016 at the price of 2006\nALSO READ: Singur: Mamata returns land to farmers as promised, offers new deal to Tata\nALSO WATCH", "url": "https://www.indiatoday.in/india/story/bhangar-violence-mamata-banerjee-outsiders-provoked-955759-2017-01-18", "label": 1}