{"authors": [], "date_download": "2019-03-27 14:35:21", "date_modify": "2019-03-27 14:35:21", "date_publish": "2018-05-30 22:30:00", "description": "Madras High Court on Wednesday ordered re-postmortem of the bodies of seven victims of Tuticorin violence.", "filename": "india_story_tuticorin-violence-madras-high-court-orders-re-postmortem-of-7-bodies-1246358-2018-05-30_1553697321.html", "image_url": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/201805/tuticorin-protest.jpeg?AaC5BhX.XfG2BjNXVxSrXpRAoGqFuXNJ", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/indiatoday.in/india_story_tuticorin-violence-madras-high-court-orders-re-postmortem-of-7-bodies-1246358-2018-05-30_1553697321.html", "title": "Tuticorin violence: Madras High Court orders re-postmortem of 7 bodies", "title_page": "Tuticorin violence: Madras High Court orders re-postmortem of 7 bodies - India News", "title_rss": "NULL", "source_domain": "indiatoday.in", "text": "Almost a week after, 13 people were killed in the gruesome violence that gripped Tamil Nadus Tuticorin in protest against Sterlite plant, Madras High Court today ordered re-postmortem of seven bodies.\nThe court ordered the re-postmortem after petioners alleged tampering of evidence.\nThe court has mandated that a doctor from All India Institute of Medical Sciences (AIIMS) or Jawaharlal Nehru Institute of Postgraduate Medical Education and Research (JIPMER) or Kerala Insititute of Medical Sciences (KIMS) to be part of the team.\nThe High Court has also ordered preservation of bodies of the remaining six victims. A forensic expert will also be part of the post-mortem team.\nSome petitioners are planing to approach Supreme Court to seek permission for their doctors to be present.\nLarge-scale violence on May 22 against the Sterlite copper plant in Tuticorin and police firing led to the death of 12 persons. The next day saw one more youth succumbing to injuries that he sustained after police opened firing.\nFollowing the incident, Tamil Nadu Police was subjected to severe criticism over its handling of the sitiuation. The incident found resonance in the state politics of Tamil Nadu as opposition DMK staged a walkout from the state assembly to demand closure of the Sterlite plant.\nThe plant was closed following the state government's order. The closure of the plant resulted in loss of employment for thousands of workers.", "url": "https://www.indiatoday.in/india/story/tuticorin-violence-madras-high-court-orders-re-postmortem-of-7-bodies-1246358-2018-05-30", "label": 1}