{"authors": [], "date_download": "2019-03-27 14:35:37", "date_modify": "2019-03-27 14:35:37", "date_publish": "2018-12-17 00:00:00", "description": "Delhi BJP leader sits on indefinite hunger strike against Kamal Nath, says he was involved in the anti-Sikh riots - A Delhi BJP leader Monday sat on an indefinite hunger strike against Kamal Nath being nominated for the CM's post in Madhya Pradesh, alleging that the Congress leader was involved in the anti-Sikh riots.", "filename": "india_report-delhi-bjp-leader-sits-on-indefinite-hunger-strike-against-kamal-nath-says-he-was-involved-in-the-anti-sikh-riots-2697034_1553697337.html", "image_url": "https://cdn.dnaindia.com/sites/default/files/styles/full/public/2018/12/17/766271-tajinder-bagga-kamal-nath-fb.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/dnaindia.com/india_report-delhi-bjp-leader-sits-on-indefinite-hunger-strike-against-kamal-nath-says-he-was-involved-in-the-anti-sikh-riots-2697034_1553697337.html", "title": "Delhi BJP leader sits on indefinite hunger strike against Kamal Nath, says he was involved in the anti-Sikh riots", "title_page": "Delhi BJP leader sits on indefinite hunger strike against Kamal Nath, says he was involved in the anti-Sikh riots", "title_rss": "NULL", "source_domain": "dnaindia.com", "text": "A Delhi BJP leader Monday sat on an indefinite hunger strike against Kamal Nath being nominated for the CM's post in Madhya Pradesh, alleging that the Congress leader was involved in the anti-Sikh riots.\nNath will be sworn in as chief minister of Madhya Pradesh on Monday. Tejinder Pal Singh Bagga started his hunger strike at Tilak Nagar in west Delhi where several families affected in the 1984 anti-Sikh riots live.\nProtesting the Congress's move in selecting Nath for the chief minister's post, he said, \"I am sitting on an indefinite hunger strike against Rahul Gandhi's decision to nominate him as CM. He (Nath) is the same person who was involved in the riots against Sikhs in Delhi.\" He said his hunger strike will continue till Nath is replaced by someone else as chief minister of Madhya Pradesh.\nSeveral BJP leaders are supporting Bagga's protest.\nBJP leader and Leader of Opposition in the Delhi Assembly Vijender Gupta said the Congress has \"hurt\" Sikh sentiments by appointing Nath as chief minister.", "url": "https://www.dnaindia.com/india/report-delhi-bjp-leader-sits-on-indefinite-hunger-strike-against-kamal-nath-says-he-was-involved-in-the-anti-sikh-riots-2697034", "label": 1}