{"authors": [], "date_download": "2019-03-27 14:35:20", "date_modify": "2019-03-27 14:35:20", "date_publish": "2015-08-24 00:00:00", "description": "Jayalalithaa today urged AIADMK cadres to stop protests against Tamil Nadu Congress chief E.V.K.S. Elangovan over his \"unpalatable remarks and crude interpretation\" of a meeting between her and Narendra Modi.", "filename": "india_amma-the-merciful_cid_1512745_1553697320.html", "image_url": "https://www.telegraphindia.com/assets/images/default_social_image.png?v=19", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/telegraphindia.com/india_amma-the-merciful_cid_1512745_1553697320.html", "title": "Amma the 'merciful'", "title_page": " Amma the 'merciful' ", "title_rss": "NULL", "source_domain": "telegraphindia.com", "text": "Chennai, Aug. 23: Jayalalithaa today urged AIADMK cadres to stop protests against Tamil Nadu Congress chief E.V.K.S. Elangovan over his \"unpalatable remarks and crude interpretation\" of a meeting between her and Narendra Modi.\n\"The very fact that Elangovan has explained his remarks have been misunderstood amounts to an indirect admission of guilt that he had crossed the lines of political decency. I can understand the protests by AIADMK cadres out of the hurt and anguish caused by Elangovan's remarks. Now that you have expressed your feelings, it is time to end these protests,\" the chief minister said in a statement today.\nElangovan had said Jayalalithaa and Modi \"should make public their special friendship\", referring to a meeting between the two on August 7 at the chief minister's residence.\nOver the past week, AIADMK cadres led by party MLAs and MPs burnt effigies of Elangovan, some beating his posters with shoes and brooms. One supporter, Karate trainer Shihan Hussaini, made a bust of Elangovan using cow dung.\nWhile police kept most protests under control, some turned violent. That included one in which AIADMK cadres led by Lok Sabha MP P. Kumar attacked a Congress office in Tiruchy, leading to their arrests.\nAlso, the protests were mostly held during rush hours, creating traffic jams and causing inconvenience to the public, and many felt they could have turned counterproductive if they continued. So Jayalalithaa's orders to halt them were seen by some as a way to nip the backlash.\nHer appeal was promptly welcomed as an example of \"healthy politics' by Thamilisai Soundararajan, the state BJP president known for her strident criticism of the AIADMK.\nIt was also a reciprocation of Jayalalithaa's acknowledgement that the state BJP, too, had joined the protests against Elangovan's comment.\nWith his remarks, though, the Congress leader appears to have unwittingly helped break the ice between Soundararajan and Jaya, fanning speculation of closer ties between the AIADMK and the BJP ahead of next year's Assembly polls.", "url": "https://www.telegraphindia.com/india/amma-the-merciful/cid/1512745", "label": 1}