{"authors": [], "date_download": "2019-03-27 14:40:26", "date_modify": "2019-03-27 14:40:26", "date_publish": "2016-11-22 21:54:04", "description": "The NIA special court in Delhi framed charges against five accused ISIS members on Monday.", "filename": "india_story_nia-court-charges-isis-accused-matchsticks-bombs-terror-353387-2016-11-22_1553697626.html", "image_url": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/201611/isis_647_112216094340.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/indiatoday.in/india_story_nia-court-charges-isis-accused-matchsticks-bombs-terror-353387-2016-11-22_1553697626.html", "title": "NIA court frames charges against 5 ISIS accused who used matchsticks to make bombs", "title_page": "NIA court frames charges against 5 ISIS accused who used matchsticks to make bombs - India News", "title_rss": "NULL", "source_domain": "indiatoday.in", "text": "The NIA special court in Delhi framed charges against five accused ISIS members on Monday.\nThe ISIS terror module in question learnt to make bombs out of matchstick heads.\nThis was discovered by NIA sleuths from one of the accused Akhlakur Rehman alias Akhlaq from whose mobile, the officials recovered an e-book on bomb making, titled \"Bomb banane ka asan tariqa\".\nThe conspiracy took place in 2014-15 when the five accused formed a group to unleash terror in various parts of country.\nMohammed Azeemushan, Mohammed Osama alias Adil (Peer), Mohammed Mehraj alias Monu and Akhlaq, are from Roorkie in Uttarakhand while the fifth accused, Mohsin Ibrahim Sayyed, is a resident of Malad West, Mumbai.\nALSO READ | ISIS plans to attack India through its bases in Bangladesh and Pakistan\nALSO READ | Confessions of ISIS' Indian lone wolf Mohammad Masiuddin\nTHE CASE\nAll five were charged by the NIA for forming a terror module, with the accused owing allegiance to ISIS.\nWith instructions from Syria-based Indian handler Shafi Armar, the module conspired and planned to carry out a terrorist act by assembling and planting IEDs to strike terror across the country.\nReading the e-book thoroughly, the module learnt how to assemble IED using the explosive material extracted from match sticks. Following instructions from the terror literature, the module purchased match boxes in bulk and extracted the matchstick heads.\nThese explosives were later recovered from the possession of accused Azeemushan.\nAccording to NIA chargesheet, the accused also held several meetings at Lucknow and Deoband to conspire with other radicalised youth, who are also under investigation.\nThe case has been listed for prosecution evidence on December 16 and 16.\nThe case was registered by Delhi Police Special Cell in January, this year.\nThe NIA took over the investigation in March, after an order from the Ministry of Home Affairs.\nAlso Read:\nTerror alert: US embassy warns Americans in India of possible ISIS attacks", "url": "https://www.indiatoday.in/india/story/nia-court-charges-isis-accused-matchsticks-bombs-terror-353387-2016-11-22", "label": 1}