{"authors": [], "date_download": "2019-03-27 14:35:41", "date_modify": "2019-03-27 14:35:41", "date_publish": "2017-06-11 19:37:52", "description": "A photo of an 80-year old woman being beaten up by cops in the farmers' protest in Madhya Pradesh went viral on Twitter on Saturday", "filename": "india_farmers-strike-madhya-pradesh-police-beat-up-80-year-old-woman-arrest-100-year-old-husband-3542297_1553697341.html", "image_url": "https://images.firstpost.com/wp-content/uploads/2017/06/mp-police-social1.jpg", "language": null, "localpath": "/home/raj/news-please-repo//data/2019/03/27/firstpost.com/india_farmers-strike-madhya-pradesh-police-beat-up-80-year-old-woman-arrest-100-year-old-husband-3542297_1553697341.html", "title": "Farmers' strike: Madhya Pradesh Police beat up 80-year-old woman, arrest 100-year-old husband", "title_page": "Farmers' strike: Madhya Pradesh Police beat up 80-year-old woman, arrest 100-year-old husband - Firstpost", "title_rss": "NULL", "source_domain": "firstpost.com", "text": "Bhopal: A photo of an 80-year-old woman being beaten up by cops during the ongoing farmers' protest in Madhya Pradesh went viral on Twitter on Saturday. Its authenticity was initially questioned but media interviews of the woman confirmed that the woman had indeed been beaten up.\nA report in NDTV identified the elderly woman as Kamlabai Mewade, who wanted to meet Chief Minister Shivraj Singh Chouhan, who was holding a \"peace fast\" in response the agitation by Madhya Pradesh's farmers. The report also adds that the police beat up her 100-year-old husband, while her sons and four grandsons were arrested.\nIn the report, she said that the police blamed her for setting trucks on fire and causing violence. Despite telling them that she had a rod in her leg and had been sitting at home for one-and-a-half-years, the police beat her up.\nDNA said that the police dragged her out of her home in Phanda Kala and also accused her of hiding stone pelters inside her house.\nAnother report by The Times of India states that she went to Dusshera Maiden on Saturday to meet the chief minister to complain about her ordeal, but she was turned away by police officials there. In an interview with The Times of India, Superintendent of Police (North) Arvind Saxena said that he will investigate into the matter.\nMeanwhile, Congress vice president Rahul Gandhi condemned the way the situation was handled. Gandhi tweeted a news-clipping of the incident, with a comment that read: \"BJP spreading the love\"\nBJP spreading love pic.twitter.com/0EhOjom740 — Office of RG (@OfficeOfRG) June 10, 2017\nFarmers in Madhya Pradesh and Maharashtra have been on a strike since 1 June to demand better prices for their crops along with a loan waiver. On 7 June, six farmers had died after police opened fire at farmers protesting in Mandsaur, Madhya Pradesh. The incident caused outrage across the state with farmers as well as political parties demanding an immediate solution to the farmers' woes.\nThough farmers in Maharashtra have called off the strike after the state government announced loan waiver to farmers owning land up to five acres, negotiations between the Madhya Pradesh government and the state's farmers have not been successful yet.\nThe Madhya Pradesh chief minister had initiated a fast on Saturday calling for peace in the state but called it off on Saturday.\nFirstpost is now on WhatsApp. For the latest analysis, commentary and news updates, sign up for our WhatsApp services. Just go to Firstpost.com/Whatsapp and hit the Subscribe button.", "url": "https://www.firstpost.com/india/farmers-strike-madhya-pradesh-police-beat-up-80-year-old-woman-arrest-100-year-old-husband-3542297.html", "label": 1}