{"authors": [], "date_download": "2019-03-27 14:29:04", "date_modify": "2019-03-27 14:29:04", "date_publish": "2018-09-26 20:32:19", "description": "According to the UPSIDC, there are 264 big and small tanneries that operate in Kanpur and Unnao. Income from these tanneries is the primary source of livelihood for more than one lakh families.", "filename": "india_uttar-pradesh-govt-decides-to-shut-tanneries-during-kumbh-mela-move-made-to-provide-devotees-with-clean-water-5265471_1553696944.html", "image_url": "https://images.firstpost.com/wp-content/uploads/2018/09/Tannery1280SumitSharma.jpg", "language": null, "localpath": "/home/raj/news-please-repo//data/2019/03/27/firstpost.com/india_uttar-pradesh-govt-decides-to-shut-tanneries-during-kumbh-mela-move-made-to-provide-devotees-with-clean-water-5265471_1553696944.html", "title": "Uttar Pradesh govt decides to shut tanneries during Kumbh Mela; move made to provide devotees with clean water", "title_page": "Uttar Pradesh govt decides to shut tanneries during Kumbh Mela; move made to provide devotees with clean water - Firstpost", "title_rss": "NULL", "source_domain": "firstpost.com", "text": "Lucknow: The Government of Uttar Pradesh has taken a decision to close tanneries operating in Kanpur and Unnao, between December to March, 2019, to provide clean water for devotees participating in the upcoming Ardh Kumbh festival.\nThe Kumbh Mela is to be held in Allahabad for three months, between 15 January and 4 March, 2019.\nThis decision was taken by the Uttar Pradesh government and handed down by Renuka Kumar, principal secretary of the forest department, on 12 June. A review meeting on this decision was chaired by the Uttar Pradesh Pollution Control Board (PCB) on Monday, 17 September, and the copy of the order was dispatched to the district magistrates of Kanpur and Unnao, director of Uttar Pradesh State Industrial Development Corporation (UPSIDC), managing director of the Uttar Pradesh Jal Nigam (UPJN) and divisional commissioner from Kanpur range.\nTU Khan, the chief environmental officer at the Uttar Pradesh PCB, says the government’s orders will be followed although the Board was not consulted before a decision was taken.\nAccording to the UPSIDC, there are 264 big and small tanneries that operate in Kanpur and Unnao. Income from these tanneries is the primary source of livelihood for more than one lakh families.\nMukhtarul Amin, chairman of the Council of Leather Exports said that the government’s decision will have an adverse impact on the leather industry.\n“If this happens, it will be impossible for us to get back into the leather business,” said Amin.\nThey have asked Chief Minister Yogi Adityanath for time and requested that the decision be reviewed. He added that leather exports from Kanpur and Unnao is valued at around Rs 8,000 crore, and about Rs 12,000 crore from the entire state. Amin said that the government should act swiftly to avoid consequences.\n“Pakistan and Bangladesh will earn the larger share in global leather exports,” he said.\nAccording to the UP PCB, these tanneries discharge 6.7 million litres of treated effluent per day. This water is treated at a chemical plant in Jajmau area, which holds the capacity to treat up to 37 million litres per day. These tanneries were once the biggest exporters of finished and unfinished leather in the international market, however, 154 tanneries have been shut down since 2016 due to excessive water pollution or illegal functionality.\nTo maintain the treatment plant, the government recently provided Rs 17 crore to the UPJN, according to the UP Minister for Export Encouragement, Satyadev Pachauri.\nAccording to the PCB, wastewater coming out from tanneries is first treated at the 37 MLD chemical plant in Jajmau, after which the treated water is sent into the Ganga. The water is considered not fit for consumption, but the treatment makes it fit to be sent into the river. There are nine points in the treatment plant from where the water is dumped into the river.\nAccording to AK Srivastava, managing director of UPJN, the treatment plants are sufficiently equipped to deal with the polluted water. The funds requested were to repair the processing unit. “The department is also in process to set up more treatment plants in the future,” he added.\nTaj Alam, president of Uttar Pradesh’s Leather Industries Association, said that the government’s order will kill the leather industries in the state.\n“The leather industries are already in a loss and global exporters have started terming India as an unreliable market. In conditions like this, the industries will either shut down or move to different states and this will affect us very badly,” he said, adding that workers are seeking employment elsewhere and a few industries are operating day and night to meet production deadlines.\nAs per data provided by the Council for Leather Exports, the export of leather and leather products for the financial year of 2017-18 touched Rs 9,153.321 crore, as compared to 2016-17, which recorded a negative growth of -4.89 percent at Rs 9,624.193 crore.\nA report by IndiaSpend states that the leather industry employs around 2.5 million people across the country, most of them Dalit or Muslim. India’s leather industry accounts for 9 percent of the world’s footwear production, and 12.93 percent of the international production of hides/skins.\n“This order, for the government, is just three months, but for traders like us this is going to affect more than four months, as we will have to stop the soaking process a month before and the raw material will also rot in this period if not processed,” said Alam.\nVaki Mohammad, who runs Kanpur Leather Exports, a leather showroom, said that industries have increased the cost for local dealers and shop owners are not receiving adequate supplies from tanneries due to which they would have to look for some other business. “This industry is sinking and nobody cares for it other than the labourers who work there. It is not the first time that Kumbh is happening, but this type of closure is happening for the first time,” he said.\nSmall-scale tanneries are likely to be the worst affected by the government’s order.\nBabu Bhai, the owner of Star House, a small tannery unit, thinks that if the government sticks to this decision, a lot of labourers and small businessmen will die.\n“We do not have much money like big tanneries. A lot of money is required in processing the leather and we do not have savings to feed our family for three continuous months. Most of the labourers are working overtime to complete the order before this diktat is implemented,” said Bhai.\nHe has asked his employees to find another job during those three months as they are in no position to challenge the government order.\nRakesh Tripathi, the Uttar Pradesh BJP spokesperson, said that Kumbh is the world’s largest gathering where people from various nations visit. This step has been taken just to provide clean water, as bathing in the ‘pure’ Ganga water would benefit pilgrims.\n“The government would not want visitors to have a negative perception of the state,” he explained, adding that the government has started discussing alternative solutions, to prevent the leather industry’s loss. When asked about the order’s impact on workers’ livelihood, Tripathi said that the Kumbh Mela will generate sufficient employment opportunities to a large section of the population.\nFirstpost is now on WhatsApp. For the latest analysis, commentary and news updates, sign up for our WhatsApp services. Just go to Firstpost.com/Whatsapp and hit the Subscribe button.", "url": "https://www.firstpost.com/india/uttar-pradesh-govt-decides-to-shut-tanneries-during-kumbh-mela-move-made-to-provide-devotees-with-clean-water-5265471.html", "label": 1}