{"authors": [], "date_download": "2019-03-27 14:35:05", "date_modify": "2019-03-27 14:35:05", "date_publish": "2017-02-04 18:00:16", "description": "Kerala, Karnataka and Tamil Nadu are all staring at catastrophic droughts, and water rationing and water wars loom in the three parched states.", "filename": "india-news_tamil-nadu-andhr_00b2e5eee377c2eeffacfbaccf62077f_story-HuRpL6p0cA7paSUpIDITCP_1553697305.html", "image_url": "https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2017/02/04/Pictures/_65d38f8e-ead5-11e6-a2d8-09470c086dd7.JPG", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/hindustantimes.com/india-news_tamil-nadu-andhr_00b2e5eee377c2eeffacfbaccf62077f_story-HuRpL6p0cA7paSUpIDITCP_1553697305.html", "title": "Tamil Nadu, Andhra, Karnataka droughts: The looming water crisis in South India", "title_page": "Tamil Nadu, Andhra, Karnataka droughts: The looming water crisis in South India   | india news | Hindustan Times", "title_rss": "NULL", "source_domain": "hindustantimes.com", "text": "After the budget day, VK Sasikala, general secretary of the AIADMK, reportedly complained that the Union Budget did not give any special allocation to Tamil Nadu for its extreme drought. Sasikala’s response came soon after chief minister O Panneerselvam said on February 01 that the central team to assess the state’s drought situation had now completed its study, and that he expected the Centre to provide assistance.\nOn January 10, Panneerselvam had already declared Tamil Nadu drought-hit based on an assessment undertaken by the state. This came after around 40 farmers protested outside the Trichy collector’s office, holding dead rats in their mouths, stating that over 47 farmers had committed suicide in the state in the last two months.\nPanneerselvam declared all 32 districts drought-affected in his memorandum to the Prime Minister – 13,305 villages out of 16,682 revenue villages in the state were identified as drought-affected, and all 32 districts as receiving deficit rainfall, with the deficit ranging from 35% to 81%. He also pointed to how their drought has worsened due to Karnataka’s non-release of Cauvery water. Fifteen irrigation reservoirs in the state were at 13% levels at the end of 2016.\nThe Tamil Nadu government urged the Centre to sanction Rs 39,565 crore from the National Disaster Response Fund (NDRF) for relief. Soon after Panneerselvam’s demand, an inter-ministerial central team was constituted to assess the situation in Tamil Nadu. Between January 23-25, the central team studied the damage caused to agricultural crops and took stock of the scarcity in drinking water.\nThe monsoon in Tamil Nadu has been deficient by close to 70%, according to the regional meteorological department. Ground water has been exploited by up to 85% across the state, according to statistics by the agriculture department.\nKerala has also never been spurned by rain gods in over a century as in the past six months. With both the southwest and northeast monsoons not making an appearance except for a few occasional showers, ‘God’s own country’ is all set for its hardest drought in 115 years, and the worst since the state’s formation in 1956.\nMeanwhile, the rains stopped in August in Karnataka. Estimates and surveys carried out by agriculture and revenue departments, 136 of the 175 taluks in the state are drought-hit and experiencing severe drinking water crisis. This is the third consecutive year of drought in the state.\nThere was 33.7% deficiency in the southwest monsoon between July and September. ( File Photo )\nThe numbers in the three states have raised alarm bells everywhere, and what is even more worrying is what they indisputably portend -- the coming water wars that will stem from Tamil Nadu’s dependence on its neighbours.\nA historic emergency in Kerala\nThe regional meteorological department has recorded sobering numbers. There was 33.7% deficiency in the southwest monsoon between July and September. But the real villain was the northeast monsoon between October and December that fell short by 61%.\n“Both the monsoon systems failing is very rare, and a lot is due to the cyclonic systems that developed in the Bay of Bengal like Vardah, which hit Chennai and the Andhra coast. While last year, we got 20% more rains than normal from the northeast monsoon, this time it’s running on a negative scale,” said S Sudevan, director, State Meteorological Department.\nThe worst affected districts are Thrissur and Palakkad, both normally drought-prone, where dryness and crop-wilting are common. But this time, the farmers here were in for a shock.\nKV Santosh is a farmer from Chooliserry panchayat in Thrissur who grows paddy every year on five acres of land. He is also a leader in the local farming community. This year, the father of two had tilled his land and sowed seeds in mid-August like other years. In December when the harvest season arrived, more then 3.5 acres of his land had been rendered completely useless. With the northeast monsoon not bringing precious rain, the crops had died. A dejected Santosh says he will be lucky if the yield is even close to a dismal 30% of the usual produce.\nThroughout Kerala, the groundwater situation is also getting dire. Reports coming from reservoirs and dams across the state have also been discouraging. Almost all reservoirs have been recording steep falls in water level continuously.\nDroughts have led to depletion of water levels in dams and river basins. ( File Photo )\n“The situation is certainly going from bad to worse. At this rate, the water will last for only the next 90 days in most places. We are taking all possible measures, but irrigation is perhaps the last thing on our minds now as we need to save water for all other purposes,” said A Shainamol, managing director, Kerala Water Authority (KWA).\nIn Palakkad, the hottest district in the state, farmers have actually given up on the idea of cultivation. P Sivadasan, 65, comes from a family of farmers. At his panchayat in Kannadi in Palakkad, the farmer claims that this time only 10% crops were cultivated.\n“My son and I are both farmers, and our family is completely dependent on the cultivation. I have never seen such a situation in my whole life. Now the problem is how I will sow the seeds next April with no cash in my hand. My family will starve,” said Sivadasan.\nThe latest figures as of December 21, 2016 from the directorate of agriculture show that 17,128 hectares of cultivable land across the state have been affected by the drought. Crop loss stands at more than Rs 90 crore.\nThe Kerala State Disaster Management Authority (KSDMA) has called upon the government to take proactive steps to preserve whatever water is available for the next few months. On October 28, at a high-level meeting chaired by chief minister Pinarayi Vijayan, the government decided to, for the first time ever, impose a water rationing system across households and industries as recommended by KSDMA.\nA 26-point agenda has been chalked out with the motto of three Rs -- ‘Reduce, Reuse and Recycle’ water. An order of preference has also been decided for use of water till May 2017, with drinking water at the top followed by use of water for household purposes and then for industrial use.\nFor the first time ever, ‘water kiosks’ are being set up in every grama panchayat and tankers, the usual mode of supplying drinking water, are catering only to high water-scarcity areas. Industries that tap ground water have been issued notices to stop productivity by 75% until summer showers arrive in May.\nA round-the-clock control room has also been activated at the State Emergency Operations Centre of KSDMA in Thiruvananthapuram, which reviews the different stages of the drought across the state. In fact, by October the state had already declared itself drought-hit and asked for the Centre’s help, but even that anticipation had failed to see the severity of the oncoming drought.\nWhat makes this drought worse than the one of 2012 is that rainfall was only 24% deficient that year, compared to this year’s 33.7%. In 2012, the northeast monsoon showers had compensated, unlike the dry spell this year.\nWhile in Karnataka\nIf one had seen Karnataka’s farmers in June, they were a happy, beaming lot. It was pouring rain and they were looking forward to a bumper harvest. Till the rains stopped in August.\nThis is the first time in 42 years that the Mysuru region has received scanty rains, forcing farmers to abandon agriculture activities. “The worst story of the drought is that even parts of the Western Ghats, such as Kodagu and Hassan districts, failed to record normal rainfall, drying up dams in Cauvery basin of water,” an agriculture department official claimed, pointing out how farmers in Mandya district, part of the Krishnaraja Sagar dam ayacut area, have failed to harvest even a single paddy crop this year.\nChief minister Siddaramaiah recently said the state had suffered a crop loss of Rs 25,000 crore. The Karnataka government has asked the Centre for a Rs 4,702.54 crore package to help tide over the drought. It has also constituted four teams to tour and assess the drought’s severity in the four revenue divisions -- Bengaluru, Kalaburagi, Belagavi and Mysuru. The teams, comprising junior ministers and headed by a senior minister, toured villages, taluks and district headquarters until December 20 to submit a report recommending measures to tackle the drought.\nThe drought has also led to depletion of water levels in dams across the state, particularly in the old Mysuru region, which has led to a severe drinking water crisis. With water level in the Krishnaraja Sagar dam touching a 15-year low, the worst-affected are likely to be Bengaluru and Mysuru, which depend on the Cauvery delta dams to meet their drinking water needs.\nAs per estimates from the Karnataka State Natural Disaster Monitoring Centre (KSNDMC), the prospect of a severe drinking water problem in the summer months will be a reality in the state. “Water rationing is the only plausible option if the body has to ensure sustained water supply to Bengaluru’s residents until June 2017,” said a senior official from the Bangalore Water Supply and Sewerage Board (BWSSB).\nPreparing for water wars\nDam levels across Tamil Nadu have plunged to 4-6% of capacity, except for a few in the western districts. In the southern parts, farmers have not even sown their crops. In the northern and Cauvery delta districts, thousands of acres of crops have dried up. While the state government is assessing the damage and crop losses, farmers’ associations say that 50 lakh acres in the Cauvery basin alone have been destroyed.\nIn October and November 2016, tensions flared up between Karnataka and Tamil Nadu over the issue of sharing Cauvery river water. Tamil establishments in Karnataka were attacked and vandalised as a decade-old legal battle over sharing of Cauvery river water swung in favour of Tamil Nadu in the Supreme Court. In retaliation, Kannadiga establishments in Chennai were attacked, and Karnataka state buses burnt in Tamil Nadu.\nKarnataka activists set alight trucks coming from Tamil Nadu at Hosa Guddada Halli during their protest against Tamil Nadu Govt and Supreme Court verdict on Cauvery river water. ( Kashif Masood/HT File Photo )\nAs the Supreme Court ordered the release of 2,000 cusecs of water for a specific period to Tamil Nadu, the Karnataka government, initially refusing to obey the order, later reluctantly complied.\nTensions have simmered down now but as the drought deepens in Tamil Nadu, fresh water wars are on the horizon.\nBoth Karnataka and Kerala are upper riparian states with rain-fed rivers originating and flowing mainly from the Western Ghats, and so these two states are not dependent on water from other states to a large extent. However, these rivers cross over into Tamil Nadu and bring water to the farmers there.\nTamil Nadu’s continuing battles with Karnataka and Kerala over water sharing, from the Cauvery and Mullaperiyar respectively, usually intensify during drought situations when these states curtail their sharing of river water with Tamil Nadu.\n“Karnataka has not released Cauvery water this year. We are going to have problems with the release of Mullaperiyar water from Kerala too. The state government has to take a strict stand,” said PR Pandian, president of the All Farmers’ Associations of Tamil Nadu Coordination Committee.\nRead | Farmer deaths in Tamil Nadu: NHRC seeks govt response on steps taken\nTamil Nadu has requested Andhra Pradesh as well for more water from the Krishna river in order to meet the drinking water needs of Chennai and its surroundings. The Andhra government has taken it under consideration and is yet to respond.\nWith the current water levels in dams, a power crisis also looms large over the states, threatening to make it a terrible summer. “We are in for a severe, hot and angry summer, with many battles over water,” sighed a senior official in the Tamil Nadu government. “What we need to do is focus on water management in the long term.”\n(Published in arrangement with GRIST Media)\nFirst Published: Feb 04, 2017 18:00 IST", "url": "https://www.hindustantimes.com/india-news/tamil-nadu-andhra-karnataka-droughts-the-looming-water-crisis-in-south-india/story-HuRpL6p0cA7paSUpIDITCP.html", "label": 1}