{"authors": [], "date_download": "2019-03-27 14:29:09", "date_modify": "2019-03-27 14:29:09", "date_publish": "2018-01-07 23:10:12", "description": "Members of the community submitted a memorandum addressed to President Ram Nath Kovind and PM Modi demanding high-level inquiry into the violence.", "filename": "india_story_rajasthan-dalits-stage-protest-in-dholpur-against-bhima-koregaon-violence-demand-rs-20-lakh-for-kin-of-deceased-1124627-2018-01-07_1553696949.html", "image_url": "https://akm-img-a-in.tosshub.com/indiatoday/thane_story_647_010718111012.jpg?ADN.QahEYkTuWbR9rvPBTJL8WUIcXrzA", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/indiatoday.in/india_story_rajasthan-dalits-stage-protest-in-dholpur-against-bhima-koregaon-violence-demand-rs-20-lakh-for-kin-of-deceased-1124627-2018-01-07_1553696949.html", "title": "Rajasthan: Dalits stage protest in Dholpur against Bhima Koregaon violence, demand Rs 20 lakh for kin of deceased", "title_page": "Rajasthan: Dalits stage protest in Dholpur against Bhima Koregaon violence, demand Rs 20 lakh for kin of deceased - India News", "title_rss": "NULL", "source_domain": "indiatoday.in", "text": "Dalit groups protesting at Thane railway station during the Maharashtra Bandh earlier this week following clashes between two groups in Bhima Koregaon near Pune. (Photo: PTI)\nHundreds of Dalit community members today took to streets in Rajasthan's Dholpur district in protest against the violence perpetrated in Maharashtra's Bhima Koregaon area on January 1.\nAgitators took out the protest march from several main arterial roads of Dholpur while indulging in sloganeering against the Maharashtra government.\n\"In 1818, there was a battle between the Mahars and Peshwas in which the former emerged victorious. To celebrate the 200th anniversary of the win, members of the Bahujan community had gathered in Bhima-Koregaon area. They were attacked in a planned manner under the leadership of Sambhaji Bhide. Petrol bombs were hurled and stones were pelted in which thousands of people sustained injuries. Several people were killed, at least 45 vehicles were destroyed and the loss incurred was worth over lakhs,\" Mangilal Arya, Dalit community leader, said.\nAfter the protest march, members of the community submitted a memorandum addressed to President Ram Nath Kovind and Prime Minister Narendra Modi demanding high-level inquiry into the violence.\nThey also demanded financial assistance of Rs 20 lakh for the kin of the deceased and Rs 5 lakh for the injured.\nAccording to the agitators, they were celebrating the 200th anniversary of the victory of Mahars over the Peshwas on January 1 in Maharashthra's Bhima-Koregaon area when the saffron clad indulged in violence and attacked unarmed people.\n\"We have submitted a memorandum addressed to the President stating our demands. We have requested the President to provide an aid of Rs 20 lakh to the kin of those who lost their lives. We have also mentioned in the memorandum that at least one person from the family of the deceased be offered government job. All of us want immediate action against the culprit. We have sent the memorandum through the district collector,\" added Arya.\nALSO WATCH | Gujarat MLA Jignesh Mevani questions Prime Minister Modi's silence on Bhima Koregaon violence", "url": "https://www.indiatoday.in/india/story/rajasthan-dalits-stage-protest-in-dholpur-against-bhima-koregaon-violence-demand-rs-20-lakh-for-kin-of-deceased-1124627-2018-01-07", "label": 1}