{"authors": [], "date_download": "2019-03-27 14:29:01", "date_modify": "2019-03-27 14:29:01", "date_publish": "2019-02-27 00:00:00", "description": "Bengal Chief Minister Mamata Banerjee's sit-in protest against the centre entered Day 3 amid a full blown political stand-off that saw a host of opposition leaders extending support to the Trinamool Congress chief.", "filename": "india-news_mamata-banerjee-dharna-enters-day-3-live-updates-top-court-to-hear-rajeev-kumars-case-today-1988340_1553696941.html", "image_url": "https://c.ndtvimg.com/2019-02/ud5hctnc_mamata-day-3_625x300_05_February_19.jpg", "language": null, "localpath": "/home/raj/news-please-repo//data/2019/03/27/ndtv.com/india-news_mamata-banerjee-dharna-enters-day-3-live-updates-top-court-to-hear-rajeev-kumars-case-today-1988340_1553696941.html", "title": "Mamata Banerjee Calls Off Protest In Kolkata", "title_page": "Mamata Banerjee Dharna Enters Day 3 Highlights: Mamata Banerjee Calls Off Protest In Kolkata", "title_rss": "NULL", "source_domain": "ndtv.com", "text": "Arun Jaitley shared a blog on Facebook on Mamata Banerjee's ongoing dharna. Titled \"The Kleptocrat's Club\", Arun Jaitley attacked the Trinamool supremo over the Saradha and Rose Valley chit fund scams. Here is the full text of the blog Mamata Banerjee's disproportionate over-reaction to the CBI wanting to interrogate the Kolkata Police Chief has flagged several issues for a public discourse. The most important being that a Kleptocrat's Club now aspires to capture the reigns of India.The West Bengal Chit Fund Fraud was unearthed in 2012-13. Its investigations were handed over to the CBI by the Supreme Court. The Court monitored these investigations. The CBI has interrogated and even arrested some people. Many have been granted bail. If a Police Officer is also required to be interrogated, how does it become a \"super emergency\", \"assault on Federalism\", or \"destruction of Institutions\"? What is the strategy behind Chief Minister's disgraceful and disproportionate reaction? What is her strategy in inviting all other leaders belonging to every opposition to join her on the Dharna? It would be a gross error to assume that she did this because of a routine investigation involving a Police Officer. She did it to defocus from other opposition aspirants for the highest office and to project herself as the nucleus of India's opposition. Her speeches attack Prime Minister Modi but her strategy is aimed to defocus some of her other colleagues in the Opposition and hogging the centre stage.Federalism is not a slogan. It is a delicate balance of the Centre-State relationship. Our Constitutional framework clearly defines the sharing of functions between the Centre and the State. It does not permit an overlap. There are Central agencies and organizations which conduct legitimate investigation in States. Today the CBI is being brutally prevented by physical force and detention of its officer from investigating a crime legally within its jurisdiction, in the State of West Bengal. It is a textbook illustration of a State Government assaulting Federalism. Can a State Government prevent the Income-tax Department from collecting taxes in a State? Can another State Government prevent the NIA from proceeding to arrest a Terrorist located in the State? Can the Enforcement Directorate be prevented from investigating or arresting a smuggler or money-launderer physically located in a State? Obviously the answer is No. If any of these is visible, it would be a case of a State assaulting Federalism. The prevention of a Central investigating agency discharging a function given to it by the Supreme Court is a direct assault on Federalism.Technology has been a great enabler in detection of improper monetary transactions. Traceability of transactions has become simpler and the footprints of illegality can be traced. This has empowered all investigative agencies both at the Centre and at the State Governments to unearth financial crimes including corruption.When Mamata Banerjee decided to sit on a Dharna she received support of many opposition parties. There is an important commonality between them. They are all in Opposition and aspire to be in power. Most of them, or their affiliates are today being investigated, prosecuted and in some cases have also been convicted for crimes of corruption. Her ally from Bihar represents the party of the convicted. The friend from Andhra Pradesh runs a party of contractors, thekhedaars and money-launderers. Her two friends from Uttar Pradesh represent the scandalous legacy of corruption. Her Anarchic brother from the Delhi Government is at his wits end because the penny stock companies of his Ministerial colleagues have been found out. Curiously, the AICC President somersaulted his position from Saradha being a scam to \"shoulder-to-shoulder\" support to the scamster. This somersaulter belongs to the first family of the Congress Party where most members of the family are on bail. It has been argued in the past that the Opposition is going in for a non-ideological short-lived coalition. India cannot afford instability. It has also been argued that the choice in the next Election will be either Modi Vs. Chaos or Modi Vs. Anarchy. Mamata Banerjee's latest acrobatics are the best evidence of the kind of governance India's opposition can provide. But more importantly those who have lent support to the West Bengal Dharna are those who are battling serious allegations of economic improprieties, criminal misconduct and even corruption. Can \"New India\" be ever run by this Kleptocrat's Club?", "url": "https://www.ndtv.com/india-news/mamata-banerjee-dharna-enters-day-3-live-updates-top-court-to-hear-rajeev-kumars-case-today-1988340", "label": 1}