{"authors": [], "date_download": "2019-03-27 14:40:28", "date_modify": "2019-03-27 14:40:28", "date_publish": "2017-06-06 14:56:12", "description": "Tension gripped Mandsaur in Madhya Pradesh after a farmer was killed in police firing.", "filename": "india_farmer-killed-in-police-firing-in-madhya-pradesh-many-injured-2455854_1553697628.html", "image_url": "https://www.oneindia.com/img/2017/06/farmers-protest-06-1496741343.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/oneindia.com/india_farmer-killed-in-police-firing-in-madhya-pradesh-many-injured-2455854_1553697628.html", "title": "Madhya Pradesh farmers' protest: Five dead in police firing, curfew imposed", "title_page": "Madhya Pradesh farmers' protest: Five dead in police firing, curfew imposed - Oneindia News", "title_rss": "NULL", "source_domain": "oneindia.com", "text": "Madhya Pradesh farmers' protest: Five dead in police firing, curfew imposed\nIndia\noi-Anusha\nFive farmers were killed after security forces opened fire in Mandsaur of Madhya Pradesh on Tuesday. At least half a dozen protesting farmers sustained injuries as they clashed with police. Curfew was imposed in sensitive areas across the state after protests turned violent.\nMadhya Pradesh Chief Minister after convening a meeting with his cabinet announced compensation of Rs 10 lakh to families of those killed in the violence. Rs 1 lakh was announced as exgratia to those seriously injured and Shivraj Singh Chouhan assured that the medical expenses of those who sustained injuries would be paid by the government. Reaching out to the farmers, Chouhan said those killed were \"our people\". \"I can understand the pain of their families,\" he said, promising a government job each to the families of the victims.\"Please maintain peace. The government is with farmers,\" he added.\nमंदसौर घटना के मृतकों के परिजनों को रु. 10 लाख, गंभीर घायलों को 1 लाख सहायता राशि देंगे। घायलों के इलाज की ज़िम्मेदारी प्रदेश सरकार उठायेगी। — ShivrajSingh Chouhan (@ChouhanShivraj) June 6, 2017\nCondemning the incident, Congress vice president Rahul Gandhi said the government is at war with farmers.\nMeanwhile, Senior Congress leader and former chief minister Digvijay Singh has called for a bandh on June 7 because of the violence.\nEarlier in the day, the government had denied giving any orders to the police to open fire at the protesters. \"Police has not fired. A probe has been ordered into the same. Neither has the government ordered for suspension of internet nor is there any curfew or clamp down in place,\" said Madhya Pradesh's Home Minister Bhupendra Singh.\nMeanwhile, the opposition attacked the government for failing to address farmers' issues and letting them down. Congress Vice President Rahul Gandhi took to Twitter to declare that the government was at war with farmers.\nThis Govt is at war with the farmers of our country#Mandsaur #MadhyaPradesh https://t.co/HQsjluDUPg — Office of RG (@OfficeOfRG) June 6, 2017\nChief Minister Shivraj Singh Chouhan has ordered a judicial probe into the violence that broke out on Tuesday. Despite MP Kisan Sena (MPKS) and Bharatiya Kisan Sangh (BKS) withdrawing their protest after Chief Minister's assurances, other farmer bodies continued to agitate. The Kisan Union and Rashtriya Kisan Mazdoor Sangh continued their stir on Tuesday. The police opened fire in Mandsaur as the situation got out of hand on in which farmers were killed, worsening the situation further.\nFor days now, farmers in Madhya Pradesh have been protesting demanding higher prices for their produce including onions and dal. Loan waiver is a concern for farmers in Uttar Pradesh and Maharashtra where protests were witnessed. Protests turned violent in many places across Madhya Pradesh with protesters pelting stones at policemen torching police and other vehicles and vandalising shops.\nInternet services were banned in Ratlam and Neemuch as well following the farmers' protest. Earlier, internet services were suspended in Maharashtra's Nasik which is also witnessing massive farmers' protests.\nOneIndia News", "url": "https://www.oneindia.com/india/farmer-killed-in-police-firing-in-madhya-pradesh-many-injured-2455854.html", "label": 1}