{"authors": [], "date_download": "2019-03-27 14:18:15", "date_modify": "2019-03-27 14:18:15", "date_publish": "2017-11-18 12:00:53", "description": "While private doctors in Karnataka were busy protesting against a medical regulation bill, government doctors turned heroes across the state.", "filename": "india_karnataka-government-doctors-treated-6-lakh-outpatients-as-pvt-doctors-protested-2585465_1553696295.html", "image_url": "https://www.oneindia.com/img/2017/11/doctors-18-1510986355.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/oneindia.com/india_karnataka-government-doctors-treated-6-lakh-outpatients-as-pvt-doctors-protested-2585465_1553696295.html", "title": "Karnataka government doctors treated 6 lakh outpatients as Pvt doctors protested", "title_page": "Karnataka government doctors treated 6 lakh outpatients as Pvt doctors protested - Oneindia News", "title_rss": "NULL", "source_domain": "oneindia.com", "text": "Karnataka government doctors treated 6 lakh outpatients as Pvt doctors protested\nIndia\noi-Anusha\nWhile private doctors in Karnataka were busy protesting against a medical regulation bill, government doctors turned heroes across the state. Between November 11 and 16, government doctors have treated 6,46,939 outpatients. Government doctors at various district-level, taluk-level hospitals, and community centers have treated more than 6 lakh patients in 6 days.\nOPDs pf private hospitals and nursing homes, diagnostic centers and clinics were shut for almost a week across Karnataka as doctors went on a strike against the Karnataka Private Medical Establishments (Amendment) Bill, 2017. Government doctors in various places turned saviors for patients in need of medical attention.\nData sourced from all community health centers, district and taluk hospitals between November 11 and 16 shows that government doctors treated 48,706 In patients, conducted 5,072 surgeries and attended to 6,285 deliveries. The largest number of outpatients was recorded on November 16 with 1,49,943 patients seeking help from government doctors.\nPrivate medical practitioners in Karnataka called off their strike after the High Court directed them to do so and after a meeting with Chief Minister Siddaramaiah. Post the meeting, Siddaramaiah said that the private doctors' concerns will be addressed and a new bill would be tabled before the assembly on Monday.\nOneIndia News", "url": "https://www.oneindia.com/india/karnataka-government-doctors-treated-6-lakh-outpatients-as-pvt-doctors-protested-2585465.html", "label": 1}