{"authors": [], "date_download": "2019-03-27 14:18:21", "date_modify": "2019-03-27 14:18:21", "date_publish": "2015-09-27 00:00:00", "description": "'Live and let live,' the Supreme Court told Karnataka today, urging the state to consider releasing water from the Cauvery river to neighbour Tamil Nadu.", "filename": "india-news_live-and-let-live-supreme-court-tells-karnataka-on-cauvery-water-dispute-1453661_1553696301.html", "image_url": "https://i.ndtvimg.com/i/2015-09/cauvery-water-sharing-650_650x400_41443445200.jpg", "language": null, "localpath": "/home/raj/news-please-repo//data/2019/03/27/ndtv.com/india-news_live-and-let-live-supreme-court-tells-karnataka-on-cauvery-water-dispute-1453661_1553696301.html", "title": "'Live And Let Live', Supreme Court Tells Karnataka On Cauvery Water Dispute", "title_page": "'Live And Let Live', Supreme Court Tells Karnataka On Cauvery Water Dispute", "title_rss": "NULL", "source_domain": "ndtv.com", "text": "The Supreme Court has also asked Karnataka to inform about how much water it can release to Tamil Nadu.\nHighlights Top court asks Karnataka to consider releasing Cauvery water. Karnataka asked to abide by decision of Cauvery Water Tribunal Tamil Nadu had accused Karnataka of not releasing enough water\n'Live and let live,' the Supreme Court told Karnataka today, urging the state to consider releasing water from the Cauvery river to neighbour Tamil Nadu.The court also asked Karnataka to inform it on Monday how much water it can release to Tamil Nadu.\"Both Karnataka and Tamil Nadu should maintain harmony in the water dispute,\" said the court.Farmers in Tamil Nadu are protesting against Karnataka for not releasing water despite a court-appointed tribunal ordering it.\"When there is deficit in the release of water some attempts have to be made by Karnataka so that Tamil Nadu can survive as an entity,\" said the judges today.After Tamil Nadu went to the court saying it had received less water than what it had been promised, Karnataka argued that there is no water in its reservoirs.The court said: \"You can't say you are not bothered about the Tribunal's (decision). If the tribunal determined the formula, how can you get away from it?\"According to the Cauvery Water Disputes Tribunal decision, Karnataka has an obligation to deliver 192 thousand million cubic feet of water to Tamil Nadu every year. However, this year Karnataka has failed to even meet its monthly quotas. Tamil Nadu wants the release of at least 25 thousand million cubic feet of water by Karnataka immediately.\nGet the latest election news, live updates and election schedule for Lok Sabha Elections 2019 on ndtv.com/elections. Like us on Facebook or follow us on Twitter and Instagram for updates from each of the 543 parliamentary seats for the 2019 Indian general elections.", "url": "https://www.ndtv.com/india-news/live-and-let-live-supreme-court-tells-karnataka-on-cauvery-water-dispute-1453661", "label": 1}