{"authors": [], "date_download": "2019-03-27 14:29:05", "date_modify": "2019-03-27 14:29:05", "date_publish": "2016-09-27 00:00:00", "description": "Bihar Chief Minister Nitish Kumar, said to be fond of Akhilesh Yadav, has offered his young counterpart in neighbouring Uttar Pradesh support and some friendly advice. Try prohibition, he says.", "filename": "india-news_how-to-win-elections-nitish-kumar-offers-akhilesh-yadav-a-key-tip-1475588_1553696945.html", "image_url": "https://i.ndtvimg.com/i/2016-09/nitish-kumar_650x400_51474949499.jpg", "language": null, "localpath": "/home/raj/news-please-repo//data/2019/03/27/ndtv.com/india-news_how-to-win-elections-nitish-kumar-offers-akhilesh-yadav-a-key-tip-1475588_1553696945.html", "title": "How To Win Elections: Nitish Kumar Offers Akhilesh Yadav A Key Tip", "title_page": "How To Win Elections: Nitish Kumar Offers Akhilesh Yadav A Key Tip", "title_rss": "NULL", "source_domain": "ndtv.com", "text": "Months before UP polls, Bihar's Nitish Kumar has offered Chief Minister Akhilesh Yadav a friendly advice\nBihar Chief Minister Nitish Kumar, said to be fond of Akhilesh Yadav, has offered his young counterpart in neighbouring Uttar Pradesh support and some friendly advice. Try prohibition, he says.Months before crucial assembly elections in UP, Akhilesh Yadav is engaged in a bitter tussle for power with his uncle Shivpal Yadav, one in which his father and Samajwadi Party chief Mulayam Singh has seemed to lean in favour of the latter.\"Akhileshji is the youth face of politics and if he dares to enforce prohibition in the state then he won't need anyone's support or shadow to win the assembly elections,\" said Nitish Kumar as he weighed in on the very public family feud in UP's first family.He said he wouldn't hesitate in supporting Akhilesh Yadav if the 44-year-old UP chief minister announced prohibition. \"There 's no gain without a risk, so unless you dare to do something drastic you can't achieve big political goals,\" said the Bihar Chief Minister, whose promise of prohibition had helped him secure overwhelming support from women voters in last year's assembly elections in his state.Mr Kumar's affection does not extend to Akhilesh Yadav's father Mulayam Singh after their pre-election misadventure in Bihar. Mulayam Singh had walked out of what was called the Grand Alliance led by Nitish Kumar protesting that his Samajwadi Party, a minor player in the state, had not been given an adequate number of seats to contest.\"Mulayam Singh and his party have been cursed by someone for ditching us last year,\" Nitish Kumar said on Monday, linking the Samajwadi Party's troubles with what he called its party chief's \"betrayal\" of an anti-BJP coalition at the last minute.Nitish Kumar, who has taken over as chief of his party the Janata Dal-United, has already held 10 rallies in Uttar Pradesh amid a recent buzz of a possible alliance with Jat leader Ajit Singh of the Rashtriya Lok Dal. Mr Kumar has firmly rejected the possibility of a partnership in UP with the Samajwadi Party, though his Bihar ally Lalu Yadav has said his RJD will help Mulayam Singh by fielding no candidates in the state and working \"in favour of secular forces.\"\nGet the latest election news, live updates and election schedule for Lok Sabha Elections 2019 on ndtv.com/elections. Like us on Facebook or follow us on Twitter and Instagram for updates from each of the 543 parliamentary seats for the 2019 Indian general elections.", "url": "https://www.ndtv.com/india-news/how-to-win-elections-nitish-kumar-offers-akhilesh-yadav-a-key-tip-1475588", "label": 1}