{"authors": [], "date_download": "2019-03-27 14:29:12", "date_modify": "2019-03-27 14:29:12", "date_publish": "2016-02-27 00:00:00", "description": "A wild elephant went on a rampage in a village in West Bengal today, damaging around 100 structures, villagers said", "filename": "india-news_caught-on-video-a-wild-elephant-tears-through-a-bengal-town-1275920_1553696952.html", "image_url": "https://i.ndtvimg.com/i/2016-02/siliguri-elephant-pti_650x400_61455108657.jpg", "language": null, "localpath": "/home/raj/news-please-repo//data/2019/03/27/ndtv.com/india-news_caught-on-video-a-wild-elephant-tears-through-a-bengal-town-1275920_1553696952.html", "title": "Caught On Video, A Wild Elephant Tears Through A Bengal Town", "title_page": "Caught On Video, A Wild Elephant Tears Through A Bengal Town", "title_rss": "NULL", "source_domain": "ndtv.com", "text": "The panicked elephant, filmed in the village of Ektiasal, trampled parked cars and motorbikes as crowds of people gathered to watch (PTI photo)\nA wild elephant went on a rampage in a village in West Bengal today, damaging around 100 structures, villagers said.No injuries were reported.The panicked elephant, filmed in the village of Ektiasal, trampled parked cars and motorbikes as crowds of people gathered to watch from balconies and roof tops. Some followed from a distance as the elephant moved through the streets.The elephant wandered out of a forest, crossing roads and a small river before entering the area where it was filmed. Villagers said they were woken up by its roaring. Authorities shot it with a tranquilizer gun and used a crane to remove it from the town. Attacks by elephants have been on the rise in eastern India. Wildlife experts say the destruction of animal habitats in the country is one of the main reasons for the increase in encounters between wild animals and villagers in rural areas of India.\nGet the latest election news, live updates and election schedule for Lok Sabha Elections 2019 on ndtv.com/elections. Like us on Facebook or follow us on Twitter and Instagram for updates from each of the 543 parliamentary seats for the 2019 Indian general elections.", "url": "https://www.ndtv.com/india-news/caught-on-video-a-wild-elephant-tears-through-a-bengal-town-1275920", "label": 1}