{"authors": [], "date_download": "2019-03-27 14:35:14", "date_modify": "2019-03-27 14:35:14", "date_publish": "2018-05-23 22:38:11", "description": "Two police vehicles were set on fire by protesters as Tamil Nadu's Thoothukudi continued to burn over protests against the Vedanta group's Sterlite Copper plant. Meanwhile, actor-turned-politician Kamal Haasan was booked for violating Section 144 when he reached the hospital with 20 people. Watch LIVE News, Latest Updates, Live blog, Highlights and Live coverage online at firstpost.com.", "filename": "india_sterlite-protest-live-updates-police-vehicles-torched-outside-thoothukudi-hospital-kamal-haasan-booked-for-violating-section-144-4479201_1553697314.html", "image_url": "https://images.firstpost.com/wp-content/uploads/2018/05/Ddx4q54V0AAc854.jpg", "language": null, "localpath": "/home/raj/news-please-repo//data/2019/03/27/firstpost.com/india_sterlite-protest-live-updates-police-vehicles-torched-outside-thoothukudi-hospital-kamal-haasan-booked-for-violating-section-144-4479201_1553697314.html", "title": "Sterlite protest updates: Thoothukudi SP, collector transferred; Centre seeks report from Tamil Nadu govt", "title_page": "Sterlite protest updates: Thoothukudi SP, collector transferred; Centre seeks report from Tamil Nadu govt", "title_rss": "NULL", "source_domain": "firstpost.com", "text": "Anti-Sterlite protest LATEST updates: Congress leader Ghulam Nabi Azad said the state government and the police must be held responsible for the \"massacre of common people\".\nOne of the policemen who fired shots at the protesters is a member of the Special FP commando team of Thoothukudi.\nOne person was killed in fresh firing. Protesters have also begun pelting stones as fresh violence erupted.\nTwo police vehicles were set on fire by protesters as Tamil Nadu's Thoothukudi continued to burn over protests against the Vedanta group's Sterlite Copper plant. Meanwhile, actor-turned-politician Kamal Haasan was booked for violating Section 144 when he reached the hospital with 20 people.\nThe Tamil Nadu government has constituted a one member inquiry committee of retired Judge Aruna Jagadeesan to probe the issue after 11 people were killed in police firing on Tuesday. Thirty others were left injured as a mob of 20,000 people went on a rampage demanding the copper unit be shut down because it has been polluting the area. Earlier, the Union Home Ministry on Asked the Tamil Nadu government to provide details of the incident.\nThe Madurai bench of the Madras High Court has halted the construction for the new copper smelter plant of Sterlite Industries in Thoothukudi after police firing killed at least 11 people and injured more than 60. According to reports, the home ministry has sought a report from Tamil Nadu govt over Thoothukudi incident.\nPoliticians, actors took to Twitter to condemn Tuesday's violence in Thoothukudi, where at least nine were killed in police firing after protests for the closure of Vedanta group's Sterlite Copper plant over pollution concerns turned violent. The Opposition criticised the police action and the government's stoic silence on the issue.\nMeanwhile, the Madras High Court's Madurai bench will deliver interim order on the ongoing construction of a new copper smelter by Sterlite industries in Thoothukudi, ANI reports.\nChief Minister K Palaniswamy confirmed reports about the death of nine people in \"police action\", while reports claimed many, including policemen, were injured in clashes. Governor Banwarilal Purohit condoled the deaths. Palaniswamy announced a compensation of Rs 10 lakh to the families of each of the deceased, and ordered judicial inquiry into the violence.\nThe protests were going on in Tuticorin for over three months now, but violence erupted on Tuesday with agitators fighting pitched battles with police, prompting it to open fire. Palaniswami said in a statement in Chennai that the protesters took out a procession towards the collectorate in defiance of the prohibitory orders clamped in the specific area in Tuticorin.\nHurling stones and setting government vehicles and public property on fire, the agitators went on the rampage in the town, about 600 km from Tamil Nadu capital Chennai. Police said nearly 5,000 protesters gathered near a local church and insisted on taking a out a rally to the district collectorate after they were denied permission to march to the copper smelter plant.\nInitial pushing and shoving soon led to violent clashes, after agitated locals began hurling stones at police and overturned a vehicle. Security personnel used batons and burst teargas shells to break up the protest.\nMany were injured in stone-pelting by the agitators, who also set some vehicles on fire. Windscreens of some government cars were smashed and bank premises were attacked by the rampaging mobs.\nAs the violence spiralled, police opened fire, killing nine people. \"The police had to take action under unavoidable circumstances to protect public life and property as the protestors resorted to repeated violence... police had to control the violence,\" Palaniswami, who holds the Home portfolio, said.\nReinforcements have been rushed from neighbouring districts to Tuticorin to assist the local administration in restoring normalcy. Some senior officials have also been despatched from Chennai to the strife-torn town to assess the situation and take measures to restore calm, sources said.\nMeanwhile, an official release said about 20,000 people took out a procession towards the district collectorate and the copper plant, demanding its permanent closure. The government, underlining its \"pro-people commitment\", said further legal action would be taken, \"respecting\" their feelings.\n\"The Tamil Nadu government requests the people to accept this (assurance) and maintain peace,\" it said. The statement said the plant was in operation in Meelavitan in Tuticorin for the past 20 years.\nFollowing a gas leak in March 2013, the then chief minister the late J Jayalalithaa, ordered its closure, following which the company moved the National Green Tribunal. With the tribunal overturning the government order, the state moved the Supreme Court against it, and the petition was now pending there, it added.\nIt said the Tamil Nadu Pollution Control Board (TNPCB) had earlier this year rejected Sterlite's application seeking renewal of consent to operate the plant over non-fulfilment of green norms, including those related to disposal of copper waste and effluents.\nThe company later moved the Appellate Authority and the next hearing is slated for 6 June, it said. DMK Working President and Leader of Opposition, MK Stalin, slammed the \"inhumane\" firing on protestors.\nIn a statement, he demanded an inquiry by a sitting high court judge, besides a compensation of Rs 1 crore for the families of each of those killed. The government committed a \"Himalayan blunder\" by handling the protest with \"guns and teargas shells,\" he said, adding at least a minister accompanied by the district collector should have spoken to the agitators.\nHe called for the removal of state police chief TK Rajendiran.\nStalin, who was to attend the swearing-in ceremony of JD(S) leader H D Kumaraswamy as Karnataka chief minister tomorrow, said he has cancelled his Bengaluru visit, and would head for Tuticorin to take stock of the situation. MDMK founder Vaiko likened the incident to the British era Jallianwala Bagh massacre, while the CPI(M)'s state unit demanded the chief minister's resignation.\nOpposition parties including PMK, DMDK, Congress, and the MNM slammed the violence and police action, while actor Rajinikanth, who is slated to launch his political party, held the government responsible for the deaths.\nStalin and MNM founder Kamal Haasan demanded permanent closure of the plant.\nWith inputs from PTI\nFirstpost is now on WhatsApp. For the latest analysis, commentary and news updates, sign up for our WhatsApp services. Just go to Firstpost.com/Whatsapp and hit the Subscribe button.", "url": "https://www.firstpost.com/india/sterlite-protest-live-updates-police-vehicles-torched-outside-thoothukudi-hospital-kamal-haasan-booked-for-violating-section-144-4479201.html", "label": 1}