{"authors": [], "date_download": "2019-03-27 14:18:31", "date_modify": "2019-03-27 14:18:31", "date_publish": "2015-03-13 10:37:52", "description": "Unprecedented events unfolded in Kerala assembly on Budget day as the opposition, the Left Democratic Front, tried to stall Finance Minister K.M. Mani from presenting the budget.", "filename": "india_story_km-mani-ruckus-in-kerala-assembly-bar-bribery-case-244099-2015-03-13_1553696311.html", "image_url": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/201503/kerala-story_650_031315101801.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/indiatoday.in/india_story_km-mani-ruckus-in-kerala-assembly-bar-bribery-case-244099-2015-03-13_1553696311.html", "title": "Tainted Kerala minister presents budget amid fisticuffs and protests", "title_page": "Tainted Kerala minister presents budget amid fisticuffs and protests - India News", "title_rss": "NULL", "source_domain": "indiatoday.in", "text": "Protest against Kerala Finance Minister KM Mani outside Kerala Assembly. Photo: ANI Protest against Kerala Finance Minister KM Mani outside Kerala Assembly. Photo: ANI\nUnprecedented events unfolded in Kerala Assembly on Budget day as the opposition, the Left Democratic Front, tried to stall Finance Minister K.M. Mani from presenting the budget.\nHowever, in a day marred with untoward incidents and in an assembly upturned by protests, Mani presented the budget, his thirteenth, on Friday, the 13th. His speech, just a few token sentences, was lost in the hurrahs of ruling MLAs, and the melee of the Opposition.\nThe Opposition said Mani, who is facing a vigilance inquiry for allegedly accepting bribes to reopen some bars in the state, has no moral right to present the budget.\nProtest against Kerala Finance Minister KM Mani outside Kerala Assembly. Photo: ANI Protest against Kerala Finance Minister KM Mani outside Kerala Assembly. Photo: ANI\nThe assembly saw an ugly show of strength. When Mani tried to enter the building the first time, the CPM's M.A. Baby and Thomas Isaac and other MLAs wrestled with the Watch and Ward that was protecting the finance minister and pushed him out of the assembly. When Mani returned with beefed-up protection, the protests worsened. The Speaker's chair was upturned, his computer ripped out.\nMeanwhile, Mani reached the assembly through the backdoor, with a lapel microphone attached to his kurta.\nThe Speaker, the newly elected N. Shakthan, could not be present in the assembly initially as the Opposition had stalled his entry. Later it was reported that he managed to come near his seat and gave Mani permission to present the budget.\nMani presented the budget not from his seat, but from the third-row aisle, surrounded by several rings of UDF MLAs and the Watch and Ward staff.\nThis time what is in the budget was not the issue; instead, all eyes and all the energies were invested on if the finance minister would indeed present the budget, if he would at least say 'Sir'. And he did, much to the government's relief.\nThree legislators, V. Sivankutty and K.S. Saleekha of the CPM and K. Ajith of the CPI, fell unwell after the fisticuffs and were hospitalised.\nProtest against Kerala Finance Minister KM Mani outside Kerala Assembly. Photo: ANI Protest against Kerala Finance Minister KM Mani outside Kerala Assembly. Photo: ANI\nHigh drama began Thursday itself when the Opposition declared they would gherao the assembly building and would not allow Mani to enter or present the budget.\nMeanwhile, outside the assembly building, thousands of Left supporters and Yuva Morcha activists had converged from all over the state to protest against Mani and stop his approach. To circumvent Opposition's tactic, Mani stayed over at the assembly on Thursday night. So did Chief Minister Oommen Chandy and a host of other UDF ministers and MLAs. Sensing this, the LDF also spent the night in the assembly.\nKerala saw the unusual sight of almost all the MLAs and ministers turning the assembly building into a place for a sleepover.\nThe Yuva Morcha's protest briefly turned violent on Friday morning, with a few pelting stones and bottles in the crowd and at the police. A reporter was injured.\nAfter the budget was presented, the police used water cannons and tear gas and baton charge to disperse the protesters outside the assembly building.", "url": "https://www.indiatoday.in/india/story/km-mani-ruckus-in-kerala-assembly-bar-bribery-case-244099-2015-03-13", "label": 1}