{"authors": [], "date_download": "2019-03-27 14:35:00", "date_modify": "2019-03-27 14:35:00", "date_publish": "2017-07-25 07:50:56", "description": "On Monday, a farmer from Tamil Nadu attempted suicide at the protest venue, Jantar Mantar, in New Delhi.", "filename": "india_spectre-suicide-haunts-tamil-nadu-farmers-during-delhi-prote-2504704_1553697300.html", "image_url": "https://www.oneindia.com/img/2017/04/modi1-19-1492586315.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/oneindia.com/india_spectre-suicide-haunts-tamil-nadu-farmers-during-delhi-prote-2504704_1553697300.html", "title": "Spectre of suicide haunts Tamil Nadu farmers during Delhi protest", "title_page": "Spectre of suicide haunts Tamil Nadu farmers during Delhi protest - Oneindia News", "title_rss": "NULL", "source_domain": "oneindia.com", "text": "Spectre of suicide haunts Tamil Nadu farmers during Delhi protest\nIndia\noi-Oneindia\nBy Oneindia Staff Writer\nNew Delhi, July 25: Once again, they are back in the national capital to highlight the plight of drought-hit Tamil Nadu farmers recently.\nAfter ending their protest, which lasted for more than 40 days at Jantar Mantar in April, farmers from Tamil Nadu returned to their previous protesting venue in the national capital on July 16 to raise their demands.\nLike the last time, this time too, the protesting farmers from the southern state are demanding loan waiver, better prices for their crops and interlinking of rivers, to name a few.\nOn the 9th day of their protest this time, reports suggested that one of the farmers attempted suicide at Jantar Mantar on Monday. Thankfully, the farmer is alive as he was immediately rushed to Ram Manohar Lohia hospital for treatment. Police are investigating the matter.\nTamil Nadu farmer commits suicide by consuming sleeping pills | Oneindia News\nHowever, the police and the farmers are contradicting with each other over the reason behind the suicide attempt. While police officials said that NK Subramaniam, the farmer who attempted suicide, took sleeping pills as he was unable to sleep, his friends told the media that Subramaniam attempted suicide as he was highly frustrated because of the lackadaisical attitude of the central government towards the plight of Tamil Nadu farmers.\n\"Subramaniam has given a statement to doctors that he had been having difficulties falling asleep for the last couple of days and had taken the six-odd sleeping pills to help him sleep better,\" BK Singh, deputy commissioner of police, New Delhi, was quoted as saying by The Hindustan Times.\nSubramaniam's friends disagree with the police. \"He told us in the morning that he thought he would have to commit suicide as the central government was not responding to the farmer's demands or empathising with our plight. We did not think he would actually try to do so.\nIt was only when he fainted at around 8:30 am that we realised he had actually done it. We tried sprinkling some water on his face. He opened his eyes a little bit and told us that he could not bear to see our plights anymore and he was committing suicide in the hope that it would move the central government to action,\" claimed R Sellaperumal, a friend of Subramaniam.\n\"Though he had no loans in his name, his family members were in debt. He had been disturbed for the last two days, as he thought that even after nine days of protest there has been no reaction from the central government and he would have to do something so drastic,\" said another farmer.\nThe southern state of Tamil Nadu is facing one of its worst droughts in 140 years. According to reports around 19 farmers in the state have committed suicide in the last 10 months due to rising debts and crop loss.\nIn fact, the protesting farmers at Jantar Mantar have brought with them skulls of dead farmers who have committed suicide earlier.\nOneIndia News", "url": "https://www.oneindia.com/india/spectre-suicide-haunts-tamil-nadu-farmers-during-delhi-prote-2504704.html", "label": 1}