{"authors": [], "date_download": "2019-03-27 14:18:22", "date_modify": "2019-03-27 14:18:22", "date_publish": "2016-09-07 20:20:50", "description": "While the state government is no mood to defy the Supreme court order, they do feel that the ground situation is quite grim and it will become increasingly difficult for the state to release water if the rains continue to fail.", "filename": "india_story_cauvery-water-dispute-karnataka-sc-verdict-339726-2016-09-07_1553696302.html", "image_url": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/201609/cauvery_647_090516022314_090716050042.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/indiatoday.in/india_story_cauvery-water-dispute-karnataka-sc-verdict-339726-2016-09-07_1553696302.html", "title": "Cauvery water dispute: Karnataka to appeal against SC verdict, seek relief", "title_page": "Cauvery water dispute: Karnataka to appeal against SC verdict, seek relief - India News", "title_rss": "NULL", "source_domain": "indiatoday.in", "text": "The state of Karnataka will appeal in the Supreme court on Monday seeking relief on the decision of the apex court seeking release of 10 thousand cusecs of water to Tamil Nadu for their Samba crop cultivation. While the state government is no mood to defy the Supreme court order, they do feel that the ground situation is quite grim and it will become increasingly difficult for the state to release water if the rains continue to fail.\n\"One thing is certain that we have to respect the judgement of the SC. The advocates appealed to them and expressed the distress situation, may be our advocate with a larger heart, thinking that it will resolve the issue for some time, he showed a bit of open-heartedness , saying atleast 10,000 cusecs of water will be released , so that this problem will be solved , but that itself has become a bigger issue now, said the Karnataka home minister Dr G Parameshwara. The Karnataka Home minister has appealed to the people of Karnataka not to indulge in any form of violence to protests against the release of water from the Cauvery Basin.\nCAUVERY SUPERVISORY COMMITTEE\nWhile petitioning the Supreme court, Karnataka has sought a meeting with the Cauvery supervisory committee, which consists of the members of the Central Water Commission to reschedule the release of water in case of distress. What this means is that if the state faces a water shortage due to poor rains or drought, then the release of water to TN may be spaced out.\nAccording to the Cauvery river tribunal which passed its decision in 2007, the state of Karnataka had been directed to release 192 TMC feet of water to Tamil Nadu and Pondicherry in a year. Due to poor monsoons this year, Karnataka has been able to release only 36 TMC of water as compared to 94 TMC that it should have released during this monsoon.\nNOT THE FIRST TIME\nThis is not the first time that the state of Karnataka has been forced to release water despite poor rains. Under the government of HD Deve Gowda (JDS), S M Krishan (Congress) and Jagdish Shettar (BJP) water was released to TN despite scanty rains. Then too it was done on the basis of the advice given by the state legal counsel Fali Nariman.\nOPPOSITION SLAMS FALI NARIMAN\nThis time, the decision by Fali Nariman came under sharp criticism by the opposition who said that the legal counsel should not have agreed to release water. But the Karnataka Chief minister has come in defence of the legal counsel saying that the decision was taken based on the situation in court.\nSpeaking to select media on the Cauvery issue, Siddaramaiah said, Some people are trying to attribute that Nariman made a mistake and that's why we were forced to release water. But he has done so keeping in mind the situation in the court room. Nariman has been senior counsel for Karnataka for the last 32 years. He told us that on October 18, the main Special leave petition which Karnataka has filed against the order of the Cauvery tribunal will be coming up for final hearing. We should keep that in mind and act. This is why he thought it fit to do the good gesture.\nWhat's the ground situation? Storage Water in Mettur (TN) is 36 TMC. Ground water in Tamil Nadu can be found within four to five metres. In Karnataka ground water is found only at 1000 feet. Karnataka faced drought last year Rain deficit of 40 per cent this August compared to Tamil Nadu that has received very good north east monsoons and even faced floods last year. As of now Karnataka has only 46.7 TMC of water and this will be needed till June 2017. Bengaluru and Mysore need close to 28 TMC of water for drinking purposes. 47 TMC is required for agricultural purposes. Karnataka needs a total of 75 TMC of water and as of now has only 46.7 TMC.\nBased on the decision of the Supreme court, the Karnataka government has begun releasing water to Tamil Nadu from Tuesday night.\nKannada organisations have called for a state-wide bandh against the decision of the court to release water saying that not only was Karnataka's side not well presented, it is also injustice to the farmers of the state to have been denied their share of water.\nAlso Read: Cauvery row: Supply of drinking water suspended in Mysuru\nAlso read: Cauvery row: Tamilians in Bengaluru seek protection", "url": "https://www.indiatoday.in/india/story/cauvery-water-dispute-karnataka-sc-verdict-339726-2016-09-07", "label": 1}