{"authors": ["Abp News Bureau"], "date_download": "2019-03-27 14:29:04", "date_modify": "2019-03-27 14:29:04", "date_publish": "2017-05-24 11:41:12", "description": "Lucknow: Raising serious questions at recruitment drive of constables in Uttar Pradesh police, the aspirants on Wednesday staged a massive protest outside Vidhan Sabha. \r\n\r\nThe angry", "filename": "india-news_lucknow-seething-police-aspirants-claim-irregularities-in-recruitment-drive-launch-protest-531171_1553696944.html", "image_url": "https://images.abplive.in/v2/aHR0cHM6Ly9zdGF0aWMuYWJwbGl2ZS5pbi93cC1jb250ZW50L3VwbG9hZHMvMjAxNy8wNS8yNDA2MTExMi9VbnRpdGxlZC1jb21wcmVzc2VkLTEyLmpwZyM2NDA6NDgwI3Jlc2l6ZSNqcGVn/Untitled-compressed-12.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/abplive.in/india-news_lucknow-seething-police-aspirants-claim-irregularities-in-recruitment-drive-launch-protest-531171_1553696944.html", "title": "Lucknow: Seething Police aspirants claim irregularities in recruitment drive, launch protest", "title_page": "Lucknow: Seething Police aspirants claim irregularities in recruitment drive, launch protest", "title_rss": "NULL", "source_domain": "abplive.in", "text": "The angry aspirants staged a massive demonstration and accused the authorities of torturing them. Speaking to the media one of the aspirants said, “We have been tortured. We thought of him as a guardian, and went to Yogi Adityanath ji but the police is beating us up now”.Complaining of violence by the police, he added saying, “We wanted to demonstrate a very peaceful protest but the police are resorting to violence. We have been betrayed\".Another protester accused the cops of not letting them launch a protest, “We were going to the Vidhan Sabha to protest. But the police charged baton on us. They are not letting us have a peaceful protest”.It has been alleged that discrimination has been committed in calling the candidates for the recruitment.Earlier this month, the Uttar Pradesh Police Recruitment and Promotion Board (UPPRPB) had released an employment notification inviting candidates to apply for the positions of Computer Operator. The candidates will be selected on the basis of an online written exam and typing test.", "url": "https://www.abplive.in/india-news/lucknow-seething-police-aspirants-claim-irregularities-in-recruitment-drive-launch-protest-531171", "label": 1}