{"authors": [], "date_download": "2019-03-27 14:40:33", "date_modify": "2019-03-27 14:40:33", "date_publish": null, "description": "BEST bus strike: After BEST, the Maharashtra State Road Transport Corporation is threatening a strike until their demands are met.", "filename": "india_article_best-strike-b_4bb50992f3607b1eb9020c03961a1091_347010_1553697633.html", "image_url": "https://img.timesnownews.com/story/1547444207-Mumbai-BEST-strike-to-continue-as-meet-fails-to-break-deadlock-ani1.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/timesnownews.com/india_article_best-strike-b_4bb50992f3607b1eb9020c03961a1091_347010_1553697633.html", "title": "BEST strike, Day 7: Bombay HC pulls up workers; MNS threatens to launch protest", "title_page": "BEST strike, Day 7: Bombay HC pulls up workers; MNS threatens to launch protest | India News", "title_rss": "NULL", "source_domain": "timesnownews.com", "text": "Representational image | Photo Credit: ANI\nMumbai: The BEST (Brihanmumbai Electricity Supply and Transport) bus strike in Mumbai entered its seventh day on Monday with no agreement in sight between the management of the civic-run transport undertaking and the trade union organisations.\nMeanwhile, the Bombay High Court, while hearing a petition filed against the strike on Thursday, observed that the BEST union is not negotiating properly and also violating the court orders. The BEST union, however, defended their stance, saying they were compelled to go on strike as the BEST is not ready to accept their demands.\nAfter BEST, the Maharashtra State Road Transport Corporation is threatening a strike until their demands are met. If they go on a strike, it will impact the whole of Maharashtra.\nAdding to the woes of Mumbaikars, cab rides to areas housing offices such as Lower Parel, BKC, Churchgate, Andheri, and Goregaon are costing more. More than 32,000 BEST employees are on strike since Tuesday and 3,200 buses are off the roads, affecting 25-30 lakh passengers.\nPeople of Thane and Navi Mumbai are suffering the most due to the BEST strike. The workers on strike have been calling for the merger of the Brihanmumbai Municipal Corporation (BMC) and BEST budgets, demanding higher salaries among other issues.\n​Meanwhile, Nationalist Congress Party (NCP) leader Nawab Malik hit out at the Shiv Sena and the BJP-led Maharashtra government, saying the parties are holding Mumbaikars to “ransom for personal benefits”.\nThe Maharashtra Navnirman Sena (MNS) has threatened to take to the streets on Monday if the Maharashtra government and BMC administration fail to break the deadlock. \"We support the strike and the BEST employees. Their demands are just. If those demands are not met, the MNS will launch a protest,\" said MNS leader Sandip Deshpande.\nOn Sunday, Shiv Sena chief Uddhav Thackeray had vowed to fulfil the promise to merge the BEST and BMC budgets. BEST, the lifeline of Mumbai, is the second largest transport system in the metropolis after local trains.\nWhy is BEST management not agreeing to union's demands:\nThere is a loan of Rs 25,000 crores currently on BEST A deficit of around Rs 200 crores a month BEST has to bear the losses of about Rs 900 crores annually Every month, there is a need to borrow a loan to get the salary of the employees The transportation department's income of one day is Rs 3 crore and the expenditure is Rs 6 crore", "url": "https://www.timesnownews.com/india/article/best-strike-best-bus-strike-mumbai-latest-news-today-bus-strike-news-in-maharashtra-update/347010", "label": 1}