{"authors": [], "date_download": "2019-03-27 14:34:57", "date_modify": "2019-03-27 14:34:57", "date_publish": "2018-09-22 15:16:25", "description": "The Tamil Nadu government asserted that the Sterlite Industries' plant in Tuticorin would not be re-opened.", "filename": "industry_sterlite-plant-in-_bf6761b65df92300dce3108e8ae5c00e__1553697297.html", "image_url": "https://images.financialexpress.com/2018/09/sterlite.jpg", "language": null, "localpath": "/home/raj/news-please-repo//data/2019/03/27/financialexpress.com/industry_sterlite-plant-in-_bf6761b65df92300dce3108e8ae5c00e__1553697297.html", "title": "Sterlite plant in Tuticorin would not be re-opened: Tamil Nadu government", "title_page": "Sterlite plant in Tuticorin would not be re-opened: Tamil Nadu government - The Financial Express", "title_rss": "NULL", "source_domain": "financialexpress.com", "text": "The locals held protests demanding the closure of the Sterlite factory for 99 days and the agitation turned violent on May 22. (PTI)\nThe Tamil Nadu government asserted that the Sterlite Industries’ plant in Tuticorin would not be re-opened as its policy decision to seal the Vedanta Ltd unit was in line with people’s sentiments.\nThis comes on a day when a three-member panel appointed by the National Green Tribunal (NGT) and led by former Meghalaya High Court Chief Justice Tarun Agrawal, is slated to visit the copper smelter plant in the southern district.\n“Our stand is that once it is closed, it is closed. A policy decision was taken by the government and based on that the plant was sealed.They (Vedanta) have moved the NGT against the sealing and a panel was formed. We have moved the Supreme Court saying not even that panel is required,” Fisheries Minister D Jayakumar told reporters here.\nJayakumar said the local people were against the plant, and therefore the government took a decision to seal it “in line with the sentiments of the people of Tuticorin.”\n“Once closed, it is closed. There is no chance of re-opening it by the government,” he asserted.\nThe Tamil Nadu government had ordered permanent closure of the copper smelter plant on environment grounds in the wake of protests by locals.\nThe locals held protests demanding the closure of the Sterlite factory for 99 days and the agitation turned violent on May 22 on its 100th day leading to 13 agitators being killed in police firing.\nThe state government had last Tuesday urged the Central Pollution Control Board to postpone today’s visit of the expert committee to the closed Sterlite Industries, citing pendency of its appeal in the SC against the NGT order setting up the panel.\nIn its communication to CPCB, the Tamil Nadu Pollution Control Board (TNPCB) referred to pending cases in the Supreme Court against the NGT order on setting up the panel.\nEarlier, the state government had also rejected the Centre’s report on groundwater contamination in Tuticorin in the backdrop of the Sterlite controversy, saying it was “absolutely vague” and seemed to support the Vedanta unit which was “totally unwarranted.”\nIt had said the state “strongly feels that the report is motivated and has been prepared only to prejudice the Tamil Nadu government and the TNPCB cases in various judicial fora.”\nTo a query, Jayakumar rejected archrival DMK’s contention that the ruling AIADMK’s September 25 protest against Congress and DMK on the Sri Lankan Tamils issue was a bid to divert attention from corruption charges faced by the ruling dispensation.\nThe AIADMK has announced state-wide public meetings on\nSeptember 25 seeking ‘trial’ of DMK and Congress for “war crimes” against Tamils in the 2009 Sri Lankan civil conflict.\nJayakumar said the meetings were not an attempt at diverting attention from anything “as we have nothing to hide.”\n“Certain truths have to be told to the people at the right time,” he said.\nThe old political issue has been revived by the AIADMK in the backdrop of the recent remarks of former Sri Lankan president Mahinda Rajapaksa that the Indian government helped his country during the final war against the Liberation Tigers of Tamil Eelam (LTTE) in 2009.\nRajapaksa was at the helm when the nearly 30 year-old ethnic strife in Sri Lanka ended in 2009 with the defeat of the LTTE while the DMK was part of the Congress-led UPA that ruled India then.\nThe AIADMK had on September 19 adopted a resolution at a meeting here alleging DMK and Congress were responsible for the killings of thousands of Tamils during the war.\n“Now that Rajapaksa has openly admitted to all secrets, the DMK-Congress coalition government aiding the killings of 1.5 lakh Tamils and rapes of thousands of Tamil women should be treated as war crimes and those involved should be made war criminals and given punishment,” it had said.\nJayakumar sought to know why the DMK had not warned Congress of withdrawing support seeking ceasefire then, and said had this been done, “the 1.5 lakh lives would have been saved.”", "url": "https://www.financialexpress.com/industry/sterlite-plant-in-tuticorin-would-not-be-re-opened-tamil-nadu-government/1322768/", "label": 1}