{"authors": [], "date_download": "2019-03-27 14:29:20", "date_modify": "2019-03-27 14:29:20", "date_publish": null, "description": null, "filename": "industry_1500-km-pipeline-i_9f8eca4e1fe0b993ca34ee374bf7d34b_54481_1553696960.html", "image_url": "https://www.btvi.in/media/images/news/395a9405288bf2f0e93c71627691fdab.jpg", "language": null, "localpath": "/home/raj/news-please-repo//data/2019/03/27/btvi.in/industry_1500-km-pipeline-i_9f8eca4e1fe0b993ca34ee374bf7d34b_54481_1553696960.html", "title": "1500 km pipeline in Assam to supply gas to NE states", "title_page": "1500 km pipeline in Assam to supply gas to NE states", "title_rss": "NULL", "source_domain": "btvi.in", "text": "Guwahati: Five major oil and natural gas PSUs would set up a joint company for a 1500 km gas pipeline at an estimated cost of Rs 6000 crore stretching from Guwahati to Tinsukia via Numaligarh to supply gas to the NE states, Petroleum Minister Dharmendra Pradhan said today.\nThe five PSUs that would form the company are ONGC, Oil India Limited, Indian Oil Corporation, Numaligarh Refinery Limited and GAIL.\n\"The pipeline would connect Guwahati, Numaligarh and Tinsukia in Assam to supply gas to Arunachal Pradesh, Sikkim, Meghalaya, Manipur, Mizoram, Nagaland and Tripura. This pipeline would truly make Assam advantageous,\" Pradhan told reporters on the sidelines of the Global Investors Summit 'Advantage Assam' here.\nThe minister said that earlier the people of Assam would complain that oil and and gas was found in the state but its benefit did not reach it. Now the Centre has decided to change the scenario with the cooperation of the state government, he said.\n\"Assam has the top priority in oil and gas and projects are on to ensure that they reap the benefits under the Vision Document plan of the Central government\", he said.\nGAIL signed an MoU with Assam government today and many more agreements are expected to be signed during the two-day summit.\nThe MoU pledged to complete the Rs 3000 crore pipeline from Bongaigaon to Guwahati which would change the scenario of supply of gas in lower Assam and bring in large scale industrialisation, the union minister said.\nHe thanked Assam Chief Minister Sarbananda Sonowal for organising the summit and added \"It is, indeed, heartening to note that these navaratna, maharatna companies along with other private and government undertakings plan to increase their investments in Assam\".\n(PTI)", "url": "https://www.btvi.in/industry/1500-km-pipeline-in-assam-to-supply-gas-to-ne-states/54481", "label": 1}