{"authors": [], "date_download": "2019-03-27 14:35:10", "date_modify": "2019-03-27 14:35:10", "date_publish": "2016-02-28 06:47:00", "description": "A win for Jayalalithaas AIADMK in the bypolls paved the way for action in Idinthakarai, a fishing hamlet close to the nuclear power plant.", "filename": "industry_energy_power_tamil_fe235ef94a247eceb6fdc734f265b9a1_51170414_1553697310.html", "image_url": "https://img.etimg.com/thumb/msid-51170460,width-1070,height-580,imgsize-97506,overlay-economictimes/photo.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/economictimes.indiatimes.com/industry_energy_power_tamil_fe235ef94a247eceb6fdc734f265b9a1_51170414_1553697310.html", "title": "Tamil Nadu's debt ridden power discom, with a debt of Rs 80,000 crore, needs to be put on the recovery path", "title_page": "Tamil Nadu's debt ridden power discom, with a debt of Rs 80,000 crore, needs to be put on the recovery path - The Economic Times", "title_rss": "NULL", "source_domain": "economictimes.indiatimes.com", "text": "There was a promise of a fierce summer in March 2012 when Tamil Nadu chief minister J Jayalalithaa decided to meet activists and fishermen protesting even more fiercely against the Kudankulam nuclear power plant in southern Tamil Nadu. Jayalalithaa, at that time, declared her support for the agitation against the opening of the nuclear plant. “I am with you,” she said in Tirunelveli, ahead of the Sankarankoil bypolls in March 2012. “Your sister will not let you down.” That did not last.A decisive win for Jayalalithaa’s AIADMK in the bypolls paved the way for decisive action in Idinthakarai, a fishing hamlet close to the nuclear power plant and the focal point of the protests. “After the Sankarankoil bypoll, the police entered the area and committed all sorts of atrocities,” alleged G Sundarrajan of NGO Poovulagin Nanbargal (Friends of the Earth), one of the activists spearheading the protests. Over 300 cases of sedition were filed as over 5,000 police personnel clamped down on the protests, paving the way for the nuclear power plant to begin operations.Jayalalithaa demanded from the Centre that all the 1,000 MW generated by unit 1 of the Kudankulam plant should come to power-starved Tamil Nadu. The UPA government at the Centre then remained silent. Tamil Nadu entered into an agreement with the new BJP government, but hitches continued.“The Kudankulam power plant has tripped 31 times in two years since it began operations,” said Sundarrajan. “The world average for nuclear power plants is one trip every two years,” he said. Kudankulam continues to face myriad problems — fans get stuck, pipes burst, boilers become stubborn. This plant is perhaps a symbol of everything that is wrong with Tamil Nadu’s power infrastructure.As the crackdown continued on Tamil Nadu’s southern shores in the summer of 2012, the rest of the state began to wilt as the mercury rose. Tamil Nadu needed an additional 3,500 MW of power for its residents — it was just not available. A period of intense load shedding was forced on residents and industry. The textile industry of the western belt was hit by outages.“Some 40% of the entire industrial load consumption is by spinning mills,” said K Selvaraj, general secretary, South Indian Spinning Mills Association. “We are the largest consumers of power but we were getting only two-thirds of power during that time.Load shedding began in 2008 and peaked in 2011-12. We suffered 20-30% losses in production due to this, meaning a loss of Rs 1,000 crore, since we had to run on expensive diesel power. Luckily, now there is no such issue,” he said.As per the Comptroller and Auditor General (CAG) report tabled in the Assembly in 2015, the state power discom, TANGEDCO (Tamil Nadu Generation and Distribution Corporation), had goofed up. Citing “deficiencies in financial management, planning, implementation of project, operations and monitoring”, the CAG came down on the power utility for, one, buying expensive power at over Rs 12 per unit when cheaper power was available; two, not evacuating available wind power into the grid; and three, for not recovering penalties from power suppliers.Another key grouse was that TANGEDCO had simply not stuck to deadlines, with projects being delayed for up to three years.Two large power projects totalling a generation of 2,640 MW are now stuck in courts.The Udangudi Ultra Mega Power Project, initiated by the previous Dravida Munnetra Kazhagam (DMK) regime in 2007 and awarded to the Bharat Heavy Electricals Limited ( BHEL ) was scrapped in 2012 after Jayalalithaa swept to power.On February 24, 2012, Jayalalithaa cited BHEL’s “non-cooperation” to scrap the contract, saying the state government would take over the implementation of the project.This exit was to cost the state Rs 64 crore. By May 2013, fresh bids were issued and in less than two years, these bids were cancelled, prompting a bidder, Chinese consortium CSEPDI-Trishe (Central Southern China Electric Power Engineering Design Institute of China; Trishe is the Indian partner firm) to drag TANGEDCO to court, alleging that the only other bidder, BHEL was being favoured by the power utility.The case is pending before the Madras High Court, which granted partial relief to the Chinese consortium, stating that TANGEDCO could not scrap a bid after it was finalised. An interim stay is in place on issuance of fresh bids, although the court has allowed TANGEDCO to issue tenders in order to test the response. Hearings will continue in court.Another project that is awaiting judgment is the Ennore power project, which faced a similar fate with the same companies involved — BHEL and CSEPDI-Trishe. The Chinese firm has alleged that the bids were deliberately rigged in order to favour BHEL. Having lost the case in the Madras High Court, the Chinese firm moved the Supreme Court. Orders have been reserved for over a month in this case.Tamil Nadu may be generating the highest amount of wind power in the country, 7,500 MW, but for almost three years a major chunk of this wind power was not being evacuated into the grid. This inexplicable move took place when the state was starved of a massive 3,500 MW of power between 2013 and 2014, prompting wind power producers to drag the power utility to court, alleging that over 1,500 MW was not being utilised by TANGEDCO. It is only since 2015 that TANGEDCO has begun evacuating the entire wind power.By June 2015, another furore erupted. This time it was over the government allegedly favouring the Adani Group , which was to set up a 648 MW solar power plant in Ramanathapuram. According to the deal, the state power utility would pay a fixed price of Rs 7.01 per unit of solar power generated by the Adanis and 40 other private producers for the next 25 years. The caveat was that power production must begin between September 2014 and September 2015 for them to avail of this fixed price. Subsequently this was extended to January 2016.Opposition parties alleged that the price of Rs 7.01 per unit fixed for purchase of solar power from the Adanis was too high when compared with what other states were paying and alleged that the deals were fixed behind the scenes. A senior official at TANGEDCO, though, says that the price has been rejigged now, after the expiry of the time-frame. “The power regulator has fixed the new price at Rs 5.10 per unit for these solar producers,” said the official, who did not wish to be named. “We are likely to ask for Rs 4.68 since prices across the country have dropped,” he said. Sources say the Adanis have managed to complete only about 72 MW so far.Only 220 MW of solar power is being generated in the state currently, despite an ambitious Solar Power Policy released in 2012, envisioning generation of 1,000 MW solar power by 2015.TANGEDCO is bleeding heavily. With a debt burden of Rs 80,000 crore, it is among the top three debt-laden discoms in the country. While the state government has been helping it out by taking over loans, it is only this year that the power utility has slowly begun to clean up its act.“We cancelled the high-cost power purchases of Rs 12.50 per unit and this saved us Rs 3,000 crore per year,” said the senior official. “We have added 800 MW of short-term power purchases at Rs 5.50 per unit and this year it will come down to Rs 5.05 per unit. That will save us Rs 500 crore per annum,” he said.Three sugar mills have offered power, which they generate from bagasse, at `4.20 per unit, he adds, saving the discom another Rs 150 crore. “We have reduced our losses by Rs 3,000 crore this fiscal,” said the official. “At this rate, if all goes well, TANGEDCO has a good chance of coming back into the black in three years,” he said.TANGEDCO is also confident of meeting expected peak demand of 14,500 MW in the summer. Since June 2015, no power restriction has been imposed on the industry. As of now, the chief minister’s claim is a correct one — Tamil Nadu, for now, is indeed a power surplus state, although just barely.Experts say governments in Tamil Nadu have paid little heed to and, in fact, contributed to the mismanagement of the power sector in the state.The alliance that wins in 2016 will have to be careful: generate enough power but curtail losses on the balance sheet. Meanwhile, the consumer in the middle should not suffer unending power cuts.(The writer is a freelance journalist based in Chennai)", "url": "https://economictimes.indiatimes.com/industry/energy/power/tamil-nadus-debt-ridden-power-discom-with-a-debt-of-rs-80000-crore-needs-to-be-put-on-the-recovery-path/articleshow/51170414.cms", "label": 1}