{"authors": ["Preity Atwal"], "date_download": "2019-03-27 14:34:51", "date_modify": "2019-03-27 14:34:51", "date_publish": "2018-12-13 21:48:49", "description": "The ban “compromises hygiene for common man/masses and favours only large establishments,” says the industry body", "filename": "industry_tamil-nadus-plasti_b4985fa621b5504a41e52617f71d33a5__1553697291.html", "image_url": "https://images.financialexpress.com/2018/12/protest-against-plastic-ban-in-Tamil-Nadu.jpg", "language": null, "localpath": "/home/raj/news-please-repo//data/2019/03/27/financialexpress.com/industry_tamil-nadus-plasti_b4985fa621b5504a41e52617f71d33a5__1553697291.html", "title": "Tamil Nadu's plastic ban discriminatory, will result in over 2 lakh job losses: Industry body", "title_page": "Tamil Nadu's plastic ban discriminatory, will result in over 2 lakh job losses: Industry body - The Financial Express", "title_rss": "NULL", "source_domain": "financialexpress.com", "text": "The Tamil Nadu government is all set to go ahead with its decision to implement a ban on use of single use plastic across the state from January 1 next year. The decision by the state government in June this year coincided with the World Environment Day this year.\nThe plastic industry, however, has expressed apprehensions over the implementation of the move and termed it discriminatory against individuals and small businesses.\nThe Tamil Nadu Plastic Manufacturers’ Association (TAPMA) are holding a demonstration in Chennai today appealing to the Tamil Nadu government to withdraw its order. The order will take effect from January 1, 2019.\n(Image: B Swaminathan, Chairman, Environment Committee, TAPMA)\nTAPMA members are of the opinion that that the government order is “discriminatory in nature” as the ban still allows the use of plastic products in many of the government sector enterprises as well as large-scale private businesses. Their cause of for concern is the fact that the ban has been ordered only for the public and small-scale private sector.\nSingle-use plastic is commonly used for plastic packaging that includes items such as food containers, grocery bags, straws, bottles, containers, cups etc.\nSpeaking to Financial Express Online, B Swaminathan, Chairman, Environment Committee, TAPMA said, “The government is permitting packaging of milk, diary products, oil etc whose packaging can also be classified as one-time only. Also, the supplies to the forestry and horticulture government departments are permitted whereas to private nurseries and other cooperatives are prohibited.\n(Image: Reuters)\n“Again, packaging material used by the manufacturer or processor is permitted so long the packaging is integral and sealed to prior to use. The same packaging material is not permitted for packers / repackers and small retailers for the same products. Smaller shops – be it sweet shops, groceries, hotels ..They are not allowed to use plastic packaging material at all,” he said, adding that this also “compromises hygiene for the common man and favours only large establishments.”\nSo, how should the responsibility be accorded if the country is going to deal with plastic waste?\n“Plastics waste management rules 2016 and solid waste management rules elaborately deal with the responsibilities of local bodies and other stakeholders including EPR– mandated for producers, manufacturers , brand owners and packers,” Swaminathan said.\n“Let the government implement these rules and the industry work on EPR then we can think of other methods.”\nREAD ALSO | Eliminating plastic can’t happen in a short time; in the interim, we can reduce its use\nHe also drew attention to what it means for the plastic manufacturers. He told Financial Express Online, “Out of 8000 factories, 4000 units will be affected (wider impact of packaging ban) in Tamil Nadu. Rs. 4000 Crores is likely to become sticky revenue and Rs.1800 Crores (GST annual) will be lost. Additionally other loans and working capital etc will also become sticky.”\n(Image: B Swaminathan, Chairman, Environment Committee, TAPMA)\nAdding that not only will people lose jobs, “The collateral damage is far beyond comprehension.” He puts the number of job losses at 200000 plus and adds that employees loans – housing, educational, vehicle, personal loans etc will be in default.\nSo, what is the solution?\nBanning manufacture is not the solution, he replies. The government may campaign for reduction in consumption through education and awareness campaigns; this is more sustainable and impactful.\nAccording to a september 2018 report by the Times of India, the Tamil Nadu government is thinking of aiding, in lieu of incentives, single use plastic producers to shift to alternate products.\nFinancial Express Online also spoke to Green technologist and Environmentalist Somendra Mohan Ghosh who said, “I welcome the decision of TN Govt the banning of single use plastic that’s mainly carry bags below 50 micron thickness.”\nThis one type plastic mainly chokes the drainage lines and causes water logging during rainy season. Also, burning of such plastic adds high toxicity in air which is carcinogenic. On first phase “<50 micron” poly bag is essential.Alternatively, use of jute, cloth or paper bags which have lesser water absorption capacity should be encouraged for using in municipal markets for carrying veggies, fish,meat etc. So long the supply source in manufacturing level is not stopped awareness is meaningless. ”", "url": "https://www.financialexpress.com/industry/tamil-nadus-plastic-ban-discriminatory-will-result-in-over-2-lakh-job-losses-industry-body/1412950/", "label": 1}