{"authors": ["Fe Online"], "date_download": "2019-03-27 14:35:17", "date_modify": "2019-03-27 14:35:17", "date_publish": "2017-04-07 14:10:49", "description": "RBI Governor Urjit Patel has sought to send a reality-check message on farm loan waiver", "filename": "industry_banking-finance_fa_9c428874627aa8d7eb99553ffcd35441__1553697317.html", "image_url": "https://images.financialexpress.com/2017/02/Urjit-Patel_PTI-L-1-1.jpg", "language": null, "localpath": "/home/raj/news-please-repo//data/2019/03/27/financialexpress.com/industry_banking-finance_fa_9c428874627aa8d7eb99553ffcd35441__1553697317.html", "title": "Farm loan waiver engenders 'moral hazard', says RBI Governor Urjit Patel", "title_page": "Farm loan waiver engenders 'moral hazard', says RBI Governor Urjit Patel - The Financial Express", "title_rss": "NULL", "source_domain": "financialexpress.com", "text": "RBI Governor Urjit Patel highlighted the risks that could arise as loans are written off. (PTI)\nWhile the Uttar Pradesh government and all Bharatiya Janata Party (BJP) members are preening at the waiving off loans of farmers amounting Rs 36,359-crore, RBI Governor Urjit Patel has sought to send a reality-check message. In a press meet after announcing the RBI’s policy decision to maintain status quo on key rates, he said, “waivers engender moral hazard.” During the campaigning for UP assembly polls, the saffron party had promised farm loan waiver if the party comes to power. Keeping its poll promise, chief minister Yogi Adityanath and his cabinet cleared the proposal to waive off loans of small and marginalised farmers in the first cabinet meeting held earlier this week. Few days after the move, Reserve Bank of India (RBI) chief Patel, said that any such move “undermines an honest credit culture” and could “affect the national balance sheet”.\nPatel was addressing a press conference to announce the bi-monthly monetary policy when he discussed the loan waiver. Referring to several conceptual issues, he said the step “impacts credit discipline” as it “plugs incentives for future borrowers to repay”. The comment of RBI Governor came at the time when farmers of other states including Tamil Nadu and Maharashtra have been demanding loan waiver similar to UP. A group of Tamil Nadu farmers are demonstrating at Jantar Mantar in New Delhi demanding that the Centre waive off their loans. Concerning this, the Madras High Court directed the Tamil Nadu government to waive all farm loans and restrained officials from initiating any penal action against defaulting farmers.\nWATCH | Decisions taken in Yogi Adityanath’s first cabinet meeting\nTo balance the fiscal deficit, a “Kisan Rahat Bond” will be introduced for raising money to fund the farm loan waiver scheme besides some other scheme would be announced by the Yogi government soon in this connection, said the state minister. The RBI governor further highlighted the other risks that could arise as loans are written off. However, Patel highlighted the risks that could arise as loans are written off. He said the waiver can lead to high government borrowings, which can impact yields on government bonds.", "url": "https://www.financialexpress.com/industry/banking-finance/farm-loan-waiver-engenders-moral-hazard-says-rbi-governor-urjit-patel/619104/", "label": 1}