{"authors": [], "date_download": "2019-03-27 14:35:49", "date_modify": "2019-03-27 14:35:49", "date_publish": null, "description": "Canadian PM Refuses to Withdraw Criticism of Saudi Human Rights Record - Saudi-Backed\r\nIsDB Ready to Help Imran-Led Govt with $4 Billion Loan\r\n\r\nApplied\r\nIslamics Will Revolutionize Islamic Studies: Mahmood Madani, Rahman Khan\r\n\r\nThree\r\nMembers of UK Grooming, Islamic World News, New Age Islam News Bureau, New Age Islam", "filename": "islamic-world-news_new-age-_41127b63459a823a930f84c20a4d42d5_116096_1553697349.html", "image_url": "http://www.newageislam.com/picture_library/TahiraRahman_NewAgeIslam.jpg", "language": null, "localpath": "/home/raj/news-please-repo//data/2019/03/27/newageislam.com/islamic-world-news_new-age-_41127b63459a823a930f84c20a4d42d5_116096_1553697349.html", "title": "Canadian PM Refuses to Withdraw Criticism of Saudi Human Rights Record, Islamic World News, New Age Islam News Bureau, New Age Islam", "title_page": "Canadian PM Refuses to Withdraw Criticism of Saudi Human Rights Record, Islamic World News, New Age Islam News Bureau, New Age Islam", "title_rss": "NULL", "source_domain": "newageislam.com", "text": "Canadian PM Refuses to Withdraw Criticism of Saudi Human Rights Record\nTahera Rahman knew her road to becoming the U.S.'s first hijab-wearing Muslim television reporter would be fraught with obstacles\n------\nCanadian PM Refuses to Withdraw Criticism of Saudi Human Rights Record\nSaudi-Backed IsDB Ready to Help Imran-Led Govt with $4 Billion Loan\nApplied Islamics Will Revolutionize Islamic Studies: Mahmood Madani, Rahman Khan\nThree Members of UK Grooming Gang Face Possible Deportation to Pakistan\nBangladeshi Terror Group Jamat Ul Mujahideen Planning Terror Attacks in India and Myanmar\nNorth America\nCanadian PM Refuses to Withdraw Criticism of Saudi Human Rights Record\nFirst Hijabi US TV Reporter to Go On Air\nAnti-Islam Group Postpones Rally at Nathan Phillips Square\nElliott Broidy case: US judge calls for law to prosecute countries such as Qatar\nBrooklyn imam dismayed by family’s tragedy at New Mexico compound\n--------\nPakistan\nSaudi-Backed IsDB Ready to Help Imran-Led Govt with $4 Billion Loan\nSindh Govt Notifies Hindu Marriage Law\nPakistan stands with Saudia Arabia in diplomatic feud with Canada\nMaulana Fazlur Rehman’s address causes outrage in Pakistan\n‘Afghan-trained militant’ allegedly behind Diamer School attacks: police\n--------\nIndia\nApplied Islamics Will Revolutionize Islamic Studies: Mahmood Madani, Rahman Khan\nMadrasas in MP Told To Hold Tiranga Rally on Independence Day, Send Videos As Proof\nTemple in Delhi’s CR Park Denies Muslim Man’s Plea for Last Rites of Hindu Wife\nGovt Yields: Triple Talaq FIR Only By Victim, Blood Relatives\n2013 Bodh Gaya bomb blast: NIA arrests one more terror suspect in Bengaluru\nAhead of Independence Day, explosives seized in Delhi, terror suspects nabbed in Bengaluru\nModi Govt Waters down Triple Talaq Bill with Bail Clause to Clear Rajya Sabha Hurdle\nIntel input says Masood Azhar’s nephew in India, agencies on high alert\n--------\nEurope\nThree Members of UK Grooming Gang Face Possible Deportation to Pakistan\nOne Third of Britons View Johnson’s Burqa Comments as Racist: Poll\nSwitzerland recommends firms continue Iran activity\nRestoring Iran bans entails 'destructive' repercussions, Russia warns US\n--------\nSouth Asia\nBangladeshi Terror Group Jamat Ul Mujahideen Planning Terror Attacks in India and Myanmar\nMore Than 70 Militants Including Foreigners Killed In Paktia Clashes\nTaliban Fighters Storm Afghanistan’s Ghazni, Seize Parts Of City\nMyanmar snubs Hague court’s intervention in Rohingya crisis\nTaliban Launch Major Attack On Afghan City, Casualties: Officials\nBangladeshi Jamat-e-Islami member arrested in Meghalaya\nChildren among 12 dead, wounded in Herat city suicide attack\n6 civilians killed, wounded in rocket attack by Taliban in Logar\n--------\nSoutheast Asia\nChinese Hui Muslim Protest Forces Authorities to Halt Plan To Demolish Weizhou Grand Mosque\n‘Brave’ Mujahid defended Islam by removing LGBT portraits, Perak Mufti says\nOkay To Task 2 Groups to Reform Islamic Bodies, Says Don\nIndonesia launches new group to combat extremism\nAhmad Sarji: New panel will study effectiveness of Islamic institutions\nFatwas violated my right as an author, says Faisal Tehrani\n--------\nMideast\nIran: We Will Hit 112 US Bases with Suicide Bombings\nHamas, Israel Agree Egypt-Mediated Truce To End Gaza Flare-Up: Officials\nAt least 18 Palestinians injured by renewed Israeli strikes on Gaza\nAt least 29 children killed in strike on Yemen bus\nArab Coalition: Many Houthi leaders killed in air raid on Yemen’s Saada\nIsrael strikes Gaza after rockets fired from Palestinian enclave\nGulf Cooperation Council to hold meeting discussing Yemen in Saudi Arabia\nHouthi commander, militiamen killed in Yemen’s Hodeidah\nUAE aircraft took part in Israeli air raids on Gaza, journalist claims\n--------\nArab World\nSyrian Troops Shell Idlib, Drop Leaflets Ahead Of Assault\nISIL Withdraws from Vast Areas of Badiyeh in Sweida\nSeveral Civilians Killed in US Airstrikes in Deir Ezzur\nHezbollah says Lebanon government delay risks ‘slide towards tension’\nSecond Syrian Druze held hostage by ISIS dies\nRussia downs militant drone near Syria’s Hmeimim airbase\nArab coalition: Raid on Houthi missile launch site in Yemen complies with international law\n--------\nAfrica\nBoko Haram militants kill 17 Nigerian soldiers\n11 civilians kidnapped, killed in Mali ethnic attack\nBoko Haram undefeated because of corruption in FG, military – Ribadu explodes\nCompiled by New Age Islam News Bureau\nURL: http://www.newageislam.com/islamic-world-news/new-age-islam-news-bureau/canadian-pm-refuses-to-withdraw-criticism-of-saudi-human-rights-record/d/116096\n--------\nCanadian PM refuses to withdraw criticism of Saudi human rights record\nAug 9, 2018\nCanadian Prime Minister Justin Trudeau says his country will not withdraw its criticism of Saudi Arabia’s human rights record, rebuffing a call by the kingdom’s foreign minister, Adel al-Jubeir.\nThe Canadian PM made the remarks at a Wednesday press conference in Montreal, stressing that his country will “speak strongly and clearly” wherever it sees the need on questions of human rights.\nHis comments came shortly after Jubeir told reporters in Riyadh that Ottawa must recant its criticism of Riyadh’s decision to imprison two Saudi women’s rights activists if it seeks reconciliation with the kingdom.\nThe criticism had been raised last week by Canadian Foreign Minister Chrystia Freeland, who condemned the Al Saud regime for detaining Nassima al-Sadah and Samar Badawi, the latter of whom has family ties to Canada.\nTrudeau told the presser that his country always maintains constructive and positive ties with other nations across the world, but at the same time it must ensure human rights concerns are brought up.\nThat is “because Canadians expect that, and indeed people around the world expect that leadership from Canada,” he noted, stressing that his country will continue to stand up for human rights in all parts of the world in a “polite and constructive” way.\nThe US, which claims to be an advocate of human rights in the world, has yet to support Canada in its tension with Saudi Arabia. However, Trudeau said he cannot “impose on other countries what their responses and reaction should be.”\nHe added that he “respects the rights of other countries to speak for themselves.”\nThe Riyadh-Ottawa diplomatic brawl has already led to the expulsion of the Canadian ambassador to Saudi Arabia, and recalling of the Saudi envoy from Canada.\nSaudis have also suspended all flights to and from the North American state, halted their trade with the country, and ordered its students studying in Canada and patients receiving treatment there to go elsewhere by the next month.\nhttps://www.presstv.com/Detail/2018/08/09/570611/Canada-criticism-Saudi-human-rights\n--------\nSaudi-Backed IsDB Ready to Help Imran-Led Govt with $4 Billion Loan\nAugust 10, 2018\nKARACHI: Pakistan plans to borrow more than $4 billion from the Saudi-backed Islamic Development Bank (IsDB) as part of its attempts to restore dangerously low stocks of foreign currency, reported The Financial Times on Thursday.\nTwo officials told the daily that the Jeddah-based bank had agreed to make a formal offer to lend Islamabad the money when Imran Khan took over as prime minister. They added that they expected Asad Umar — Mr Khan’s proposed finance minister — to accept the offer.\n“The paperwork is all in place,” said one senior adviser in Islamabad. “The IsDB is waiting for the elected government to take charge before giving their approval,” the report quoted the official as saying.\nThe official added that the loan would not cover Pakistan’s expected financing gap of at least $25bn during this financial year but was “an important contribution”.\nSpeaking to reporters in Islamabad this week, Mr Umar had warned: “The situation is dire. We’ve got 10bn dollars of central bank reserves, [and] we’ve got somewhere between $8bn and $9bn in short-term liabilities, and therefore your net reserves are close to nothing.”\nAs per the newspaper report, officials have already drawn up plans to borrow up to $12bn from the International Monetary Fund — though such a bailout is likely to come with strings attached, such as a demand to see the details behind billions of dollars’ worth of Chinese loans.\nMr Umar, it added, was therefore exploring what other options remained open to him, of which the IsDB loan was one. Officials said the loan would be used mainly to pay for oil imports, with higher crude prices having contributed to the country’s problems. One official at Pakistan’s central bank — who has been involved in negotiations with the IsDB — said the loan had the backing of the Saudi government, “which wants to play a part in rescuing Pakistan from its present crisis”.\nDespite the promise of money from the IsDB, economists warn that Mr Khan’s government will still have to enact potentially unpopular spending cuts and tax rises to help repair the government’s balance sheet.\n“The budget deficit shot up to about 7 per cent of gross domestic product during the last financial year,” Waqar Masood Khan, a former finance ministry official told FT. “Bringing that down to the target of 4 per cent is not going to be easy,” the report added, quoting the official.\nhttps://www.dawn.com/news/1426093/saudi-backed-isdb-ready-to-help-imran-led-govt-with-4-billion-loan\n--------\nApplied Islamics will revolutionize Islamic Studies: Mahmood Madani, Rahman Khan\nAugust 9, 2018\nMangaluru (Karnataka): The inaugural programme of the Post Graduate Diploma in Applied Islamics was organised at Yenepoya University, Mangaluru (Karnataka) on 9th August 2018 at 10 am. The programme has been initiated by Chair in Islamic Studies and Research under Dr. Javed Jamil.\nInaugurating the programme Mohamood Madani, General Secretary Jamiat e Ulema Hind, described it as the ‘need of the time ‘and stressed that Islam is meant for the welfare of the whole humanity. He praised the syllabus of the proposed course and described it as an ideal which will be followed by the whole world in future.\nChief Guest, former Minister of Minority Affairs, Rahman Khan lauded the efforts of Dr. Javed Jamil on presenting a new holistic vision, and congratulated Chancellor Abdulla Kunhi for taking the initiative.\nHe said that “the concept of Applied Islamics is wonderful” and if Muslims learn its essence, a new evolution in Islamic studies will be witnessed.\nGuest of Honuor Ziaulla Sheriff stressed upon the students to work hard and to be familiar with all the aspects of life.\nIntroducing the course Dr. Javed Jamil said that all the religions need to come together on the basis of religious morality and not fight on the basis of religious identity.\nHe said that the principles of Islam can be applied in fields like Health Sciences, Social Sciences and National Sciences for the benefit of the whole world. He stressed that one should not study Islam in the light of modern sciences, but study the modern sciences in the light of Islam.\nVice Chancellor Dr. M. Vijayakumar gave thr introduction of Yenepoya University saying that PG Diploma in Applied Islamics is the 100th course started by the University.\nChancellor Y Abdulla Kunhi expressed his delight at the inauguration of the course. He said that the varsity's ultimate aim is to establish a big International centre of Applied Islamics\nPostgraduate Diploma in Applied Islamics, the course inaugurated today, is a unique course, first of its kind in the world, which will focus on Islamic analysis of the scientific and social developments in the modern world.\nAbout Applied Islamics\nApplied Islamics refers to the study of the application of Islamic Principles in the modern fields of knowledge like Law, Natural Sciences, Health Sciences and Social Sciences including Economics and Philosophy.\nIt comprises of the analysis of the modern theories in different fields in the light of Islamic principles and the development of the alternative terminologies, definitions, methodologies, indices, programmes, policies, models and paradigms consistent with Islamic teachings with an aim of helping a cleaner, healthier and more peaceful world.\nWhile subjects like Theology, Arabic and Islamic History are being taught in other places as well, it is the subject of Applied Islamics, which gives this course a very special place. It introduces an interdisciplinary approach.\nUnder the course, chapters on India’s Constitution and the importance of its Secular and Democratic values and the international institutions will also be covered.\nIt will also have Comparative Religion as part of its course and will work for the coming together of all religions and religious communities on the basis of common religious morality rather than fighting each other on the ground of religious identity.\nhttp://www.ummid.com/news/2018/August/09.08.2018/applied-islamics-will-revolutionize-islamic-studies-mahmood-madani-rahman-khan.html\n--------\nThree members of UK grooming gang face possible deportation to Pakistan\nAUGUST 10, 2018\nThree members of a Rochdale grooming gang face possible deportation to Pakistan after Court of Appeal judges upheld a decision to strip them of their British citizenship, The Guardian reported on Wednesday.\nThey had acquired British citizenship by naturalisation.\nAbdul Aziz, Adil Khan and Qari Abdul Rauf were among nine men of Pakistani and Afghan descent convicted of luring girls as young as 13 into sexual encounters using alcohol and drugs. They were based in Rochdale, in northern England.\nThe three men were jailed in May 2012 but were later released on licence. The gang’s ringleader, Shabir Ahmed, was sentenced to 22 years in jail and remains in custody.\nAziz, Khan and Rauf were convicted on conspiracy and trafficking for sexual exploitation charges. Aziz was not convicted of having sexual intercourse with any child.\nThe case centres on a decision by Prime Minister Theresa May, when she was home secretary, to strip the men’s citizenship “for the public good”.\nThe men had challenged the government decision at two immigration tribunals, arguing revoking their citizenship would violate their human right to a family life, as they have children living in the UK. Their appeals were dismissed.\nThe convicts then approached the Court of Appeal, senior judges of which ruled on Wednesday that the previous tribunals had made a “proper and lawful assessment” of the likelihood of deportation. A person can be deprived of British citizenship for the public good on the grounds of “involvement in terrorism, espionage, serious organised crime, war crimes or unacceptable behaviours”.\nAfter serving their sentences, the three convicts will have a further legal right to appeal their deportation and the process could take months, according to the BBC.\nIt quoted a Home Office spokeswoman as saying: “This was an appalling case. We welcome the court’s finding and will now consider next steps.” The five victims of the gang who gave evidence in the 2012 trial were all white, and spoke of being raped, assaulted and traded for sex, being passed from man to man, and sometimes being too drunk to stop the abuses. The men, ranging in age from 22 to 59, used various defences, including claiming the girls were prostitutes.\nhttps://dailytimes.com.pk/280968/three-members-of-uk-grooming-gang-face-possible-deportation-to-pakistan/\n--------\nBangladeshi terror group Jamat ul mujahideen planning terror attacks in India and Myanmar\nAug 9, 2018\nBangladesh terror groups Jamat ul-Mujahideen (JMB) and Ansar ul Bangla Team (ABT) are planning to recruit in India, set up hideouts and procure weapons for terrorist activities in the country. These groups are also making efforts to established contact with radical Islamic groups in India with a view to widening their network. Disclosure of some arrested ABT cadre revealed that outfit has set up an organised network of radicalised local village youth in Assam and West Bengal.\nThe arrest of JMB terrorist and mastermind of Bodh Gaya blast Zahidul Islam revealed before NIA that JMB terrorists are planning to fight against Myanmar army in the Rakhine state of Myanmar. NIA recently arrested two accused including the mastermind of the Bodh Gaya blast. The arrested accused were involved of planting of IED at Kalchakra Maidan, Bodh Gaya, Bihar this year in January.\nThe arrested accused Zahidul Islam alias Kausar and Adil of West Bengal revealed that they were also planning to attack Myanmar by setting up JMB base in India. .Zahidul Islam is a Bangladeshi citizen and most wanted accused in serial blast cases in Bangladesh. He was also found involved in Trishal Police van attack in Bangladesh. He was sentenced to 95 years of imprisonment in total by the Bangladeshi courts and one murder case is still pending trial against him. In 2014 he escaped from custody in Bangladesh and illegally entered into India. He was part of JMB module involved in the preparation of IEDs in Burdwan.\nAs per the NIA sources, Zahidul Islam is the main bomb maker of JMB.He is an expert in making bombs. The arrest of Zahidul is a big success for investigating agencies. During the house search of Zahidul Islam, NIA team recovered electronic devices including traces of explosive from his house at Ramnagara, Bengaluru. Initial interrogation has also revealed that the group led by Zahidul Islam planned to cause IEDs explosion at Bodh Gaya to avenge the atrocities on Rohingyas in Myanmar.\nhttp://www.dnaindia.com/india/report-bangladeshi-terror-group-jamat-ul-mujahideen-planning-terror-attack-in-india-and-myanmar-2647708\n--------\nNorth America\nFirst Hijabi US TV Reporter to Go On Air\n09 August 2018\nTahera Rahman knew her road to becoming the U.S.'s first hijab-wearing Muslim television reporter would be fraught with obstacles.\nAfter graduating from Loyola University Chicago her professors and colleagues would ask if she would be willing to take off her hijab, a headscarf often worn by Muslim women to cover their hair, to land a dream job in journalism. Her answer was consistently a firm \"No.\"\n\"My boss said ‘that’s fine I respect your decision, but just know that you’re going to get a lot of no’s,'” Rahman, 27, told Anadolu Agency.\nAnd indeed the daughter of Indian and Pakistani immigrants did face rejection time and again, having her applications to newsrooms shot down in quick order, and forcing a revaluation of her career path.\nRather than directly seek a reporter position, Rahman chose to pursue a backdoor into the newsroom.\nShe eventually landed a producer position at WHBF-TV, a CBS-affiliated television station about three hours west of Chicago, Illinois.\nBut Rahman was not about to settle for a position behind the scenes. She was determined to make her way in front of a camera, firing off applications to internal openings as soon as she could find them, but was again met with the repeated rejection her mentors foresaw, eventually facing a crisis of confidence that only her mother could pull her back from.\nDurdana Rahman refused to let her daughter spiral into a void of despair, insisting Tahara work even harder to meet her goals.\n“I wrote them an email, my bosses, and I said tell me how I can be the best candidate, tell me what I need to do. And I kept working hard and then I applied the third time and alhamdulillah I got the job, thank God,” she said.\nShe first went on air Feb. 8 of this year, making history in the process.\nAfter her first broadcast the messages of support began rolling in from all across the world, from Mexico to the Netherlands, she said. Perhaps just importantly, Rahman has garnered the appreciation of those in her community.\nShe said she received one such message from a man in Iowa who said \"‘I’m a father of two and I’m Christian, but any time you’re in Des Moines, I want you to come have dinner with my family, because I want my daughters to know who you are.”\n\"The support has been amazing. I couldn’t have expected anything better, and I couldn’t be more grateful,” she said.\nRahman does not know where her career will lead, opining that it may lead to a job in national or international news. Ultimately, however, she is keeping an open mind.\n\"I just want to be able to tell people's stories and make some kind of a difference,\" she said. “It’s gonna be an adventure no matter what, inshallah.”\nhttp://www.worldbulletin.net/america-canada/204824/canada-plans-no-economic-retaliation-on-saudis\n--------\nAnti-Islam group postpones rally at Nathan Phillips Square\nAug. 9, 2018\nAn anti-Islam organization has postponed a rally scheduled for Saturday after drawing widespread condemnation from organizations and Toronto city councillors.\nThe World Coalition Against Islam, a Calgary-based far-right group, planned to gather at Nathan Phillips Square for what would have been its first rally in Ontario. It was set to mark the one-year anniversary of the Unite the Right rally in Charlottesville, Va., where Heather Heyer, 32, was killed when a far-right protester rammed his car into the crowd.\nWCAI posted a public statement on Facebook Thursday afternoon calling people “snowflakes” for reacting negatively to the rally that was to fall the day before the anniversary of the fatal Charlottesville car attack, which the group says was a total coincidence.\n“Due to people being snowflakes about the Aug. 11 date coincidentally being on the same day as Charlottesville last year and groups pulling out and there being a Bollywood festival scheduled at Nathan Phillips Square, I have decided to postpone the rally,” the statement read.\nWCAI had an active presence in Calgary, where they were denied permits by city officials who cited the group’s “hateful” messages.\nCouncillor Kristyn Wong-Tam, whose ward includes Nathan Phillips Square, called the Aug. 11 rally “a disappointing reminder that, as far as we have come as a society, many still cling to violent prejudice.”\nIn her statement, Wong-Tam condemned the group, who she says “reject the very foundational values” of the country, but added that she stands by their “right to march and protest.”\nMayor John Tory also spoke out Thursday. “Hatred and acts of violence against any identifiable group have no place in this city,” he said.\n“City staff assure me that no permit has or will be issued for any rally in Nathan Phillips Square, regardless of when the hate rally is being organized for,” he said in the statement.\nToronto city council spokesperson Paula Chung said the group did not apply for a permit to rally at the square, but didn’t need to. Protesters and counterprotesters are both allowed to gather at the square, she said.\nSeveral groups also condemned the public appearance of WCAI. The Steelworkers’ Toronto Area Council and the United Jewish People’s Order were organizing a counterprotest in the same area.\nThe National Council of Canadian Muslims, the Urban Alliance on Race Relations and other community organizations had planned to hold a news conference Friday at city hall to denounce the rally. The news conference has been cancelled in light of the postponement.\nIn a combined statement Thursday afternoon, the Muslim council and race relations alliance “welcomed” the news that the rally had been rescheduled, but noted that postponing the rally means it could still happen at a later date.\n“While we welcome the postponement of the planned rally, we note that the organizers have indicated the possibility of rescheduling it for a future date. As such, we will continue to monitor and alert our communities to any such event,” said Ihsaan Gardee, executive director of the National Council of Canadian Muslims.\n“The planning of this event, which was due to fall on the first anniversary of the racist, neo-Nazi gathering in Charlottesville, U.S., gave us all a disturbing insight into what can happen when ignorance, racism and Islamophobia join together with the intention of dividing our communities. It is critical that we do not become complacent in our rejection of racism and other forms of hate,” said Nigel Barriffe, president of the Urban Alliance on Race Relations.\nThe Muslim council says it has recorded a “significant spike” in the number of anti-Muslim hate crimes happening across the country — especially in the GTA.\nFull report at:\nhttps://www.thestar.com/news/gta/2018/08/09/anti-islam-group-postpones-rally-at-nathan-phillips-square.html\n--------\nElliott Broidy case: US judge calls for law to prosecute countries such as Qatar\n9 August 2018\nA US federal judge has called on Congress to legislate a law that allows prosecution of countries that carry out cybercrime targeting US citizens, saying that the absence of such laws makes it impossible to consider the case filed by Elliott Broidy against Qatar.\nThe judge refused formally to consider the case because of the lack of jurisdiction of the Court to hear cases in which one of the parties is a sovereign state enjoying immunity, according to Wall Street Journal.\nBut the judge stressed in his decision a paragraph indicating that there is a pressing need to legislate a law that allows the prosecution of states in view of the repetition of these incidents in recent years.\nHowever, the judge said they would continue to look into such violations committed by the individuals listed in the case.\nFull report at:\nhttps://english.alarabiya.net/en/News/world/2018/08/09/Elliott-Broidy-case-US-judge-calls-for-law-to-prosecute-countries-such-as-Qatar.html\n--------\nBrooklyn imam dismayed by family’s tragedy at New Mexico compound\nAugust 10, 2018\nTAOS, N.M.: A prominent New York City Muslim cleric said on Thursday that he was baffled by events leading to his grandson’s presumed death and the arrest of his son and four other adult relatives on charges of abusing children at a compound in New Mexico.\nSiraj WahHajj, a Brooklyn-based imam, spoke to reporters at his mosque, Masjid Taqwa, a day after his son, two daughters, a daughter-in-law and a son-in-law were charged with 11 felony counts of child abuse in New Mexico.\nThe son, Siraj Ibn WahHajj, 39, also was charged with custodial interference in the alleged abduction of his 3-year-old son, Abdul-Ghani WahHajj, last December from the Atlanta home of the child’s mother.\nThe search for the missing boy and his father ultimately led investigators to the ramshackle compound on the outskirts of Amalia, New Mexico, north of Taos near the Colorado border.\nEleven children ranging from 1 to 15 years of age were found ragged and starving at the compound last Friday after sheriff’s deputies raided it. They were placed in protective custody.\nThe imam, who was the first Muslim to offer a prayer before the US House of Representatives, said he is the biological grandfather of nine of the children in the case, including Abdul. Remains of a young boy believed to be those of Abdul were found at the compound on Monday.\nThe elder WahHajj said, without elaborating, that some of the children have said they saw Abdul alive as recently as three weeks ago, adding, “One of them said, ‘Yeah, we buried him over there.’“\nHis son, said by authorities to have been heavily armed when arrested, was taken into custody with his brother-in-law, Lucas Morton. His wife Jany Leveille and two sisters, Subhannah and Hujrah WahHajj, were detained and later arrested.\nIn court petitions seeking to hold them without bond, prosecutors accused them of training the children to use firearms to carry out school shootings, but no related charges have been filed.\nThe elder Siraj WahHajj said he has been cooperating with authorities in their investigation and that he had not had direct communication with his son since a search for him was launched after Abdul’s disappearance.\nHe said he did not know what his son and daughters were doing in New Mexico or what prompted them to go into seclusion, but he was anxious to get to the bottom of a situation he described as “bizarre” and “weird.”\n“As far as my son and my daughters are concerned, I want to make sure they get good legal representation. We want to find out what happened,” he said. “Even if it’s against them. We stand in judgment. God stands in judgment against them, and we stand on the side of truth.”\nThe cleric recounted having a brief exchange with his daughter Subhannah at some point through a go-between on Facebook. Subhannah later reached out to someone in Atlanta saying, “’I need some food. We are starving.”\nThe imam said he instructed that intermediary to “find out where we should send the food.” He said once his daughter provided the location, “We gave it to the police. That’s why the police came in.”\nHis account dovetailed with a chronology given earlier in the week by Taos County Sheriff Jerry Hogrefe, who said he obtained a search warrant for the compound after police in Georgia got a plea about starvation from someone in the compound and shared it with his investigators.\nFull report at:\nhttp://www.arabnews.com/node/1353901/world\n--------\nPakistan\nSindh govt notifies Hindu marriage law\nAugust 10, 2018\nKARACHI: The Sindh government notified on Thursday the Sindh Hindu Marriage (Amendment) Bill 2018. The bill, moved by Pakistan Muslim League-Functional leader Nand Kumar was passed by the assembly in March, earlier this year, to give couples the right of ‘separation’ and allowing Hindu widows to remarry.\nThe bill not only accords the right of separation to both the husband and wife, but also ensures the financial security of the wife and children.\n“Either party to Hindu marriage, whether solemnised before or after the commencement of this Act, may present a petition to the court praying for decree of judicial separation,” the law states.\nThe law also places a general ban of underage marriages among members of the Hindu community. “The Hindu community had been protesting forced conversions and marriages of underage girls. This law has banned the marriage of minors from the Hindu community,” said Nand Kumar, adding that he had also moved a bill against the forced conversions of members of religious minorities, but the bill was gathering dust in the Sindh Assembly secretariat.\nReferring to past practices, Kumar said Hindu women were considered lesser mortals, who were not even accorded the right to divorce before the enactment of this law. “The amendment to this law is aimed at getting rid of old and outdated customs,” he remarked.\nPakistan Peoples Party chairperson Bilawal Bhutto and other party leaders also felicitated the last provincial assembly’s lawmakers on the passage of the act, which was ratified by the Governor last week.\nBefore the passage of this law, there was no legal cover for Hindu marriages for the past seven decades.\nhttps://tribune.com.pk/story/1777191/1-sindh-govt-notifies-hindu-marriage-law/\n--------\nPakistan stands with Saudia Arabia in diplomatic feud with Canada\nAUGUST 10, 2018\nDr Muhammad Faisal, Pakistan Foreign Office spokesperson said, on Thursday, that Pakistan stands with Saudia Arabia in its diplomatic row with Canada.\nHe went on to say that “Pakistan always supports the sovereignty of states and the principle of non-interference in the internal affairs of other states. Both these aspects are enshrined in UN Charter and are among the basic tenets of international law, and the foundation of peaceful and friendly inter-state relations.”\nSaudia Arabia and Canada have been embroiled in a diplomatic row ever since Canadian Foreign Minister Chrystia Freeland posted a demand for the Saudi government to release women-rights activist Samar Badawi on social media.\nFull report at:\nhttps://dailytimes.com.pk/281150/pakistan-stands-with-saudia-arabia-in-diplomatic-feud-with-canada/\n--------\nMaulana Fazlur Rehman’s address causes outrage in Pakistan\nAugust 9, 2018\nJamiat Ulema-e Islam (F) chief Maulana Fazlur Rehman on Wednesday stated that they would not accept ‘fake prime minister [Imran Khan]’ at any cost while demanding resignations from officials of Election Commission of Pakistan (ECP) over their failure to hold transparent elections. He was addressing protest rally outside ECP headquarters.\nHowever, a portion of his speech raised concerns among the people of Pakistan as they perceived him spewing hatred against the Armed forces as well as the country itself. In the controversial part of his address, the JUI(F) chief can be seen calling for the nation’s 71st Independence day celebration while also threatening the Pakistan Army.\nRead more: Opposition parties stage protest in Islamabad; defeated Maulana Fazlur Rehman bashes…\nBlaming it for bringing the PTI to power, Fazlu Rehman stated that such actions would force them to be viewed as “Western agents” by him and his supporters. Such language is mostly used by terror groups such as the Tehreek-e-Taliban Pakistan who spring from the same school of thought i.e. Deoband as the Jamiat-Ulema-e-Islam.\nLeaders of opposition parties including Ahsan Iqbal, Pervez Rasheed, Zahid Hamid, Afrasyab Khattak, Zahid Khan, Khawaja Asif, Mushahidullah Khan, Rashid Mehmood Soomro, Raja Pervez Ashraf, Sherry Rehman, Khursheed Shah, Raja Zafarul Haq, Senator Chaudhry Tanveer, Nehal Hashmi, Mushahid Hussain, Abdul Ghafoor Hyderi, Usman Kakar, Zahid Khan, Mehmood Achakzai and Bushra Gohar participated in the protest.\nFull report at:\nhttps://www.globalvillagespace.com/maulana-fazlur-rehmans-address-causes-outrage-in-pakistan/\n--------\n‘Afghan-trained militant’ allegedly behind Diamer school attacks: police\nAug 10, 2018\nISLAMABAD: Gilgit-Baltistan (GB) Police on Thursday said that a man suspected of being involved in the Diamer school attacks and killed during a search operation earlier this week, was a “high-profile Afghan-trained militant”.\nDiamer Superintendent Police (SP) Rai Ajmal in a report submitted to the Diamer deputy inspector general (DIG) of police said that the suspect, Commander Shafiur Rehman, was killed in an exchange of fire with the police.\n“On noticing the police raiding team, the accused opened indiscriminate fire that resulted in the martyrdom of Constable Arif Hussain, while Head Constable Karamat Ali sustained bullet injuries,” the report said. “In response to the incident, police cordoned off the entire area and started a search operation,” it added.\nThe SP’s report further adds: “Three suspects identified as Fidaur Rehman, Faizur Rehman and Saeedur Rehman allegedly involved in the attack were arrested whereas, commander Shafi was killed during an exchange of fire.”\n“A criminal case was registered against Shafiur Rehman, Saeedur Rehman, Fidaur Rehman, Ziaur Rehman, Basil, Nasirullah, Sher Khan and Muhammad Nasir,” the report said, adding that efforts for the arrests of the remaining five suspects are currently underway.\nThe report also said that “unknown terrorists” had opened fire at the Darel police station at 2am on Saturday night, to which “police effectively retaliated”.\nA case was registered against this incident, as well as against the blocking of a road and firing at passersby by miscreants in Darel’s Phuguch area.\nFull report at:\nhttps://www.pakistantoday.com.pk/2018/08/09/high-profile-afghan-trained-suspect-allegedly-behind-diamer-school-attacks-police-report/\n--------\nIndia\nMadrasas in MP told to hold Tiranga rally on Independence Day, send videos as proof\nAug 09, 2018\nThe BJP government in Madhya Pradesh has asked its madrasas to hold a Tiranga rally on August 15 as part of the Independence Day celebrations, and send videos as “proof” to the Madhya Pradesh Madarsa Board.\nThe circular issued by the MP government’s general administration department asks the schools, on the other hand, to take out “morning processions” and does not make it mandatory on them to send photos or videos.\nThe circular, dated August 7, has titled the ‘Tiranga rally’ for madrasas under a theme, Paigham-e-Mohabbat (message of love), with a competition of sorts whereby the best rally, decided by the board based on the videos received, would be rewarded.\nA similar Independence Day order issued by the state government for the madrasas last year had drawn flak from members of the Muslim community who had raised concerns over the directive, which appeared to suggest that the government “doubted the community’s patriotism”.\n“Every madrasa has to hoist the national flag on Independence Day and take out a rally to spread the message of love and brotherhood among people of different communities. This year, we have asked the madrasas to invite people from all communities to take part in the rally,” board chairman Syed Imad Uddin said.\nHe said the order to shoot videos “has nothing to do with any evidence to prove our patriotism”. “It is (being asked) so that the best rally could be judged.”\n“On the (board’s) Foundation Day (September 22), the best of the rallies will be felicitated by chief minister Shivraj Singh Chouhan,” he added.\nActivist Upasana Behar, who works in the field of education, said such “discriminatory” orders — one for the schools and another for the madrasas — “will only drive a wedge between children of the two communities”.\n“It is bound to raise suspicion in the minds of students from the minority community if their patriotism is under doubt. Independence Day and Republic Day have always been celebrated in madrasas and schools but now the government wants a proof. It’s really unfortunate,” she said.\nhttps://www.hindustantimes.com/india-news/madrasas-in-mp-told-to-hold-tiranga-rally-on-independence-day-send-videos-as-proof/story-FiGVwQyinpReYrpdzyy74I.html\n--------\nTemple in Delhi’s CR Park denies Muslim man’s plea for last rites of Hindu wife\nAug 10, 2018\nA Muslim husband wants to perform a ritual for his dead Hindu wife and a temple society in a New Delhi Bengali-dominated neighbourhood has not allowed because they believe the woman was no longer a Hindu after her marriage even as she had not given up her faith.\nImtiazur Rahman, who is based in Kolkata, lost her wife Nivedita Ghatak in the capital after she suffered from multiple organ failure last week -- 20 years after the couple married in accordance with the Special Marriages Act that allows inter-faith wedding of couples irrespective of their individual faith.\nGhatak was cremated as per Hindu rites at Delhi’s Nigam Bodh Ghat but the family could not perform shradh -- a set of Hindu rituals performed for the deceased.\nRahman, who works as assistant commissioner, commercial taxes in the West Bengal government, said he had booked an August 12 slot at Kali Mandir Society in the Bengali-dominated Chittaranjan Park after paying Rs 1,300 for the ceremony on Aug 6. But he was later told by the temple society that his booking has been cancelled “for obvious reasons”.\nAshitava Bhowmik, the president of the temple society, told IANS that Rahman’s request could not be taken up for “more than one reason”.\nHe alleged that Rahman “concealed his identity” and made the booking in his daughter Ihini Ambreen’s name “which doesn’t sound like Arabic or Muslim”.\nBhowmik said “we got to know about his religious identity when a priest got suspicious and asked him about gotra” -- the lineage which forms an important factor in determining Hindu ancestry.\n“Obviously, he had no answers. Muslims don’t follow gotra system. His wife can no longer be considered a Hindu after marrying the Muslim because a woman adopts the surname and belief system of her in-laws and becomes a part of that society,” Bhowmik told IANS.\nUnapologetically, he said, “It was done in keeping with and respecting the Hindu traditions and rites.”\nAsked since it was the last wish of the woman, who followed the Hindu belief system, Bhowmik said “who knows the man has some ulterior motive and could bring in 50-100 of his relatives inside the temple and start praying Namaz” there.\n“What will we do in that case? Should we allow that?” he asked.\nBeing probed further that it was only the temple society’s hypothetical fear, Bhowmik said if Rahman was too keen on performing the ritual of his wife he should do that at his home.\n“Why insist on a temple in Delhi? Why doesn’t he do it at his home in Kolkata?”\nBut Rahman countered the allegations saying faith was a personal matter for him and it had never hurt his relationship with his “practising Hindu wife” as she would perform any ritual the way she wanted and he would do it his way.\nFull report at:\nhttps://www.hindustantimes.com/india-news/muslim-man-seeks-hindu-rites-for-dead-wife-temple-head-says-not-eligible/story-NySgsw8KSK8BSwzghW7A4L.html\n--------\nGovt yields: Triple talaq FIR only by victim, blood relatives\nby Liz Mathew\nAugust 10, 2018\nConceding one of the main demands of Opposition parties to ringfence the proposed law on instant triple talaq against misuse, the Union Cabinet Thursday approved inclusion of provisions that the complaint in such a case can only be filed by the victim (wife) or blood relations, and that a magistrate can grant bail with terms and conditions.\nUnder the amendments cleared, a magistrate will have powers to grant bail. The woman can approach the magistrate to seek subsistence allowance for herself and her minor children, and can also seek custody of her minor children from the magistrate who will take a final call on the matter.\nThe Muslim Women (Protection of Rights on Marriage) Bill, 2017, introduced after the landmark 3-2 verdict of the Supreme Court which set aside the centuries-old practice of talaq-e-biddat or instant triple talaq in which Muslim men divorce their wives by uttering talaq three times in quick succession, has cleared Lok Sabha and is pending in Rajya Sabha where the government lacks numbers.\nThe government will bring the amendments to Rajya Sabha on Friday, the last day of the monsoon session.\nWhen the winter session of Parliament drew to a close in January this year, the fate of the Bill hung in the balance. The matter of ringfencing penal provisions in the Bill emerged as the central issue for some give-and-take to break the stalemate between the ruling BJP and the Opposition over the Bill.\nAfter the session concluded, Ghulam Nabi Azad, Leader of Opposition in Rajya Sabha, offered to agree to the penal provisions in the Bill, provided it was insulated from outside interference and had a mechanism for subsistence allowance.\nAnnouncing the changes approved Thursday by the Cabinet, Union Law and Justice Minister Ravi Shankar Prasad said the government did not want “anyone to misuse the law while ensuring that justice is done”.\n“The Union Cabinet has approved amendments in the law relating to triple talaq. We have proposed three changes. FIR will become cognizable only if the complaint is filed by the victim, wife, blood relations, or relations by marriage. If any outside agency or neighbour is initiating this process, it will not be registered,” Prasad told reporters.\n“It has been made compoundable, that is, if the wife and husband desire to settle differences, then the magistrate can compound the offence on appropriate terms and conditions. Magistrate can grant bail after hearing the wife,” he said.\nThe minister rejected arguments that the husband cannot be sent to jail since he will not be able to provide subsistence to the divorced wife and children if he is in prison. “If a husband is convicted in a dowry case or domestic violence case also, he will go to jail. So why are such issues raised only in triple talaq? Congress should clarify if it is sticking to vote-bank politics,” he said.\nMaintaining that the government did not make the changes under pressure from anyone, he said the decisions were taken in the interest of the people.\nTo Sonia Gandhi, Prasad said: “You are not just the Congress leader, you are a national leader too. You keep talking about the legacy of your family… Would you stand for justice, honour and respect for women? Or would you continue to oppose the Bill?”. He took a swipe at BSP chief Mayawati and TMC chief Mamata Banerjee, saying votebank politics is more important for them.\nFull report at:\nhttps://indianexpress.com/article/india/triple-talaq-law-misuse-union-cabinet-muslim-men-women-divorce-5299954/\n--------\n2013 Bodh Gaya bomb blast: NIA arrests one more terror suspect in Bengaluru\n09th August 2018\nBENGALURU: The NIA has arrested another member of the Jamaat-ul-Mujahideen Bangladesh in the city, a day after the nabbing of the outfit's top leader Mohammed Jahidul Islam, wanted in several terror cases, officials said today.\n29-year old Adil Alias Assadullah, a resident of a village in West Bengal's Murshidabad district, was arrested near the Cantonment Railway station on August 7 in connection with the bomb blast at Kalchakra Maidan in Bodh Gaya on January 19, 2013, a statement from the National Investigation Agency said.\nHe was said to be the close associate of Jahidul Islam, who was arrested by an NIA team from nearby Ramanagara.\nAssadullah was produced before an NIA special court which granted transit remand for being taken to Patna.\nThe NIA said its sleuths recovered three mobile phones, bank paying slips, handwritten notes in Bangla language regarding chemical formulas for preparation of improvised explosive devices from him.\nJahidul Islam was the top leader of the JMB in India and wanted in the Burdwan blast case and in many other cases in Bangladesh also.\nHe was the mastermind in the Bodh Gaya case, the agency had said.\nOn October 2, 2014, a blast had occurred in a house at Khagragarh in West Bengal's Burdwan district in which a man identified as Sakil Gazi died on the spot, while another named Sovan Mandal died in hospital.\nBoth of them were suspected of having terror links.\nThe NIA had alleged that the JMB members wanted to establish Sharia rule by overthrowing the democratically-elected government in Bangladesh.\nA low-intensity blast was reported at a kitchen set up at a ground in the temple town of Bodh Gaya on January 19, causing panic among devotees gathered to hear the Dalai Lama's discourse.\nFull report at:\nhttp://www.newindianexpress.com/nation/2018/aug/09/2013-bodh-gaya-bomb-blast-nia-arrests-one-more-terror-suspect-in-bengaluru-1855557.html\n--------\nAhead of Independence Day, explosives seized in Delhi, terror suspects nabbed in Bengaluru\nAug 10, 2018\nNEW DELHI: Ahead of the Independence Day celebrations, the authorities have seized a huge cache of arms and ammunition from two places in national capital while a suspected Bangladeshi terrorist was nabbed in Bengaluru.\nAccording to reports, a huge cache of arms and ammunition, including carbines and cartridges, were recovered from two suspected arms peddlers in two separate operations by the Delhi Police late on Thursday.\nThe two accused have been identified as Mohammad Azimuddin Sheikh lias Azim, a resident of Malda in West Bengal and Soyyam alias Aas Mohammad, a resident of Shamli in Uttar Pradesh.\nSharing details of the police action with media, Sanjeev Kumar Yadav, Deputy Commissioner of Police (Special Cell) said, ''Soyyam was arrested from Singhola village on GT Karnal road on Thursday while Azim was arrested earlier this week from northwest Delhi.''\nThe accused were involved in supplying arms to Delhi-based criminals for the last four-five years, the official said.\nWith just few days left to the Independence Day, the Special Cell of Delhi Police has been keeping a tight vigil on the movement of arms suppliers and those with suspected terror links. The recovery of the arms and ammunition leading to the arrest of the two suspects is part of our vigit, the officer said.\n''The Special Cell has launched a drive against supply of illegal firearms in Delhi from other parts of the country. Concerted efforts have led to busting of several gun selling rackets and seizure of huge cache of sophisticated/semi-automatic weapons,'' the officer said.\nAccording to the DCP, the teams of the Special Cell have successfully busted two interstate gun-selling rackets with the recovery of large cache of arms and ammunition from the accused.\nAzim was arrested by one of the teams of the Special Cell on August 6 following a tip-off, he said.\nAzim along with Akil had come to deliver the huge consignment of illegal firearms to Hazi Kayum in Delhi. Following specific inputs, a team laid a trap at the vantage points near Tara Chowk, Dheerpur in northwest Delhi here, the officer said.\nAround 11.55 am, Azim was found waiting for Kayum, carrying two trolley bags. He was subsequently overpowered and nabbed. From the trolley bags two automatic sophisticated carbines, 38 pistols and 50 live cartridges concealed in clothes and newspapers were recovered, the ACP said.\nAnother team of the Special Cell nabbed Soyyam, a key member of arms supplier syndicate of Kairana (UP) from near CNG station in village Singhola near GT Karnal road, added the DCP.\nTwelve sophisticated .32 bore pistols and 19 magazines were recovered from his bag, the DCP said.\nDuring interrogation, it came to light that after the police crackdown in Bihar's Munger, the arms manufacturers have shifted their base to West Bengal and weapons are being manufactured at different places.\nThe weapons manufactured in West Bengal are being supplied in Delhi and its neighbouring areas.\nThe DCP said raids are being conducted to nab more associates of the arrested duo.\nIn a related incident, the Army too seized a large quantity of arms and explosive materials, including 7 firearms, 14 grenades and 401 rounds, during a search operation in Jammu and Kashmir's Poonch district on Thursday.\nArmy troops discovered the weapons during a search operation in the Chapriyan-KP Nala area of Mandi tehsil, a defence spokesperson said.\nThe recoveries include four 9mm pistols with seven magazines and 31 rounds, four carrying bags, one AK-56 rifle (with sling) along with three loaded magazines, one 7.62mm rifle of foreign origin, one revolver, 14 hand grenades and one AK-47 Bayonet, he added.\nMeanwhile, the National Investigating Agency (NIA) has arrested a suspected member of the Jamaat-ul-Mujahideen Bangladesh in Bengaluru.\nThe arrest was made a day after the NIA nabbed the outfit's top leader Mohammed Jahidul Islam, wanted in several terror cases.\n29-year old Adil Alias Assadullah, a resident of a village in West Bengal's Murshidabad district, was arrested near the Cantonment Railway station on August 7 in connection with the bomb blast at Kalchakra Maidan in Bodh Gaya on January 19, the NIA said in a statement.\nHe is believed to be the close associate of Jahidul Islam, who was arrested by an NIA team from nearby Ramanagara.\nFull report at:\nhttp://zeenews.india.com/india/ahead-of-independence-day-explosives-seized-in-delhi-terror-suspects-nabbed-in-bengaluru-2131919.html\n--------\nModi Govt Waters Down Triple Talaq Bill With Bail Clause to Clear Rajya Sabha Hurdle\nAugust 9, 2018\nNew Delhi: The Muslim Women Protection of Rights Bill 2018, colloquially known as the Triple Talaq Bill, will now have a clause that would ensure Muslim husbands have a right to approach the court seeking bail after being arrested on charges of instantaneous talaq.\nDuring the last Budget Session of the Parliament, when the bill was tabled in Lok Sabha, there was a strong demand to refer the bill to a parliamentary select committee. However, with a sizeable strength in the lower house, the government had managed to pass the bill.\nThe bill got stalled in the Rajya Sabha amid protests by the opposition. The provision of bail was one of the biggest sticking points. In the tweaked version passed by the Union Cabinet, the offence would stay non-bailable but a judge can decide whether to grant bail after hearing out the wife.\nGiving instant triple talaq would still continue to be illegal and void and will attract a jail term of three years for the husband. But the case can be dropped if both sides agree, the new version of the bill says.\nThe proposed law would only be applicable on instant triple talaq or 'talaq-e-biddat' and it would give power to the victim to approach a magistrate seeking \"subsistence allowance\" for herself and minor children.\nHowever, the All India Muslim Personal Law Board is still not impressed with the changes.\nBoard member and legal counsel, Zafaryab Jilani, told News18 that there were several other amendments that were demanded to be brought in and this amendment did not \"portray the true picture.\"\n\"Let the bill be introduced in the Rajya Sabha. The bill is void in totality and hence objections will remain but there were other specific objections made too that have remained unanswered in the latest cabinet meeting,\" said Jilani.\nZakia Soman, convener of Bhartiya Muslim Mahila Andolan, who was one of the key petitioners in the case, told News18 that though this amendment was a welcome change, but \"there still exists others that is needed.\"\n\"Yes the bail amendment is welcome but the provision which makes FIR registered by anyone acceptable needs to be amended and it has to be only at the behest of wife. There also needs to be a provision which states that a wife will have a right over her matrimonial residence even though the husband is penalised,\" said Soman.\nUnion Law Minister Ravi Shankar Prasad, who had tabled the Muslim Women (Protection of Rights on Marriage) Bill, called it a “historic day.”\nSaying that the bill should not be seen through the prism of vote-bank, but from the humanitarian side, Prasad said the bill was “not about religion but about justice and respect for women.” He said that the bill was essential for gender equality and dignity.\nAccording to the bill, a woman can also seek the custody of her minor children from the magistrate who will take a final call on the issue.\nThe bill was passed in Lok Sabha after the House rejected a string of amendments moved by various opposition members. MPs from the RJD, AIMIM, BJD, AIADMK and All India Muslim League had opposed the bill, calling it arbitrary in nature and a faulty proposal.\nOwaisi was the strongest critic of the bill and had said that \"dowry deaths and other crimes against women did not stop even when specific laws were made against these practices.\"\nFull report at:\nhttps://www.news18.com/news/india/cabinet-approves-provision-of-bail-in-triple-talaq-bill-1839311.html\n--------\nIntel input says Masood Azhar’s nephew in India, agencies on high alert\nAugust 10, 2018\nAhead of Independence Day celebrations, security agencies are on their toes after an intelligence input was received that the nephew of Jaish-e-Mohammed chief Masood Azhar and his younger brother Abdul Rauf’s former bodyguard have infiltrated into India and are suspected to have set up terror modules in Delhi and Srinagar.\nAccording to the input, accessed by The Indian Express, Mohammed Umer, son of Azhar’s elder brother Ibrahim, infiltrated into Jammu and Kashmir in the last week of May. In the same month, Rauf’s former bodyguard Mohammed Ismail is also learnt to have entered Kashmir. Rauf is a key accused in the IC 814 hijacking which led to Azhar’s release from captivity in India.\nWorryingly, Ismail was learnt to have visited Delhi immediately after infiltrating into Kashmir and is now back into the Valley after, perhaps, setting up a module. “Mohammed Ismail has also entered J&K in May 2018. However, he moved towards Delhi, where he was asked to set up a module for a spectacular operation,” the input said.\nConfirming his current location in J&K, it said, “As per latest input, senior formations of JeM based in Pakistan have now located Mohammed Ismail in the general area between Pulwama and Srinagar.”\nMeanwhile, Azhar’s nephew Mohammed Umer is learnt to be working on recruiting and training youths in J&K, which has recently seen a surge in young men joining militant ranks. According to the input, Umer has been “tasked to oversee operational preparation and training of newly recruited Kashmiri youth inside the Valley by staying for a period of six months”.\nSecurity agencies, in fact, have already had an encounter with Umer in which he escaped and later took shelter near Pantha Chowk in Srinagar, according to the input. Last month, a group associated with Umer had even snatched weapons from policemen in Kashmir, the input said.\nIntelligence agencies have learnt that Mohammed Ismail is currently with Umer to execute the outfit’s plans in Kashmir.\n“The presence of two extremely important and senior JeM Commanders in the Valley closer to the Independence Day Celebrations and the ongoing Amarnath Yatra has significant security implications,” the input said.\nFollowing the input, security forces across the country, particularly in J&K and Delhi, have been asked to remain extra alert and watchful. All military and central armed police camps in J&K have been asked to maintain tight security around their camps and to be extremely vigilant. Suggestions have also been made to increase the number of pickets and have more road opening exercises in Kashmir, Home Ministry sources said.\nFull report at:\nhttps://indianexpress.com/article/india/intel-input-says-jaish-e-mohammed-chief-masood-azhars-nephew-in-india-agencies-on-high-alert-5299880/\n--------\nEurope\nOne third of Britons view Johnson’s burqa comments as racist: Poll\nAug 9, 2018\nA new poll shows that more than a third of people in Britain view comments by former foreign minister Boris Johnson on burqa, a full-body dress for Muslim women, as racist.\nAccording to the results of the survey by Sky News, six out of ten people said it was \"not\" racist to compare Muslim women wearing the Islamic veils to “bank robbers” and “letter boxes ” as Johnson had designated, while just 33 percent of the respondents thought it was racist.\nThe poll also suggested that 26 percent of Britons were against a ban on burqas, while around 60 percent supported such a ban by the government.\nThe poll was conducted after Johnson made the comparisons in an article for The Daily Telegraph newspaper on Monday.\nIt revealed that Britons remain split as to whether Johnson should apologize for his remarks - 45 percent think he should do so, while the majority, some 48 percent, think he should not.\nPeople from the capital city London were the heaviest critics of Johnson, a man they twice elected as London mayor, with over 50 percent saying he should apologize for the Islamophobic remarks.\nA series of prominent Conservatives have called on Johnson to apologize, including the Prime Minister Theresa May. A senior Tory Muslim peer, Lord Sheikh, said Johnson should lose the Conservative whip if he doesn't make a public show of contrition. This means that his ties with the Party would be seriously downgraded.\n“Take the whip from him. Why not? He's not a superhuman being; he's a member of the party. The party chairman, the prime minister has the right to take the whip,” said Lord Sheikh.\nThe Muslim Council of Britain (MCB), the UK's largest Muslim umbrella organization, has also released a public statement condemning Johnson’s article.\n“Boris Johnson’s comments are particularly regrettable in this current climate, where Islamophobia and anti-Muslim hatred is becoming worryingly pervasive with disappointingly little action from this current government. Muslim women bear the brunt of hate on the streets… We need responsibility and action from our politicians, not pandering to the far-right,” it read.\nThe MCB has been investigating incidents of Islamophobia within the Tory party and has recently demanded an internal enquiry to be launched to root out Conservative party Islamophobia.\nSo far Boris Johnson has refused to apologize for the comments or admit any wrongdoing despite Prime Minister May’s intervention.\nhttps://www.presstv.com/Detail/2018/08/09/570689/Britain-burqa-Johnson-comments-poll\n--------\nSwitzerland recommends firms continue Iran activity\nAug 9, 2018\nThe Swiss government has promised to defend the economic interests of its companies that are active in Iran and would be targeted by renewed US sanctions, recommending that they go on with their business in the Islamic Republic.\n“[The government] recommends that companies pursue their commercial relations with Iran and inform themselves about the situation,” said Fabian Maienfisch of the State Secretariat for Economic Affairs (SECO) on Thursday.\nThe comments came just a few days after the United States re-imposed a series of sanctions on Iran that had been lifted as part of a 2015 landmark nuclear agreement between the country and world powers. The decision came after US President Donald Trump’s unilateral withdrawal from the pact, which is known as the JCPOA, in May, despite statements by other parties to the deal, including the Europeans, that they would remain committed to the agreement and would do their best to protect their businesses from renewed US sanctions.\nMaienfisch said the Swiss government regretted the “deteriorating” situation regarding the sanctions imposed by Washington on Iran but also insisted that it could not force its businesses to resist US pressure.\n“Switzerland regrets that the sanctions situation in relation to Iran is again deteriorating,” he said.\nSome European companies have announced that they would halt their activities in Iran to avoid US punishments. Some others, however, have insisted they would remain in the country.\nFull report at:\nhttps://www.presstv.com/Detail/2018/08/09/570708/Switzerland-companies-Iran-US-sanctions\n--------\nRestoring Iran bans entails 'destructive' repercussions, Russia warns US\nAug 9, 2018\nRussia has once again hit out at the US for re-imposing its unilateral sanctions against Iran after scrapping the 2015 multilateral nuclear deal, describing it as a \"destructive step\" that could destabilize the already-volatile Middle East region.\nAddressing a news briefing on Thursday, Russian Foreign Ministry spokeswoman, Maria Zakhariva, said \"Washington’s course at bringing down the Joint Comprehensive Plan of Action (JCPOA) on the Iranian nuclear program and restoring full-scale pressure through sanctions is absolutely destructive,\" referring to the Iran deal by its official name.\nAfter abandoning the JCPOA in May, the administration of US President Donald Trump on Tuesday reinstated a series of unilateral sanctions targeting Iran's purchase of US dollars, trade in gold and other precious metals as well as its automotive sector. A second batch of US sanctions will be re-imposed on Iran in November with the aim of undermining its oil exports and shipping sectors.\nThe US president has also threatened punitive measures against the firms that refuse to stop their business links with Iran when the American sanctions return.\nWashington's move drew criticisms from Russia, China and the European parties to the Iran deal -- France, Britain and Germany.\nThe EU was quick to issue a statement in defense of the landmark accord, vowing to fight the American sanctions and protect the firms working with Iran.\nThe 28-nation bloc has activated a \"blocking statute\" aimed to mitigate the impact of American restrictive measures on European firms legally active in the Iranian market. It has also warned that the firms that choose to abide by Washington's bans may be slapped with European sanctions.\nZakharova further said the Trump administration's measures would entail \"long-term deplorable consequences for global nonproliferation [of the weapons of mass destruction] and will impart a destabilizing impulse to the situation in the Middle East.\"\nOn Tuesday -- when the US reintroduced its bans on Iran -- the Russian Foreign Ministry released a statement and criticized the US for violating UN Security Council Resolution 2231 that endorsed the Iran deal.\n“We denounce any unilateral sanctions in circumvention of the UN Security Council decisions, all the more so if they have exterritorial applications and affect the interests of third countries, as is the case with the current US restrictions against Iran,\" the statement said.\nRussia has vowed to reinforce its relations with Iran in all sectors now that the US has left the accord and chosen to build up economic pressure on the Islamic Republic.\nVladimir Yermakov, Director General of the Department for Nonproliferation and Arms Control at Russia’s Foreign Ministry, had said in early May that with the US exit “it might even be easier for us on the economic front, because we won’t have any limits on economic cooperation with Iran.\"\nSwitzerland criticizes US bans on Iran\nMeanwhile, Switzerland on Thursday expressed regret over the \"deteriorating situation\" in the aftermath of Washington's renewal of economic pressure against Tehran.\nIt also recommended Swiss firms to continue their business ties with the Islamic Republic despite the return of US bans.\n\"US decisions on sanctions do not affect the legal situation in Switzerland with regard to Iran,\" said Fabian Maienfisch of the State Secretariat for Economic Affairs (SECO).\nFull report at:\nhttps://www.presstv.com/Detail/2018/08/09/570694/Russia-Iran-US-Sanctions\n--------\nSouth Asia\nMore than 70 militants including foreigners killed in Paktia clashes\nAug 09 2018\nMore than seventy militants including foreign insurgents hailing from Pakistan were killed during the latest clashes in southeastern Paktia province of Afghanistan.\nThe 203rd Thunder Corps of the Afghan Military in the Southeast said the militants were killed or wounded during separate clashes in Aryoub Zazai and Ahmad Khel districts.\nAccording to a statement released by the Thunder Corps, a large number of militants launched coordinated attacks on Sikandar Khel, Tarkan, Khair Mina, and Hasti areas of Aryoub Zazai and Ahmad Khel districts.\nThe statement further added that the militants were equipped with heavy weapons including mortars and Dshk heavy machine guns but the Afghan forces responded to the attack, leaving at least 25 of them dead and at least 40 others wounded.\nSeveral Pakistani militants were also among those killed and their dead bodies are still left in the area, Thunder Corps added.\nIn the meantime, Thunder Corps said at least 3 militants were killed and 4 others were wounded during a separate clash in Zurmat district.\nhttps://www.khaama.com/more-than-70-militants-including-foreigners-killed-in-paktia-clashes-05729/\n--------\nTaliban fighters storm Afghanistan’s Ghazni, seize parts of city\n10 August 2018\nHeavily armed Taliban fighters attacked Ghazni city in central Afghanistan early on Friday, shelling houses and business areas and gaining control of parts of the city center, officials said.\nThe attack on a strategic city straddling the main route between the capital Kabul and southern Afghanistan demonstrated the Taliban's strength amid increased speculation about a possible ceasefire during the Eid religious holiday this month.\nOfficials said clashes between government forces and the Taliban started overnight, forcing authorities to close the highway linking it to Kabul, 150 kilometers (95 miles) to the northeast.\n“The Taliban are dropping missiles near residential and commercial areas. There has not been a single minute of silence for the last eight hours,” said a senior government official in Ghazni.\nA second government official said it was too dangerous for people to leave their homes and he had no immediate details on casualties.\n“It is not possible to get out of our homes to help the injured or collect bodies,” he said.\nTaliban spokesman Zabihullah Mujahid said parts of the city had been seized by the Taliban and many people were killed.\nThe attack on Ghazni followed a similar assault on Farah in May, when insurgents came close to overrunning the city in western Afghanistan.\nFull report at:\nhttps://english.alarabiya.net/en/News/world/2018/08/10/Taliban-fighters-storm-Afghanistan-s-Ghazni-seize-parts-of-city.html\n--------\nMyanmar snubs Hague court’s intervention in Rohingya crisis\nAugust 10, 2018\nYANGON, Myanmar: Myanmar sharply rejected an attempt by the International Criminal Court to consider the country’s culpability for activities that caused 700,000 minority Rohingya Muslims to flee to Bangladesh for safety last year.\nThe office of the nation’s leader, Aung San Suu Kyi, said in a statement posted online Thursday that the court in the Netherlands has no jurisdiction over Myanmar because it is not a member state.\nIt also offered procedural reasons for why it would not respond formally to the court’s request for its views on the exodus of the Rohingya, and said the question “is meritless and should be dismissed.” The ICC did not immediately respond to an Associated Press request for comment.\nCritics including UN experts have accused Myanmar’s military of atrocities against the Rohingya amounting to ethnic cleaning, or even genocide. Suu Kyi’s government says it was carrying out justifiable counterinsurgency operations in response to attacks on security forces by Rohingya militants in August last year.\nThe army, according to documentary evidence and survivor and eyewitness accounts compiled by human rights organizations, beat and killed civilians, organized rapes and the burning of thousands of homes belonging to Rohingya in Myanmar’s western state of Rakhine.\nThe ICC had solicited Myanmar’s views in April, and later set a July 27 deadline for a response to the question of whether the court should have jurisdiction.\nMyanmar accused the court of violating international legal norms by seeking to assert jurisdiction over the issue despite Myanmar not being a party to the Rome Statute establishing the court.\n“By allowing such a contrived procedure, the ICC may set a dangerous precedent whereby future populistic causes and complaints against non-State Parties to the Rome Statute may be litigated at the urging of biased stakeholders and non-governmental organizations and even then, selectively based on the political current of the times,” it said.\nThe statement also referred to several proceedings carried out by the court that it called irregular or not allowed under its own rules, including alleged “lack of fairness and transparency.” It also mentioned its agreements to have Rohingya repatriated from Bangladesh, though such action has yet to be implemented and the UN has criticized Myanmar for delays.\nThe Rohingya have long faced severe discrimination and were the target of violence in 2012 that killed hundreds and drove about 140,000 people — predominantly Rohingya — from their homes to camps for the internally displaced, where most remained until last year’s violence.\nFull report at:\nhttp://www.arabnews.com/node/1353906/world\n--------\nTaliban launch major attack on Afghan city, casualties: officials\nAugust 10, 2018\nTaliban militants have launched an attack on an Afghan provincial capital and heavy fighting is under way as security forces try to beat them back, with terrified residents cowering in their homes amid explosions and gunfire.\nAt least one Afghan soldier has been killed and seven others wounded in the fighting in the southeastern city of Ghazni, provincial governor spokesman Arif Noori told AFP on Friday.\nCivilian houses and army checkpoints have come under mortar attack and the bodies of dozens of Taliban fighters are in the streets, he added.\nThe Taliban began the attack late Thursday from several positions around the city, provincial police chief Farid Ahmad Mashal told AFP.\nResidents who spoke to AFP said power has been cut to the area for hours since fighting erupted, with heavy gunfire ringing out across the city and a government building set on fire.\n\"We are scared for our life. The Taliban are roaming everywhere in and around the city,\" shopkeeper Mohammad Haleem told AFP.\nAnother resident, Yasan, said the Taliban were using loudspeakers at the mosque to warn residents to stay in their homes.\n\"Heavy explosions and gunfire can be heard. We are terrified,\" Yasan wrote in a Facebook post.\nPolice special forces have been deployed to help block the Taliban advance on the city, an Afghan security official said.\nThe Taliban issued a statement claiming to have captured \"most of government buildings inside the city\".\n\"So far 140 enemy forces have been killed or wounded,\" the group said.\nThe Taliban frequently exaggerate their battlefield gains and downplay losses incurred during fighting.\nGrowing pressure\nIt was the latest in a series of attempts by the Taliban over the past three years to capture urban centres.\nAfghan forces have been struggling to hold back the resurgent militant group since the withdrawal of NATO combat forces at the end of 2014.\nIn May the Taliban attacked the western city of Farah. After a day of intense fighting, Afghan commandos and US air strikes drove the group to the outskirts of the city.\nThe attack on Ghazni comes as the Taliban faces growing pressure to agree to peace talks with the Afghan government to end the 17-year war.\nIt has so far ignored President Ashraf Ghani's offer of unconditional peace negotiations.\nThe Taliban has long insisted on direct talks with the United States. Washington has repeatedly refused, saying negotiations must be Afghan-led.\nBut there are tentative signs that diplomatic efforts to kick-start talks are starting to bear fruit.\nWashington indicated a change in its longstanding policy in June when US Secretary of State Mike Pompeo said the United States was prepared to \"support, facilitate and participate\" in talks.\nPompeo also said the role of foreign forces in Afghanistan would be on the table.\nLast month Taliban representatives met US officials for talks in Qatar.\nAnticipation has also been mounting about the possibility of a government ceasefire announcement for the Islamic holiday of Eid-al Adha later this month.\nFull report at:\nhttps://nation.com.pk/10-Aug-2018/taliban-launch-major-attack-on-afghan-city-casualties-officials\n--------\nBangladeshi Jamat-e-Islami member arrested in Meghalaya\nAugust 9, 2018\nA Bangladeshi national, working with Jamat-e-Islami foundation of Bangladesh, was arrested by troopers of the Border Security Forces (BSF) in Meghalaya, officials said on Thursday.\nMd Jaharul Islam, 26, was arrested on Wednesday from the Zero Line of the India-Bangladesh border at Baghmara in South Garo Hills district.\nDuring questioning, a BSF statement said, Islam revealed that he worked for Jamat-e-Islami foundation and wanted to become a Jihadi. He works for an international forum called SEBDA Children Denmark.\n\"Islam was not satisfied with the policy of Bangladesh's ruling Awami League government. He revealed that he wanted to become Jihadi due to torture inflicted upon him by some Awami League members. He is a supporter of Bangladesh Nationalist Party,\" the statement said.\nFull report at:\nhttps://www.business-standard.com/article/news-ians/bangladeshi-jamat-e-islami-member-arrested-in-meghalaya-118080901762_1.html\n--------\nChildren among 12 dead, wounded in Herat city suicide attack\nAug 09 2018\nAt least twelve people including children were killed or wounded in a suicide attack in Herat city, the provincial capital of western Herat province, the local officials said.\nThe incident took place this evening in the vicinity of the 1st police district of the city after a suicide bomber detonated his explosives near a military compound used which was previously used by the Afghan National Army.\nA local official confirmed that the blast has taken place close to the former military compound in the vicinity of the 1st police district of the city at around 5:30 pm local time.\nProvincial governor’s spokesman Jilani Farhad confirmed that two children were killed and ten other civilians were wounded in the attack.\nHe said the death toll could further rise as at least four wounded civilians are in critical condition.\nNo individual or group has so far claimed responsibility behind the incident.\nFull report at:\nhttps://www.khaama.com/children-among-12-dead-wounded-in-herat-city-suicide-attack-05731/\n--------\n6 civilians killed, wounded in rocket attack by Taliban in Logar\nAug 09 2018\nAt least six civilians were killed or wounded in a rocket attack by the Taliban militants in central Logar province of Afghanistan.\nAccording to reports, the incident has taken place in the vicinity of Mohammad Agha district, leaving three civilians dead and three others wounded.\nThe 203rd Thunder Corps of the Afghan Military in the Southeast confirmed the incident and the civilian casualties in the attack.\nA statement released by Thunder Corps stated that the Taliban militants carried out carried out rocket attack impacting the civilian houses.\nThe statement further added that three civilians were killed in the attack and three others sustained injuries.\nLogar has been among the relatively calm provinces in Central parts of country but the security situation of the province has deteriorated sharply during the recent years.\nFull report at:\nhttps://www.khaama.com/6-civilians-killed-wounded-in-rocket-attack-by-taliban-in-logar-05730/\n--------\nSoutheast Asia\nChinese Hui Muslim protest forces authorities to halt plan to demolish Weizhou Grand Mosque\n09 August, 2018\nLocal authorities have been pushed to delay plans to demolish a new mosque in northwest China after a rare protest by hundreds of Muslims from the ethnic Hui group on Thursday.\nThe huge crowd gathered from noon until late in the night in the square outside the Weizhou Grand Mosque, an imposing white structure topped with nine onion-shaped domes, crescent moons and four towering minarets, according to images seen online.\nThe local county head came to the mosque around midnight, urging everyone to go home and promised that the government would not touch the mosque until a reconstruction plan has been agreed upon by the townsmen, according to local sources.\nThe stand-off in the town of Weizhou in Tongxin county, in the Ningxia Hui Autonomous Region, is the latest, and possibly largest, conflict in a recent campaign to rid the region of what Beijing regards as a worrying trend of Islamisation and Arabisation, as the ruling Communist Party doubles down to “Sinicise religion”.\nAccording to a notice said to have been issued by the Weizhou government on August 3 and shared online, the mosque’s management committee had been given a deadline of Friday to demolish the building on the grounds it had not been granted the necessary planning and construction permits.\nIf the management committee failed to comply, the government would “forcefully demolish it according to the law”, the notice said.\nBut a source close to the Ningxia government said that after days of negotiation between the authorities and religious leaders, it had been agreed earlier on Thursday that the government would not demolish the mosque, but remove eight of its domes.\nThe offices of the Tongxin Party committee and local government could not be reached for comment.\nA Weizhou resident, whose name the South China Morning Post is withholding out of concern for his safety, said on Thursday that he had heard about the alternative plan, but that many Muslims did not want to see the domes removed.\n“Now we’re just in a stand-off,” he said. “The public won’t let the government touch the mosque, but the government is not backing down.”\nConstruction of the new mosque was completed last year. It replaced an earlier one that, in turn, had been built to replace Weizhou’s 600-year-old Chinese-style mosque, which was destroyed during the Cultural Revolution along with thousands of other temples, churches and monasteries across the country.\nThe government’s order sparked an outcry in the Hui Muslim community, with many people questioning why the authorities did not stop construction of the mosque – which took two years to complete – if it had not been granted the necessary paperwork.\nVideo footage seen by the Post showed police vehicles parked in the square, while on the mosque more than 10 Chinese national flags fluttered in the wind.\nTwo red banners had also been strung from the mosque’s exterior walls, one of which read: “Resolutely support the Chinese Communist Party, defend ethnic unity, safeguard the freedom of faith”.\nDespite the large numbers of people involved, the demonstration appeared to be peaceful, and the Post had not received any reports of violence as of Thursday evening.\nThe Weizhou resident said that many Hui believed it was not the intention of the Party’s central leadership to tear down their mosque.\n“The local government is not implementing the central government’s policies,” he said.\nStill, the Weizhou government’s move was most likely a response to the Communist Party’s call to “Sinicise religion” – a policy introduced by President Xi Jinping in 2015 and intended to bring religious groups in line with Chinese culture and the absolute authority of the party.\nA visit to Ningxia by a Post reporter in April found that Islamic icons and Arabic signs had been removed from streets in towns and counties across the region. While secular buildings appeared to have been the first targets, at least two mosques had their domes removed earlier this year.\nFor decades, China’s Hui Muslims have been largely left in peace to practise their faith. Most of them speak Mandarin, and apart from the white caps and headscarves worn by the more traditional members of the ethnic group they are indistinguishable from the majority Han population.\nBut as the government deepens its crackdown on Uygurs – another mostly Muslim group in the western frontier of Xinjiang – the Hui are also being targeted.\nSeveral mosques in Nigxia have been ordered to cancel public Arabic classes, while a number of private Arabic schools have been told to shut down.\nIn 2012, hundreds of Hui clashed with police in Tongxin as they tried to stop their mosque from being demolished after it was declared illegal. Several protesters were reportedly killed in the violence and dozens more were injured.\nhttps://www.scmp.com/news/china/policies-politics/article/2159047/chinese-hui-muslims-rally-protect-weizhou-grand-mosque\n--------\n‘Brave’ Mujahid defended Islam by removing LGBT portraits, Perak Mufti says\n10 August 2018\nIPOH, Aug 10 — Perak mufti Tan Sri Harussani Zakaria has praised Datuk Mujahid Yusof Rawa for ordering the removal of the portraits of lesbian, gay, bisexual and transgender (LGBT) activists from the George Town Festival.\nIn a statement issued today, Harussani commended the minister in the prime minister’s department in charge of religious affairs and that he fully supported the move.\n“Congratulations and well done to the Menteri Agama(Minister who oversees Islamic Affairs) for being brave enough to state the truth, and indirectly defend the credibility of the Islamic institution,” Harussani said.\n“LGBT is an act which is mungkar (defying God’s laws) and it has been forbidden by Allah whether it is done openly or privately.”\n“LGBT is also a condemnable act which contravenes the rights of a person, because it denies the rights of a relationship through a marriage that is legal and recognised by Islamic law.”\nHarussani also said the act of promoting LGBT icons in public was an effort to encourage and recognise the ‘forbidden’ act.\nEarlier this week, Mujahid admitted that he had ordered the removal of portraits depicting transgender activist Nisha Ayub and gay rights advocate Pang Khee Teik at the festival.\nHe said the portraits were “promoting LGBT activities”, adding that it was not in line with Pakatan Harapan’s policies.\nNisha is a transgender activist who has won many awards for her work including the US Secretary of State’s International Women of Courage Award in 2016 while Pang is the co-founder of Seksualiti Merdeka ― an annual human rights festival.\nFull report at:\nhttps://www.malaymail.com/s/1661096/brave-mujahid-defended-islam-by-removing-lgbt-portraits-perak-mufti-says\n--------\nOkay to task 2 groups to reform Islamic bodies, says don\nVinodh Pillai and Nur Hasliza Mohd Salleh\nAugust 9, 2018\nKUALA LUMPUR: A constitutional law expert says there should be no issue over duplication of roles between Putrajaya’s top advisory council and a similar council announced by the Malay rulers recently. Both groups have been tasked with reforming Islamic institutions.\nIn fact, emeritus law professor Shad Saleem Faruqi of Universiti Malaya told reporters today he believed there should be more than two committees to spearhead the initiative.\n“Some people are asking why there are two committees but there is no harm in this. Both committees have no power to make any decision. They merely make recommendations to the federal government.\n“The CEP (Council of Eminent Persons) has appointed a body to do this, and so have the Malay rulers recently. But that is their right. Let’s not make an issue of the fact that we now have two committees for this. Let’s put as many heads together.\n“Neither body has any executive, legislative or financial power. Let the government decide and examine the constitutionality of their recommendations,” he said after meeting the CEP at Ilham Tower today.\nShad noted the process would be a long-drawn one, as the Attorney-General’s Chambers would first have to take into account the legal considerations of both councils’ recommendations.\nThen, it would have to be debated in both houses of Parliament.\nThe Conference of Rulers recently agreed to the formation of a new special committee for improving federal Islamic institutions in Malaysia, called the High-level Committee on Federal Institutions of Islamic Affairs.\nThis came on the back of another committee formed under the purview of the five-member CEP previously, where several prominent Islamic scholars and activists were similarly tasked with drafting a proposal on Islamic reforms.\nA source told FMT that a possible clash could take place between the two groups in the near future, as one side or the other might not easily give way over the suggestions.\nMoreover, one committee is seen as more powerful than the other as it is directly under the rulers.\nShad said there was a need for the true spirit of Islam, shariah and civil laws to be enumerated in the new Malaysia, as well as the special position of the Federal Constitution.\n“This country was built on compromises and compassion. It’s time to walk the middle path of tolerance.”\nOver the years, leaders had questioned state Islamic authorities, especially the Malaysian Department of Islamic Affairs (Jakim), over what was perceived as their penchant for imposing a more rigid form of Islam in the country.\nThese influential government religious officers had also been blamed for a spate of controversial religious rulings as well as the banning of hundreds of books over the years dealing with Islam.\nJakim had also come under the microscope, with leaders from both sides of the political divide calling for it to be dismantled, saying its powers were against the constitutional provision that matters of Islam came under the purview of state rulers.\nProminent novelist Faisal Tehrani agreed with Shad that there was a need for an advisory council to regulate Islamic affairs, whether it was under the rulers or Parliament.\nHowever, the award-winning author, who has seven of his books banned in Malaysia, said there had to be a diverse mix of advisers in the councils, including historians, sociologists, scientists and Islamic experts.\nFull report at:\nhttp://www.freemalaysiatoday.com/category/nation/2018/08/09/kay-to-task-2-groups-to-reform-islamic-bodies-says-don/\n--------\nIndonesia launches new group to combat extremism\nAugust 3, 2018\nModerate Muslims in Indonesia have launched a new civil society group to promote interreligious tolerance in a country where religious and ethnic sentiments are on the rise ahead of a presidential election in 2019.\nMore than 200 people, including religious leaders such as Jakarta's Catholic archbishop, as well as politicians, attended the Aug. 1 launch of the Said Aqil Siroj Institute in Jakarta.\nThe new non-profit organization is named after a prominent Muslim cleric who now serves as chairman of Nahdlatul Ulama (NU), Indonesia's largest Islamic organization.\n\"His thoughts and ideas highlighting tolerance, mutual respect, peace and willingness to work together with people from different religious and ethnic backgrounds have inspired the establishment of this institute. These are important pillars for the existence of our diverse nation,\" Imdadun Rahmat, the organization's executive director, said at the launch.\n\"This institute has come about because of concerns among young people about problems and challenges faced by our nation, especially the weakening of national unity as a result of segregation based on religion, ethnicity and ideology,\" he said.\nHe said the organization would take up the same fight as similar organizations including the Jakarta-based Wahid Institute, an organization that focuses on the creation of peace and non-violence espoused by former Indonesian president Abdurrahman Wahid, who was also a former NU chairman.\n\"Such organizations need to expand to serve as 'shields' to protect our younger generation from radicalism,\" he told ucanews.com.\nIn near future, he said, the institute will share moderate Islamic teachings through social media and conduct research, seminars and discussions.\nSpeaking to reporters, Siroj said the institute would promote Islam Nusantara (Islam of the Archipelago) as many people still don't have a clear understanding of it.\n\"Islam Nusantara means an Islam which promotes cultural values that are dignified, friendly and polite,\" he said.\n\"I think Islam Nusantara is a solution to the wave of globalization which is very radical and extreme.\n\"I believe Indonesian Muslims can show people that they respect differences and other cultures,\" he said.\nCoordinating Minister for Maritime Affairs, Luhut Binsar Panjaitan, said the launch of the new organization comes at the right time.\n\"[Next year] is the year of politics. Regional elections [held in June] ran peacefully. Yet, we see that in some regions the issues of religion, ethnicity and ideology were used to influence public opinion. We predict these issues will grow ahead of the presidential election next year,\" he said.\nArchbishop Ignatius Suharyo Hardjoatmodjo of Jakarta, who attended the launch, welcomed the institute's establishment.\nFull report at:\nhttps://www.ucanews.com/news/indonesia-launches-new-group-to-combat-extremism/82981\n--------\nAhmad Sarji: New panel will study effectiveness of Islamic institutions\nAugust 9, 2018\nKUALA LUMPUR: The high-level panel established to look into federal institutions of Islam has identified groups that it will invite to share input on these institutions.\nIts chairman Ahmad Sarji Abdul Hamid said in a statement that the main focus of the panel would be to review the administration of Islamic institutions, the basis for setting up these institutions, their jurisdictions, and the effectiveness of these institutions at the federal level.\n“The panel would have closed-door meetings, three days a week within three months beginning August 2018, at the old Istana Negara.\n“It has identified target groups to be invited to provide relevant views and inputs, based on the five clusters namely shariah and legislative, financial and economic, management, education and dakwah,” he said.\nToday, seven members of the eight-member panel received their appointment letters from the Keeper of the Rulers’ Seal Syed Danial Syed Ahmad.\nA fellow at the Oxford Centre for Islamic Studies, Dr Afifi al-Akiti, is the deputy chairman while Syed Danial is its secretary.\nThe other members are International Islamic University Malaysia’s former rector Prof Dr Mohd Kamal Hassan, former Johor mufti Nooh Gadot and former director-general of the Department of Islamic Development Malaysia (Jakim) Wan Mohamad Sheikh Abdul Aziz.\nTwo additional members representing Sabah and Sarawak are Sabah Law and Native Affairs Minister Aidi Moktar and Sarawak Assistant Minister for Rural Electricity Dr Abdul Rahman Junaidi.\nFull report at:\nhttp://www.freemalaysiatoday.com/category/nation/2018/08/09/ahmad-sarji-new-panel-will-study-effectiveness-of-islamic-institutions/\n--------\nFatwas violated my right as an author, says Faisal Tehrani\nVinodh Pillai and Nur Hasliza Mohd Salleh\nAugust 9, 2018\nKUALA LUMPUR: Award-winning novelist Faisal Tehrani believes state fatwas, or religious edicts, have violated his rights as an author and called on the government to keep its word to propagate a secular version of Islam.\nSpeaking after meeting with the Council of Eminent Persons (CEP) today, Faisal, whose real name is Faizal Musa, said he believed fatwas were just “legal opinions” and should not be gazetted to become part of state laws.\n“I had my books banned because I used certain words that supposedly offended some people. All I did was quote people who had talked about Sunnah and Shia Islam teachings. But, for that they said my writing was volatile.\n“I say fatwas can be violations of human rights. We need secularism in Malaysia because in secular environments, religion flourishes better. It becomes a healthier version of religion,” he said outside Ilham Tower today.\nSeven out of his 45 books have been banned in Malaysia by the previous administration over allegations that they contained elements of Shia Islam, a school of thought labelled as “deviant” by Malaysia’s Islamic authorities.\nThe seven books are “Sebongkah Batu di Kuala Berang”, “Karbala”, “Tiga Kali Seminggu”, “Ingin Jadi Nasrallah”, “Perempuan Nan Bercinta”, “Sinema Spiritual: Dramaturgi dan Kritikan:”, and “AKU___, MAKA AKU ADA!”\nThe home ministry told FMT in June that the bans had yet to be lifted.\nFaisal said Prime Minister Dr Mahathir Mohamad had already said his government hoped to push for a better version of Islam, “one that does not punish people as it currently does.”\n“When a fatwa is issued in this country, it is also lawful. So, in the event of any offences caused, you may be subject to punishments and time in prison.\n“But this needs to be changed in the new Malaysia, doesn’t it?”\nAcademic Prof Syed Farid Al-Attas, on the other hand, said he believed that many in Malaysia were guilty of spreading hatred towards followers of the Sunni and Shia school of thought.\nFull report at:\nhttp://www.freemalaysiatoday.com/category/nation/2018/08/09/fatwas-violated-my-right-as-an-author-says-faisal-tehrani/\n--------\nMideast\nIran: We will hit 112 US bases with suicide bombings\n10 August 2018\nWar is a painful disaster, even if it is for national, defensive or religious reasons. Many countries try to avoid it as much as it can to save its people from its tragic consequences and preserve their homes from devastation and destruction, along with spectre of thousands of dead, wounded, disabled and homeless.\nHowever, Ali Reza Farqani, Iranian editor-in-chief of Arman newspaper, says his country “needs a foreign war,” threatening Washington that pro-Iranian suicide bombers would hit US bases in 112 countries in any possible war.\nThe author repeated a slogan by the founder of the Iranian regime, Ayatollah Khomeini in the 1980s, when he said that \"war is a blessing\" in reference to the war between Iraq and Iran, which ended after Tehran was forced to accept the UN resolution calling for a cease-fire between the two countries.\nAt that time, Khomeini said that he had to submit to the resolution saying: \"I drink the cup of poison.\"\nAfter US President Donald Trump ordered US sanctions against Iran to take effect last Tuesday, with will be further escalated to a more severe level on November 4, Ali Reza Farqani, an Iranian media editor and editor-in-chief ‘Arman Press', has written an article in which he expressed “the readiness of the Iranians to fight the war against the United States of America.”\nThe Washington Post reported at the end of last April that the Pentagon is working on a plan to counter Iran’s expansion and destabilizing the Middle East through Tehran’s support for armed groups in the region.\n“The US military will not face Iran directly, but it will use indirect means to limit its expansion in Syria and Iraq,” General Joseph Leonard Votel, who heads the US Central Command, was quoted as saying.\nReady for war against the US\n“We are ready to wage a major war against the United States,” Farqani said in his article. The writer described the war as “jihadist security.”\nThe editor-in-chief of Arman Press believes that the call for war by Iran would “change the perception of the military and American and Israeli politicians toward the Iranians, and help to stop the talk about the military option.”\nThe author attempted to interpret and interpret Iran’s call for foreign war as being based on the origin of jihad, claiming that such a war would be between two intellectual models. The first represented theism and the second was humanism.\nAfter describing the details of the differences between the two trends, the hardline Iranian media person issued threats against American officials and warned them: “You have to understand that the next war will ensure the survival of the Islamic Revolution of Iran and eliminate America completely and it will be a war of solidarity for all Iranian Muslims.”\n“The Iranian dictionary does not include the word dictionary ‘defeat',” he claimed.\nThe writer then tried to justify his call for war with America by resorting to the interpretation of Quranic verses on his own, describing the Iranian side as the holy party in this war and the other side in the Holy Land, claiming that Iran is the “front of truth” in such a war.\nAfter a lengthy comparison between the Iranian and American soldier’s preferences and the preference of the Iranian soldier for the other soldiers of the Muslim countries, he addressed the Americans, threatening them with suicide operations in different countries, saying: “America should know that if it entered into a war with Iran, the Hezbollah youth will determine the area of the battlefield far from Iran’s borders and within a period of less than 48 hours will launch suicide attacks.\nThreat to rape Obama’s daughter\nAli Reza Farqani was one of the former prime ministers of the government of former President Mahmoud Ahmadinejad and former ruler of Kish Island in the Gulf, where he left office after disagreements with Ahmadinejad’s government. He is a member of the hardline Islamic movement in Iran and had threatened in his blog to rape the daughter of former US President Obama if Syria was attacked by the United States.\nAmerica’s “weak points”, which he considered an easy prey for all the “peoples of the world”, were to threaten to kidnap a member of the family of every minister, ambassador and military commander around the world within one day, he said.\nAli Reza Farqani is a member of the “Ammarioun” headquarters of the radical Iranian pro-Iranian leader and reflects the views of the most extreme spectra in Iran.\nhttps://english.alarabiya.net/en/News/middle-east/2018/08/10/Iran-We-will-hit-112-US-bases-with-suicide-bombings.html\n--------\nHamas, Israel agree Egypt-mediated truce to end Gaza flare-up: Officials\nAug 9, 2018\nPalestinian officials have confirmed that the resistance movement Hamas and the Israeli regime have agreed on a ceasefire mediated by Egypt to stop cross-border fire in the Gaza Strip.\nA Palestinian official with knowledge of the ceasefire talks", "url": "http://www.newageislam.com/islamic-world-news/new-age-islam-news-bureau/canadian-pm-refuses-to-withdraw-criticism-of-saudi-human-rights-record/d/116096", "label": 1}