{"authors": [], "date_download": "2019-03-27 14:18:12", "date_modify": "2019-03-27 14:18:12", "date_publish": "2015-03-23 00:00:00", "description": null, "filename": "karnataka-announces-cbi-pro_f1ea3d9634b5ee7b9db8a428fcde095d_03231155_1553696292.html", "image_url": "https://www.nagpurtoday.in/wp-content/uploads/2015/03/ias-officer-dk-ravi-150x150.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/nagpurtoday.in/karnataka-announces-cbi-pro_f1ea3d9634b5ee7b9db8a428fcde095d_03231155_1553696292.html", "title": "Karnataka Announces CBI Probe Into IAS officer DK Ravi’s Death", "title_page": "Karnataka Announces CBI Probe Into IAS officer DK Ravi’s Death – Nagpur Today : Nagpur News", "title_rss": "NULL", "source_domain": "nagpurtoday.in", "text": "BENGALURU/NAGPUR: Amid protests over the death of IAS officer DK Ravikumar, who was found hanging in his home in Bengaluru last week, the Karnataka government has handed over the case to the Central Bureau of Investigation.\nSonia Gandhi, the president of the state’s ruling Congress, had written to the officer’s wife assuring a fair investigation. Her assurance came after Mr Ravikumar’s mother wrote an open letter to her, which was published in the newspapers.\nMrs Gandhi had also spoken to Chief Minister Siddaramaiah last week and advised him to turn over the case to the CBI.\nOn Sunday, the High Court stopped the government from making public an initial report on what it called the “unnatural death” of the 36-year-old officer.\n“The respondents are restrained from making or publishing any interim report or making any public statement pertaining to investigation being conducted with regard the unnatural death of DK Ravi…,” Justice Abdul Nazeer said, adding that the investigation can continue.\nThe court acted on a petition by the husband of an IAS officer who knew DK Ravikumar and was the last to have been in touch with him, according to media reports. The woman has reportedly shared information with the state’s Criminal Investigation Department, which is inquiring into the case.\nThe officer was found hanging from a ceiling fan in his apartment last Monday. The police have said it is “prima facie a case of suicide,” a premise questioned by many, including his family and friends.\nLast week, the officer’s family members protested outside the state assembly until the Chief Minister arrived and spoke to them.\nOpposition parties have rejected reports of personal reasons behind the death and say there is more to the case; the officer was known for taking on the sand and land mafia.\n“We will not allow the government to submit the interim report because that is a deliberate attempt at misleading investigations,” senior BJP leader BS Yeddyurappa said on Sunday.", "url": "http://www.nagpurtoday.in/karnataka-announces-cbi-probe-into-ias-officer-dk-ravis-death/03231155", "label": 1}