{"authors": ["Ht Correspondent"], "date_download": "2019-03-27 14:40:54", "date_modify": "2019-03-27 14:40:54", "date_publish": "2012-01-24 18:41:00", "description": "The cold war between Mamata Banerjee and Congress continued, as the chief minister skipped meeting union minister for rural development Jairam Ramesh, who is on a three-day tour of Bengal. HT reports.", "filename": "kolkata_one-more-snub-mamata-skips-meeting-with-jairam_story-eKTe472rWD3sfWKETnfQQJ_1553697654.html", "image_url": "https://www.hindustantimes.com/images/app-images/2019/2/icon-57x57.png", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/hindustantimes.com/kolkata_one-more-snub-mamata-skips-meeting-with-jairam_story-eKTe472rWD3sfWKETnfQQJ_1553697654.html", "title": "One more snub: Mamata skips meeting with Jairam", "title_page": "\nOne more snub: Mamata skips meeting with Jairam\n | kolkata | Hindustan Times", "title_rss": "NULL", "source_domain": "hindustantimes.com", "text": "The cold war between Mamata Banerjee and Congress continued, as the chief minister skipped meeting union minister for rural development Jairam Ramesh, who is on a three-day tour of Bengal. Though the union minister's visit was to oversee development initiatives, yet sources indicated Congress high Command sent him to mend relations with Trinamool Congress.\nInterestingly, in July last year when Ramesh was in Kolkata for a short visit, Mamata Banerjee made it a point to meet him, even in the studio of a local television channel. However this time Ramesh could only hold a meeting with state panchayat minister Subrata Mukherjee.\n\"Even yesterday the two were scheduled to share stage in a programme to commemorate Netaji Subhas Chandra Bose's birthday. Yet it was only after Jairam Ramesh left that we saw Mamata Banerjee enter. The chief minister should have met him as a mark of courtesy. This would further deteriorate our relationship here,\" said a senior Pradesh Congress leader.\nRamesh's visit held significance since as an emissary of the High Command he was sent to Kolkata to calm down tensions between the allies in Delhi and in Bengal. The High Command wanted to send a message of peace to Mamata Banerjee through Ramesh, which remained undelivered.\nJust before coming to Kolkata Ramesh sent letters to Mamata Banerjee asking why the state is yet to initiate BPL census, which is happening all over India. Earlier, too, a number of letters were sent by him to the chief minister, one of which stung the government for its poor performance on the MNREGA front.\nRamesh had to settle for state panchayat minister Subrata Mukherjee who held a meeting with him on Monday and sorted out issues.\nRamesh who arrived in Kolkata on January 23 is scheduled to leave for Jungamahal tour on January 24. Meanwhile, Mamata Banerjee herself in scheduled to hold a rally on 25th in Manipur. Ramesh meanwhile is scheduled to leave for Delhi on the night of 25th. Therefore it is unlikely that the two will meet before Ramesh leaves Bengal.\nAccording to sources, already the relation between Mamata Banerjee and Congress had taken a dip recently. Moreover, Ramesh's recent barrage of letters highlighting delay in initiatives on rural development in Bengal irked Mamata Banerjee further.\nIn Delhi Mamata Banerjee opposed crucial policy moves by the government including Lokpal Lokayukta Bill and FDI in retail.\nIn Bengal state Congress locked horns with Mamata Banerjee over the issue of renaming of Indira Bhawan, spate of farmer suicides and campus violence. Manoj Chakraborty Congress minister even resigned raising his voice against the chief minister at the corridors of writers' buildings.\nFirst Published: Jan 24, 2012 18:41 IST", "url": "https://www.hindustantimes.com/kolkata/one-more-snub-mamata-skips-meeting-with-jairam/story-eKTe472rWD3sfWKETnfQQJ.html", "label": 1}