{"authors": ["Scroll Staff"], "date_download": "2019-03-27 14:29:12", "date_modify": "2019-03-27 14:29:12", "date_publish": "2016-01-25 20:53:00", "description": "Ahead of Republic Day, the president said that the nation should guard itself against violence, intolerance, and unreason.", "filename": "latest_802482_let-us-continue-to-rebel-it-is-a-virtue-of-democracy-says-pranab-mukherjee_1553696952.html", "image_url": "https://d1u4oo4rb13yy8.cloudfront.net/facebook-xrgaunxdou-1453733906.jpeg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/scroll.in/latest_802482_let-us-continue-to-rebel-it-is-a-virtue-of-democracy-says-pranab-mukherjee_1553696952.html", "title": "Let us continue to rebel, it is a virtue of democracy, says Pranab Mukherjee", "title_page": "Let us continue to rebel, it is a virtue of democracy, says Pranab Mukherjee", "title_rss": "NULL", "source_domain": "scroll.in", "text": "President Pranab Mukherjee on Monday encouraged Indians to voice their dissent, saying it was a part of democracy. He added that people should applaud what democracy has achieved, as rebellion was a virtue of it. Addressing the nation ahead of Republic Day, Mukherjee said that India recognised its problems and addressed them, adding that industrial performance remained strong despite setbacks.\nCalling 2015 \"a year of challenges\", Mukherjee was optimistic about the future. \"With investments in infrastructure, manufacturing, health, education, science and technology, we are positioning ourselves well for achieving a higher growth rate which will in the next 10 to 15 years help us eliminate poverty,\" he said. Mukherjee added that said a spirit of accommodation and consensus-building should be the mode of decision-making, and that the country needed legislations and reforms to revitalise itself.\nThe president also spoke about terrorism, calling it pure evil and a \"cancer which must be operated out with a firm scalpel\". He added that peace is a necessity for economic progress, but there were bound to be disputes among nations. \"The closer we are to a neighbor, the higher the propensity for disputes,\" he said.", "url": "https://scroll.in/latest/802482/let-us-continue-to-rebel-it-is-a-virtue-of-democracy-says-pranab-mukherjee", "label": 1}