{"authors": ["Scroll Staff"], "date_download": "2019-03-27 14:40:48", "date_modify": "2019-03-27 14:40:48", "date_publish": "2018-07-31 14:16:23", "description": "A 35-year-old man allegedly killed himself in Beed district in support of the community’s demand for reservation in jobs and education.", "filename": "latest_888675_maharashtra-police-book-over-4000-people-for-violence-during-maratha-protests-in-chakan_1553697648.html", "image_url": "https://d1u4oo4rb13yy8.cloudfront.net/book/spoalqydfx-1533024096.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/scroll.in/latest_888675_maharashtra-police-book-over-4000-people-for-violence-during-maratha-protests-in-chakan_1553697648.html", "title": "Maharashtra Police book over 4,000 people for violence in Chakan", "title_page": "Maratha protests: Maharashtra Police book over 4,000 people for violence in Chakan", "title_rss": "NULL", "source_domain": "scroll.in", "text": "The Maharashtra Police on Tuesday registered two cases against more than 4,000 protestors for violence that broke out during demonstrations in Chakan near Pune on Monday, the Hindustan Times reported.\nOn Monday, Maratha Kranti Morcha workers allegedly blocked the Pune-Nashik highway demanding reservations in jobs and education for the Maratha community. Protestors reportedly torched five buses and damaged around 50 vehicles.\nThe police said no violence was reported from Chakan on Tuesday.\nAccording to the police, the violence appeared to be planned as protestors, some of whom were allegedly outsiders, came to Chakan with swords and petrol cans. “Some troublemakers had come with all preparation to create a disturbance,” Pune’s Superintendent of Police Sandip Patil said.\nFour policemen and three civilians were injured in the violence as the police fired tear gas shells in the air to control the crowd. The police said constable Ajay Bhapkar, who was beaten up during Monday’s violence, has slipped into a coma.\nPune: Two cases have been registered against 4000-5000 agitators for violence that broke out during protests over #MarathaReservation in Chakan area yesterday. #Maharashtra — ANI (@ANI) July 31, 2018\nShiv Sena urges state government to give reservation\nThe Shiv Sena on Tuesday urged the Maharashtra government to give reservation to Marathas, Dhangars and Kolis, saying the state would become unstable if all these communities come out and protest.\nAn editorial in the party’s mouthpiece Saamna claimed that once the Maratha community is given reservation, others will come out on streets and a new problem will crop up. “Hence the government should take a decision on demands of all communities simultaneously,” it said. “The BJP had, in any case, promised reservation to Dhangars before elections.”\n“People today are coming out of the delusion that Prime Minister Narendra Modi is a reincarnation of Lord Vishnu and the chief minister is ‘Devendra’, who has a magical stick in his hands,” the editorial said. The party is an ally of the Bharatiya Janata Party in the state.\nMan commits suicide allegedly in support of reservation\nMeanwhile, a 35-year-old man hanged himself from a tree near his house in Maharashtra’s Beed district allegedly in support of the Maratha protests.\n“We found a suicide note in which he [Abhijeet Deshmukh] mentioned that he is taking this extreme step in support of Maratha reservation demand,” Beed Superintendent of Police G Shridhar told PTI. An unidentified police officer said that the note also mentioned other reasons for his suicide, like unemployment and unpaid bank loan.\nThis is the fifth suicide in the state over the Maratha reservation demand. A 38-year-old man, Kacharu Kalyane, hanged himself in Dhabad village of Nanded on Sunday while Pramod Hore ended his life under a train in Mukundwadi in Aurangabad on Monday. Two other protestors died on July 24 and July 25.\nProtests erupted in Mumbai, Thane, Navi Mumbai, Palghar, Raigad and Satara on July 23, leading to the death of a constable. On July 25, the shutdown was called off after Chief Minister Devendra Fadnavis said the government had taken cognisance of protests and is ready to talk to the Maratha community.", "url": "https://scroll.in/latest/888675/maharashtra-police-book-over-4000-people-for-violence-during-maratha-protests-in-chakan", "label": 1}