{"authors": ["Our Bureau"], "date_download": "2019-03-27 14:29:08", "date_modify": "2019-03-27 14:29:08", "date_publish": "2018-02-07 00:20:36", "description": "An agitated Opposition in the Rajya Sabha on Tuesday boycotted the House in the afternoon to register their protest against their voice being \"muzzled\" by", "filename": "latest-news_opposition-says_822b74bfd6ba03fc3825271531a49a91_1216715_1553696948.html", "image_url": "https://www.freepressjournal.in/wp-content/uploads/2018/02/PARLIMENT-673x450.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/freepressjournal.in/latest-news_opposition-says_822b74bfd6ba03fc3825271531a49a91_1216715_1553696948.html", "title": "Opposition says its voice is being muzzled, boycotts RS", "title_page": "Opposition says its voice is being muzzled, boycotts RS", "title_rss": "NULL", "source_domain": "freepressjournal.in", "text": "The Chairman (M Venkaiah Naidu) had adjourned the House till 2 PM on Monday when the Samajwadi Party members raised slogans in the well over alleged encounter killings by the Uttar Pradesh Police and AAP members protesting at rampant sealing of the commercial establishments in the capital.\nNew Delhi : An agitated Opposition in the Rajya Sabha on Tuesday boycotted the House in the afternoon to register their protest against their voice being “muzzled” by Chairman M Venkaiah Naidu.\nThe impromptu protest came at 2 PM when the House reassembled after the adjournment within five minutes of the start as the members of the Opposition parties – Congress, Trinamool Congress, Samajwadi Party, CPI, CPI-M, Nationalist Congress Party (NCP) – abstained at 3 PM when the proceedings resumed.\nThere was no participation of the Opposition members in the second day of discussion on the motion of thanks to the President for his joint address, though those in the chairs kept calling names of those who wanted to speak and declared them absent.\nThe discussion went on with members of AIADMK, Biju Janata Dal, BJP and its allies participating. There was, however, no clarity as to whether the Opposition members return to the House when the amendments to the motion are taken up at the end of the discussion as passage of any amendments, possible because the Opposition in majority, is treated as a sort of censure of the government.\nOpposition leader Ghulam Nabi Azad expressed anguish of the MPs that they were being prevented from raising the issues and the moment someone tries, the Chairman adjourns the House. It happened on Monday and again on Tuesday, wiping out even the question hour, he said.\n“The voice of the Opposition is already being muzzled outside and we do not want this to happen with the opposition parties even inside the House. We wanted to raise this since morning but prevented by adjournment of the House and that is why we have boycotted the House for the whole day,” Azad said.\n“The framers of rules have provided that should anything of national importance happen between the previous day and the morning, we are supposed to raise that particular issue. We are not intruding into Question Hour or government business. What we want is provided in the rules. Unfortunately, for the last one week, we are not allowed to make use of rules,” Azad said.\nThe Chairman had adjourned the House on Monday till 2 PM on Monday when the Samajwadi Party members raised slogans in the well over alleged encounter killings by the Uttar Pradesh Police and AAP members protesting at rampant sealing of the commercial establishments in the capital.\nAzad said nobody had gone to the well on Tuesday but the Chairman adjourned the House within five minutes when the Trinamool Congress members tried to raise an issue concerning the West Bengal Governor.\nWhen Trinamool leader Derek O’Brien rose to asserted that he had given notice under Rule 267 for adjournment to take up an important issue, the Chairman said he had declined permission to the notices from TMC (Trinamool), Akali Dal, TDP and some other parties. He snubbed AAP member Dr Sushil Gupta, telling him not to speak without permission and advising him to give notice in other form and he would definitely examine it positively.\nWhen O’Brien said he wanted to raise the issue where the Governor of a state is writing directly…. (interruptions), the Chairman told him not to take name of the Governor. He pleaded to place it on the table, but it was ruled that it will not go on record.\nWhen CPI(M) member Tapan Kumar Sen tried to speak, the Chairman said he was not permitted. O’Brien again tried, pleading with the Chairman: “Sir, allow us to explain.”\nHis Trinamool MPs also got up to plead for allowing him to speak when the Chairman surprised all by stating that “you do not want the House to run” and adjourned it up to 2 pm.", "url": "https://www.freepressjournal.in/latest-news/opposition-says-its-voice-is-being-muzzled-boycotts-rs/1216715", "label": 1}