{"authors": ["Scroll Staff"], "date_download": "2019-03-27 14:18:25", "date_modify": "2019-03-27 14:18:25", "date_publish": "2017-11-23 10:20:51", "description": "Sudip Datta Bhaumik was shot dead at the Tripura State Rifles’ 2nd battalion headquarters in RK Nagar on the outskirts of Agartala on Tuesday.", "filename": "latest_858920_tripura-newspapers-leave-editorials-blank-to-protest-journalists-killing_1553696305.html", "image_url": "https://d1u4oo4rb13yy8.cloudfront.net/book/74556-cwhkmsfmrj-1511412386.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/scroll.in/latest_858920_tripura-newspapers-leave-editorials-blank-to-protest-journalists-killing_1553696305.html", "title": "Tripura newspapers leave editorials blank to protest journalist’s killing", "title_page": "Tripura: Newspapers leave editorials blank to protest killing of journalist Sudip Datta Bhaumik", "title_rss": "NULL", "source_domain": "scroll.in", "text": "Leading newspapers in Tripura on Thursday left their editorials blank to protest the killing of 51-year-old crime reporter Sudip Datta Bhaumik on Tuesday.\nBhaumik was shot dead at the Tripura State Rifles’ 2nd battalion headquarters in RK Nagar on the outskirts of Agartala on Tuesday. The police have arrested battalion commandant Tapan Debbarma and his personal security guard Nanda Reang, who allegedly fired the shots at the journalist.\nJournalists’ organisations staged protests near Chief Minister Manik Sarkar’s home after the killing. Governor Tathagata Roy said he would meet Union Home Minister Rajnath Singh in Delhi on Wednesday and submit a report to him on the murder.\nThe Left government has transferred the case from the district police to the Crime Investigation Department of the state police.\nThe Bharatiya Janata Party and Congress have called for a statewide shutdown on Thursday, but the ruling Communist Party of India (Marxist) opposed the strike. “The ‘bandh’ called by BJP is totally undemocratic,” a CPI(M) statement said according to the Hindustan Times. “It will hamper normal lives and especially, the annual examinations started in schools and revision of electoral rolls for the coming assembly polls.”\nBhaumik’s colleagues link his murder to a story he had recently written for the Syandan Patrika, the Bengali language newspaper he worked for. The story was published on November 2 and “exposed corruption worth Rs 10 crore on the part of Debbarma”, said the newspaper’s editor Subal Dey.\nBhaumik is the second journalist to be killed in Tripura in the past two months.", "url": "https://scroll.in/latest/858920/tripura-newspapers-leave-editorials-blank-to-protest-journalists-killing", "label": 1}