{"authors": ["Scroll Staff"], "date_download": "2019-03-27 14:35:38", "date_modify": "2019-03-27 14:35:38", "date_publish": "2017-08-07 20:21:39", "description": "Nearly 2,000 police officers present at the spot in Dhar district allegedly used force against the agitators.", "filename": "latest_846435_madhya-pradesh-medha-patkar-5-others-detained-during-their-fast-against-sardar-sarovar-dam-project_1553697338.html", "image_url": "https://d1u4oo4rb13yy8.cloudfront.net/book/65103-qoysqthiab-1502116695.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/scroll.in/latest_846435_madhya-pradesh-medha-patkar-5-others-detained-during-their-fast-against-sardar-sarovar-dam-project_1553697338.html", "title": "Medha Patkar, five other Narmada Bachao Andolan activist detained in Madhya Pradesh", "title_page": "Medha Patkar, five other Narmada Bachao Andolan activist detained in Madhya Pradesh", "title_rss": "NULL", "source_domain": "scroll.in", "text": "Activist and founder of the Narmada Bachao Andolan Medha Patkar was taken to a hospital in Indore on Monday, soon after she was detained in Madhya Pradesh’s Dhar district while protesting against the Sardar Sarovar Dam. Five others were also taken into custody as their hunger strike demanding rehabilitation of those displaced by the project entered its 12th day.\nSix other activists in Dhar said they will continue their fast, and that those detained will also carry on their hunger strike in custody.\nNearly 2,000 police officers were deployed at the protest site. They allegedly used force against the agitators, with some even claiming that the police had manhandled a few women protestors when they tried to stop Patkar from being detained. The police allegedly broke the stage and tents set up as well as chairs. It claimed that the police came armed with batons with pins on them to control the protests.\nPatkar and 11 others began their hunger strike in Dhar’s Chikalda village on July 27. They alleged that nobody from the state or central government had held any dialogue with the protestors.\nNarmada Bachao Andolan’s statement\nThe organisation alleged that a heavy police force had mobilised at the strike site in the morning, and by evening they had started to baton charge the fasting protestors. “There was no attempt to talk to the protestors sitting on fast against the illegal and unjust drowning, and forceful eviction of more than 40,000 families in Narmada Valley residing there without complete and just rehabilitation,” it said in a statement.\nNarmada Bachan Andolan accused Madhya Pradesh Chief Minister of being anti-farmer and anti-tribals. It is a “government known for killing their own people, they have blood on their hands”, the statement added.\nThe organisation condemned the police action, and demanded that those detained be immediately released.\nIs violence the new normal for @ChouhanShivraj after Mandsaur. How shameful? We need dialogue not violence. #Istandwdmedhapatkar pic.twitter.com/y6p4S12S8x — NarmadaBachaoAndolan (@NarmadaBachao) August 7, 2017\nDhar (MP): Medha Patkar, on hunger strike demanding rehabilitation of those displaced by Sardar Sarovar Dam forcibly taken away by Police pic.twitter.com/DaLqJCoAHR — ANI (@ANI_news) August 7, 2017\nNarmada Bachao Andolan\nThe Narmada Bachan Andolan is a movement against the dams built across the Narmada through Gujarat, Madhya Pradesh and Maharashtra. The Madhya Pradesh government had asked the residents of nearby districts to move to safer places by July 31, keeping in mind the closure of gates of the dam and increasing its height to 138 metre. This will result in areas such as Dhar, Barwani and other districts to be submerged.\nThe Narmada Bachan Andolan has claimed that more than 40,000 families across 190 villages in Madhya Pradesh have been left out of the rehabilitation plan. They have further alleged that the rehabilitation centres lacked basic facilities and were not habitable.\nThe state government, however, claimed that the rehabilitation sites were complete with basic facilities. “Around 65% of the villagers have shifted to the new sites after accepting compensation, which was way above what was decided by the tribunal and the courts,” Divisional Commissioner Sanjay Dubey had told The Times of India.", "url": "https://scroll.in/latest/846435/madhya-pradesh-medha-patkar-5-others-detained-during-their-fast-against-sardar-sarovar-dam-project", "label": 1}