{"authors": [], "date_download": "2019-03-27 14:29:02", "date_modify": "2019-03-27 14:29:02", "date_publish": "2017-07-02 14:16:12", "description": "Most traders and restaurants in Uttar Pradesh were caught unprepared to implement the Goods and Services Tax system that came into effect from July 1", "filename": "lucknow_gst-effect-up-traders-face-teething-troubles_story-3odarLUbTGwxXPjZ6NYuyJ_1553696942.html", "image_url": "https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2017/07/02/Pictures/_95565b88-5f01-11e7-a7a5-fdf01393e65b.JPG", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/hindustantimes.com/lucknow_gst-effect-up-traders-face-teething-troubles_story-3odarLUbTGwxXPjZ6NYuyJ_1553696942.html", "title": "GST effect: UP traders face ‘teething troubles’", "title_page": "GST effect: UP traders face ‘teething troubles’ | lucknow | Hindustan Times", "title_rss": "NULL", "source_domain": "hindustantimes.com", "text": "Barring a few big stores, most traders and restaurants in Uttar Pradesh were caught unprepared to implement the Goods and Services Tax (GST) system that came into effect from July 1.\nMost of them had not even configured and modified their billing software in accordance with the new tax rates. Consequently, many dealers issued manual cash memos to consumers while others preferred to keep their establishments closed waiting for the billing software to be changed by Saturday evening or Sunday.\nExpert private agencies that update the billing software and then link it with commercial tax department’s central billing server were also overburdened, said sources. This was also one of the reasons behind the delay in the switch over.\nMany businessmen even cited confusion over last minute changes in the GST rates by the Centre and lack of proper official communication on the issue by either state or Union government, as one of the reasons behind their unpreparedness.\nChikan traders in Lucknow protesting against GST ( HT Photo )\nSample this: Ritz, a prominent restaurant in Mahanagar, issued manual bills to consumers as their software was not updated in accordance with the GST. “Manual bills are being issued as we have not been able to update our billing software largely due to late intimation about the final GST rates,” said Mohan, an employee. “But the GST is welcome move,” he added.\nNand Kumar of the busy Mamta Medical store at Bhootnath also said he was issuing manual bills to customers. “We are waiting for our agent to come to update our billing software and till then we are issuing manual bills as per the GST rates,” he said.\nAgarwal Mobile dealer, Bhootnath, Universal Book Sellers, Mahanagar and the Veg Express (restaurant) all had similar stories to share.\nRead more | GST rollout: Bandh, protests in UP greet new tax regime\nHowever, a hotel owner, who did not wish to be identified, said contrary to the claims the GST had complicated the tax system by prescribing different rates for the same commodity. “For example, same food will be taxed on different slabs at a non-AC, AC and five star restaurants. Similarly a hotel will have to tax room rental differently depending on the tariff amount,” he said. According to him lack of preparedness both on the part of the state government and traders might make things difficult during the transition period.\nBig stores, on the other hand were better prepared for the D-Day. “We had got our software updated well in advance everything going on smoothly without any confusion or dispute,” said an executive at the Big Bazaar at Saharaganj. The situation was same at the Spencers.\nHowever, despite protests against the GST by some traders’ bodies and confusion on the first day, businessmen in general were all praise for the new tax system, which they believed was a win-win situation for all.\nUttar Pradesh Adarsh Vyapar Mandal president, Sanjay Gupta said, “What we saw on the first day of the GST is nothing but teething problems and things will become normal very soon, he said. The GST, he stressed, promised a lot of hope for the country’s economy. “The opposition by some traders is politically motivated or is a result of their ignorance,” he said.\nFirst Published: Jul 02, 2017 14:16 IST", "url": "https://www.hindustantimes.com/lucknow/gst-effect-up-traders-face-teething-troubles/story-3odarLUbTGwxXPjZ6NYuyJ.html", "label": 1}