{"authors": [], "date_download": "2019-03-27 14:35:42", "date_modify": "2019-03-27 14:35:42", "date_publish": "2018-09-04 00:00:00", "description": "Nearly 35 organizations have called for a 'Bharat bandh' against the SC/ST Amendment Bill passed in the Parliament last month.", "filename": "madhya-pradesh_sc_st-act-amendments-bandh-on-september-6-prohibitive-orders-issued-in-mp-2138616_1553697342.html", "image_url": "https://english.cdn.zeenews.com/sites/default/files/2018/09/04/717573-reservation.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/zeenews.india.com/madhya-pradesh_sc_st-act-amendments-bandh-on-september-6-prohibitive-orders-issued-in-mp-2138616_1553697342.html", "title": "SC/ST Act amendments: 'Bharat Bandh' on September 6; prohibitive orders issued in MP", "title_page": "SC/ST Act amendments: 'Bharat Bandh' on September 6; prohibitive orders issued in MP | Madhya Pradesh News", "title_rss": "NULL", "source_domain": "zeenews.india.com", "text": "Bhopal: The Madhya Pradesh police have stepped up security across the state in view of the ongoing protests against the amendments in the SC/ST (Prevention of Atrocities) Act.\nNearly 35 organizations have called for a 'Bharat bandh' against the SC/ST Amendment Bill passed in the Parliament last month.\nThe administration has imposed prohibitive orders under CrPC in four districts- Morena, Shivpuri and Bhind, all three in Gwalior-Chambal region, as well as in Ashok Nagar district in view of the proposed bandh.\nGwalior-Chambal region, one of the sensitive areas, had witnessed a large-scale violence on April 2 this year during the 'bharat bandh' called by Dalit groups.\nMakrand Deuskar, Inspector General of Police (Intelligence) told reporters today, \"Police headquarters have alerted all the superintendents of police in view of proposed bandh on September 6.\"\nPolice have been directed to contact the groups holding protests&do arrangements as per scheduled program. If needed, police can also carry out restrictive proceedings: Makrand Deuskar, IG Law&Order on Bharat Bandh called against amendments of SC/ST Act on Sept 6. #MadhyaPradesh pic.twitter.com/3UBbkVe50S — ANI (@ANI) September 4, 2018\nHe said the police force allotted to the districts on the occasion of Krishna Janmashtami yesterday, would continue to remain deployed.\nMadhya Pradesh has witnessed protests against the ruling party leaders at various places in the past few days.\n\"In view of proposed Bharat Bandh on September 6, the prohibitive orders under CrPC section 144 have been imposed in the district,\" Bhind District Collector Ashish Gupta said in a press note.\n\"It is necessary to impose section 144 this time as the law and order situation in the district was disturbed on April 2 this year when some organisations had given the call of 'Bharat bandh',\" he said.\nThe collectors in Shivpuri and Morena districts have also imposed prohibitive orders under CrPC section 144.\nBrahma Samagam Sawarna Jankalyan Sangathan's national president Dharmendra Sharma said that about 150 organisations of upper castes and OBCs would participate in the Bharat bandh against the amendments in SC/ST Act.\n\"We will protest peacefully on September 6. Through this protest, we will demand withdrawal of this black law. All the sections except SC/ST are affected due to this amendment. We will also write letters to all MPs of the country,\" Sharma said.\nFormer Union Minister and senior BJP OBC leader Prahlad Patel expressed his displasure over the protests.\n\"The role of people from the OBC community has become all the more important in this scenario. For centuries, the OBCs have been acted as a bridge between upper castes and scheduled castes and they will continue to play this role actively in future,\" he said.\nProtests have been going on against the amendments in SC/ST Bill in parts of the state since the past one week.\nThe protesters staged a demonstration outside the bungalows of Union minister Narendra Singh Tomar at Gwalior and Member of Parliament (MP) Bhagirath Prasad at Bhind.\nThe protesters also staged a demonstration at Higher Education Minister Jaibhan Singh Pawaiya's bungalow at Gwalior.\nThe protesters also showed black flags to Union ministers Thawar Chand Gehlot and M J Akbar at Guna and Vidisha respectively. Several other protests were also organised across the state.\nEarlier this year, the apex court had removed the strict provision of mandatory arrests under the Act.\nThis decision had triggered nationwide protests by Scheduled Castes organisations, forcing the Centre to bring an amendment to the Act during the Monsoon Session to overrule the SC order.", "url": "https://zeenews.india.com/madhya-pradesh/sc/st-act-amendments-bandh-on-september-6-prohibitive-orders-issued-in-mp-2138616.html", "label": 1}