{"authors": [], "date_download": "2019-03-27 14:29:05", "date_modify": "2019-03-27 14:29:05", "date_publish": "2016-11-25 05:32:00", "description": null, "filename": "metros_mumbai_251116_jnusu-members-hit-mumbai-streets-over-missing-student_1553696945.html", "image_url": "https://s3.ap-southeast-1.amazonaws.com/images.asianage.com/images/aa-Cover-nt2d4r3o3gvktpdn2fomd8hm26-20161125020113.Medi.jpeg", "language": null, "localpath": "/home/raj/news-please-repo//data/2019/03/27/asianage.com/metros_mumbai_251116_jnusu-members-hit-mumbai-streets-over-missing-student_1553696945.html", "title": "JNUSU members hit Mumbai streets over missing student", "title_page": "JNUSU members hit Mumbai streets over missing student", "title_rss": "NULL", "source_domain": "asianage.com", "text": "The protest was organised by JNU students and the Joint Action Committee (JAC) for Social Justice from the city.\nJoint Action Committee for Social Justice members and JNU students take out a rally from Kurla to Mumbai University’s Kalina campus on Thursday. (Photo: Mrugesh Bandiwadekar)\nMumbai: Members of the Jawaharlal Nehru University students’ union (JNUSU) held a protest rally starting from Kurla Pipe Road to the University of Mumbai’s Kalina campus on Thursday, demanding action in the missing case involving biotechnology student Najeeb Ahmad. Mr Ahmad (27) went missing on October 14 after an alleged altercation with members from the RSS-backed Akhil Bharatiya Vidyarthi Parishad (ABVP). It has been 38 days since he went missing.\nThe protest was organised by JNU students and the Joint Action Committee (JAC) for Social Justice from the city, following similar protests held in Delhi. The JAC’s demands include the arrest of “ABVP goons” and the resignation of the JNU vice-chancellor.\nTalking to The Asian Age, a senior member of the JAC, Ajmal Khan, said, “It’s been a month since Najeeb went missing. The investigating agencies couldn’t trace him; that’s the reason we held the protest stressing our vital demands.”\nMr Khan further said: “Our main demands are: we want the vice-chancellor of JNU to resign, we need faster updates on the whereabouts of Najeeb. The investigating agencies have failed to nab the culprits, and we think these people are hand-in-glove with the ABVP in a conspiracy to make Najeeb invisible.”\nMr Ahmad, a student of the School of Biotechnology and a native of Badaun in Uttar Pradesh, went missing on October 14, following an on-campus scuffle allegedly with the members of ABVP the night before.\nNajeeb’s mother and sister on Wednesday once again joined 50 JNU students in the march to protest against his disappearance from campus. Students have been holding protests for over a month over the issue, both inside and outside the JNU campus.", "url": "https://www.asianage.com/metros/mumbai/251116/jnusu-members-hit-mumbai-streets-over-missing-student.html", "label": 1}