{"authors": [], "date_download": "2019-03-27 14:18:25", "date_modify": "2019-03-27 14:18:25", "date_publish": "2018-05-19 05:42:00", "description": null, "filename": "metros_mumbai_190518_cong-observes-save-democracy-protest-on-friday_1553696305.html", "image_url": "https://s3.ap-southeast-1.amazonaws.com/images.asianage.com/images/aa-Cover-6g98slub5mf36hjul7r8te5lu6-20180519021149.Medi.jpeg", "language": null, "localpath": "/home/raj/news-please-repo//data/2019/03/27/asianage.com/metros_mumbai_190518_cong-observes-save-democracy-protest-on-friday_1553696305.html", "title": "Cong observes ‘Save Democracy’ protest on Friday", "title_page": "Cong observes ‘Save Democracy’ protest on Friday", "title_rss": "NULL", "source_domain": "asianage.com", "text": "The BJP won 104 seats in the Karnataka Assembly election, and is eight short of the majority mark of 112.\nMUMBAI: The Maharashtra Congress on Friday held a “Save Democracy” protest across the state, in the backdrop of the manner in which events unfolded in Karnataka after the Assembly election results were announced. Alleging that the Karnataka governor was biased towards the BJP in giving it a chance to form the government, Congress state president Ashok Chavan said that this was dangerous for democracy.\nMr Chavan said that Karnataka governor Vajubhai Vala’s decision to invite BJP leader B.S. Yeddyurappa to form the government showed that he was acting under pressure from the Modi-led central government.\n“Politics is taking place from the (Karnataka) Raj Bhavan,” Mr Chavan said while addressing the “Save Democracy” protest. “Mr Vala’s decision to invite Mr Yeddyurappa to form the government shows that he is acting under pressure from the Modi-led central government,” the Maharashtra Pradesh Congress Committee president said.\nThe Congress on Friday observed the “Save Democracy” protest across the country. Mr Chavan joined Mumbai Regional Congress Committee president Sanjay Nirupam and party workers at the protest near the “Amar Jawan Jyoti”.\nMr Chavan said, “The role of a governor should be neutral and unbiased but unfortunately, that is not the case in Karnataka. We believe in democracy.” Mr Chavan welcomed the Supreme Court’s order for a floor test in the Karnataka Assembly at 4pm on Saturday, drastically slashing the 15-day window given by the governor to Mr Yeddyurappa to prove majority.\nThe BJP won 104 seats in the Karnataka Assembly election, and is eight short of the majority mark of 112. However, governor Vala decided to invite the BJP to form the state\ngovernment.", "url": "https://www.asianage.com/metros/mumbai/190518/cong-observes-save-democracy-protest-on-friday.html", "label": 1}