{"authors": [], "date_download": "2019-03-27 14:40:51", "date_modify": "2019-03-27 14:40:51", "date_publish": "2015-08-19 00:00:00", "description": "The award ceremony was held at Raj Bhavan in Mumbai amidst tight security after the BJP-led state government's decision to honour Purandare received criticism from some sections of the Maratha community, which had protested against the move.", "filename": "mumbai_maharashtra-confers-_b75c18a5741081d30598898af28b365c_story-MVvOw9Z9rXkAe7nWnWzDHL_1553697651.html", "image_url": "https://www.hindustantimes.com/rf/image_size_640x362/HT/p2/2015/08/19/Incoming/Pictures/babasaheb-purandare_076a39be-4691-11e5-a8da-005056b4648e.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/hindustantimes.com/mumbai_maharashtra-confers-_b75c18a5741081d30598898af28b365c_story-MVvOw9Z9rXkAe7nWnWzDHL_1553697651.html", "title": "Maharashtra confers state's highest honour on writer Purandare", "title_page": "\nMaharashtra confers state's highest honour on writer Purandare\n | mumbai | Hindustan Times", "title_rss": "NULL", "source_domain": "hindustantimes.com", "text": "Historian and writer Balwant Moreshwar Purandare was on Wednesday conferred with the 'Maharashtra Bhushan' award, the state's highest honour, at a function in Mumbai.\nThe award ceremony was held at Raj Bhavan in Mumbai amidst tight security after the BJP-led state government's decision to honour Purandare received criticism from some sections of the Maratha community, which had protested against the move.\nThe ceremony was attended by chief minister Devendra Fadnavis, Shiv Sena MPs Arvind Sawant, Sanjay Raut, state cultural affairs minister Vinod Tawde, industries minister Subhash Desai and Mumbai mayor Snehal Ambekar among other dignitaries.\nWhile addressing the audience after receiving the award, Purandare said that he would donate the prize money of Rs 10 lakh to the Master Dinanath Mangeshkar Hospital located at Pune.\nIn addition, Purandare also plans to donate Rs 15 lakh to the hospital as his own contribution.\n\"I will add my 15 lakh to the award money and donate entire 25 lakh to Mangeshkar hospital for cancer care,\"announces Purandare@HTMumbai — shailesh gaikwad (@shailesh505) August 19, 2015\nPurandare said that he would like to help farmers reeling under severe financial distress in the drought-hit Marathwada region.\nUsing the opportunity to take a dig at the opposition, Fadnavis said that those who have been protesting against the government's decision have not understood Chhatrapati Shivaji.\n\"I have to clarify that this programme was not held at the Raj Bhavan because we got scared of anybody. According to tradition, the country's biggest awards are given by the President at the Rashtrapati Bhavan. Similarly, since this was the state's biggest award, we decided to hold it here,\" Fadnavis said. Fadnavis said the Maharashtra government would provide financial support to those who make movies focusing on Shivaji's work as a \"management guru\".\nHT column | Award to Babasaheb Purandare: Political row over Shivaji, once again\nMeanwhile, protestors claimed that Purandare tarnished the image of Maratha king Chhatrapati Shivaji by casting aspersions on the warrior king's parentage and the role played by his guru Dadaji Konddev.\nOn Tuesday, members of the Maratha group Sambhaji Brigade, had vandalised Maharashtra minister of state for home Ram Shinde's office in Ahmednagar district to protest against the decision to confer the award on Purandare.\nPurandare, who is referred to as \"Shiv Shahir\" or 'Shivaji's poet', has also being criticised for assisting controversial American author James Laine write his book 'Shivaji: Hindu King in Islamic India', which had allegedly made controversial inferences about Shivaji's mother Jijabai and his mentor Dadaji Konddev.\nPurandare, who was born on 19 August, 1921, started writing about the life of Shivaji from a very young age.\nHe is known for his books like Raja Shiv Chhatrapati, Purandaryanchi Daulat, Purandaryanchi Naubat and Gadsanch which are considered masterpieces on the life and times of the 16th century Maratha warrior king.\nWhile the Congress and the NCP opposed the Maharashtra government's decision to give him the award, the BJP, the Shiv Sena and the MNS backed the move.\nNCP MP from Satara Udayanraje Bhosle, who is also a descendant of Shivaji, recently asked the state government to put off the award ceremony until allegations against Purandare are verified.\nAccusing NCP supremo Sharad Pawar of playing caste politics, MNS president Raj Thackeray had said that the Maratha strongman is indulging in dirty politics over the issue.\nMeanwhile, the Bombay high court rejected a petition today, seeking a direction to the Maharashtra state government to withdraw its decision to confer the award on Purandare and it also also imposed a cost of Rs 10,000 on petitioners.\nAlso read: HC rejects plea against Maharashtra Bhushan award to Purandare\nFirst Published: Aug 19, 2015 21:51 IST", "url": "https://www.hindustantimes.com/mumbai/maharashtra-confers-state-s-highest-honour-on-writer-purandare/story-MVvOw9Z9rXkAe7nWnWzDHL.html", "label": 1}