{"authors": [], "date_download": "2019-03-27 14:40:52", "date_modify": "2019-03-27 14:40:52", "date_publish": "2015-09-15 06:16:00", "description": null, "filename": "mumbai_106-places-witness-ncp-s-jail-bharo-114_1553697652.html", "image_url": "https://www.asianage.com/AA-Fevicon/fevicon.png", "language": null, "localpath": "/home/raj/news-please-repo//data/2019/03/27/asianage.com/mumbai_106-places-witness-ncp-s-jail-bharo-114_1553697652.html", "title": "106 places witness NCP’s ‘jail bharo’", "title_page": "106 places witness NCP’s ‘jail bharo’", "title_rss": "NULL", "source_domain": "asianage.com", "text": "NCP supporters during a protest demanding relief package for drought-hit Marathwada farmers, at Azad Maidan on Monday —Debasish Dey\nNCP supporters during a protest demanding relief package for drought-hit Marathwada farmers, at Azad Maidan on Monday —Debasish Dey\nThe NCP, led by Sharad Pawar, organised a statewide ‘jail bharo’ protest against Devendra Fadnavis-led BJP government at almost 106 places on Monday. The party has claimed that around 2.5 lakh farmers participated in the agitations led by various leaders of the party in eight different districts. Significantly, senior leader and former deputy chief minister Ajit Pawar did not participate in any of the demonstrations.\nThe party is supposed to continue its agitation for drought-affected farmers on September 15 and 16 in four districts of North Maharashtra and Ahmednagar district respectively. The agitation was organised against the alleged apathy of the government towards drought-hit farmers. This is the first occasion since formation of the NCP that party workers have to come down on streets for any agitation.\nWhile party cadres were arrested in various districts, senior leaders Ajit Pawar and state NCP president Sunil Tatkare were found sitting at the party headquarters. When asked, Mr Tatkare said that they were asked to coordinate with leaders leading the protests.\n“Party chief Sharad Pawar has directed both of us (Sunil Tatkare and Ajit Pawar) to coordinate with leaders leading protests at various places. There has to be some coordination to avoid chaos,” Mr Tatkare replied.\nThe absence of both the leaders from all the protests sites was seen as a deliberate attempt as both have been summoned by the Special Investigation team (SIT) of the Anti-Corruption Bureau (ACB) probing into the irrigation scam, which was refuted by Mr Tatkare.\nThe protests were carried out by former state Assembly speaker Dilip Walse Patil at Aurangabad, Supriya Sule and Rajesh Tope at Jalna, Rajesh Kshirsagar at Beed, Dhananjay Munde at Parbhani, Padmsingh Patil at Osmanabad, Jayant Patil at Latur, Anil Deshmukh at Nanded and Shashikant Shinde at Hingoli district. All these districts are badly affected with drought and have been facing severe water scarcity problem.\nA symbolic protest was also organised in Mumbai that was led by Mumbai president Sachin Ahir.\nMr Tatkare informed that they would be continuing with ‘jail bharo’ agitation even on Tuesday and Wednesday but at different districts. “Party leaders will protest against the government at Dhule, Nashik, Nandurbar and Jalgaon district on September 15 while on September 16 a similar agitation would be held in Ahmednagar district.\nThe NCP leader agreed that some parts of Marathwada have started receiving rains since the last four days but argued the farmers’ crops have been destroyed and they need government’s aid to sow Rabi crops.", "url": "https://www.asianage.com/mumbai/106-places-witness-ncp-s-jail-bharo-114", "label": 1}