{"authors": [], "date_download": "2019-03-27 14:35:33", "date_modify": "2019-03-27 14:35:33", "date_publish": "2019-02-03 15:31:44", "description": "Shiv Sena President Uddhav Thackeray on Sunday appealed to the BJP-led Maharashtra government to intervene in Anna Hazare's hunger strike and asked it not to", "filename": "mumbai_uddhav-thackeray-urg_251b51b2ca87bdd5df33ce43b3b5fdf2_1451134_1553697333.html", "image_url": "https://www.freepressjournal.in/wp-content/uploads/2018/06/UddhavPK28.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/freepressjournal.in/mumbai_uddhav-thackeray-urg_251b51b2ca87bdd5df33ce43b3b5fdf2_1451134_1553697333.html", "title": "Uddhav Thackeray urges Maharashtra government to intervene in Anna Hazare's hunger strike", "title_page": "Uddhav Thackeray urges Maharashtra government to intervene in Anna Hazare's hunger strike", "title_rss": "NULL", "source_domain": "freepressjournal.in", "text": "Mumbai: Shiv Sena President Uddhav Thackeray on Sunday appealed to the BJP-led Maharashtra government to intervene in Anna Hazare’s hunger strike and asked it not to “play” with the social activist’s life. As Hazare’s indefinite fast over demand for immediate appointment of anti-corruption watchdogs at the Centre and in Maharashtra entered the fifth day, Thackeray in a statement expressed concern over the 81-year-old activist’s health condition.\nHe dubbed a purported letter from the Prime Minister’s Office (PMO) conveying good wishes to Hazare as “condemnable” and “laughable”. Supporters of Hazare had claimed that the Gandhian had received a “cold response” from the Prime Minister’s Office (PMO) in response to a letter sent by the activist.\nThe Sena president said Hazare’s fight was against corruption – a problem faced by the country. He asked Hazare to take to the streets in this fight to create an awakening among people, instead of giving up his life by fasting. “At present, people in the country have been given anaesthesia and the need is to bring them out of this situation,” he said in remarks laced with sarcasm.\nHazare should don the role of freedom activist Jayaprakash Narayan to usher in a new revolution, he said. Thackeray said activist G D Agrawal had sat on a huge protest in Haridwar district of Uttarakhand over his demand to clean Ganga and maintain free flow of the river.\n“But, the government did not take note of the situation and let Prof Agrawal die. Anna should give up his fast and lead an agitation over his demands, and I assure Shiv Sena’s support wherever possible.” On the fifth day of Hazare’s fast, his supporters blocked the Ahmednagar-Pune state highway at Supa village in Maharashtra, causing huge traffic jams there.\nDr Dhananjay Pote, who conducted a health check-up of Hazare in the morning, said the anti-graft crusader has lost around 3.8 kg weight in the last five days and that his blood pressure, blood sugar and creatinine level urine have gone up. Hazare has been sitting on the fast at his native Ralegan Siddhi village in Ahmednagar.\nHe has been demanding immediate appointment of Lokpal at the Centre and Lokayuktas in states where such statutory anti-corruption watchdogs do not exist, implementation of the Swaminathan Commission recommendations on ways to address agrarian distress, besides some electoral reforms.\nG D Agrawal, 86, had died of a heart attack at the All India Institute of Medical Sciences in Uttarakhand’s Rishikesh, in October last year, 111 days after he began a fast for a pollution-free Ganga. The Shiv Sena is an ally of the BJP at the Centre and in Maharashtra.", "url": "https://www.freepressjournal.in/mumbai/uddhav-thackeray-urges-maharashtra-government-to-intervene-in-anna-hazares-hunger-strike/1451134", "label": 1}