{"authors": ["Manasi Phadke"], "date_download": "2019-03-27 14:40:37", "date_modify": "2019-03-27 14:40:37", "date_publish": "2017-06-07 10:59:51", "description": "Mumbai city news: The supply of vegetables has been steadily increasing at Nashik, Pune and Navi Mumbai markets, say relieved consumers", "filename": "mumbai-news_maharashtra-far_a64ccb0ded1fdd54ab48a548d3dcfe29_story-VONVg30nGHEHqen7aOITeL_1553697637.html", "image_url": "https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2017/06/07/Pictures/_408c5c16-4b41-11e7-88f6-6a3facb665a5.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/hindustantimes.com/mumbai-news_maharashtra-far_a64ccb0ded1fdd54ab48a548d3dcfe29_story-VONVg30nGHEHqen7aOITeL_1553697637.html", "title": "Maharashtra farmers’ strike: Groups will stage mute protests to taunt ‘deaf’ BJP", "title_page": "Maharashtra farmers’ strike: Groups will stage mute protests to taunt ‘deaf’ BJP | mumbai news | Hindustan Times", "title_rss": "NULL", "source_domain": "hindustantimes.com", "text": "Farmers in Maharashtra will continue their strike for the seventh day in a row. Their demands? A complete loan waiver and minimum support prices for their produce. The agitation, initially meant as a week-long stir, started on June 1. A 21-member core committee will meet in Nashik tomorrow to decide what farmers’ next step should be.\nFarmers’ groups are planning to stage mute protests in a few districts on Wednesday, as a taunt to the Bharatiya Janata Party (BJP)-led Maharashtra government, which has been “deaf” to their demands so far. A few groups have demanded that the state legislature hold a special session to hammer out a bailout package for the farmers.\nThe supply of vegetables, which had taken a hit over the past few days, leading to increased prices, has now started steadily increasing in markets at Nashik, Pune and Navi Mumbai. Rates have reduced, say relieved consumers.\nThe Maharashtra government has issued orders in Pune, Nashik and Kolhapur banning the assembly of five or more people after a similar stir in Mandasur district in Madhya Pradesh resulted in violence on Tuesday. Shots were fired during a farmers’ protest, killing five people and injuring a dozen more. The state’s prohibitory orders will remain in effect till June 16 in Pune, June 17 in Kolhapur and June 19 in Nashik.\nBJP ministers held a late-night meeting at chief minister Devendra Fadnavis’ official residence, Varsha, to discuss the impact of their ‘Shivar Samvad’ initiative — a four-day programme to reach out to farmers in Maharashtra. The move comes ahead of a cabinet meeting on Wednesday morning and BJP president Amit Shah’a visit to the state on June 16.\nMeanwhile, tensions between warring allies, the BJP and the Shiv Sena, have escalated over the farmers’ agitation. The Shiv Sena has supported farmers’ protests, bitterly criticising the Devendra Fadnavis-led government, of which it is a part, over its farm policies. Shiv Sena ministers are likely to corner the government over this issue during the cabinet meeting.\nThe Shiv Sena lashed out at the state government again on Wednesday over the Fadnavis’ remarks that he would only talk to “real farmers”. Fadnavis termed protesting farmers “political figures”. In an editorial in the party’s mouthpiece, Saamana, the Sena said, “We have a suggestion. Only real farmers in the state government should talk to farmers’ leaders. Do you have even one real farmer in your cabinet? Don’t simply talk about farmers’ welfare.”\nFirst Published: Jun 07, 2017 10:59 IST", "url": "https://www.hindustantimes.com/mumbai-news/maharashtra-farmers-strike-groups-will-stage-mute-protests-to-taunt-deaf-bjp/story-VONVg30nGHEHqen7aOITeL.html", "label": 1}