{"authors": ["Faisal Malik"], "date_download": "2019-03-27 14:40:28", "date_modify": "2019-03-27 14:40:28", "date_publish": "2017-06-01 09:01:10", "description": "Mumbai city news: Cities such as Mumbai and Pune are likely to face a shortage of vegetables, milk and fruits owing to the strike", "filename": "mumbai-news_watch-i-maharas_ea61eaf1bc7792f6c38dff90580cbf08_story-RkNOT6jceVq9On5TtrH4xL_1553697628.html", "image_url": "https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2017/06/01/Pictures/_fe892e50-4679-11e7-ae7e-b192f5497e3d.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/hindustantimes.com/mumbai-news_watch-i-maharas_ea61eaf1bc7792f6c38dff90580cbf08_story-RkNOT6jceVq9On5TtrH4xL_1553697628.html", "title": "WATCH I Maharashtra farmers spill milk on highway, protest may hit supplies to Mumbai", "title_page": "WATCH I Maharashtra farmers spill milk on highway, protest may hit supplies to Mumbai  | mumbai news | Hindustan Times", "title_rss": "NULL", "source_domain": "hindustantimes.com", "text": "Two tankers of milk heading towards Mumbai were damaged as farmers from several districts in Maharashtra started their strike on Thursday.\nSome farmers also opened the taps of tankers carrying milk in Goregaon in Nagar district to let it flow. Watch the protest, here\nCities such as Mumbai and Pune are likely to face a shortage of vegetables, milk and fruits as farmers from several districts in Maharashtra announced the strike after talks between chief minister Devendra Fadnavis and their representatives failed on Tuesday.\nThis is probably the first time farmers have resorted to a strike in the state. Distressed over falling prices of agriculture produce and other issues, farmers have demanded a loan waiver and the state government has sought time for deliberation on the issue.\nA damaged truck ( HT )\nWestern Maharashtra is being seen as the region worst affected with the strike where milk tankers were emptied and vegetables were thrown on roads. According to reports, in Ahmednagar, Niphad and Sangamner farmers emptied milk tankers on roads wasting hundreds of litres of milk. Similarly, in Daund near Pune vegetables were thrown on roads.\nA protest in Pune. ( HT )\nKisan Kranti Morcha has already declared they will forcefully stop those who don’t participate in the strike.\n“We want to create shortage of milk and vegetables in the cities to pressurise the state government,” said Jayaji Suryavanshi, a member of the steering committee of the Morcha.\n“We will also stop farmers from supplying agriculture produce to any city. We have made certain preparations to achieve this,” Suryavanshi said.\nThe state government has been under pressure to waive off farm loans as the Bharatiya Janata Party-led Uttar Pradesh government declared a loan waiver.\nFirst Published: Jun 01, 2017 09:01 IST", "url": "https://www.hindustantimes.com/mumbai-news/watch-i-maharashtra-farmers-protest-let-milk-from-tankers-flow-on-roads-mumbai-supplies-may-be-hit/story-RkNOT6jceVq9On5TtrH4xL.html", "label": 1}