{"authors": [], "date_download": "2019-03-27 14:29:14", "date_modify": "2019-03-27 14:29:14", "date_publish": "2018-05-17 10:09:00", "description": null, "filename": "nation_current-affairs_170518_bjp-rejoices-hollow-win-karnataka-india-mourns-defeat-democracy-rahul_1553696954.html", "image_url": "https://s3.ap-southeast-1.amazonaws.com/images.deccanchronicle.com/dc-Cover-3kgrt8s3roa8cb6o9ngpo36f52-20180517100053.Medi.jpeg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/deccanchronicle.com/nation_current-affairs_170518_bjp-rejoices-hollow-win-karnataka-india-mourns-defeat-democracy-rahul_1553696954.html", "title": "BJP celebrates hollow win, India mourns defeat of democracy: Rahul", "title_page": "BJP celebrates hollow win, India mourns defeat of democracy: Rahul", "title_rss": "NULL", "source_domain": "deccanchronicle.com", "text": "Congress lawmakers, accompanied by Ghulam Nabi Azad, Ashok Gehlot and former Karnataka CM Siddaramaiah were protesting against B S Yeddyurappa's swearing in as Chief Minister of Karnataka. (Photo: ANI | Twitter)\nBengaluru/Mumbai: In a major development in the politics of Karnataka, B S Yeddyurappa has been sworn in as the Chief Minister of the state after his party became the single largest party with majority votes.\nThe vote of Congress and JD(S) which has formed an alliance is 117, more than the magical number of 112. BJP has won 104 seats.\nSoon after B S Yeddyurappa took oath as the Chief Minister of Karnataka on Thursday morning after the Supreme Court in a rare post-midnight hearing ruled out that it won't stop Yeddyurappa swearing-in, Congress MLAs and leaders held a protest outside Mahatma Gandhi’s statue in Vidhan Soudha.\nAlso Read: Yeddyurappa takes oath as Karnataka CM, gets 15 days to prove majority\nCongress lawmakers, accompanied by Ghulam Nabi Azad, Ashok Gehlot and former chief minister of Karnataka Siddaramaiah were protesting against B S Yeddyurappa's swearing in as Chief Minister of Karnataka.\nMinutes before oath taking ceremony of B S Yeddyurappa as Chief Minister of Karnataka, Congress President Rahul Gandhi took to twitter and said, “The BJP’s irrational insistence that it will form a Govt. in Karnataka, even though it clearly doesn’t have the numbers, is to make a mockery of our Constitution. This morning, while the BJP celebrates its hollow victory, India will mourn the defeat of democracy.”\nThe BJP’s irrational insistence that it will form a Govt. in Karnataka, even though it clearly doesn’t have the numbers, is to make a mockery of our Constitution.\nThis morning, while the BJP celebrates its hollow victory, India will mourn the defeat of democracy. — Rahul Gandhi (@RahulGandhi) May 17, 2018\nSiddaramaiah also expressed his anger over the swearing-in of Yeddyurappa and said, “The matter is pending before the Court. We will go to the people and we will tell them how BJP is going against the Constitution.”", "url": "https://www.deccanchronicle.com/nation/current-affairs/170518/bjp-rejoices-hollow-win-karnataka-india-mourns-defeat-democracy-rahul.html", "label": 1}