{"authors": [], "date_download": "2019-03-27 14:35:20", "date_modify": "2019-03-27 14:35:20", "date_publish": "2016-07-01 17:08:00", "description": null, "filename": "nation_current-affairs_010716_jayalalithaa-protests-ap-increasing-dam-level-wants-original-height_1553697320.html", "image_url": "https://dc-cdn.s3-ap-southeast-1.amazonaws.com/dc-Cover-dj2sjs483qb1llv45k9fuls7g6-20160701170657.Medi.jpeg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/deccanchronicle.com/nation_current-affairs_010716_jayalalithaa-protests-ap-increasing-dam-level-wants-original-height_1553697320.html", "title": "Jayalalithaa protests AP increasing dam level, wants original height", "title_page": "Jayalalithaa protests AP increasing dam level, wants original height", "title_rss": "NULL", "source_domain": "deccanchronicle.com", "text": "The dam at Perumballam village across Palar in Chithoor district near the Andhra Pradesh-Tamil Nadu border, is on an inter-state river covered under the Madras-Mysore Agreement of 1892. (Photo: Representational Image)\nChennai: Strongly protesting the increase in height of a check dam across the inter-state Palar river from five to 12 feet, Tamil Nadu Chief Minister J Jayalalithaa on Friday urged her Andhra Pradesh counterpart N Chandrababu Naidu to cut down the reservoir's level to its original position.\n\"I wish to bring to your urgent notice an important issue relating to the action of the Irrigation Department of AP increasing the height of the check dam from the existing five feet to 12 feet across river Palar,\" she told Naidu in a letter.\nThe dam at Perumballam village across Palar in Chithoor district near the Andhra Pradesh-Tamil Nadu border, is on an inter-state river covered under the Madras-Mysore Agreement of 1892, she noted.\n\"This unilateral action of Andhra Pradesh authorities has caused great alarm and apprehension in Tamil Nadu,\" she said. Pointing out that Palar was already water deficit, Jayalalithaa said the river supported an ayacut (an area served by an irrigation project) of about 4.20 lakh acres in Tamil Nadu.\nFarmers in Tamil Nadu's northern districts depend solely on this river for irrigation, she said.\n\"The Palar river with its sand strata is the only major source for drinking water supply to several towns and villages in the northern districts of Tamil Nadu. Further, water from Palar is also supplied to the Atomic Power Station at Kalpakkam (near Chennai),\" the chief minister wrote.\nNoting that Palar is one of the rivers mentioned in Schedule \"A\" of the Madras-Mysore Agreement, she said, \"As per clause II of the pact, the upstream state should not without the previous consent of the downstream state of Tamil Nadu, build any structure to obstruct or store waters across any part of the 15 main rivers.\"\nShe recalled that Tamil Nadu had filed a suit on February 10, 2006 in the Supreme Court to restrain Andhra Pradesh from constructing any structure across Palar in violation of the Madras-Mysore Agreement.\n\"In the circumstances, the government of Tamil Nadu lodges its strong protest against the action of the government of Andhra Pradesh in having unilaterally increased the height of the existing check dam at Perumballam village in violation of the Madras-Mysore Agreement,\" she said.\nShe requested Naidu to immediately intervene and instruct officials to take urgent steps to reduce the level of the check dam to its original level and not to store water additionally and ensure natural flows to Tamil Nadu.\n\"I look forward to your immediate positive response in the matter,\" she said.\nMeanwhile, DMK patriarch Karunanidhi asked Jayalalithaa to hold talks to solve the row over Andhra Pradesh raising the height of a check dam over river Palar.\nHe alleged that such issues would affect the farmers in a big way and rued that the state government was \"nonchalant.\"\nHe said she should ensure that farmers lead a peaceful life by solving river water disputes.", "url": "https://www.deccanchronicle.com/nation/current-affairs/010716/jayalalithaa-protests-ap-increasing-dam-level-wants-original-height.html", "label": 1}