{"authors": [], "date_download": "2019-03-27 14:34:55", "date_modify": "2019-03-27 14:34:55", "date_publish": "2018-09-18 16:25:00", "description": null, "filename": "nation_current-affairs_180918_dmk-holds-state-wide-protests-calls-aiadmk-government-corrupt_1553697295.html", "image_url": "https://s3.ap-southeast-1.amazonaws.com/images.deccanchronicle.com/dc-Cover-l3nups8gujk3m9eee7gnab2pt3-20180903004519.Medi.jpeg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/deccanchronicle.com/nation_current-affairs_180918_dmk-holds-state-wide-protests-calls-aiadmk-government-corrupt_1553697295.html", "title": "DMK holds state-wide protests, calls AIADMK government 'corrupt'", "title_page": "DMK holds state-wide protests, calls AIADMK government 'corrupt'", "title_rss": "NULL", "source_domain": "deccanchronicle.com", "text": "Leading the first protest after assuming the post of DMK President, Stalin launched a scathing attack on Chief Minister K Palaniswami and his cabinet colleagues, levelling corruption charges against them. (Photo: File)\nChennai: Opposition DMK Tuesday staged state-wide protests against the \"corrupt\" AIADMK government in Tamil Nadu, with party chief MK Stalin leading the charge in Salem.\nBesides Stalin, his son Udhayanidhi, sister Kanimozhi and senior DMK leaders including Durai Murugan and Dayanidhi Maran participated in demonstrations held across the state.\nLeading the first protest after assuming the post of DMK President, Stalin launched a scathing attack on Chief Minister K Palaniswami and his cabinet colleagues, levelling corruption charges against them.\nAt Salem, Palaniswami's native district, the DMK chief trained his guns against the Chief Minister.\nHe recalled that the DMK had earlier submitted a memorandum to state Governor Banwarilal Purohit detailing the alleged irregularities in the Highways Department in the wake of IT raids against a contractor.\nPalaniswami holds, among others, the Highways portfolio.\nStalin also pointed out at the recent CBI raids at the residence of Health Minsiter C Vijayabaskar in connection with the probe into the alleged gutka scam.\nThe Central Bureau of Investigation had on September 5 carried out searches at around 40 locations in Tamil Nadu, including at the residences of state's health minister and the director general of police, in connection with the scam.\n\"People of Tamil Nadu have not seen such a corrupt government in the history of the state. It is a corrupt, slave government (to the Centre). It was the people who voted for this government. But today they are on the verge of frustration as they are facing many difficulties,\" he said.\nLevelling a series of corruption charges against the ruling AIADMK, Stalin claimed that he had proof to back it up.\nThe state was facing issues like unemployment and law and order problems, he said, adding even women police personnel \"are not safe.\"\nThe DMK leader was apparently referring to a sexual harassment case filed by a woman police officer against her senior, an IG level official, recently.\n\"The DMK has the big responsibility of saving Tamil Nadu from AIADMK. This protest is the first step towards that,\" Stalin said.\nThe DMK will \"soon come to power\" and act against these corruption charges, he said, adding his party was ready to \"put an end\" to the Palaniswami government.\nKanimozhi participated at a protest demo at Tindivanam in Villupuram district while Udhayanidhi Stalin, Managing Director of DMK mouthpice 'Murasoli,' took part in the demonstration here.\nIn Coimbatore, over 3,000 activists of various political parties led by DMK staged a demonstration seeking the resignation of 'tainted' state ministers facing corruption charges.\nThe speakers, led by party Deputy General Secretary, V P Duraisamy, also demanded the resignation of AIADMK Government, as majority of the ministers were allegedly involved in corruption.\nThere were charges against ministers like Vijayabaskar and S P Velumani, the workers, some of whom sported masks of the chief minister and ministers, said.", "url": "https://www.deccanchronicle.com/nation/current-affairs/180918/dmk-holds-state-wide-protests-calls-aiadmk-government-corrupt.html", "label": 1}