{"authors": [], "date_download": "2019-03-27 14:28:58", "date_modify": "2019-03-27 14:28:58", "date_publish": "2019-02-03 18:19:17", "description": "The BJP has often said that TMC chief Mamata Banerjee was scared of its leaders' popularity that became apparent when the State denied permission for Amit Shah's chopper landing last month. This shows the undemocratic attitude of the TMC government, Union Minister Babul Supriyo said in a tweet earlier today.", "filename": "national_denied-permission-to-land-chopper-in-bengal-yogi-adityanath-says-trinamool-government-trying-to-scuttle-democratic-rights_1553696938.html", "image_url": "https://static.newsx.com/wp-content/uploads/2018/12/yogi-adityanath.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/newsx.com/national_denied-permission-to-land-chopper-in-bengal-yogi-adityanath-says-trinamool-government-trying-to-scuttle-democratic-rights_1553696938.html", "title": "Denied permission to land chopper in Bengal, Yogi Adityanath says Trinamool government trying to scuttle democratic rights", "title_page": "Denied permission to land chopper in Bengal, Yogi Adityanath says Trinamool government trying to scuttle democratic rights - NewsX", "title_rss": "NULL", "source_domain": "newsx.com", "text": "The BJP has often said that TMC chief Mamata Banerjee was scared of its leaders' popularity that became apparent when the State denied permission for Amit Shah's chopper landing last month. This shows the undemocratic attitude of the TMC government, Union Minister Babul Supriyo said in a tweet earlier today.\nUttar Pradesh Chief Minister Yogi Adityanath has said days of the Trinamool Congress government are numbered, hours after his helicopter was denied permission by West Bengal Chief Minister Mamata Banerjee to land at the Balurghat. Infuriated Uttar Pradesh Chief Minister said he would address a public gathering on February 5 in Bengal to protest against an undemocratic government in West Bengal. Alleging that the TMC government treats two communities differently, the chief minister said a few years ago when two festival coincided, the Trinamool government gave permission to one while deprioritised the other.\nTo the contrary, the Uttar Pradesh government gave both permissions together and even Calcutta High Court highlighted this, the BJP leader said. Earlier in the day, Yogi Adityanath was supposed to address a rally in South Dinajpur district but he failed to get permission from the permission for his chopper landing. He was forced to address a rally via an audio link.\nThe BJP has often said that TMC chief Mamata Banerjee was scared of its leaders’ popularity that became apparent when the State denied permission for Amit Shah’s chopper landing last month. This shows the undemocratic attitude of the TMC government, Union Minister Babul Supriyo said in a tweet earlier today.\nAs Lok Sabha elections are looming in the next few months, a political war between the BJP and the TMC has intensified. The BJP is keen to expand its footprints in West Bengal as the party had won just 2 seats from the state in last national elections.\nFor all the latest National News, download NewsX App\nRead More", "url": "https://www.newsx.com/national/denied-permission-to-land-chopper-in-bengal-yogi-adityanath-says-trinamool-government-trying-to-scuttle-democratic-rights", "label": 1}