{"authors": [], "date_download": "2019-03-27 14:34:54", "date_modify": "2019-03-27 14:34:54", "date_publish": "2018-04-20 14:04:00", "description": null, "filename": "nation_current-affairs_200418_cant-be-reporters-not-sleeping-with-big-shots-tn-bjp-leader-facebook_1553697294.html", "image_url": "https://s3.ap-southeast-1.amazonaws.com/images.deccanchronicle.com/dc-Cover-qp7h5nrh64mcaiqqomd280j7a3-20180420140121.Medi.jpeg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/deccanchronicle.com/nation_current-affairs_200418_cant-be-reporters-not-sleeping-with-big-shots-tn-bjp-leader-facebook_1553697294.html", "title": "Can't be reporters without sleeping with bigwigs: TN BJP leader writes, deletes post", "title_page": "Can't be reporters without sleeping with bigwigs: TN BJP leader writes, deletes post", "title_rss": "NULL", "source_domain": "deccanchronicle.com", "text": "Tamil Nadu BJP leader said S. VE. Shekher Venkataraman, 'Uneducated stupid ugly beings... largely in Tamil Nadu media. This woman is no exception.' (Facebook Screengrab | S. VE. Shekher Venkataraman)\nChennai: Days after Tamil Nadu Governor patted the cheek of a woman journalist, creating an uproar in media, a BJP leader from the state has sparked another outrage by saying that the Governor should \"wash his hands with phenyl\" for touching her.\nBJP leader from Tamil Nadu, S. VE. Shekher Venkataraman, an actor and playwright, shared a post on Facebook that belittles the woman journalist who had objected to the Governor patting her cheek on Tuesday.\nGovernor Banwarilal Purohit apologised to journalist Lakshmi Subramanian for the gesture, widely perceived as offensive.\nRead: TN Governor apologises to woman journalist for pat on cheek\nThe outrageous, and now deleted post by the leader said the journalist's aim was to \"defame the governor and Prime Minister Narendra Modi\".\nThe post further went on to say that “recent complaints show they (journalists) can't become reporters or anchors without sleeping with big shots...Uneducated stupid ugly beings... largely in Tamil Nadu media. This woman is no exception.”\nChennai journalists will hold protest at Tamil Nadu BJP headquarters against S. VE. Shekhar and BJP's national secretary H Raja, who is also accused of making comments in bad taste against journalists.\nThe BJP leader’s post further targeted the media for raising questions on a ‘sex-for-degrees’ scam, in which a college professor is accused of pressuring her students to sleep with officials for better marks and money.\nThe professor had claimed links with the governor, which he emphatically denied at a press conference on Tuesday. When journalist Lakshmi Subramanian asked him a question at that press meet, he didn't reply but patted her cheek.\nThe post shared by S. VE. Shekhar said, \"More than universities, sex abuse is rampant in the media. It's these people who question the Governor.\"\nHowever, S. VE. Shekher issued a statement over his derogatory post and said, \"I had posted it without reading the message. It was removed immediately after my friend pointed it out. If I had hurt anyone, it was not on purpose and I extend my heartfelt apology.\"\nDefending his party leader, BJP's KT Raghavan said, \"He has now deleted the post end of the matter. It is a good gesture from his side we must appreciate it. Party won't advocate these types of things.\"\nThe Governor's apology to the journalist had come with a bizarre justification.\n\"I considered (your) question to be a good one. Therefore, as an act of appreciation for the question that you had posed, I gave a pat on your cheek considering you to be like my granddaughter,\" he wrote. Not quite buying into the \"grandfatherly pat\" claim, Ms Subramanian said she accepted his apology, even though she was not convinced.\nAlso Read: TN Governor pats woman journalist on cheek, without consent, sparks uproar\nEarlier, she had tweeted angrily: \"Washed my face several times. Still not able to get rid of it. So agitated and angered Mr Governor Banwarilal Purohit.\"", "url": "https://www.deccanchronicle.com/nation/current-affairs/200418/cant-be-reporters-not-sleeping-with-big-shots-tn-bjp-leader-facebook.html", "label": 1}