{"authors": [], "date_download": "2019-03-27 14:28:57", "date_modify": "2019-03-27 14:28:57", "date_publish": "2019-02-03 13:42:25", "description": "Mamata Banerjee government on Sunday, ahead of a rally at Balurghat, denied permission to UP CM Yogi Adityanath's chopper to land. The UP CM Office reportedly said that the permission has been declined without any prior notice. Earlier, Mamata Banerjee government had denied permission to BJP chief Amit Shah and now UP CM has to go under same circumstances.", "filename": "national_mamata-banerjee-government-denies-permission-to-up-cm-yogi-adityanath-to-hold-rallies-in-west-bengal_1553696937.html", "image_url": "https://static.newsx.com/wp-content/uploads/2019/02/yogi.png", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/newsx.com/national_mamata-banerjee-government-denies-permission-to-up-cm-yogi-adityanath-to-hold-rallies-in-west-bengal_1553696937.html", "title": "Mamata Banerjee government denies permission to UP CM Yogi Adityanath to hold rallies in West Bengal", "title_page": "Mamata Banerjee government denies permission to UP CM Yogi Adityanath to hold rallies in West Bengal - NewsX", "title_rss": "NULL", "source_domain": "newsx.com", "text": "Mamata Banerjee government on Sunday, ahead of a rally at Balurghat, denied permission to UP CM Yogi Adityanath's chopper to land. The UP CM Office reportedly said that the permission has been declined without any prior notice. Earlier, Mamata Banerjee government had denied permission to BJP chief Amit Shah and now UP CM has to go under same circumstances.\nMamata Banerjee-led West Bengal government on Sunday denied permission to Uttar Pradesh Chief Minister Yogi Adityanath’s chopper to land at the Balurghat. According to the reports, UP CM and BJP’s star campaigner was scheduled to attend a rally and after the denial of permission, he had to cancel his plan. The UP CM Office reportedly said that the permission has been declined without any prior notice.\nInformation Advisor to Yogi Adityanath Mritunjay Kumar told the media that the West Bengal denied the permission to land UP CM’s chopper, this denial act is the result of Adityanath’s popularity in the state. Reacting to the denial of permission BJP leader Mukul Roy called it an undemocratic attitude of Mamata Banerjee-led West Bengal government.\nMukul Roy told the media that there is a regular airport at Balurghat. What is the harm of giving permission to land the helicopter on that regular helipad? So, it is an absolutely undemocratic attitude of the West Bengal government.\nA few hours later, Yogi Adityanath addressed the rally from his Lucknow office through the phone. UP CM lashed out at the West Bengal government saying Bengal’s administration is functioning like workers of TMC, which is not acceptable at all.\nUP CM in Lucknow while addressing a rally in Balurghat,South Dinajpur via telephone:Mamata Ji must accept that you don’t misuse admn. in a democracy, the way it's being done in West Bengal.The way Bengal’s admn is functioning as the workers of TMC, should not be acceptable at all pic.twitter.com/3WArf2f9hR — ANI UP (@ANINewsUP) February 3, 2019\nFor all the latest National News, download NewsX App\nRead More", "url": "https://www.newsx.com/national/mamata-banerjee-government-denies-permission-to-up-cm-yogi-adityanath-to-hold-rallies-in-west-bengal", "label": 1}