{"authors": [], "date_download": "2019-03-27 14:35:05", "date_modify": "2019-03-27 14:35:05", "date_publish": "2017-01-17 11:32:31", "description": "Chennai: Hundreds of people in Tamil Nadu took to the streets on Tuesday after more than 200 people demonstrating in favour of Jallikattu were detained by", "filename": "national_52882-jallikattu-ban-over-200-people-detained-massive-protests-in-tamil-nadu_1553697305.html", "image_url": "https://static.newsx.com/wp-content/uploads/2017/01/Jallikattu-ban20supreme20court.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/newsx.com/national_52882-jallikattu-ban-over-200-people-detained-massive-protests-in-tamil-nadu_1553697305.html", "title": "Jallikattu ban: Over 200 people detained, massive protests in Tamil Nadu", "title_page": "Jallikattu ban: Over 200 people detained, massive protests in Tamil Nadu - NewsX", "title_rss": "NULL", "source_domain": "newsx.com", "text": "Chennai: Hundreds of people in Tamil Nadu took to the streets on Tuesday after more than 200 people demonstrating in favour of Jallikattu were detained by police in Madurai.\nDMK working president MK Stalin, condemned the arrests and lamented the current AIADMK rule in Tamil Nadu as “draconian”. He demanded the immediate release of those taken into custody.\nAlso read: Why is Jallikattu issue so controversial\nThe police had housed the protesters, both men and women, in nearby wedding halls. People from various parts of the state had gathered in Madurai demanding passing of an ordinance to allow the sport.\n“People have been kept in preventive custody. They had assembled unlawfully, despite several warnings,” said the police.\nEarlier on Monday, people had kept the shops closed and hoisted black flags on their homes as a protest mark against the ban.\nJallikattu has found a strong political backing as well where, Tamil Nadu CM O Panneerselvam and later AIADMK general secretary VK Sasikala wrote to Prime Minister Narendra Modi, asking him to pass an ordinance to allow the sport during this year’s Pongal season.\nSuperstar Rajinikanth on Friday extended his support for Jallikattu , saying the sport must be held as it is part of Tamil culture. “Bring in whatever rules but Jallikattu must be held to keep up the traditions of our Tamil culture,” said the ‘Kabali’ actor.\nThe apex court in May 2014 banned Jallikattu in Tamil Nadu. Ever since the order, massive protests have taken place with people demanding the central government to uplift the ban on the sport.\nFor all the latest National News, download NewsX App\nRead More", "url": "https://www.newsx.com/national/52882-jallikattu-ban-over-200-people-detained-massive-protests-in-tamil-nadu", "label": 1}