{"authors": [], "date_download": "2019-03-27 14:18:15", "date_modify": "2019-03-27 14:18:15", "date_publish": "2018-01-27 15:25:08", "description": "Delhi Chief Minister Arvind Kejriwal faced a series of opposition from Bharatiya Janata Party (BJP) leaders after he unveiled the portrait of Tipu Sultan in Delhi Assembly on Friday. This step of Delhi CM created a controversy as most of the BJP MLAs consider Tipu Sultan as 'Anti-Hindu' and 'mass-murderer'. Most of the leaders are considering the row as identical to what happened in Karnataka recently.", "filename": "national_tipu-sultan-effect-reaches-national-capital-bjp-attacks-cm-arvind-kejriwal-for-unveiling-portrait-of-mysore-ruler-in-delhi-assembly_1553696295.html", "image_url": "https://static.newsx.com/wp-content/uploads/2018/01/Collage-1.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/newsx.com/national_tipu-sultan-effect-reaches-national-capital-bjp-attacks-cm-arvind-kejriwal-for-unveiling-portrait-of-mysore-ruler-in-delhi-assembly_1553696295.html", "title": "Tipu Sultan effect reaches national capital: BJP attacks CM Arvind Kejriwal for unveiling portrait of Mysore ruler in Delhi Assembly", "title_page": "Tipu Sultan effect reaches national capital: BJP attacks CM Arvind Kejriwal for unveiling portrait of Mysore ruler in Delhi Assembly - NewsX", "title_rss": "NULL", "source_domain": "newsx.com", "text": "Delhi Chief Minister Arvind Kejriwal faced a series of opposition from Bharatiya Janata Party (BJP) leaders after he unveiled the portrait of Tipu Sultan in Delhi Assembly on Friday. This step of Delhi CM created a controversy as most of the BJP MLAs consider Tipu Sultan as 'Anti-Hindu' and 'mass-murderer'. Most of the leaders are considering the row as identical to what happened in Karnataka recently.\nAfter leading a series of protests in Karnataka in 2017, the Bharatiya Janata Party (BJP) has now commenced a new controversy against Delhi Chief Minister Arvind Kejriwal, after he unveiled a portrait of Tipu Sultan on the occasion of the Republic Day. On Friday, Delhi CM unveiled portraits that were two-and-a-half feet long, and one-and-a-half feet wide mentioning the description of the personality in brief and their contribution towards the nation, to be put in the Assembly’s galleries. He unveiled around 70 portraits of eminent individuals including those of Ashfaqulla Khan, Bhagat Singh, Birsa Munda, Rani Chennamma, Subhas Chandra Bose and Tipu Sultan.\nHowever, Delhi CM did not receive a good response from the opposition party. Most of the BJP MLAs opposed the inclusion of 18th century Mysore ruler among other heroes. The party legislators have opposed the CM’s move saying Delhi assembly should refrain from putting up the portrait of a controversial personality. In 2017, Karnataka went through a massive protest carried out by the BJP workers opposing the celebration of Tipu Sultan’s birth anniversary which later turned into a political fight between Congress and Bhartiya Janata Party.\nNot letting the controversy rise, Assembly speaker Ram Niwas Goel has asked the BJP leaders to refrain from playing the ‘cheap politics’. On the other hand, AAP MLA Saurabh Bhardwaj supported party’s move saying, the party had asked BJP to suggest names from their party or RSS who had worked for the freedom struggle but they “could not come up with any”. It all started in 2015 when Congress government decided to celebrate the birth anniversary of 18th century Mysore ruler. BJP leaders highly opposed the decision describing Tipu Sultan as “anti-Hindu” and a “mass murderer.\nFor all the latest National News, download NewsX App\nRead More", "url": "https://www.newsx.com/national/tipu-sultan-effect-reaches-national-capital-bjp-attacks-cm-arvind-kejriwal-for-unveiling-portrait-of-mysore-ruler-in-delhi-assembly", "label": 1}