{"authors": [], "date_download": "2019-03-27 14:29:02", "date_modify": "2019-03-27 14:29:02", "date_publish": null, "description": "Seven Bangladeshis with suspected terror links with terrorists were arrested from Makhdoom Sarai locality under Town police station area in the district late last night Additional Superintendent of Police(ASP) A K Gupta told media persons here today that police raided their hide-out following a tip off and arrested them along with five of their local accomplices", "filename": "news_Articles_India_20160113_2769034_1553696942.html", "image_url": "https://www.webindia123.com/shared_files/ssl/images/favicon.ico", "language": null, "localpath": "/home/raj/news-please-repo//data/2019/03/27/news.webindia123.com/news_Articles_India_20160113_2769034_1553696942.html", "title": "Seven Bangladeshis arrested, terror links suspected", "title_page": "Seven Bangladeshis arrested, terror links suspected", "title_rss": "NULL", "source_domain": "news.webindia123.com", "text": "Seven Bangladeshis with suspected terror links with terrorists were arrested from Makhdoom Sarai locality under Town police station area in the district late last night Additional Superintendent of Police(ASP) A K Gupta told media persons here today that police raided their hide-out following a tip off and arrested them along with five of their local accomplices. Two pistols and as many live cartridges were also seized during the raid, Mr Gupta said adding that during interrogation, it came to light that the arrested used to sell crockeries during the day to conceal their identities. Prima facie, the arrested are suspected to be linked with terrorists, he informed and that their link was being established. Five of their local accomplices arrested were natives of Kanpur and Kannauj in Uttar Pradesh and were partners in dacoity, the ASP said adding that looted gold jewellery, 20 cell phones and a tab was also recovered from them. \"Fake Aadhar cards and Voter cards were seized from the hideout\", Mr Gupta said and added that no valid document was found relating to their stay in India.It was being investigated how they came to Indiawithout any valid document and also about their links with terrorists, he informed.UNI XC KKS PL DJK AS1814 -- (UNI) -- C-1-DL0211-536302.Xml", "url": "https://news.webindia123.com/news/Articles/India/20160113/2769034.html", "label": 1}