{"authors": [], "date_download": "2019-03-27 14:40:59", "date_modify": "2019-03-27 14:40:59", "date_publish": "2016-11-10 22:41:33", "description": "Amid state-wide protests by BJP, the Karnataka government on Thursday observed \"Tipu Jayanti\" in a low-key manner as Chief Minister Siddaramaiah said the rival party opposed the event for political gains and narrow considerations and termed it as \"religious fanatic\".", "filename": "news_karnataka_amid-bjp-protests-tipu-jayanti-held-in-low-key-manner-by-karnataka-government_1948567_1553697659.html", "image_url": "https://english.cdn.zeenews.com/sites/default/files/default_images/placeholder_image_8.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/zeenews.india.com/news_karnataka_amid-bjp-protests-tipu-jayanti-held-in-low-key-manner-by-karnataka-government_1948567_1553697659.html", "title": "Amid BJP protests, Tipu Jayanti held in low-key manner by Karnataka government", "title_page": "Amid BJP protests, Tipu Jayanti held in low-key manner by Karnataka government | Karnataka News", "title_rss": "NULL", "source_domain": "zeenews.india.com", "text": "Bengaluru: Amid state-wide protests by BJP, the Karnataka government on Thursday observed \"Tipu Jayanti\" in a low-key manner as Chief Minister Siddaramaiah said the rival party opposed the event for political gains and narrow considerations and termed it as \"religious fanatic\".\nThe main event was held at Vidhana Soudha, the state secretariat.\nThe BJP observed the day as a \"black day\" and staged protest here and across the state with its leaders, including BS Yeddyurappa, courting arrests.\nThe party held protests in Mangaluru, Mysuru, Kodagu and other districts, against holding celebrations for the 18th century ruler of erstwhile Mysore kingdom who, it said, was a \"religious bigot\" who \"converted people to Islam and massacred many\".\nSecurity was beefed up across Karnataka with prohibitory orders in sensitive Mangaluru, Chitradurga, Shivamogga and Kodagu districts and central forces, including Rapid Action Force, and City Armed Reserve personnel being deployed in Bengaluru and elsewhere.\nHitting out at BJP leaders for branding a national icon as a religious fanatic, Siddaramaiah said, \"We are celebrating Tipu jayanti for the second time. Our government did not decide to celebrate Tipu Jayanti for the sake of gaining votes, nor for appeasing Muslim community.\"\nSpeaking at Tipu Jayanti celebrations organised by the Department of Kannada and Culture, he said, BJP, \"because of its narrow mind, is trying to project Tipu as anti-Hindu, anti-Kannada and as religious fanatic\".\n\"You are doing this for politics, for your selfish gains,\" he added.\nAccusing BJP, RSS and Bajrang Dal of trying to twist history, he said, \"They are trying to do it for the sake of (next Assembly) elections. We will not fear it and disrespect public sentiment. We will celebrate Tipu jayanti every year, next year we will celebrate with more fanfare.\"\n\"It is not Tipu who is a religious fanatic, it is these people (BJP) who are religious fanatics,\" he added.\nCongress government's decision to observe Tipu Jayanti since last year has stirred a major row, with opinion sharply divided among intellectuals, academia and various communities and organisations, which have differing views on his reign.\nLast year's celebrations had led to violence in Madikeri and parts of coastal districts, resulting in two deaths.\nAddressing a protest here, Yeddyurappa said BJP was not \"anti-Muslim\" but against celebrating Tipu Sultan against whom there was resentment among different sections of society across the state.\nBJP leaders, including former Deputy Chief Minister R Ashok, who addressed the protest, said Tipu Sultan was \"anti-Kannada\" and a \"religious fanatic\" and the Congress government was trying to polarise people.", "url": "https://zeenews.india.com/news/karnataka/amid-bjp-protests-tipu-jayanti-held-in-low-key-manner-by-karnataka-government_1948567.html", "label": 1}