{"authors": ["Relatives Have Turned Political Rivals Many A Time", "State Has Seen Good Translators", "Some Not So Good Ones"], "date_download": "2019-03-27 14:35:21", "date_modify": "2019-03-27 14:35:21", "date_publish": "2018-03-02 00:05:03", "description": "It will review implementation of National Food Security Act", "filename": "news_national_tamil-nadu_tn_34e946e717f4713b9c9d0ab66d477d36_article22898452_1553697321.html", "image_url": "https://www.thehindu.com/news/national/tamil-nadu/article22898451.ece/ALTERNATES/LANDSCAPE_615/02THPDSPHOTO", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/thehindu.com/news_national_tamil-nadu_tn_34e946e717f4713b9c9d0ab66d477d36_article22898452_1553697321.html", "title": "T.N. constitutes State Food Commission", "title_page": "\nT.N. constitutes State Food Commission - The Hindu\n", "title_rss": "NULL", "source_domain": "thehindu.com", "text": "A six-member Tamil Nadu State Food Commission, with IAS officer R. Vasuki as its Chairperson, was recently constituted by the State government, more than a year after it decided to implement the National Food Security Act (NFSA).\nAs per Section 16 of the National Food Security Act, 2013, every State should constitute a State Food Commission for the purpose of monitoring and reviewing implementation of this Act. P. Priya Selvi from Vellore, M. Ganesan from Thuraiyur, K. Balaji Singh from Mogappair in Chennai, S. Asai Mani of Kayathur in Nagapattinam district, and G. Rajamohan from Valangaiman are the other members of the Commission that will function from the office of the Assistant Commissioner (Civil Supplies) on Canal Road, Chepauk.\n“Though our State has agreed to implement the NFSA, we are also implementing Universal PDS which ensures supplies to all. NFSA ensures legal entitlement of food to consumers and the Commission will monitor the implementation of the Act in the State,” Kumar Jayant, Secretary of Co-operation, Food and Consumer Protection Department, said.\nItems to be supplied\nAsked whether the Commission would be able to make other decisions as to the items to be supplied to the consumers, the officer replied in the negative.\nAccording to the NFS Act, 2013, the Commission shall monitor and evaluate the implementation of this Act in relation to the State, inquire into complaints of violations of entitlements, give advice to the State government for the effective implementation of food and nutrition related schemes.\nThe Commission is empowered to either suo motu or on receipt of complaint, inquire into violations of entitlements and can give advice to the government, and has all the powers of a civil court.\nBy a G.O. dated October 27, 2016, the Tamil Nadu government decided to implement the National Food Security Act, 2013 from November 1, 2016, after protesting against it for over three years.\nAbout 50.55% of the State’s population or around 3.6 crore, out of the total 7.2 crore consumers, are eligible for entitlements under the NFSA.", "url": "https://www.thehindu.com/news/national/tamil-nadu/tn-constitutes-state-food-commission/article22898452.ece", "label": 1}