{"authors": [], "date_download": "2019-03-27 14:34:54", "date_modify": "2019-03-27 14:34:54", "date_publish": "2019-03-28 00:00:00", "description": "New Delhi [India], Sept.30 (ANI): The Supreme Court on Friday again directed Karnataka to release 6000 cusecs of Cauvery water from October 1 till October 6.\nDu", "filename": "news_248133109_sc-asks-karnataka-to-release-6000-cusecs-of-water-to-tamil-nadu-from-tomorrow_1553697294.html", "image_url": "https://cdn.bignewsnetwork.com/ani1475238241.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/srilankasource.com/news_248133109_sc-asks-karnataka-to-release-6000-cusecs-of-water-to-tamil-nadu-from-tomorrow_1553697294.html", "title": "SC asks Karnataka to release 6000 cusecs of water to Tamil Nadu from tomorrow", "title_page": "SC asks Karnataka to release 6000 cusecs of water to Tamil Nadu from tomorrow", "title_rss": "NULL", "source_domain": "srilankasource.com", "text": "New Delhi [India], Sept.30 (ANI): The Supreme Court on Friday again directed Karnataka to release 6000 cusecs of Cauvery water from October 1 till October 6.\nDuring the hearing, Tamil Nadu's Counsel Sekhar Naphade accused the Karnataka Government of failing to comply with the apex court's orders by passing the resolution.\nThe Karnataka government, however, defended its action, saying that the will of the people was reflected while passing the resolution in the state assembly.\nThe apex court asked the Cauvery Water Management Board (CWMB) to visit Karnataka and Tamil Nadu and file a report on the \"ground realities\" by Thursday. It has also asked the governments of Kerala, and Puducherry to nominate one representative by 4.p.m tomorrow.\nThe apex court has asked the board to file its report by Thursday.\nA meeting was convened by Union Water Resource Minister Uma Bharti, on Thursday, to sort out differences between both states. However, it failed to reach any conclusion.\nAddressing the media, shortly after the meet, Bharti stated that no solution was arrived at as the Tamil Nadu Government did not accept the Karnataka Government's suggestion of sending an expert committee to assess the Cauvery Basin.\n\"If tension rises between Karnataka and Tamil Nadu, I am going to sit on a hunger strike on the border of both states,\" she threatened.\nThe Karnataka Government yesterday requested the Centre to form an expert panel to assess the availability of water in the Cauvery Basin. (ANI)", "url": "https://www.srilankasource.com/news/248133109/sc-asks-karnataka-to-release-6000-cusecs-of-water-to-tamil-nadu-from-tomorrow", "label": 1}