{"authors": [], "date_download": "2019-03-27 14:29:13", "date_modify": "2019-03-27 14:29:13", "date_publish": "2017-02-21 01:22:00", "description": "Anupriya Patel's Apna Dal is running the polls under an electoral understanding with the BJP. She rubbished claims of governance by Akhilesh.", "filename": "news_politics-and-nation_un_f34ff886ca9de3f6a34784a9d403d4b7_57261430_1553696953.html", "image_url": "https://img.etimg.com/thumb/msid-57261474,width-1070,height-580,imgsize-95347,overlay-economictimes/photo.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/economictimes.indiatimes.com/news_politics-and-nation_un_f34ff886ca9de3f6a34784a9d403d4b7_57261430_1553696953.html", "title": "Union minister Anupriya Patel lashes out at SP-Congress alliance", "title_page": "Union minister Anupriya Patel lashes out at SP-Congress alliance - The Economic Times", "title_rss": "NULL", "source_domain": "economictimes.indiatimes.com", "text": "ALLAHABAD: Union minister Anupriya Patel on Monday sought to dub the Congress-Samajwadi Party electoral alliance in Uttar Pradesh as a tie-up between “those who looted the country in the past and those who were looting the state at present.”“It is strange to see that those who looted the country in the past and those who are looting the state at present have joined hands.”“The Congress and the SP have resorted to this desperate move as they are scared of the headway made by the BJP-Apna Dal alliance in the first three phases of assembly polls ,” said Patel, who is the daughter of the Dal’s late founder Soneylal Patel Claiming the BJP has gained handsomely in the first three phases of the polls, she asserted in the remaining four phases “our position will be strengthened further and we will form the next government in UP”.The Apna Dal is running the polls under an electoral understanding with the BJP. She rubbished the claims of good governance by CM Akhilesh Yadav", "url": "https://economictimes.indiatimes.com/news/politics-and-nation/union-minister-anupriya-patel-lashes-out-at-sp-congress-alliance/articleshow/57261430.cms", "label": 1}