{"authors": [], "date_download": "2019-03-27 14:40:55", "date_modify": "2019-03-27 14:40:55", "date_publish": "2017-01-14 19:51:01", "description": "UNC opposes India-Myanmar border fencing...UNC general secretary Milan Shimrey termed the mov...Shimrey said that this 'divisive' policy of the In...\"All the Nagas should oppose it as this borde...The fencing work is on at remote Pangsha ...", "filename": "news_articles_a709737_1553697655.html", "image_url": "https://s0.nxstatic.com/favicon.ico", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/prokerala.com/news_articles_a709737_1553697655.html", "title": "UNC opposes India-Myanmar border fencing", "title_page": "UNC opposes India-Myanmar border fencing", "title_rss": "NULL", "source_domain": "prokerala.com", "text": "Imphal, Jan 14 : Manipur's apex body of Naga civil society organisations, the United Naga Council (UNC), on Saturday opposed the fencing work between India and Myanmar and appealed to Nagas to jointly oppose it.\nUNC general secretary Milan Shimrey termed the move as 'great injustice' committed on the Naga people and said that such move to fence the border is bound to deprive the inherent rights of the 'Naga family' from communicating with each other.\nShimrey said that this 'divisive' policy of the Indian government will create a rift among the 'Naga family' and appealed to everyone to thwart the move.\n\"All the Nagas should oppose it as this border fencing infringes the rights of the Naga people,\" he added.\nThe fencing work is on at remote Pangsha village in Nagaland's Tuensang district.\nEarlier, the NSCN (IM), NSCN (K), Eastern Naga Peoples' Organization (ENPO) and several other Nagaland based social organization had opposed the move to fence the India-Myanmar border in Nagaland, both sides of which are inhabited by Naga tribes since time immemorial.\nThe UNC has been continuing with the blockade of two National Highways of Manipur -- the NH 53 and NH 2 -- since November 1 cutting the supply lines to remote areas of Manipur in protest against the Manipur government's decision to create seven new districts bifurcating some Naga inhabited areas.", "url": "https://www.prokerala.com/news/articles/a709737.html", "label": 1}