{"authors": ["In This New Podcast Series Tracking Major Campaign Speeches Across The Country", "Varghese K George Is In Conversation With Jayant Sriram To", "Opposition Shows Video Of", "Bjp Leader", "Exchanging Old Currency Past Deadline"], "date_download": "2019-03-27 14:28:57", "date_modify": "2019-03-27 14:28:57", "date_publish": "2016-12-14 23:36:36", "description": "The party to brief the people that the objectives of govt.’s exercise to end terrorism and to curb black money have failed", "filename": "news_national_Cong.-to-hit-_4afb2e6e24beb11fdf0f500157ef76c4_article16806401_1553696937.html", "image_url": "https://www.thehindu.com/static/theme/default/base/img/og-image.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/thehindu.com/news_national_Cong.-to-hit-_4afb2e6e24beb11fdf0f500157ef76c4_article16806401_1553696937.html", "title": "Cong. to hit the streets on demonetisation after winter session", "title_page": "\nCong. to hit the streets on demonetisation after winter session - The Hindu\n", "title_rss": "NULL", "source_domain": "thehindu.com", "text": "The Congress has decided to take to the people the “complete failure of the government’s stated objectives” for undertaking demonetisation as soon as the winter session of Parliament ends on Friday through an aggressive, countrywide campaign, top party sources told The Hindu.\nThis was the decision taken at a meeting of party MPs and national general secretaries at the Congress’s war room on Gurdwara Rakabganj Road on Wednesday. The discussion was presided over by party vice-president Rahul Gandhi, who made both the initial and concluding remarks. As many as 22 others spoke, as the party’s top leaders brainstormed on the campaign.\nFour rallies\nMr. Gandhi himself will address four public rallies, one each in the northern, southern, eastern and western parts of the country. All top leaders have been asked to fan out through the length and breadth of India, also to address public meetings, even as party units have been told to get activated at different levels on the demonetisation issue.\nThis plan has the blessings of Congress President Sonia Gandhi: party sources said that she had been advocating that the party should hit the streets. Initially, the Congress had been measured in its response as it wished to see how the demonetisation exercise rolled out.\n“The theme of the campaign will be that the so-called stated objectives of the demonetisation exercise — to end terrorism, to make use of counterfeit money and black money impossible — have failed,” a senior Congress leader, who attended the meeting, said. It was repeatedly stressed during the discussion that the message would have to be taken “aggressively” to the people.\nParty communication chief Randeep Surjewala added that the Congress would also emphasise through the campaign that the party stood with the people on the hardships they were facing.\nGraft allegations\nReference was made to Mr. Gandhi’s press conference earlier in the day to the allegations of corruption that he had made against Prime Minister Narendra Modi: many of the speakers said that if those details were made public, it would give ballast to the Congress campaign against the government that had said the demonetisation exercise was an attack on corruption.\nHowever, Mr. Gandhi is learnt to have said that he would prefer to make another attempt to present those details in Parliament — if he fails to do so by Friday, then a fresh strategy will be worked out on how to disseminate that information.\nMeanwhile, it is learnt that other opposition parties are also making plans to take forward the aggression — and solidarity — of their parliamentary wings to the streets.\nThis week, for three days, for instance, 200-odd Trinamool Congress MLAs will be demonstrating in front of the Reserve Bank in Kolkata.\nAjit Singh’s Rashtriya Lok Dal, too, will shortly be holding a rally at Baghara near Muzaffarnagar in western Uttar Pradesh. Former Prime Minister and JD(S) leader H.D. Deve Gowda, JD(U) leader Sharad Yadav, and the NCP will participate in the rally: the new guests this time will be from the Trinamool, sources in that party said.", "url": "https://www.thehindu.com/news/national/Cong.-to-hit-the-streets-on-demonetisation-after-winter-session/article16806401.ece", "label": 1}