{"authors": [], "date_download": "2019-03-27 14:29:06", "date_modify": "2019-03-27 14:29:06", "date_publish": "2017-01-19 00:27:01", "description": "Money loot common thread between 'Didibh...Yechury referred to Saradha and Rose Valley ponzi ...\"Constant loot is going on in Bengal sometime...\"Similarly Prime Minister Modi has conducted ...Ridiculing the Modi government's ...", "filename": "news_articles_a710918_1553696946.html", "image_url": "https://s0.nxstatic.com/favicon.ico", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/prokerala.com/news_articles_a710918_1553696946.html", "title": "Money loot common thread between 'Didibhai-Modibhai': Yechury", "title_page": "Money loot common thread between 'Didibhai-Modibhai': Yechury", "title_rss": "NULL", "source_domain": "prokerala.com", "text": "Kolkata, Jan 19 : Cocking a snook at Prime Minister Narendra Modi and West Bengal Chief Minister Mamata Banerjee, CPI-M General Secretary Sitaram Yechury on Wednesday said \"money loot\" was a cmmon thread between the \"Didibhai-Modibhai (Mamata-Modi) nexus.\nYechury referred to Saradha and Rose Valley ponzi scheme scandals and the Nara Sting operations, the later purportedly showing some top leaders of the state's ruling Trinamool Congress allegedly taking wads of notes in exchange for doling out favours to a fictitious company.\n\"Constant loot is going on in Bengal sometimes in the form of Sarada, sometimes Narada and sometimes Rose Valley,\" he said.\n\"Similarly Prime Minister Modi has conducted loot on common people of the nation through his demonetisation move. The money loot is the common thread between Didibhai-Modibhai (Mamata-Modi) nexus,\" Yechury said while addressing a party meeting in the satellite township of Salt Lake.\nRidiculing the Modi government's demonetisation move, Yechury said he has failed to unearth black money.\n\"Modi said demonetisation was a move to curb black money but the reality is only 5-6 per cent of the black money is in the nation while the major chunk is stashed in the banks abroad. Modi should have ordered investigations on the people who hold those foreign bank accounts but he hasn't done that,\" he said.\n\"97 per cent of the total amount of scrapped notes have already come back to the bank. Where is the black money,\" Yechury added.\nHe said all major financial organisations in the world including IMF, World Bank, Asian Development Bank have said India's GDP will go down significantly after demonetisation.\nHe alleged the BJP led NDA government at the centre was trying to \"stoke\" communal passions.\n\"But they are going to lose badly in the coming elections to Uttar Pradesh. People will give them triple talaq. The first talaq was when the BJP lost in the Delhi assembly polls. Then they lost in Bihar. It was the second Talaq. The third or triple talaq from the people will come in Uttar Pradesh,\" he said.", "url": "https://www.prokerala.com/news/articles/a710918.html", "label": 1}