{"authors": ["First Edition Of", "Les Francophonies De Pondicherry", "To Be Held Today"], "date_download": "2019-03-27 14:29:11", "date_modify": "2019-03-27 14:29:11", "date_publish": "2015-08-06 14:34:31", "description": "Students of Pondicherry University, on Thursday, began an indefinite hunger strike seeking the ouster of Vice-Chancellor Chandra Krishnamurthy even as a two-member team of the Ministry of Human Resour", "filename": "news_cities_puducherry_pond_bf6873b3f9ca135d94b2f169714068a4_article7507326_1553696951.html", "image_url": "https://www.thehindu.com/migration_catalog/article10241522.ece/ALTERNATES/LANDSCAPE_615/HOLDING_PLACARDS%5B1%5D", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/thehindu.com/news_cities_puducherry_pond_bf6873b3f9ca135d94b2f169714068a4_article7507326_1553696951.html", "title": "Pondy varsity students begin indefinite hunger strike", "title_page": "\nPondy varsity students begin indefinite hunger strike - The Hindu\n", "title_rss": "NULL", "source_domain": "thehindu.com", "text": "Students of Pondicherry University, on Thursday, began an indefinite hunger strike seeking the ouster of Vice-Chancellor Chandra Krishnamurthy even as a two-member team of the Ministry of Human Resources Development (MHRD) was due to visit the campus later in the day to take stock of the situation.\nA spokesperson for the Pondicherry University Students Movement (PUSM) — which is spearheading the strike — said 15 students, including three girls, would be on an indefinite hunger strike till the MHRD acceded to their demand.\nThe students launched their strike on July 27 after which the MHRD constituted a two-member team to assess the prevailing situation in the institution. PUSM accused the Vice-Chancellor of running the University “by appointing key persons in charge of important departments.”\nPUSM claimed that students who had gained admission on merit basis from far flung areas were not provided hostel accommodation so far. Four to six students are forced to share a room as against the earlier arrangement of three students.\nStudents get support from CPI(M)\nAddressing the striking students, CPI (M) MLA from Chidambaram constituency and State Secretariat member K. Balakrishnan said the Vice-Chancellor should morally step down from office for alleged academic misdemeanour and act of plagiarism.\nMr. Balakrishnan said that a VC of a University should set an example and lead the institution. But the present incumbent had been running the university as per her whims and fancies and had brought disrepute to the institution, he alleged.\nThe Central Government should have acted earlier against the Vice-Chancellor based on the report submitted by the Fact Finding Committee. But there has been an unwarranted delay on the part of the Centre in taking action.\nHe condemned the police lathi-charge and said the police had no locus standi to enter the campus. The protest cannot be suppressed by the administration by unleashing goons to assault the students. All political parties will join hands with the students seeking the ouster of the VC, he said.\nMeanwhile, the Registrar-in-charge has called for an urgent meeting of Deans, Head of the Departments and all officers in the Executive Council hall at 2.30 p.m.", "url": "https://www.thehindu.com/news/cities/puducherry/pondy-varsity-students-begin-indefinite-hunger-strike/article7507326.ece", "label": 1}