{"authors": [], "date_download": "2019-03-27 14:35:22", "date_modify": "2019-03-27 14:35:22", "date_publish": "2019-03-28 00:00:00", "description": "Bengaluru (Karnataka) [India], Oct. 1 (ANI): With Sri Lanka also opting out of the South Asian Association for Regional Cooperation (SAARC) Summit to be held in", "filename": "news_248148815_pakistan-facing-global-isolation-due-to-its-own-deeds-says-congress_1553697322.html", "image_url": "https://cdn.bignewsnetwork.com/ani1475291536.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/srilankasource.com/news_248148815_pakistan-facing-global-isolation-due-to-its-own-deeds-says-congress_1553697322.html", "title": "Pakistan facing global isolation due to its own deeds, says Congress", "title_page": "Pakistan facing global isolation due to its own deeds, says Congress", "title_rss": "NULL", "source_domain": "srilankasource.com", "text": "Bengaluru (Karnataka) [India], Oct. 1 (ANI): With Sri Lanka also opting out of the South Asian Association for Regional Cooperation (SAARC) Summit to be held in Islamabad in November, the Congress Party on Saturday said Pakistan's global isolation is of its own making.\n\"SAARC member nations are pulling out of the summit one by one. So far, five countries, including Sri Lanka, have pulled out and there is a chance that The Maldives will also pull out. Pakistan must comprehend where it is making a mistake, because so many nations want to stay away from Pakistan and the summit, which is a proof of Pakistan's mistake. Pakistan is being isolated internationally due to their own deeds,\" Leader of Opposition in the Lok Sabha Mallikarjun Kharge told ANI.\n\"Bangladesh, Afghanistan and America have openly condemned them for backing terrorism. Moreover, 25-30 nations have supported India on the surgical strike carried out by the army, which means that we are on the right path, while Pakistan has taken some wrong path,\" said Kharge.\n\"At least now, good sense should prevail upon them and allow all neighbouring states in Asia to work with peace and tranquillity and not encourage terrorism,\" he added.\nThe Congress leader said peace in the world and in Asia is essential for progress; for the education; for prosperity of the people.\nHe said every country would have to reckon with it (dismantling terrorism), \"especially Pakistan, which is a poverty-stricken country, and that's why its responsibility is greater\".\n\"India has been tolerating a lots for the sake of peace and reacts only when there is immense pressure on it to retort. Pakistan must understand as to why it is being isolated,\" he added.\nPakistan yesterday said it has postponed the 19th SAARC Summit after India and four other countries announced their decision to boycott it.\nIn a press release, the Pakistan Ministry of Foreign Affairs said a new set of dates for holding the summit in Islamabad would soon be announced by Nepal, the Chair of SAARC.\nIndia, Afghanistan, Bangladesh, Bhutan and Sri Lanka have informed the SAARC Secretariat that their leaders will not attend the November summit in Islamabad.\nThe absence of even one member state leads to an automatic postponement or cancellation of the summit. (ANI)", "url": "https://www.srilankasource.com/news/248148815/pakistan-facing-global-isolation-due-to-its-own-deeds-says-congress", "label": 1}