{"authors": [], "date_download": "2019-03-27 14:35:17", "date_modify": "2019-03-27 14:35:17", "date_publish": "2018-03-15 08:56:22", "description": "Chennai (Tamil Nadu) [India], Mar 15 (ANI): To mark their protest over the demand to constitute Cauvery Water Management board, some of the Dravida Munnetra Kazhagam (DMK) MPs were seen wearing black dresses outside the Parliament on Thursday.", "filename": "news_national_general-news__1553697317.html", "image_url": "https://aniportalimages.s3.amazonaws.com/media/details/MK_StalinMar15.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/aninews.in/news_national_general-news__1553697317.html", "title": "Cauvery issue: DMK protests in black outside Parliament", "title_page": "Cauvery issue: DMK protests in black outside Parliament", "title_rss": "NULL", "source_domain": "aninews.in", "text": "Chennai (Tamil Nadu) [India], Mar 15 (ANI): To mark their protest over the demand to constitute Cauvery Water Management board, some of the Dravida Munnetra Kazhagam (DMK) MPs were seen wearing black dresses outside the Parliament on Thursday.\nDMK MPs even walked out of the Assembly for the delay in adopting tactics for the formation of the Cauvery management board.\n\"We are wearing black, and have walked out of the assembly to show our protest against delaying tactics adopted in the formation of Cauvery management board, TN Govt has failed to put pressure in this matter, therefore we boycott today's budget speech,\" DMK working president MK Stalin said.\nEarlier, even members of All India Anna Dravida Munnetra Kazhagam (AIADMK) staged a protest in front of Parliament over the same issue.\nThe Supreme Court on February 16 had ordered the Central Government to set up the CMB and the Cauvery Water Regulatory Committee within six weeks.\nEarlier, MK Stalin had met Tamil Nadu Chief Minister Edappadi K. Palaniswami and put forward a proposal of mass resignation of all state MPs from the Union Cabinet to stress this point to the Centre.\nThe Cauvery tribunal recommended that the Cauvery management be modelled after Bhakra Beas Management Board by the Centre unless an appropriate mechanism comes to place.\nThe apex court had reduced Tamil Nadu's share in the Cauvery water to 177.25 thousand million cubic feet, down from 192 TMC allocated by a tribunal in 2007. (ANI)", "url": "https://www.aninews.in/news/national/general-news/cauvery-issue-dmk-protests-in-black-outside-parliament201803151425060001/", "label": 1}