{"authors": ["Tribune News Service"], "date_download": "2019-03-27 14:40:32", "date_modify": "2019-03-27 14:40:32", "date_publish": "2017-06-20 00:00:00", "description": "TheTribune: MUMBAI: Supplies of agricultural produce to Mumbai and other cities in Maharashtra continue to be disrupted as groups of farmers continued to block roads and damage vehicles transporting milk and vegetables.", "filename": "news_nation_maharashtra-far_8e08a5133b259f1d2013f24fb0114308_417410_1553697632.html", "image_url": "https://images.tribuneindia.com/cms/gall_content/2017/6/2017_6$largeimg04_Sunday_2017_133428466.JPG", "language": null, "localpath": "/home/raj/news-please-repo//data/2019/03/27/tribuneindia.com/news_nation_maharashtra-far_8e08a5133b259f1d2013f24fb0114308_417410_1553697632.html", "title": "Maharashtra farmers block roads; call for bandh on Monday", "title_page": "\r\n\tMaharashtra farmers block roads; call for bandh on Monday\r\n", "title_rss": "NULL", "source_domain": "tribuneindia.com", "text": "Shiv Kumar\nTribune News Service\nMumbai, June 4\nSupplies of agricultural produce to Mumbai and other cities in Maharashtra continue to be disrupted as groups of farmers continued to block roads and damage vehicles transporting milk and vegetables. Kisan Kranti Morcha, the umbrella body of farmers, has called for a state-wide bandh on Monday.\n(Follow The Tribune on Facebook; and Twitter @thetribunechd)\nThough Maharashtra Chief Minister Devendra Fadnavis announced early Saturday that the farmers’ strike has been called off after he promised to waive off payment of loans by small and medium farmers by October this year, the decision was rejected by farmers in many parts of the state.\nSources said today that the core committee of the Kisan Kranti Morcha, which is spearheading the strike, has resigned and farmers’ groups were in the process of electing a set of new leaders who would\nnegotiate with the government. The earlier members of the core committee were forced to apologize to farmers after being accused of selling out to the state government.\n“We have not called off the strike. Protests will continue till the Maharashtra government announces a waiver of loans from all farmers immediately,” Raghunath Patil, senior leader of the Swabhimani\nShetkari Sanghatana said. Patil along with party MP Raju Shetti are among the leaders who have organised the strike.\nPatil said the farmers will enforce a Maharashtra-wide bandh on Monday. The KKM said except for ambulances, fire engines and police vans no vehicles would be allowed to ply on the state’s roads, KKM\nleaders said.\nAccording to the state co-operatives department milk procurement in Western Maharashtra, which supplies much of the milk to Maharashtra’s cities, has virtually come to a halt with dairy owners refusing to call off their strike.\nTraders at the Agriculture Produce Marketing Committee market at Navi Mumbai had earlier said they would keep the market closed this weekend and resume operations only if supplies resume on Monday.\nLeaders of some farmers’ organizations said they wanted the government to waive off payment of farm loans immediately. “Chief Minister Devendra Fadnavis is dividing the farmers without giving them any\nconcrete assurances on the waiver of loans to be paid by them,” Congress party chief Ashok Chavan told reporters today.", "url": "https://www.tribuneindia.com/news/nation/maharashtra-farmers-block-roads-call-for-bandh-on-monday/417410.html", "label": 1}