{"authors": [], "date_download": "2019-03-27 14:35:35", "date_modify": "2019-03-27 14:35:35", "date_publish": "2019-03-26 00:00:00", "description": "Thousands of Muslims gathered on Sunday at Delhi's Jantar Mantar to protest the recent decisions of Uttar Pradesh and Madhya Pradesh government of recording the Independence Day celebrations in madrasas.", "filename": "news_india_why-does-my-religion-overshadow-my-love-for-nation-question-muslims-asked-to-record-i-day-celebrations-in-madrasas-1490395_1553697335.html", "image_url": "https://images.news18.com/ibnlive/uploads/2017/08/india-muslims-875.jpg", "language": null, "localpath": "/home/raj/news-please-repo//data/2019/03/27/news18.com/news_india_why-does-my-religion-overshadow-my-love-for-nation-question-muslims-asked-to-record-i-day-celebrations-in-madrasas-1490395_1553697335.html", "title": "Why Does my Religion Overshadow my Love for Nation? Ask Muslims Ordered to Record I-Day Celebrations in Madrasas", "title_page": "Why Does my Religion Overshadow my Love for Nation? Ask Muslims Ordered to Record I-Day Celebrations in Madrasas - News18", "title_rss": "NULL", "source_domain": "news18.com", "text": ": Days after the Yogi government in Uttar Pradesh declared that all madrasas in the state must celebrate the Independence Day and record the events, Muslims turned up in thousands at the Jantar Mantar on Sunday to say that they have been celebrating the day all this while.Participants at the rally called by Jamiat Ulema-i-Hind said that they are not opposed to showing brotherhood and love among communities, but do not support the recent decisions of Uttar Pradesh and Madhya Pradesh government of recording the celebrations in madrasas.\"Our community had vehemently opposed the partition of Hindustan. We have embraced our nation with love, but now those who are in power want us to record Independence Day celebrations in madrasas. May be they do not know but we have been hoisting the national flag since Independence. You cannot teach us nationalism,\" said Maulana Mufti, a member of Jamiat Ulema-i-Hind to a large gathering who were chanting 'Hindustan Humara Hai' and 'Hindustan Zindabad'.Jamiat, one of the most prominent Islamic organisations in India was founded in 1919 by Sheikh ul Hind Maulana Mehmood Hasan, Maulana Syed Hussain Mehmood Madani and others. They were one of the key opponents to the idea of colonialism and voiced the idea of a united India.Madani, the first president of the organisation, believed that unity among Hindus and Muslims was essential for India's freedom.The gathering on Sunday witnessed a crowd mostly aged between 20 and 30 years carrying placards with peace messages.Arif Shaikh, a store owner from Delhi's Matia Mahal area, told News18 that such an event only shows that we can all come together to \"oppose tyrannical moves of the government\".\"Why does the government always see us as less patriotic? Just because we have a beard and wear a cap? Why does my religion overshadow my love for the nation? Since this government has come to power, there have been increasing number of attacks on Muslims. There is a vicious environment around. Our love for our Hindu brothers and our nation must defeat this,\" said Arif Shaikh.One could easily feel a palpable anger in the crowd as most of them felt that although everyone remembers India's freedom struggle, but no one acknowledges the contribution of the Muslims.\"Soon after the Revolt of 1857 failed, the Ulema who were also a leading force in the mutiny, became the main target of British persecution. Two lakh men and women were martyred at the time. Of these, about 51,200 were Ulema. Five hundred of these Ulema were hanged in Delhi,\" recollected Shaikh.The Jamiat which gave the slogan of Muttahida Qaumiyat (universal brotherhood) in the face of Muhammad Ali Jinnah's two-nation theory had opposed the partition bid and the idea of Pakistan. Soon, Jamiat faced a split and a section sided with the Muslim League.\"You need to have freedom to experience India’s Independence. If the minorities are forced to come out on the streets to make their voices heard and the government does not pay any heed, then there is some introspection needed,\" said Manjari Karmarkar, a doctoral candidate at the Delhi University.At the same time, there were constant murmurs at the venue about the recent diktat in Uttar Pradesh and Madhya Pradesh, which they say could have been the result of the reluctance of Muslims in saying \"Vande Mataram\".Mehboob Aslam Rahmani, a store owner in Mehrauli, told News18 that the fear of being \"beaten up if he one does not say Jai Hind needs to be addressed at the earliest\".\"We sing our national anthem and chant Jai Hind the loudest, but we do not say Vande Mataram because it means worship the land which is our mother. In Islam, we cannot worship anyone except the Almighty, hence this reluctance. But that does not mean we do not love India. We have bled for our country and will sacrifice our lives for Hindustan again,\" said Rahmani.The 'Aman March' is being organised across all major cities with the district and state level mosque heads addressing the population.", "url": "https://www.news18.com/news/india/why-does-my-religion-overshadow-my-love-for-nation-question-muslims-asked-to-record-i-day-celebrations-in-madrasas-1490395.html", "label": 1}