{"authors": ["Sandhya Dangwal"], "date_download": "2019-03-27 14:40:39", "date_modify": "2019-03-27 14:40:39", "date_publish": "2017-01-16 17:30:48", "description": "All the 70 constituencies of Uttarakhand will go to poll in single phase on February 15 while the counting in all five poll bound states will be held on March 11, 2017. - Uttarakhand Assembly Elections 2017 Opinion Poll Results: BJP predicted to win polls with thumping majority", "filename": "news_india__1553697639.html", "image_url": "https://www.india.com/wp-content/uploads/2016/12/Harish-Rawat.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/india.com/news_india__1553697639.html", "title": "Uttarakhand Assembly Elections 2017 Opinion Poll Results: BJP predicted to win polls with thumping majority", "title_page": "Uttarakhand Assembly Elections 2017 Opinion Poll Results: BJP predicted to win polls with thumping majority | India News, India.com", "title_rss": "NULL", "source_domain": "india.com", "text": "Dehradun, Jan 15: With Assembly elections just round the corner, political parties mainly the Congress and Bharatiya Janta Party (BJP) are trying to woo every section of voters in Uttarakhand. 2017 is crucial for both Bharatiya Janta Party (BJP) as well as Congress as both the political parties will aim to win with thumping majority. All the 70 constituencies of Uttarakhand will go to poll in single phase on February 15 while the counting in all five poll bound states will be held on March 11, 2017.\nAhead of the polls, the cold war between Uttarakhand Chief Minister Harish Rawat and Pradesh Congress Committee (PCC) chief Kishore Upadhyay is however out in public. Apart from battle with rival party BJP, Harish Rawat is also battling for supremacy within the state unit of his party. Although the pre-election survey gives BJP the edge, it has still projected Harish Rawat as the best chief ministerial candidate. Rawat denied any discord between him and Upadhyaya and said, “By January 16, our party will come out with the list of candidates.”\nThere have been many pre-poll surveys to see which party is strong and who will win Uttarakhand polls. Uttarakhand legislative five-year tenure is however soon going to finish on 26th March 2017. Here are some pre-poll predictions:\nIndia Today-Axis Opinion Poll:\nThe India Today-Axis Opinion Poll shows that it will be difficult for the Congress party to retain power in the hill state. As per the pre-poll survey, BJP is predicted to win 41 to 46 seats in the 70-seat Uttarakhand legislative assembly while Congress is predicted to get 18-23 seats.\nParty Seat Share BJP 41 – 46 Congress 18 -23 Others 2 – 6\nABP News survey:\nAhead of the upcoming Uttarakhand polls 2017, the opinion poll conducted by ABP News gives Bharatiya Janata Party (BJP) an edge when compared to other major political parties in the state. The surveys released so far by regional media predicted Congress to be winning the elections. Out of the total 70 seats, the pre-poll survey claims that BJP would win 35-43 assembly seats. The opinion poll gives BJP a clean majority to form the government in the hilly state while the incumbent Congress, is predicted to win 22-30 seats.\n19 per cent of participants of the survey voted Rawat as the best CM choice among a list of competitors. BJP’s presumptive nominee BC Khanduri was voted by only 13 per cent of participants.\nParty Seats BJP 35-43 Congress 22-30 Total 70\nThe Congress Party has seen a sharp decline and hopes to gain a stronghold on Punjab this time while it also focuses to continue being in power in the hilly state Uttarakhand and Himachal Pradesh. The parties that are in power in Uttarakhand are Congress, Bahujan Samaj Party (BSP), Progressive Democratic Front. Currently, Uttarakhand is under the leadership of Harish Rawat who belongs to the Congress Party.\nThe ABP-CSDS Opinion Poll Uttarakhand Election 2017 survey predicted that BJP will win with a thumping majority with 34-43 seats that account to 40% of the votes share. The pre-poll survey placed Congress on the second position with 22-30 seats which account for 33% of the total.\nABP-CSDS Opinion Poll Uttarakhand Election 2017\nAs per ABP-CSDS Opinion Poll Uttarakhand Election 2017, BJP is predicted to get 34-43 seats out of the total 70 seats in the Uttarakhand legislative assembly, accounting to 40% of the votes share. Meanwhile, Congress is predicated to get 20-30 seats that accounts for 33% votes shares.\nParty Seat Share Votes Share % BJP 34-43 40 Congress 22-30 33\nUttarakhand Assembly Election 2017 Opinion Poll by VDP Associates\nDate: 16 July 2016\nParty Seat Share Vote % Sharing BJP 40 39 Congress 24 34 BSP 2 7 Others 4 13 Undecided – 7\nThe Uttarakhand Assembly Election 2017 Opinion Poll by VDP Associates suggests that BJP will win 40 seats out of the 70 seats which accounts to 39% of the total vote share. Despite all their efforts in the election-bound states, Congress is on number second position with 24 seats that account for 34% vote sharing.\nDate Polling Agency BJP INC Others Mar 2016 ABP News Opinion Poll 35-43 seats 22-30 seats – Aug 2016 ABP-CSDS Opinion Poll 34-43 seats 22-30 seats – Oct 2016 India Today-Axis 41 – 46 seats 18 -23 seats 2- 6 seats July 2016 VDP Associates 40 seats 24 seats 6 seats\nThe Congress in Uttarakhand conducted a pre-election survey internally to predict its stand in the upcoming polls. The survey predicted that the party is going to win 33 out of 70 seats in the state going to polls this February. Uttarakhand Congress president Kishore Upadhyay claimed that the survey shows the party in a formidable position in another 10 seats. He said that the Congress may win 43 seats and said that if it becomes true, it will be the biggest electoral victory for a party in the history of the state. The upcoming polls in five states of India is being touted as the semi-final in the run up to 2019 General Elections.", "url": "https://www.india.com/news/india/uttarakhand-assembly-elections-2017-opinion-poll-results-1761122/", "label": 1}