{"authors": [], "date_download": "2019-03-27 14:25:50", "date_modify": "2019-03-27 14:25:50", "date_publish": "2018-12-13 15:11:19", "description": "Thiruvananthapuram, Dec 13: A 49-year-old man allegedly in an inebriated state set himself on fire outside Kerala government Secretariat in Palayam area of the city during Thursday wee hours. The victim, identified as Venugopalan Nair, doused himself in some flammable liquid and then lit his clothing outside the Secretariat, the local police said. He was immediately rushed to the nearby Trivandrum Medical College Hospital for the treatment.", "filename": "news_drunk-man-sets-self-ablaze-near-bjp%E2%80%99s-protest-venue-he%E2%80%99s-ayyappa-devotee-claims-bjp_1553696750.html", "image_url": "http://www.coastaldigest.com/sites/default/files/field/image/fire_20.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/coastaldigest.com/news_drunk-man-sets-self-ablaze-near-bjp%E2%80%99s-protest-venue-he%E2%80%99s-ayyappa-devotee-claims-bjp_1553696750.html", "title": "Drunk man sets self ablaze near BJP’s protest venue; he’s Ayyappa devotee, claims BJP", "title_page": "Drunk man sets self ablaze near BJP’s protest venue; he’s Ayyappa devotee, claims BJP | Coastaldigest.com - The Trusted News Portal of India, Coastal Karnataka", "title_rss": "NULL", "source_domain": "coastaldigest.com", "text": "Thiruvananthapuram, Dec 13: A 49-year-old man allegedly in an inebriated state set himself on fire outside Kerala government Secretariat in Palayam area of the city during Thursday wee hours.\nThe victim, identified as Venugopalan Nair, doused himself in some flammable liquid and then lit his clothing outside the Secretariat, the local police said. He was immediately rushed to the nearby Trivandrum Medical College Hospital for the treatment.\nNair is said to be in a critical state and is under observation in the Intense Care Unit. The incident took place at around 1:30 am in the morning near the BJP's venue of protest against restrictions on women's entry into Sabarimala temple. Police are yet to ascertain the reason behind the victim's extreme step.\nBJP, however, alleges that Nair was Lord Ayyappa's devotee and was upset because of the ongoing row over the ban on women of a particular age entering Sabarimala temple.\nBJP's state unit president, P Sreedharan Pillai had on Friday had announced a protest outside Kerala Secretariat over Sabarimala temple issue. The protest which will continue for 14 days is expected to see the party members from each of 14 districts coming to Thiruvananthapuram to protest each day.\nSome of the demands of the BJP include lifting the ban on the restrictions over the movement of female devotees in Sabarimala temple and stringent action against the police officials for allegedly filing a false case against K Surendran, the party's general secretary.\nA string of protests has been witnessed in the state after the Supreme Court's verdict of allowing women of all age groups to enter the Lord Ayappa shrine. Female devotees in the age bracket of 10 to 50 years have not yet succeeded in offering prayer at the shrine even after the Apex Court's decision.", "url": "http://www.coastaldigest.com/news/drunk-man-sets-self-ablaze-near-bjp%E2%80%99s-protest-venue-he%E2%80%99s-ayyappa-devotee-claims-bjp", "label": 1}