{"authors": ["Pragati Ratti Sharma"], "date_download": "2019-03-27 14:35:05", "date_modify": "2019-03-27 14:35:05", "date_publish": "2017-03-29 15:29:17", "description": "The farmers of Tamil Nadu who have been protesting at Jsntar Mantar for over 15 days protested with dead snakes in their mouths on Wednesday, intensifying their stir. - Tamil Nadu farmers protesting with skulls at Jantar Mantar hold dead snakes in their mouths as mark of protest", "filename": "news_india__1553697305.html", "image_url": "https://www.india.com/wp-content/uploads/2017/03/tamil-nadu-farmers-snakes.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/india.com/news_india__1553697305.html", "title": "Tamil Nadu farmers protesting with skulls at Jantar Mantar hold dead snakes in their mouths as mark of protest", "title_page": "Tamil Nadu farmers protesting with skulls at Jantar Mantar hold dead snakes in their mouths as mark of protest | India News, India.com", "title_rss": "NULL", "source_domain": "india.com", "text": "New Delhi, March 29: The farmers of Tamil Nadu who have been protesting at Jsntar Mantar for over 15 days protested with dead snakes in their mouths on Wednesday, intensifying their stir. In the past few days, the farmers have demonstrated with live mice in their mouths, with skulls of dead farmers and what not, demanding drought relief from Centre.\nAt least 84 drought-hit farmers from Tamil Nadu launched the ‘skull protest’ at Jantar Mantar two weeks ago. The agitating farmers are demanding the formation of a Cauvery Management Committee, linking of all rivers by Smart Waterways Project and profitable prices for agricultural produce. They have also demanded a farm loan waiver for them.\nThe Tamil Nadu government has demanded Rs 40,000 crore from the Centre for drought-hit farmers. However, according to reports the Centre has allocated just Rs 2,000 crore so far.\nThe farmers have been protesting in the capital even as the temperature continues to rise. The South Indian community in the national capital has been helping them with food and ration. The farmers refuse to budge till their demands are met. In the past few days, they have tried different methods of protesting.\nLast week, two young farmers climbed a tree at Jantar Mantar shouting out their demands. One of the farmers’ was even demonstrated as a corpse as a mark of protest. Besides that, the farmers also kept live mice in their mouths to demonstrate.", "url": "https://www.india.com/news/india/tamil-nadu-farmers-protesting-with-skulls-at-jantar-mantar-hold-dead-snakes-in-their-mouths-as-mark-of-protest-1972780/", "label": 1}