{"authors": ["Agencies Our Bureau"], "date_download": "2019-03-27 14:18:23", "date_modify": "2019-03-27 14:18:23", "date_publish": "2018-03-01 21:40:45", "description": "Releases ‘charge-sheet’, launches 14-day yatra; Siddaramaiah accuses BJP of ‘looting’ the city", "filename": "news_national_under-congres_dca4e1c5ff1b3a243d1a310d920daf46_article22896858_1553696303.html", "image_url": "https://www.thehindubusinessline.com/migration_catalog/article22896855.ece/ALTERNATES/LANDSCAPE_615/BL02JAVDEKAR", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/thehindubusinessline.com/news_national_under-congres_dca4e1c5ff1b3a243d1a310d920daf46_article22896858_1553696303.html", "title": "Under Congress, crime is rife in Bengaluru, says BJP", "title_page": "\nUnder Congress, crime is rife in Bengaluru, says BJP - The Hindu BusinessLine\n", "title_rss": "NULL", "source_domain": "thehindubusinessline.com", "text": "The BJP will on Friday launch a ‘Protect Bengaluru’ yatra, even as it targeted the Congress government in Karnataka over “increasing” cases of crime, releasing a city-specific ‘charge-sheet’ against the ruling party.\nIn response, Karnataka Chief Minister Siddaramaiah accused the BJP of “looting” the city while it was in power.\n“What is the use if looters do any yatre (yatra)? They (BJP) looted while in power,” Siddaramaiah told reporters.\nAnnouncing the ‘Bengaluru Rakshisi Padayatre’, Union HRD Minister Prakash Javadekar said the BJP would visit all 28 constituencies in the city and call upon the people to root out the Congress.\nThe 14-day yatra will criss-cross Bengaluru with a call to save the city from “Congress’ misrule” and revive the BJP, the party’s State unit said on its official Twitter handle.\nThis is the second march launched by the party, the first being the 85-day “Parivarthana Yatra” that concluded on February 4. That yatra had travelled to all 224 Assembly constituencies in the State and virtually sounded the poll bugle.\nReleasing a booklet carrying the “failures” of the Congress government, Javadekar alleged that Bengaluru had been reduced to “garbage city and crime city” ever since Siddaramaiah took over as Chief Minister.\nThe BJP also brought out a Bengaluru specific “charge-sheet” against the Congress. “The charge-sheet is an eye-opener. A decent city has been converted into a crime city. Now it’s ‘Goonda Raaj’ when we see the happenings in the last one month,” the Union Minister said.\nGoondas were attacking police, robbing their houses and snatching their revolvers in Bengaluru, he alleged. “Once considered the safest city for women, Bengaluru has become the most unsafe city today due to increasing cases of rape, abduction and chain snatching. This is the transformation done by Congress under Siddaramaiah,” he said.\nTaking on the the saffron party, State Home minister Ramalinga Reddy referred to various incidents where those associated with the BJP were allegedly involved in violent acts. He said action had been taken in all cases, including one in which a Congress MLA’s son was involved.\n“When we came to power, BJP that was in power earlier had left Bengaluru Mahanagara Palike (city civic body) with ₹8,000 crore in debt...we need to save people of Bengaluru from BJP, as they are the ones who are goondas,” he said.", "url": "https://www.thehindubusinessline.com/news/national/under-congress-crime-rife-in-bengaluru-says-bjp/article22896858.ece", "label": 1}