{"authors": [], "date_download": "2019-03-27 14:29:03", "date_modify": "2019-03-27 14:29:03", "date_publish": null, "description": "After her massive protest rally in Lucknow, West Bengal Chief Minister and Trinamool Congress (TMC) supremo Mamata Banerjee will stage a dharna at the Gardanibagh ground in Patna today against demonetisation of Rs 500 and Rs 1000 notes", "filename": "news_Articles_India_20161130_3002610_1553696943.html", "image_url": "https://www.webindia123.com/shared_files/ssl/images/favicon.ico", "language": null, "localpath": "/home/raj/news-please-repo//data/2019/03/27/news.webindia123.com/news_Articles_India_20161130_3002610_1553696943.html", "title": "Mamata to stage dharna against 'note-bandi' at Patna", "title_page": "Mamata to stage dharna against 'note-bandi' at Patna", "title_rss": "NULL", "source_domain": "news.webindia123.com", "text": "After her massive protest rally in Lucknow, West Bengal Chief Minister and Trinamool Congress (TMC) supremo Mamata Banerjee will stage a dharna at the Gardanibagh ground in Patna today against demonetisation of Rs 500 and Rs 1000 notes. Ms Banerjee has been demanding rollback of the Centre's demonetisation decision. She has been vehemently opposing the Modi led Central government's demonetisation move since it was announced on November 8. Before coming to Patna, she staged dharnas in Delhi and Lucknow. She reached Patna yesterday after staging a dharna in Lucknow where she was welcomed by her UP counterpart Akhilesh Yadav. Talking to the media on her arrival at the Patna airport, Ms Banerjee sought to downplay her Bihar counterpart Nitish Kumar's support to Prime Minister Narendra Modi on the demonetisation of high value currency notes by saying every party has its own views on the issue. \"Every party and leader have their own perspective on the issue of demonetisation,\" Ms Banerjee said. She has invited RJD chief Lalu Prasad Yadav to take part in the agitation. Senior TMC leader and Rajya Sabha member Mukul Roy had met Mr Prasad in Patna on November 25 to extend the party's invitation to him for his party's programme but the RJD supremo was unsure at that time also as he was not keeping well. \"CM @MamataOfficial came & discussed difficulties faced by ppl due to improper implemntation of demonetization. RJD wil join her protest tom,\" Mr Yadav tweeted. Several members of the Samajwadi Party were present at the Lucknow rally. Addressing the rally, Ms Banerjee targeted the Prime Minister for demonetisation and said that the people from all sections of society the common man, the farmers, the labourers, housewives -- were facing problems. \"The people of Uttar Pradesh have made you the Prime Minister and they can remove you from the post too,\" she added. Ms Banerjee questioned: \"Why only account details from Nov 8? Just three weeks? Why not for last 2-1/2 years? PM Ji you think you alone are intelligent!\" \"You have started note-bandi, people will reply with vote-bandi. After your 21 days of note-bandi, the whole country is ghar bandi, so why this farce?\" she asked. She accused Mr Modi of mismatch between his words and actions. The BJP was looting the country without declaring Emergency, she said and accused the ruling party of depriving people of their constitutional rights. Ms Banerjee slammed the Centre for not planning before going ahead with demonetisation and said the BJP was aware of this move in advance. Calling note-bandi a scandal, she said the fight will go on and she \"is even ready to go to jail\".UNI BM AD1432 -- (UNI) -- C-1-1-DL0108-1045180.Xml", "url": "https://news.webindia123.com/news/Articles/India/20161130/3002610.html", "label": 1}