{"authors": [], "date_download": "2019-03-27 14:18:11", "date_modify": "2019-03-27 14:18:11", "date_publish": "2019-03-27 00:00:00", "description": null, "filename": "news_newsDisplay.aspx_newsID=514785_1553696291.html", "image_url": "http://daijiworld.com/images/daijiSquareLogo.png", "language": null, "localpath": "/home/raj/news-please-repo//data/2019/03/27/daijiworld.com/news_newsDisplay.aspx_newsID=514785_1553696291.html", "title": "AAP, BJP protests 'drama', people of Delhi real victims: Rahul Gandhi", "title_page": "\r\n\tAAP, BJP protests 'drama', people of Delhi real victims: Rahul Gandhi - Daijiworld.com\r\n", "title_rss": "NULL", "source_domain": "daijiworld.com", "text": "New Delhi, Jun 18 (Deccan Chronicle): As the Aam Aadmi party's sit-in protest at Lieutenant Governor Anil Baijal's residence continues, Congress party president Rahul Gandhi on Monday took to Twitter to call the protest a 'drama' and said that the real victims were the people of Delhi.\nArvind Kejriwal, Manish Sisodia, Satyendar Jain, and Delhi Development Minister Gopal Rai have been camping at Anil Baijal’s waiting room since June 11, refusing to leave until the L-G makes IAS bureaucrats in the Delhi government end their “strike”.\nRahul Gandhi's tweeted saying: Delhi CM, sitting in Dharna at LG office. BJP sitting in Dharna at CM residence. Delhi bureaucrats addressing press conferences. PM turns a blind eye to the anarchy; rather nudges chaos & disorder. People of Delhi are the victims, as this drama plays out.\nThis is the first time that the Congress chief has reacted to AAP's protest which began last week.\nAAP leaders accompanied by thousands of party workers on Sunday marched towards Prime Minister Narendra Modi’s residence on Sunday in support of their ministers’ protest.\nAlso Read: Delhi dy CM Manish Sisodia, on hunger strike at L-G's office, hospitalised\nWest Bengal Chief Minister Mamata Banerjee, Karnataka Chief Minister H D Kumaraswamy, Kerala Chief Minister Pinarayi Vijayan and Andhra Pradesh Chief Minister N Chandrababu Naidu have also backed CM Arvind Kejriwal.", "url": "http://www.daijiworld.com/news/newsDisplay.aspx?newsID=514785", "label": 1}