{"authors": [], "date_download": "2019-03-27 14:18:23", "date_modify": "2019-03-27 14:18:23", "date_publish": "2016-09-14 00:00:00", "description": "Massive protests over water sharing in southern India. People in Karnataka state are afraid that sharing water will leave their fields and taps dry", "filename": "news_massive-protests-over-water-sharing-in-southern-india_77078_1553696303.html", "image_url": "https://www.ucanews.com/uploads/2016/09/1473331380.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/ucanews.com/news_massive-protests-over-water-sharing-in-southern-india_77078_1553696303.html", "title": "Massive protests over water sharing in southern India- ucanews.com", "title_page": "\r\nMassive protests over water sharing in southern India- ucanews.com", "title_rss": "NULL", "source_domain": "ucanews.com", "text": "Mass protests have intensified in the southern Indian state of Karnataka after the Supreme Court asked the government there to share water with neighboring Tamil Nadu state, provoking an old dispute . Several highways were blocked with logs and burning tires when hundreds of farmers, especially in Mandya district, demonstrated against the government releasing water from the Cauvery River. The Supreme Court on Sept. 5 directed the Karnataka state government to release water from their dam every day for the next 10 days. The court took a lenient view on Tamil Nadu's claim that there was not enough water for their summer crops. The verdict infuriated farmers in Karnataka. Protesters attacked government offices in Mandya forcing them to shut down. The administration was forced to issue a ban on their public assembly. Mandya area has become the \"center of protest as local farmers believe they will be affected more,\" said Father George Alukka, vicar general of the Mandya Diocese. \"Most people grow sugarcane which needs a lot of water.\" Farmers in both states depend on water from the Cauvery, a major river that flows through the area and into the Bay of Bengal. Since 1892 people in the two states have disputed how best to share the water supply. The Karnataka government initially said that \"not a drop\" of water would go to Tamil Nadu but relented after the court order. State Chief Minister Siddaramaiah (who uses only one name) expressed his inability to defy the Supreme Court . Protesters claim that sharing water will leave their own fields and taps dry and several organizations have called for a general strike on Sept. 9 threatening to \"shut down\" the state. They want to close all educational institutions, government offices, transport services and markets as a mark of protest. \"There is fear and that is why people are agitated,\" Father Alukka said. \"If people are affected, local Catholics are also affected.\" A Protestant Christian group called Prayer Warriors supports the protest. The court order makes \"our state a devastated state\" it said noting the tension on the border connecting both the states, where inter-state buses and trucks have been stopped and attacked. \"Vehicles have been stopped at the border,\" they wrote in a letter. \"Many people want to comment suicide in protest, properties have been damaged and Karnataka has lost its peace. We don't want any farmers to die.\" The letter noted that the chief minister promised that the state would not suffer any water shortages although the basis of his confidence is unknown. \"We stand for our state and pray everyday\" said the Prayer Warriors.", "url": "https://www.ucanews.com/news/massive-protests-over-water-sharing-in-southern-india/77078", "label": 1}