{"authors": ["Sakshi Post"], "date_download": "2019-03-27 14:34:59", "date_modify": "2019-03-27 14:34:59", "date_publish": "2017-09-27 00:00:00", "description": "It may be recalled that Andhra Pradesh government held an auction in Chennai on March 28, 2016 to sell 83.11 acres of the Sadavarthi lands.", "filename": "news_2017_09_18_sadavarthi-lands-sold-for-rs-6030-crore-_1553697299.html", "image_url": "https://images.assettype.com/sakshipost/2017-09/aa85fdba-fb2c-468f-92b6-02088565cef9/1.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/english.sakshi.com/news_2017_09_18_sadavarthi-lands-sold-for-rs-6030-crore-_1553697299.html", "title": "Sadavarthi Lands Sold For Rs 60.30 Crore", "title_page": "\n\nSadavarthi Lands Sold For Rs 60.30 Crore  - Sakshipost", "title_rss": "NULL", "source_domain": "english.sakshi.com", "text": "AP Endowments commissioner Anuradha, who supervised the auction, said a detailed report of the auction will be submitted to the Supreme Court. It may be recalled that Andhra Pradesh government held an auction in Chennai on March 28, 2016 to sell 83.11 acres of the Sadavarthi lands. However, after YSRCP MLA Alla Ramakrishna Reddy approached the Tamil Nadu high court that the lands were being sold for paltry amount, the arguments prolonged for more than a year culminating in Monday's auction.\nYSRCP Proved Right In The Sale Of Sadavarthi Lands\nVijayawada: The YSR Congress Party (YSRCP) has been proved right once again following the sale of Sadavarthi lands for Rs 60.30 crore on Monday, the party spokesperson Vasireddy Padma said.\nAddressing the media, she said YSRCP had mentioned on several occasions that the AP government was trying to sell the controversial lands at throwaway prices. “It was only after YSRCP MLA Alla Ramakrishna Reddy filed a petition in the High Court that the misdeeds of the TDP government came to light and the subsequent re-auction was ordered.” she said.", "url": "https://english.sakshi.com/news/2017/09/18/sadavarthi-lands-sold-for-rs-6030-crore-", "label": 1}