{"authors": ["Clashes Break Out Between Police", "Villagers In Meghalaya", "Stone Pelting", "Arson Reported"], "date_download": "2019-03-27 14:40:34", "date_modify": "2019-03-27 14:40:34", "date_publish": "2019-01-29 01:11:52", "description": "Says they will go ahead with those who adhere to Hindutva", "filename": "news_states_fadnavis-to-sena-bjp-is-not-a-helpless-party_article26115405_1553697634.html", "image_url": "https://www.thehindu.com/static/theme/default/base/img/og-image.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/thehindu.com/news_states_fadnavis-to-sena-bjp-is-not-a-helpless-party_article26115405_1553697634.html", "title": "Fadnavis to Sena: BJP is not a helpless party", "title_page": "\nFadnavis to Sena: BJP is not a helpless party - The Hindu\n", "title_rss": "NULL", "source_domain": "thehindu.com", "text": "Chief Minister Devendra Fadnavis on Monday said while the Bharatiya Janata Party (BJP) is interested in a tie-up with the Shiv Sena, it is not helpless and more than prepared to contest the elections on its own.\n“Yes, we want an alliance [with the Sena], but we are not helpless or dependent upon it. The BJP is the party of Atal Bihari Vajpayee and Narendra Modi…the only reason we are interested in an alliance is because we do not want power in the hands of the Congress and other opposition parties who have looted the country,” Mr. Fadnavis said at the BJP’s day-long State executive meet in Jalna district.\nThe CM further said the BJP will move forward with those allies who adhere to the principle of Hindutva. “We [the BJP] will take those who side with us, or else we will fight on our own. Our party’s national president Amit Shah has already clarified this point.”\nMr. Fadnavis’ remark was a thinly-veiled jibe at Sena president Uddhav Thackeray and his attempts to position himself as the mascot of the Hindutva vote bank.\nBJP State president Raosaheb Danve said while the BJP is ready for an alliance, it all depends on whether the Sena is willing to hold out its hand.\nHitting out at the Congress and the Nationalist Congress Party (NCP), Mr. Fadnavis said the Opposition neither has any vision nor any direction and that the formation of regional alliances against Mr. Modi will come a cropper. “Unlike the Congress, the BJP is not a dynastic party, but that of the people… the Opposition cannot even decide on a leader before the election. These parties have no aim and are only motivated by sheer political opportunism and their desire to supplant Mr. Modi. But they will not succeed.”\nHe said, “Who will come to listen to Sharad Pawar if he holds a rally in Manipur…but people across India throng to listen to the Prime Minister.”\nMr. Fadnavis also said the BJP government firmly stands by farmers in their hour of crisis and that the government’s ‘Shivaji Maharaj Shetkari Sanman’ scheme will not be closed till the last farmer gets justice.\n“I challenge leaders of the Congress and the NCP to produce records of those farmers who have benefited from their ₹6,000 crore waiver scheme,” he said.", "url": "https://www.thehindu.com/news/states/fadnavis-to-sena-bjp-is-not-a-helpless-party/article26115405.ece", "label": 1}