{"authors": [], "date_download": "2019-03-27 14:35:22", "date_modify": "2019-03-27 14:35:22", "date_publish": "2016-09-13 00:00:00", "description": "Maintaining that the situation is peaceful, police said stringent action would be taken against miscreants or vandals. | Karnataka will implement 'difficult' SC order, 1 dies in Cauvery violence", "filename": "news_report_cauvery-violence-updates-in-karnataka-tamil-nadu_20160913_1553697322.html", "image_url": "http://im.rediff.com/news/2016/sep/13karna5.jpg", "language": null, "localpath": "/home/raj/news-please-repo//data/2019/03/27/rediff.com/news_report_cauvery-violence-updates-in-karnataka-tamil-nadu_20160913_1553697322.html", "title": "Karnataka will implement 'difficult' SC order, 1 dies in Cauvery violence", "title_page": "Karnataka will implement 'difficult' SC order, 1 dies in Cauvery violence - Rediff.com India News", "title_rss": "NULL", "source_domain": "rediff.com", "text": "Last updated on: September 13, 2016 20:18 IST\nA day after being rocked by large-scale violence, the city appeared to limp back to normal on Tuesday with sporadic protests, even as the Karnataka government decided to comply with the Supreme Court’s modified order to release 12,000 cusecs of water Tamil Nadu till September 20.\nIMAGE: Charred remains of the vehicles in Bengaluru on Tuesday, a day after they were torched by pro-Kannada activists during their violent protests over Cauvery water row. Photograph: PTI\nAs the Cauvery unrest kept the country’s IT capital on the boil, the government warned of dealing with an “iron hand” any violence after an emergency cabinet meeting which took stock of the situation and decided to comply with the apex court order passed on Monday.\nA 30-year-old man died on Tuesday of multiple injuries he suffered while escaping police lathicharge when he jumped in panic from a three-storey building on Monday, police said, with the toll in the unrest over Cauvery row rising to two.\nOne person had died in police firing on Monday.\nKarnataka Chief Minister Siddaramaiah said the victim did not die due to police action, but due to the injuries he had suffered.\nIMAGE: Police raises his baton at a man who defied a curfew in Bengaluru, following violent protests in Karnataka over the Cauvery river. Photograph: Abhishek N Chinnappa/Reuters\nFacing more pressure after the apex court’s modified order, Siddaramaiah held an emergency cabinet meeting which decided that though it was “most difficult” to follow, the direction could not be disobeyed or rejected as it would be against the Constitution.\n“This order is the most difficult to follow. But when we are functioning within the framework of the Constitution, though it is a difficult order, as a constitutionally formed government it is difficult to violate or reject the Supreme Court order. It will be a violation of the Constitution,” he said.\nSiddaramaiah said the cabinet, after weighing the pros and cons “constitutionally, legally and politically” and keeping in mind the main Special Leave Petition challenging the Cauvery tribunal’s final award coming up on October 18, decided to obey the court order.\nHe said the first order passed on September 5 itself was difficult and Monday’s was “most difficult” to follow.\n“But we have accepted the federal set up and that the legislature, executive and judiciary should function in a way complementary to one another,” he said.\nIMAGE: Members of the security forces make their way past burning lorries in Bengaluru, which were set on fire by protesters. Photograph: Abhishek N Chinnappa/Reuters\nIn its September 5 order, the apex court had directed release of 15,000 cusecs for 10 days to ameliorate the plight of farmers of the neighbouring state, which had triggered strong protests from farmers and pro-Kannada outfits with Karnataka observing a bandh against it on September 9.\nThe chief minister said he would meet Prime Minister Narendra Modi, seeking his intervention and requesting him to call a meeting of chief ministers of both states to resolve the issue.\nAn immediate appointment had been sought and “probably we will get it tomorrow.”\nIn Bengaluru, under prohibitory orders till Wednesday and where 16 localities remained under curfew, there were palpable signs of normalcy returning, as city police assisted by central forces kept a close vigil.\nIMAGE: Curfew remains imposed in Bengaluru and schools and colleges remain shut on Tuesday. Photograph: Abhishek N Chinnappa/Reuters\nA bus that was half burnt on Monday was torched once again on Tuesday near New Timber layout and another vehicle was also set on fire near Tigalarapalya here. Both had Tamil Nadu registration number plates.\nPolice lobbed tear gas at Hegganahalli and Pattegarapalaya as protesters tried to burn tyres on the streets, defying curfew.\nPolice are also conducting combing operations in several sensitive areas and dispersing crowds that are gathering.\nKarnataka Home Minister G Parameshwara said the police commissioner would decide on continuing or lifting of curfew depending on the situation.\nSporadic protests have been reported in various parts of the state like Mandya, Chitradurga, Ramanagara and Mysuru.\nIMAGE: Police personnel disperse pro-Kannada activists during their violent protest over Cauvery water row, in Bengaluru. Photograph: PTI\nIn Chitradurga, a lorry with Tamil Nadu registration number was burnt, while in Ramanagara protesters held demonstrations in front of a farmhouse reportedly belonging to a daughter of former Tamil Nadu Chief Minister M Karunanidhi.\nShooting of a Tamil film was stopped by protesters at Jaganmohan palace in Mysuru, police said.\nIn a video message to the people, Siddaramaiah warned of stringent action against any act of vandalism or disturbance to peace.\nStating that some organisations and political forces were behind Monday’s violence, Parameshwara said more than 300 people have been arrested so far and more arrests would follow.\nIt is the government’s responsibility to protect public and their property and “we will do our work without any hesitation,” he added.\nAsked whether the government had failed in assessing the situation and in maintaining law and order, he said, “We did our best and we showed some sort of tolerance, but that has been misused.”\nPointing out that the violence was an instantaneous reaction to the developments in Tamil Nadu, Parameshwara said, “We have controlled it as far as possible, or else there were chances of it going out of control and more loss of lives.”\nHe said that other than a couple of stray incidents, the situation is peaceful.\nWATCH: Security tightened in Karnataka\nParameshwara said the government has decided to give Rs 10 lakh compensation each to families of the two persons killed.\nSidddaramaiah held consultations with senior Congress leaders from the state on the prevailing situation.\nSpeaking to reporters after the meeting, Congress Leader in the Lok Sabha Mallikarjun Kharge sought the prime minister’s intervention.\nHe said the prime minister has to convene a meeting of chief ministers of riparian states for an out-of-court settlement of the issue.\n“I request the prime minister at this critical juncture as it involves inter-state water dispute. His role is important for peaceful settlement of the dispute, he said.\nThe bustling IT city was bereft of its monstrous traffic with very few vehicles moving on city roads. Schools, colleges and government offices also remained shut due to Bakr Eid on Tuesday.\nBengaluru Metropolitan Transport Corporation operated buses in select areas in the city, where cab aggregators and autorickshaws also plied, though in lesser numbers.\nOfficials said transport services to Tamil Nadu remain suspended. Metro Rail services have been temporarily stopped.\nHe said that other than a couple of stray incidents, the situation is peaceful.\nMeanwhile, domestic airlines including national carrier Air India on Tuesday announced waiving off flight cancellation/ rescheduling changes for some of their flights for a specified period.\nAir India said it would not charge any fee for cancellation of a ticket or rescheduling of its flights to and from Bengaluru and Hubli upto September 16.\n\"On account of disturbance, Air India waives applicable penalties of re-issuance, date change, no-show, cancellation & refund charges for travel from/to BLR & HBX for both dom & intl flts,on all tkts issued on/before Sept 13th '16 for trvl on Sept 13th '16,\" Air India tweeted.\nPrivate carriers Jet Airways and Vistara also said they have decided to waive off date and flight change fee due to the situation in the Karnatka capital.\n\"Due to the present situation in BLR (Bangalore), we are waving off date and flight change fee to & from BLR for travel on 13th & 14th Sep,\" Vistara said in a tweet.\nDue to the current situation in Bengaluru, we will waive off penalties for date change & flight change on confirmed tickets to and from Bengaluru for September 12 and 13, Jet Airways announced.", "url": "https://www.rediff.com/news/report/cauvery-violence-updates-in-karnataka-tamil-nadu/20160913.htm", "label": 1}