{"authors": ["India.Com News Desk"], "date_download": "2019-03-27 14:34:58", "date_modify": "2019-03-27 14:34:58", "date_publish": "2017-09-13 12:52:01", "description": "At the protest, DMK President MK Stalin said that the protest is not for any political reason and is not aimed at capturing power. - Tamil Nadu Opposition Parties Hold Protest, Demand Exemption of NEET Exam", "filename": "news_india__1553697298.html", "image_url": "https://www.india.com/wp-content/uploads/2017/09/red.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/india.com/news_india__1553697298.html", "title": "Tamil Nadu Opposition Parties Hold Protest, Demand Exemption of NEET Exam", "title_page": "Tamil Nadu Opposition Parties Hold Protest, Demand Exemption of NEET Exam | Exams & Results News, India News, India.com", "title_rss": "NULL", "source_domain": "india.com", "text": "Coimbatore, Sep 13: Opposition parties in Tamil Nadu held a protest in Coimbatore demanding exemption of NEET exam, days after 17-year-old Dalit girl Anitha, who led a campaign against the exam, committed suicide. At the protest, DMK President MK Stalin said that the protest is not for any political reason and is not aimed at capturing power. “This is a protest for safeguarding the interest of students,” he said at the protest.\nAnti-protests are being conducted by opposition parties across Tamil Nadu since Anitha committed suicide. Anitha hung herself on September 1, a week after NEET was made mandatory by the government. She had sought admissions into medical colleges based on the score of twelve standard final examination.\nA day after her suicide, members of Naam Tamilar Katchi staged a protest over her death demanding exemption of NEET exam. Students’ Federation of India members too staged a protest at Chennai’s Mount Road. The party members said that it is wrong to make NEET the only criteria to get seats in medical colleges.\nIn class 12 board exams, Anitha had scored 1,176 marks out of 1,200. Anitha had scored 196.75 out of 200 for a medical seat and 199.76 out of 200 for an engineering seat. However, she scored only 86 out of 700 in the NEET exam.\nGrieving over the death of Anitha, her father told the media that her daughter was concerned about the NEET exam and managed to study despite unfavourable circumstances. “What wrong had she done, who will answer?” asked Anitha’s father.\nOn September 6, an anonymous letter which threatened that a bomb would go off each month at Tamil Nadu railway station till NEET is withdrawn. Police said that the threat letter was received by a senior railway official.", "url": "https://www.india.com/news/india/tamil-nadu-opposition-parties-hold-protest-demand-exemption-of-neet-exam-2468010/", "label": 1}