{"authors": [], "date_download": "2019-03-27 14:35:20", "date_modify": "2019-03-27 14:35:20", "date_publish": "2017-07-24 07:21:00", "description": "The association will make a representation to state finance minister D Jayakumar, asking him to place their demands to the GST council.", "filename": "news_industry_gst-tamil-nad_92686fe8b14d53e0162f02049646333a_59731051_1553697320.html", "image_url": "https://etimg.etb2bimg.com/thumb/msid-59731051,imgsize-33324,width-800,height-434,overlay-etretail/gst-tamil-nadu-traders-association-to-stage-protest-in-chennai-on-july-25.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/dc21dd9a3fe65a3d1ffd1dba9014397b/news_industry_gst-tamil-nad_92686fe8b14d53e0162f02049646333a_59731051_1553697320.html", "title": "GST: Tamil Nadu Traders Association to stage protest in Chennai on July 25", "title_page": "GST: GST: Tamil Nadu Traders Association to stage protest in Chennai on July 25, Retail News, ET Retail", "title_rss": "NULL", "source_domain": "retail.economictimes.indiatimes.com", "text": "COIMBATORE: The Tamil Nadu Traders Association will stage a protest in Chennai on July 25 against the tax rates under the goods and services tax system that was implemented on July 1.The association will make a representation to state finance minister D Jayakumar , asking him to place their demands to the GST council.The secretary of the Tamil Nadu Traders Association, Coimbatore, K P Kumaran said, “We have been told by the officials of the central government that any representation regarding the GST has to be made to the state finance ministers. They will place our requests to the GST council.”The traders association feels that only if the requests are made in the initial days of the GST regime, they will be able to get them fulfilled. “We hope our demands are heard in the first three-four months,” said Kumaran.The traders association want the revenue cap for tax being upped from Rs 75 lakh to Rs 1.5 crore. “There are many traders in the city and the state who will get affected because of this. The GST council should consider this,” said association district vice-president T Soundararaj. Soundararaj pointed out that Tamil Nadu had exempted 589 grocery items from tax until GST was implemented. “Under GST, nearly 500 of these 589 products are being taxed. The tax ranges from 5% to 28%. This has impacted the traders as well as the common man,” said Soundararaj.“We are also creating awareness among the public about the new tax rates on the products under the GST,” he added.The traders association has prepared a 10-point memorandum that will be handed over to the state government to be placed in front of the GST council.“If our demands are not heard, then we will go on a day-long strike on August 8,” said Soundararaj.", "url": "https://retail.economictimes.indiatimes.com/news/industry/gst-tamil-nadu-traders-association-to-stage-protest-in-chennai-on-july-25/59731051", "label": 1}