{"authors": [], "date_download": "2019-03-27 14:40:29", "date_modify": "2019-03-27 14:40:29", "date_publish": "2018-03-08 00:00:00", "description": "The BJP has taken one more step towards a Left-mukt Bharat and is gloating over it. Narendra Modi. Amit Shah. Rajnath Singh. Lenin. Saffronisation. JNU. Mahabharat. Gajendra Chauhan. Yellapragada Sudershan Rao. ICHR. CPI(M). Manik Sarkar. Ramayana.", "filename": "news_india_2018_03_08_modi-mishandling-statue-rekindling-earlier-wrongs-lenin_1553697629.html", "image_url": "https://www.theweek.in/content/dam/week/news/india/images/2018/3/8/lenin-pti.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/theweek.in/news_india_2018_03_08_modi-mishandling-statue-rekindling-earlier-wrongs-lenin_1553697629.html", "title": "Modi govt mishandling statue issue, rekindling its past wrongs", "title_page": "Modi govt mishandling statue issue, rekindling its past wrongs | Narendra Modi |  Amit Shah |  Rajnath Singh |  Lenin |  Saffronisation |  JNU |  Mahabharat |  Gajendra Chauhan |  Yellapragada Sudershan Rao |  ICHR |  CPI(M) |  Manik Sarkar |  Ramayana", "title_rss": "NULL", "source_domain": "theweek.in", "text": "Two days after a statue of Communist icon Vladimir Lenin was demolished by activists celebrating the victory of the BJP in Tripura, and hours after a statue of Dravidian movement leader Periyar was vandalised in Vellore, Prime Minister Narendra Modi on Wednesday took up the matter with Home Minister Rajnath Singh. On his part, BJP president Amit Shah issued statements condemning the acts of violence.\nThe statement issued by the PMO said Modi “strongly condemned the reported incidents of vandalism in certain parts of the country and said stern action will be taken against those found guilty.” The home minister, in turn “took serious note of such incidents of vandalism, and expressed his strong disapproval of such incidents.”\nTo be fair, senior BJP leaders have never directed their supporters to go after the statues of leaders who represent the 'other ideologies'. But there are other things they have done that send out a message to some of their supporters, which includes lumpen elements no less than society as a whole does.\nFor one, Modi, Shah and company have openly enjoyed Nehru-bashing that goes beyond what is required, permissible and acceptable in a democracy. Going beyond the political rhetoric and speeches, they have taken steps to obliterate all things Nehruvian. The Planning Commission has become the NITI Aayog. The BJP leadership has tried to rewrite history in order to underplay or erase leaders or heroes, and bring upfront others in their place. Attempts have been made to alter school syllabi for similar reasons.\nTo drive all this, the BJP-led government has moved very subtly and swiftly—brought in people from the RSS background into departments, institutions and organisations dealing with history, archaeology and culture in educational institutions and bodies regulating and administering higher education.\nEarly into the Modi government's term, when Nobel laureate economist Amartya Sen was removed as chancellor of Nalanda University, he had warned that the government was trying to take over academic institutions. There is a sudden rash of institutions, parks and buildings that have been named after Deen Dayal Upadhyay.\nThere is a subtle way in which the thinking of youth towards Hindutva-connected ideas is being moulded and the way the government handled the Jawaharlal Nehru University issue—saffronising what was a freethinkers' campus—is all too well known.\nSome students of Benares Hindu University had protested against a question in their paper on “Social and Political Thoughts of Ancient India.” One of the students, Vikram Singh, national general secretary of the Students Federation of India, wrote in his blog, “The whole idea is to compel the students to think in a certain way.”\nAnother student who did not want to be identified given the atmosphere of fear that prevailed, said, “Students are being taught these fictitious concepts just to validate the policies of the present government.” The 'concepts' pertained to GST in the times of Kautilya's Arthashastra and Manu as the first global citizen!\nAmong the first few acts of saffronising higher institutions was the appointment of Yellapragada Sudershan Rao as chairperson of the ICHR. Rao has long believed that Ramayana is not mythology but history. In fact, it was his role as the mythological Yudhisthira in the television serial Mahabharata that landed Gajendra Chauhan, hardly known otherwise, the top job at the Indian Film and Television Institute—an appointment that led to protests and agitations there. Not surprisingly, he was a member of the BJP! Gopinath Ravindran, a former member secretary of the Indian Council of Historical Research, had raised concerns over the attempts to have history reframed, if not rewritten.\nTherefore, while the party is promoting its icons and brushing aside those of other parties with the help of administrative control the government has, its supporters are doing the same but in their own way!\nThe destruction of the Lenin statue was neither stopped nor condemned for almost 48 hours. On the contrary, BJP leaders were allowed to defend it charitably. One can say the BJP's frenzied fans were celebrating the 3 per cent margin victory in Tripura.\nIt took only a few hours for the BJP leadership to wake up to the hooliganism and vandalising of statue of Periyar in Tamil Nadu—after BJP leader H. Raja mentioned the possibility in a Facebook post—because in the southern state, the saffron party is trying to woo voters and fish for a share in a future government, through the AIADMK.\nThe Dravidian parties as well as a lot of people in Tamil Nadu are miffed because Periyar represents Tamil pride. And not coming down on those who did this would have jeopardised whatever chances the BJP has of building an electoral relationship with the AIADMK. It also gave the BJP the chance to come down on Kolkata students who rampaged and vandalised a statue of Shyama Prasad Mukherjee.\nFrom its stated goal of having a 'Congress-mukt Bharat', the BJP has taken one more step towards a Left-mukt Bharat and is gloating over it.\n'New India' will have many things that will be India reimagined by the BJP. One will be a map that will be all saffron. To paint this saffron in Tamil Nadu, the BJP needs the AIADMK, which is itself fumbling post Jayalalithaa's demise.\nAlong with New India, the party is ushering in new politics. “Hatred and division is the face of the BJP and it is a reflection of a new kind of politics,” said Congress' national spokesperson Randeep Surjewala.\nBut a party so conscious of history and culture should also be conscious of preserving the two. These statues may not be akin to the Bamiyan Buddhas, but they nevertheless represent history. With no more than months to go for the Lok Sabha elections, the government is clearly mishandling the statue issue, in the process rekindling all its earlier, similar wrongs.", "url": "https://www.theweek.in/news/india/2018/03/08/modi-mishandling-statue-rekindling-earlier-wrongs-lenin.html", "label": 1}