{"authors": [], "date_download": "2019-03-27 14:29:24", "date_modify": "2019-03-27 14:29:24", "date_publish": "2017-11-08 00:25:00", "description": "He took on the Congress-led UPA government saying that it was all about policy paralysis whereas the present BJP-led NDA govt is all about \"structural reforms\".", "filename": "news_politics-and-nation_ar_e2b1d0828eda4fc5a687dc3665cbc04a_61545689_1553696964.html", "image_url": "https://img.etimg.com/thumb/msid-61545824,width-1070,height-580,imgsize-165135,overlay-economictimes/photo.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/economictimes.indiatimes.com/news_politics-and-nation_ar_e2b1d0828eda4fc5a687dc3665cbc04a_61545689_1553696964.html", "title": "Arun Jaitley calls demonetisation \"watershed moment\", says will make India a clean economy", "title_page": "demonetisation: Arun Jaitley calls demonetisation \"watershed moment\", says will make India a clean economy - The Economic Times", "title_rss": "NULL", "source_domain": "economictimes.indiatimes.com", "text": "Announcement of demonetisation was a watershed moment for the Indian economy, finance minister Arun Jaitley said on Tuesday, even as he slammed the Congress for criticising a step that has led to a “more formal, less-cash and a cleaner economy” with a “higher taxpayer base”.In an interaction with the press on the eve of the first anniversary of the demonetisation announcement, Jaitley described it as a “moral step”. He was speaking hours after former PM Manmohan Singh rubbished demonetisation as an “organised loot and legalised plunder” that had led to job losses and, along with goods and services tax, broken the back of small businesses. “The anti-black-money step is a moral step.What is morally and ethically correct has to be politically correct,” Jaitley said, while taking on Congress. “Loot is what was done in 2G spectrum allocation, Commonwealth Games scam and coal block allocation. Our and Congress views of what is ethical are different. Their primary objective is to serve the family (Nehru-Gandhis), while ours is to serve the nation,” he said.“It is surprising that the ethical and moral rationale behind such a move is being called loot.” He said Congress-led UPA had not taken any step to check corruption and black money for the 10 years that it was in power. “We in BJP believe this status quo needed to be shaken up for the country’s economy and its future,” Jaitley said.“It is common knowledge that cash is anonymous. When demonetisation was implemented, one of the intended objectives was to put identity on the cash holdings in the economy,” Jaitley wrote in a blog, “A Year after Demonetisation”.", "url": "https://economictimes.indiatimes.com/news/politics-and-nation/arun-jaitley-calls-demonetisation-watershed-moment-says-will-make-india-a-clean-economy/articleshow/61545689.cms", "label": 1}