{"authors": ["In This New Podcast Series Tracking Major Campaign Speeches Across The Country", "Varghese K George Is In Conversation With Jayant Sriram To", "Opposition Shows Video Of", "Bjp Leader", "Exchanging Old Currency Past Deadline"], "date_download": "2019-03-27 14:41:05", "date_modify": "2019-03-27 14:41:05", "date_publish": "2016-11-28 09:33:33", "description": "Even Hitler would not have thought of such a thing, says Mamata.", "filename": "news_national_Mixed-respons_31f24ba51e454b3d85473f3b484cd2b6_article16714474_1553697665.html", "image_url": "https://www.thehindu.com/news/national/article16714657.ece/ALTERNATES/LANDSCAPE_615/Vishakapatnam%20protest.jpg2", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/thehindu.com/news_national_Mixed-respons_31f24ba51e454b3d85473f3b484cd2b6_article16714474_1553697665.html", "title": "Mixed response to nationwide protest call against demonetisation", "title_page": "\nMixed response to nationwide protest call against demonetisation - The Hindu\n", "title_rss": "NULL", "source_domain": "thehindu.com", "text": "A nationwide shutdown called by Left parties against the demonetisation of high value currency evoked partial response across the country on Monday.\nWhile the Left parties, including the CPI(M) and the CPI, called a 12-hour bandh to protest against the move in West Bengal, Mamata Banerjee’s TMC will not join it and only hold protests.\nThe Congress decided not to participate in the bandh. Senior party leader Jairam Ramesh said no ‘Bharat bandh’ has been called by the party, which will hold nationwide protests as part of ‘Jan Aakrosh Diwas’.\nThe JD(U) also decided not to participate in the protests after its leader and Bihar Chief Minister Nitish Kumar welcomed the demonetisation decision.\nUttarakhand\nKavita Upadhyay reports from Dehradun that the ruling Congress party decided to observe Monday as Jan Akrosh Divas, instead of a bandh. The reason: business has already taken a toll due to currency crisis, according to the party.\nKerala\nThe United Democratic Front, which stood by the government at the special session of the State Assembly to adopt a resolution on the crisis in the cooperative sector, has chosen to distance itself from the hartal.\nLeaders and activists of the Opposition alliance staged a dharna outside Raj Bhavan in Thiruvananthapuram. Addressing the rally, Leader of the Opposition Ramesh Chennithala came down heavily on Mr. Modi and his government over the demonetisation which, he said, had heaped untold misery on the ordinary people.\nMr. Chennithala and other Opposition leaders, MLAs and activists were arrested and removed by the police.\nBiju Govind reports from Kozhikode:\nA dawn-to-dusk hartal called by the LDF began at 6 a.m. This time, special exemptions have been given to banks, hospitals, tourist centres, Sabarimala pilgrims and weddings.\nNo untoward incident has been reported so far in Kozhikode.Hartal is near total in the city. Banks are functioning. State-run KSRTC bus services to Sabarimala are not affected.\nMohamed Nazeer reports from Kannur:\nThe shutdown is near total as shops remained closed, and vehicles, barring two-wheelers, were off the roads. LDF workers took out a protest march in support of the hartal. It was led by CPI (M) district secretary P. Jayarajan and CPI district secretary P. Santhosh.\nLeaders of the Left Democratic Front take out a protest march against demonetisation in Kannur on Monday.\nCongress workers stage a 'Shayana Pradakshinam' at the Town Square to register their protest. Police say no hartal related incidents have been reported so far.\nIn Malappuram, Latheef Naha says, hartal is partial and peaceful. While shops and business firms remain closed, private vehicles were seen running. Long queues were witnessed outside banks.\nLeft Front activists take out a protest march against the demonetization, in Kasaragod on Monday. Photo: K. Vinaya Kumar | Photo Credit: K. Vinaya Kumar\nWest Bengal\nOur Kolkata Correspondent Shiv Sahay Singh says the Left parties took out a rally in the city. CPI(M) State secretary Surjya Kanta Mishra, along with Left Front chairperson Biman Basu led the rally from Moulali to Mullick Bazar in the heart of city.\nMr. Basu says the bandh has evoked mixed response. In the coming months when people will not get salary they will realise the need for such strikes.\nSchool, colleges and most of the private offices are closed today. The State Secretariat - Nabanna - is open and functioning, says Suvojit Bagchi, our Chief of Bureau. There are traffic snarls in key arterial roads connecting north and south Kolkata due to rallies.\nShout slogans like me: Mamata\n\"We have one thing to say — withdraw the decision,\" says Mamata. ''Such a thing (move to demonetise higher currency) has never happened in any country. Even Hitler would not have thought of such a thing.\" She claims that intellectuals of the country have hit the streets for the first time in the State.\nReaching out to the Left parties, she says, \"You have to hit the streets, friends from the Left. Shout slogans like me.\"\nNew Delhi\nLeaders of Left Parties, including CPI(M) general secretary Sitaram Yechury, address a gathering during a protest march. Photo: R.V. Moorthy\nTamil Nadu\nChennai correspondent R. Sivaraman says leaders of the CPI(M), the CPI and the VCK staged a demonstration in Nungambakkam, Chennai.\nTiruchi correspondent R. Rajaram says the DMK and the Congress staged a protest demonstration in the city. Later in the day, the DMK is set to protest in the central region.\nOver 800 DMK cadres stage protests in front of the head post offices in Pudukottai, Karur and Kumbakonam.\nKarthik Madhavan reports from Coimbatore that around 800 DMK and Congress cadres staged a protest near the Red Cross Junction, seeking the withdrawal of demonetisation move. Former Union Minister A. Raja and four district secretaries of the DMK lead the protest.\nCadres belonging to the Left parties and the VCK, led by former MLA K. Thangavelu, also stage a protest.\nProtests near the Coimbatore Collectorate and the nearby Coimbatore South Taluk office choke the arterial Avinashi Road and nearby areas.\nP.V. Srividya reports that DMK cadres, led by MLA Thadangam Subramani, and those belonging to the Congress staged a protest outside the head post office in Dharmapuri.\nVCK president Thol. Thirumavalavan has criticised Mr. Modi for refusing to answer in Parliament and branding everyone opposing demonetisation as black money hoarders.\nD.J. Walter Scott from Ramanathapuram reports that former DMK Minister Suba Thangavelan, his son and District Secretary Diwakaran were among 159 arrested when they attempted to lay siege to the post office in Paramakudi protesting against demonetization.\nBihar\nAmarnath Tewary reports on happenings in Bihar:\nSeveral trains in Patna, Jehanabad, Gaya, Bhojpur and Muzaffarpur were stopped by supporters of Left parties. The ruling party JD(U) has opposed the bandh, while its two alliance partners, the RJD and the Congress, have supported it.\nRJD workers are expected to take out a protest march from the party office at Birchand Patel Marg to Dak Bungalow at 11 a.m.\nAndhra Pradesh\nPolice arrested activists of Left parties and the Congress who staged a demonstration at the Kadapa RTC bus stand.\nThe Left parties protesting in Vijayawada during 'Bharat Bandh' | Photo Credit: Ch. Vijaya Bhaskar\nLeft parties stage a protest in Vijayawada against the demonetisation move. Photo: Ch. Vijaya Bhaskar\nThe shutdown call evokes mixed response in Srikakulam district. A majority of the schools and colleges remain closed as managements have declared holiday to avoid inconvenience to students.\nSeveral shops continue to function. Opposition parties have confined their protest to the RTC Bus Stand, Potti Srirramulu Junction, 7 Road Junction.\nKarnataka\nRaghava M. and Rishikesh report:\nLife was normal in Mangaluru and other parts of Dakshina Kannada. Schools and colleges were open. There was no disruption of city and mofussil buses. Protest against demonetisation has minimal impact in Bidar.\nPolice on high alert at K.R.Circle in Mysuru. | Photo Credit: M.A. Sriram\nPolice on high alert at K.R. Circle in Mysuru. Photo: M.A. Sriram\nM. Ahiraj reports from Ballari that life remained unaffected in the district. Business establishments and educational institutions functioned normally.\nVeerendra Pinaki Murigeppa says there was no impact of the shutdown on life in Shivamogga district. Education institutions and commercial establishments were open. The public transport services were normal in Shivamogga, Bhadravathi cities and in rural areas.\nPuducherry\nRajesh B. Nair says Chief Minister V. Narayanasamy will be a part of the Congress' protest in front of an HDFC bank at Nellithope.\nCadres of the CPI(M), the CPI and the RSP stage a rail roko at the Puducherry Railway Station. Photo: S.K.S. Kumar\nDMK cadres stage a protest in front of a post office on Rangapillai Street.", "url": "https://www.thehindu.com/news/national/Mixed-response-to-nationwide-protest-call-against-demonetisation/article16714474.ece", "label": 1}