{"authors": ["Ians Feeds"], "date_download": "2019-03-27 14:40:27", "date_modify": "2019-03-27 14:40:27", "date_publish": "2017-06-07 18:11:29", "description": "Mandsaur/Indore (Madhya Pradesh), June 7 (IANS) Fresh violence broke out on Wednesday in Madhya Pradesh, a day after security forces fired at protesting farmers killing up to eight of them and sparking tensions across the state. - Fresh violence in MP, farmers say eight killed", "filename": "news_agencies__1553697627.html", "image_url": "https://s3.india.com/wp-content/uploads/2015/06/indiacom-image-banner_01.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/india.com/news_agencies__1553697627.html", "title": "Fresh violence in MP, farmers say eight killed", "title_page": "Fresh violence in MP, farmers say eight killed | Agencies News, India.com", "title_rss": "NULL", "source_domain": "india.com", "text": "Mandsaur/Indore (Madhya Pradesh), June 7 (IANS) Fresh violence broke out on Wednesday in Madhya Pradesh, a day after security forces fired at protesting farmers killing up to eight of them and sparking tensions across the state.\nDefying curfew, hundreds of farmers took to the streets in Mandsaur district where police opened fire on Tuesday at a mob of peasants, leaving five dead according to official count and eight according to farmer outfits.\nAnd some 200 km away, a group of farmers marched to a police station in Dewas district and set fire to an unspecified number of vehicles parked there on Wednesday.\nThe farmers then stopped two buses and 10 other vehicles plying on the Indore-Bhopal highway and torched them. But none of the occupants were hurt.\nOfficials in Bhopal said Chief Minister Shivraj Singh Chouhan was keeping Prime Minister Narendra Modi informed about the situation. He also held a meeting with his senior ministers to discuss ways to restore peace.\nMadhya Pradesh Home Minister Bhupendra Singh had on Tuesday denied the police opened fire but he did not reiterate this on Wednesday as he met senior police officials.\nHundreds of angry farmers on Wednesday continued to block roads and also attacked two senior officials at Mandsaur.\nMandsaur District Magistrate Swatantra Kumar Singh and Indore Superintendent of Police O.P. Tripathi were roughed up when they reached Barkheda Pant where the farmers were squatting on a road with the body of one of those killed on Tuesday.\nSingh and Tripathi wanted to persuade the farmers to end their protest but the attempt backfired.\nSingh was chased by the farmers, with some repeatedly hitting him on the head. Tripathi had a tough time too. Police reinforcements which rushed to the spot rescued both the officials.\n“The situation is tense but under control,” a senior official said on Wednesday.\nThe administration in Mandsaur on Wednesday barred politicians, including those from the Congress and the ruling Bharatiya Janata Party, from visiting the troubled areas, saying this would only fuel more unrest.\nThe farmers allege that the Madhya Pradesh Police and the Central Reserve Police Force (CRPF) deliberately opened fire at them on Tuesday when they were protesting demanding that their loans be written off and their produce be bought by the government at a fair price.\nAt least seven farmers were also wounded in the police firing. Police said it were the farmers who triggered the violence.\nThe farmers retaliated by torching more than 30 vehicles. In a bid to control the situation, authorities imposed curfew late on Tuesday in parts of Mandsaur.\nAn official said the curfew would remain in force until further orders.\nLeaders of three farmers’ organisations alleged in Indore that the number of people killed in police firing was eight and not five. One of the dead was a college student.\nRepresentative of the Rashtriya Kisan Mazdoor Sangh, Aam Kisan Union and Bharatiya Kisan Union accused the government of spreading lies about the farmers.\nAam Kisan Union founder Kedar Sirohi said: “By branding us anti-social elements, the government is adding fuel to the fire. On the one hand the government has unleashed repression on us, and on the other it is trying to defame us.”\nSirohi warned that if the situation did not change immediately, the farmers would resort to a “jail bharo” campaign across the state.\n“And in all the 53,000 villages of the state we will take out a mock funeral of the Chief Minister.”\nThe Congress extended support to a shutdown called by farmers in Madhya Pradesh on Wednesday.\nReports reaching Bhopal said the strike evoked varying response in Bhopal, Jhabua, Ujjain and Neemuch.\nFarmers in Madhya Pradesh have been on strike from June 1 to June 10 in support of their demands.\nThis is published unedited from the IANS feed.", "url": "https://www.india.com/news/agencies/fresh-violence-in-mp-farmers-say-eight-killed-2211181/", "label": 1}