{"authors": ["Known As The Poor Man S Cocaine", "Mephedrone Is Cheaper", "More Easily Available", "Therefore More In Demand", "Say Police"], "date_download": "2019-03-27 14:40:38", "date_modify": "2019-03-27 14:40:38", "date_publish": "2015-10-16 16:29:01", "description": "The Bombay High Court on Friday permitted the Shiv Sena to hold its annual Dussehra rally at Mumbai's Shivaji Park on October 22.\nA Division Bench on Justices V.M. Kanade and Shalini Phansalkar-", "filename": "news_cities_mumbai_shiv-sen_7a3a09679278780bf6de891d51987f44_article7770268_1553697638.html", "image_url": "https://www.thehindu.com/static/theme/default/base/img/og-image.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/thehindu.com/news_cities_mumbai_shiv-sen_7a3a09679278780bf6de891d51987f44_article7770268_1553697638.html", "title": "Shiv Sena gets court nod to hold Dussehra rally at Shivaji Park", "title_page": "\nShiv Sena gets court nod to hold Dussehra rally at Shivaji Park - The Hindu\n", "title_rss": "NULL", "source_domain": "thehindu.com", "text": "The Bombay High Court on Friday permitted the Shiv Sena to hold its annual Dussehra rally at Mumbai's Shivaji Park on October 22.\nA Division Bench on Justices V.M. Kanade and Shalini Phansalkar-Joshi granted the permission with the rider that noise pollution rules should be adhered to.\nThe court observed that since permission for the rally was being granted for the last three years, \"There was no reason to refuse it this year.\"\nOn Thursday, the government approached the court seeking its nod for the rally. The Sena also moved the court seeking permission for the event.\nAdvocate-General Shriharee Aney argued that as per the regulations, the government was required to issue a notification for holding \"non-sporting\" events at the park last November itself. However, it could not be done as the government was in the process of formation after the State Assembly elections in October 2014.\nHowever, a group of Shivaji Park residents objected to the rally on the grounds that the park was a silent zone and noise pollution norms regarding loudspeakers were routinely violated. The MNS too opposed the Sena's plea.\nThe government said that noise was \"a fact of life\" and use of different type of loudspeakers to distribute noise would not breach noise rules.\nThe Bench remarked that there were strong arguments on noise pollution and the issue will be decided finally after hearing the issue at length.", "url": "https://www.thehindu.com/news/cities/mumbai/shiv-sena-gets-court-nod-to-hold-dussehra-rally-at-shivaji-park/article7770268.ece", "label": 1}