{"authors": ["Nachiket Deuskar"], "date_download": "2019-03-27 14:29:14", "date_modify": "2019-03-27 14:29:14", "date_publish": null, "description": "Speaking to businessmen in Gujarat, Singh said that demonetisation and the shoddy implementation of the GST had pushed millions of Indians into terrible hardship.", "filename": "news_india_november-8-was-a-black-day-for-our-economy-and-democracy-manmohan-singh-2431655_1553696954.html", "image_url": "https://static-news.moneycontrol.com/static-mcnews/2017/04/manmohan_1280-763x435.jpg", "language": null, "localpath": "/home/raj/news-please-repo//data/2019/03/27/moneycontrol.com/news_india_november-8-was-a-black-day-for-our-economy-and-democracy-manmohan-singh-2431655_1553696954.html", "title": "November 8 was a black day for our economy and democracy: Manmohan Singh", "title_page": "November 8 was a black day for our economy and democracy: Manmohan Singh - Moneycontrol.com", "title_rss": "NULL", "source_domain": "moneycontrol.com", "text": "Former Prime Minister Manmohan Singh on Tuesday labelled last year’s demonetisation exercise as \"organised loot and legalised plunder\".\nSpeaking to small group of businessmen in Gujarat, one year after the note ban was implemented, Singh said that demonetisation and the shoddy implementation of the Goods and Services Tax (GST) had pushed millions of Indians into terrible hardship, thereby undoing the work of his United Progressive Alliance (UPA) government which he said had pulled 140 million Indians out of poverty.\n“The bad implementation of GST only benefited China,” said the former Prime Minister.\n#BREAKING -- Compliance of #GST procedures has become a nightmare for small businesses: Manmohan Singh pic.twitter.com/IFKtzjzvxY\n— News18 (@CNNnews18) November 7, 2017\nHe said that even a one percent drop in the GDP caused by the two major initiatives (demonetisation and GST) would be an immense loss for the economy.\nSingh said, \"Did the prime minister stop to consider the wisdom of the Mahatma (Gandhi) when he asked the Reserve Bank Governor to sign on the dotted line or while implementing the GST in utter haste?\"\nThe former prime minister also questioned PM Modi if he had thought about the impact on those in the informal sector, \"whose earnings have dried up because of shortage of cash\".\nSingh also took a veiled dig at Prime Minister Narendra Modi by comparing with India’s first deputy Prime Minister Sardar Patel.\n“Bravado and drama are poor substitutes for courage and conviction to execute well,” Singh added.", "url": "https://www.moneycontrol.com/news/india/november-8-was-a-black-day-for-our-economy-and-democracy-manmohan-singh-2431655.html", "label": 1}