{"authors": [], "date_download": "2019-03-27 14:40:53", "date_modify": "2019-03-27 14:40:53", "date_publish": null, "description": "With Chiraw dance, popularly known as the bamboo dance, from Mizoram, the cultural event began.\nNew Delhi: Delhi University’s Gargi College organised the first edition of the ‘Northeast Festival’ on Friday.\nThe event was attended by the Commonwealth Human Rights Initiative Director Sanjoy Hazarika, who held a discussion regarding the region.\nFurther multiple cultural events were organised showcasing dance and music of the north-eastern states.\nThe festival was aimed at promoting the traditions and culture of the northeastern region and creating awareness regarding the same among the students of the university.", "filename": "news_delhi_1066260__1553697653.html", "image_url": "https://i2.wp.com/www.siasat.com/wp-content/uploads/2018/03/DU_ANI.jpg?resize=600%2C330&ssl=1", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/nyoooz.com/news_delhi_1066260__1553697653.html", "title": "Northeast cultural event held at Delhi college", "title_page": "Northeast cultural event held at Delhi college | DELHI NYOOOZ", "title_rss": "NULL", "source_domain": "nyoooz.com", "text": "Advertisement\nWith Chiraw dance, popularly known as the bamboo dance, from Mizoram, the cultural event began. New Delhi: Delhi University’s Gargi College organised the first edition of the ‘Northeast Festival’ on Friday. The event was attended by the Commonwealth Human Rights Initiative Director Sanjoy Hazarika, who held a discussion regarding the region. Further multiple cultural events were organised showcasing dance and music of the north-eastern states. The festival was aimed at promoting the traditions and culture of the northeastern region and creating awareness regarding the same among the students of the university.", "url": "https://www.nyoooz.com/news/delhi/1066260/northeast-cultural-event-held-at-delhi-college/", "label": 1}