{"authors": [], "date_download": "2019-03-27 14:40:42", "date_modify": "2019-03-27 14:40:42", "date_publish": "2018-04-14 00:00:00", "description": "Amaravati: Andhra Pradesh Cabinet on Monday finalised strategy for the one-day hunger strike by Chief Minister N. Chandrababu Naidu on April 20 in", "filename": "news__1553697642.html", "image_url": "https://www.siasat.com/wp-content/uploads/2018/04/14APR148U-660x330.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/siasat.com/news__1553697642.html", "title": "Andhra Cabinet finalises strategy for CM's one-day hunger strike", "title_page": "Andhra Cabinet finalises strategy for CM's one-day hunger strike", "title_rss": "NULL", "source_domain": "siasat.com", "text": "Amaravati: Andhra Pradesh Cabinet on Monday finalised strategy for the one-day hunger strike by Chief Minister N. Chandrababu Naidu on April 20 in Vijayawada.\nNaidu will sit on hunger strike on his birthday against the Centre over the demand of Special Category Status (SCS) to the state.\nThe Cabinet meeting, chaired by Naidu, also decided that 13 ministers will organise simultaneous hunger strikes in the districts for which they are in-charge ministers.\nRemaining ministers will take part in the hunger strike along with the Chief Minister. The Cabinet requested the general public to take part in the hunger strikes in the large numbers.\nThe Cabinet meet assessed the bandh called by the opposition parties and observed that people have suffered due to the bandh.\n“In some areas, it was attempted to create violence. Tirupati incident, wherein a motorcycle was set ablaze, is the evidence of it,” a release said.\nThe Andhra Pradesh politicians have been protesting demanding SCS to Andhra Pradesh.\nNaidu led Telugu Desam Party (TDP) and the Bharatiya Janata Party-ruled Centre have been at the loggerheads ever since the announcement of 2018-19 Union Budget.\nThe TDP alleged that the Centre ignored the demand of ‘Special Category Status’ to Andhra Pradesh in the budget, while the latter brushed aside the charges.\nThe cabinet also took some decisions.\nChandranna Pelli Kanuka (marriage gift) scheme will be implemented from April 20 in which as many as 60,000 Scheduled Castes, Scheduled Tribes, Other Backward Classes, and minority couples are expected to be benefitted. Inter caste marriages, marriages of Divyangs (specially abled persons) will get extra benefit.\nThe Cabinet also decided that the stamp duty and registration fee will be exempted for houses to be built under Pradhan Mantri Awas Yojna.\nThe meeting also approved state aqua policy which paved way for setting up aqua zones in nine coastal districts in the state.\nThe Cabinet also approved to make Telugu Ganga drinking water project as drinking water and irrigation project. With 6672 crores allocation, it will bring 5.70 lakh acres into cultivation.\nAnimation, visual effects, gaming and comics policy also got the Cabinet’s nod. Forty-acre land will be given in Visakhapatnam for this purpose.\nThe Cabinet also discussed Agrigold victims issue and the Government’s decision will be informed to the court on April 25.\nANI", "url": "https://www.siasat.com/news/andhra-cabinet-finalises-strategy-cms-one-day-hunger-strike-1343263/", "label": 1}