{"authors": [], "date_download": "2019-03-27 14:34:54", "date_modify": "2019-03-27 14:34:54", "date_publish": "2019-03-28 00:00:00", "description": "Bengaluru [India], Oct. 1 (ANI): Karnataka Chief Minister Siddaramaiah has convened an all-party meeting in Bengaluru today to discuss future course of action,", "filename": "news_248148827_cauvery-dispute-karnataka-cm-to-convene-all-party-meeting-today_1553697294.html", "image_url": "https://cdn.bignewsnetwork.com/ani1475291567.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/srilankasource.com/news_248148827_cauvery-dispute-karnataka-cm-to-convene-all-party-meeting-today_1553697294.html", "title": "Cauvery dispute: Karnataka CM to convene all-party meeting today", "title_page": "Cauvery dispute: Karnataka CM to convene all-party meeting today", "title_rss": "NULL", "source_domain": "srilankasource.com", "text": "Bengaluru [India], Oct. 1 (ANI): Karnataka Chief Minister Siddaramaiah has convened an all-party meeting in Bengaluru today to discuss future course of action, in the wake of fresh Supreme Court order for release of 6,000 cusecs of Cauvery water per day till October 6 to Tamil Nadu.\nChief Minister has convened an all-party meeting of floor Leaders of both Houses, MPs, including central ministers representing the state, and Ministers concerned of Cauvery basin and district in-charge Ministers.\nMeanwhile, Union Water Resources Ministry asked four Cauvery basin states to nominate their representatives to be appointed on the Cauvery Water Management Board as directed by the Supreme Court.\nThe apex court has directed the Centre to set up the Board by October 4. It ordered all the stakeholders Karnataka, Tamil Nadu, Kerala and Puducherry to give names by 4 pm today of the representatives to be on the Board which will be chaired by Union Water Resources Minister Uma Bharti.\nWater Resources Secretary Shashi Shekhar said that letters have been issued to the four states seeking their nominations. (ANI)", "url": "https://www.srilankasource.com/news/248148827/cauvery-dispute-karnataka-cm-to-convene-all-party-meeting-today", "label": 1}