{"authors": [], "date_download": "2019-03-27 14:34:54", "date_modify": "2019-03-27 14:34:54", "date_publish": "2019-03-28 00:00:00", "description": "Bengaluru (Karnataka) [India], Sept. 30 (ANI): With the Cauvery water sharing problem remaining unresolved despite the Centre intervention, former Karnataka c", "filename": "news_248099355_adamant-tn-must-cooperate-let-expert-panel-examine-cauvery-issue-says-shettar_1553697294.html", "image_url": "https://cdn.bignewsnetwork.com/ani1475205966.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/srilankasource.com/news_248099355_adamant-tn-must-cooperate-let-expert-panel-examine-cauvery-issue-says-shettar_1553697294.html", "title": "'Adamant' TN must cooperate, let expert panel examine Cauvery issue, says Shettar", "title_page": "'Adamant' TN must cooperate, let expert panel examine Cauvery issue, says Shettar", "title_rss": "NULL", "source_domain": "srilankasource.com", "text": "Bengaluru (Karnataka) [India], Sept. 30 (ANI): With the Cauvery water sharing problem remaining unresolved despite the Centre's intervention, former Karnataka chief minister and Leader of Opposition in the Karnataka state assembly, Jagadish Shettar, has accused the Tamil Nadu Government of being uncooperative and adamant, and asked it to consider the interests of the people of Karnataka.\nShettar pointed out that Karnataka has honoured and implemented the Supreme Court orders of releasing 15000 cusecs and later 12000 cusecs of water, but could not continue as little water was left in reservoirs.\n\"Tamil Nadu has always been a adamant state. Being a neighbour state, they have to cooperate in all respects. They should not only see the interest of their own people, but also consider the interests of Karnataka people. We gave 5 tmc of water to Chennai from the Krishna Basin, and what we are asking is for drinking water purpose, not for crops. Whatever water is left at the reservoir, it is for drinking. It is unfortunate that Tamil Nadu is not at all cooperating for any negotiation. The Central government, according to the direction of the Supreme Court, also tried to resolve this issue, but they remain adamant,\" Shettar told ANI.\nShettar suggested that an expert committee must be formed comprising of representatives of both states and a third party state to examine the Cauvery reservoir and claimed that if they examine the 'entire truth will come out.'\nOn Thursday, a meeting was convened by Union Water Resource Minister Uma Bharti to iron out differences between both the states, however, it failed to reach any conclusion.\nAddressing the media, shortly after the meet, Bharti stated that no solution was arrived as the Tamil Nadu Government did not accept the Karnataka Government's suggestion of sending central sponsored expert committee to assess the Cauvery basin.\n\"If tension rises between Karnataka and Tamil Nadu, I am going to sit on a hunger strike on the border of both states,\" she threatened.\nThe apex court, had also expressed its displeasure over Karnataka's inaction, saying that it violates the spirit of federalism or cooperation between states.\nThe apex court on Tuesday directed the Karnataka government to release 6000 cusecs of water till Friday. (ANI)", "url": "https://www.srilankasource.com/news/248099355/adamant-tn-must-cooperate-let-expert-panel-examine-cauvery-issue-says-shettar", "label": 1}