{"authors": ["India Blooms News Service"], "date_download": "2019-03-27 14:18:33", "date_modify": "2019-03-27 14:18:33", "date_publish": "2019-03-27 00:00:00", "description": "Agartala, Aug 9 (IBNS): During her maiden mass rally in Tripura's capital Agartala on Tuesday, Trinamool Congress (TMC) supremo Mamata Banerjee urged the people to rule out CPI-M-led government in the state and to establish TMC government there, in upcoming Tripura assembly election.", "filename": "news-details_N_23117_mamata-banerjee-calls-for-a-change-in-tripura_1553696313.html", "image_url": "https://indiablooms.com/news_pic/2016/Mamata-rally-1470760244.jpg", "language": null, "localpath": "/home/raj/news-please-repo//data/2019/03/27/indiablooms.com/news-details_N_23117_mamata-banerjee-calls-for-a-change-in-tripura_1553696313.html", "title": "Mamata Banerjee calls for a change in Tripura", "title_page": "Mamata Banerjee calls for a change in Tripura | Indiablooms - First Portal on Digital News Management", "title_rss": "NULL", "source_domain": "indiablooms.com", "text": "Agartala, Aug 9 (IBNS): During her maiden mass rally in Tripura's capital Agartala on Tuesday, Trinamool Congress (TMC) supremo Mamata Banerjee urged the people to rule out CPI-M-led government in the state and to establish TMC government there, in upcoming Tripura assembly election.\nThe next assembly election in Left-ruled Tripura is scheduled to be held in 2018.\n\"After 34 years of Left's misrule in West Bengal, there is a surge of development in the state and it's time to establish Trinamool Congress (TMC) government in Tripura,\" Banerjee said.\nMocking the alliance between Left and Congress in Bengal, Mamata Banerjee said, \"The CPI(M) does not understand anything but torture, and the Congress is in cahoots with them.\"\n\"We came out of the Congress the day they sold their ideology to the CPI(M). We were able to establish Trinamool because we walked out of the Congress,\" she added.\nAttacking the BJP government in the Centre, Banerjee said, \"The BJP Government does not do any work, it only blows its own trumpets during elections.\"\n\"Breaking the federal structure, the BJP is interfering in the business of the state. BJP wants to scare us but we will keep marching forward fearlessly,\" she said.\nHitting out the Manik Sarkar-government in Tripura, the TMC supremo said, \"There is no such development in Tripura, except loot and plunder. CPI-M leaders are controlling the police force here.\"\n\"To end the misrule in this state and establish Ma-Mati-Manush government here, vote us in the upcoming assembly election,\" Mamata Banerjee further said.\nAfter maximum Congress MLAs of Tripura assembly joined Trinamool Congress (TMC), Mamata's party becomes the main opposition in the state.\nImage credit: AITC Official Facebook page.", "url": "https://indiablooms.com/news-details/N/23117/mamata-banerjee-calls-for-a-change-in-tripura.html", "label": 1}