{"authors": ["Sitting Mps Have Been Re-Nominated", "Veteran L.K. Advani Has Been Dropped", "Jobs", "Healthcare Are Top Priorities For Voters"], "date_download": "2019-03-27 14:29:07", "date_modify": "2019-03-27 14:29:07", "date_publish": "2016-06-20 00:00:00", "description": "Nearly two months after they protested against the Delhi government, guest teachers will be re-appointed to government schools.\nThe government on Saturday directed the Directorate of Education (DoE) t", "filename": "news_national_other-states__abeefb02bde903977424482fef03b003_article14432952_1553696947.html", "image_url": "https://www.thehindu.com/static/theme/default/base/img/og-image.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/thehindu.com/news_national_other-states__abeefb02bde903977424482fef03b003_article14432952_1553696947.html", "title": "Guest teachers reinstated in govt. schools", "title_page": "\nGuest teachers reinstated in govt. schools - The Hindu\n", "title_rss": "NULL", "source_domain": "thehindu.com", "text": "Nearly two months after they protested against the Delhi government, guest teachers will be re-appointed to government schools.\nThe government on Saturday directed the Directorate of Education (DoE) to reappoint all guest teachers in government schools who were previously removed due to transfer and postings of permanent teachers.\n“All the heads of schools are informed that the guest teachers engaged up to May 10 be re-engaged from July 1. In case any guest teacher fails to report to the school by July 8, it will be presumed that he/she is no longer interested in the re-engagement and no alternative arrangement will be made,” an official statement from DoE said.\n“Guest teachers removed due to indiscipline, poor performance shall not be re-engaged and the ones who have been disengaged prior to May 10 due to lack of vacancy in their earlier schools will be deployed suitably in a different school,” it added.\nThe services of 1,920 contractual teachers, all employed under the Sarva Siksha Abhiyan scheme, were terminated from March 31 reportedly due to “non-continuation” of the post by the Ministry of Human Resource Development.", "url": "https://www.thehindu.com/news/national/other-states/Guest-teachers-reinstated-in-govt.-schools/article14432952.ece", "label": 1}