{"authors": [], "date_download": "2019-03-27 14:40:24", "date_modify": "2019-03-27 14:40:24", "date_publish": "2019-03-26 00:00:00", "description": "The figure was released by the makers of the film Viacom in a statement on Thursday where they said the Rs 150 crore film was released in 4,000 screens.", "filename": "news_india_1-million-people-defied-threats-to-see-padmaavat-on-day-1-amid-protests-1642167_1553697624.html", "image_url": "https://images.news18.com/ibnlive/uploads/2018/01/Padmaavat-reuters.jpg", "language": null, "localpath": "/home/raj/news-please-repo//data/2019/03/27/news18.com/news_india_1-million-people-defied-threats-to-see-padmaavat-on-day-1-amid-protests-1642167_1553697624.html", "title": "A Million People Defied Threats to See Padmaavat on Day 1 Amid Protests", "title_page": "A Million People Defied Threats to See Padmaavat on Day 1 Amid Protests - News18", "title_rss": "NULL", "source_domain": "news18.com", "text": "Sanjay Leela Bhansali’s Padmaavat saw one million footfalls as cinema goers defied threats of violence to watch the film on first day.The figure was released by the makers of the film Viacom in a statement on Thursday where they said the Rs 150 crore film was released in 4,000 screens.Tension was palpable with security personnel deployed at cinemas, both cineplexes and single screen, and kept a tight vigil. However, no major incident was reported against any cinema hall.This came as Rajasthan, Gujarat, Madhya Pradesh and Goa state chapters of Multiplex Association of India said the film would not be screened in view of the tenuous law and order situation.Meanwhile, protests and acts of vandalism by Rajput groups were reported from Rajasthan, Bihar, Uttar Pradesh and Madhya Pradesh. In Jaipur, a bike rally was taken out by Karni Sena activists in protest against the release of the film while arterial roads were blocked and shops were vandalised. In Uttar Pradesh's temple town Varanasi, a man attempted to immolate himself but was stopped from doing so.\"Our protest against the film is continuing. The Rajput Karni Sena took out a bike rally in Jaipur and similar protests took place in other areas also,\" the group's president Mahipal Makrana told PTI.In the National Capital Region, Gurugram was tense following an attack on a school bus by protesters on Wednesday but no major incident was reported with some cinema halls showing the film under tight security. Meanwhile, police filed an FIR on the bus attack. The FIR does not mention Karni Sena but states that 50-60 protesters shouted slogans. So far, 29 people have been arrested in Gurugram, out of which 18 have been identified as attackers of the school bus.Karni Sena leader and ex-BJP member Suraj Pal Amu, who had announced a Rs. 10 crore bounty for beheading Sanjay Leela Bhansali and Deepika Padukone, was arrested in Gurugram on Thursday.Elsewhere in Haryana, fearing ransacking of their properties, theatre owners in places such as Sonipat and Panchkula refused to screen the movie.In Madhya Pradesh, educational institutions remained open but commercial establishments were closed in places such as Indore, Ujjain and Gwalior. In Gujarat, however, the bandh called by the Karni Sena evoked a tepid response with educational institutions, offices and markets open in most parts of the state. As a precautionary measure, the Gujarat State Road Transport Corporation (GSRTC) suspended bus services from Ahmedabad to Mehsana and Banaskantha, an official said.The drama also acquired political hues with Congress attacking the Centre and the BJP governments in Rajasthan, Haryana, Gujarat and Madhya Pradesh for the violent protests against Padmaavat. “Why is the Centre not doing anything to stop this violence? The BJP must answer to the people. The governments must be ashamed for their inaction,” said Congress spokesperson Priyanka Chaturvedi.Hitting out at BJP ruled Union and state governments of completely failing to stop violence over the release of film Padmaavat, AIMIM chief Asaduddin Owaisi said that PM Narendra Modi has surrendered to the ideology. Owaisi said, \"It’s nothing but pakoda politics being practised by BJP. PM in Davos said, we have removed red tape and laid red carpet. But PM and his party has laid red carpet for people who are indulging in violence. Small children are hurt, public property is being burnt, it’s happening only because of tactical support of BJP. It's the jobless youth, with no work, who are indulging into such violence”, he said.", "url": "https://www.news18.com/news/india/1-million-people-defied-threats-to-see-padmaavat-on-day-1-amid-protests-1642167.html", "label": 1}