{"authors": ["Known As The Poor Man S Cocaine", "Mephedrone Is Cheaper", "More Easily Available", "Therefore More In Demand", "Say Police"], "date_download": "2019-03-27 14:40:49", "date_modify": "2019-03-27 14:40:49", "date_publish": "2015-06-02 03:12:22", "description": "IIT Bombay forms Ambedkar-Periyar-Phule Study Circle", "filename": "news_cities_mumbai_iitm-ban-protests-spread-to-mumbai_article7272310_1553697649.html", "image_url": "https://www.thehindu.com/static/theme/default/base/img/og-image.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/thehindu.com/news_cities_mumbai_iitm-ban-protests-spread-to-mumbai_article7272310_1553697649.html", "title": "IIT-M ban: protests spread to Mumbai", "title_page": "\nIIT-M ban: protests spread to Mumbai - The Hindu\n", "title_rss": "NULL", "source_domain": "thehindu.com", "text": "Protests against the decision of IIT Madras administration to ban the Ambedkar-Periyar Study Circle (APSC) spread to Mumbai on Monday with over a hundred students from different institutions staging a rally at the Dadar station here.\n“We see nothing wrong with what APSC has done. It is not a new group. We condemn the decision to ban it. Even if you think they did something wrong, they should have been given a fair hearing. This is just one visible instance of the administration’s autocratic behaviour. This issue is not limited to IIT Madras alone. Across IITs, there are various problems, such as poor implementation of the reservation systems, absence of Dalit faculty and so on. What does it mean when they say IITs are not political? Everything is political. To be political is my right,” Kranthi Kumar, a Ph.D. scholar from IIT Bombay told The Hindu.\nIn response to the ban, students from IIT Bombay have formed an Ambedkar-Periyar-Phule Study Circle, which staged its first protest on campus on Sunday.\n“Even though we stood silently with posters, the IIT security personnel, administration and the police threatened us with adverse action. We were told to remove the mention of the HRD Ministry from our posters. So the message is ‘don’t say anything against the government’. It is very important for students across campuses to come together,” Paanki Agrawal from IIT Bombay said.\nProtesters chanted the slogans such as, ‘when will achche din come?’, ‘long live Ambedkar and Periyar’, ‘down with casteism’ and demanded a revocation of the ban.\n“We express our solidarity with the study circle and with the aim of annihilation of the caste system. Silencing of voices is a dangerous step,” said Bodhayan Roy from the Marxist study circle at the Tata Institute of Fundamental Research.\n“Such bans,” pointed out Sunija M.V. from the Tata Institute of Social Sciences (TISS), “will obstruct the support system of marginalised students on campuses. As a result you will see more student suicides.”\nStudents also questioned the irony of demonising the ideas of Dr. Ambedkar, the architect of the Constitution.\n“Are we living in dualism?” asked Jackson Khumukcham from TISS. “It is time to think about the kind of education we want to impart. ” he said.", "url": "https://www.thehindu.com/news/cities/mumbai/iitm-ban-protests-spread-to-mumbai/article7272310.ece", "label": 1}