{"authors": [], "date_download": "2019-03-27 14:35:39", "date_modify": "2019-03-27 14:35:39", "date_publish": "2017-06-10 05:53:20", "description": "Author Anand Neelakantan talks about his books, his views about religion and Leftism", "filename": "news_regular-story_speaking-with-the-author-who-wrote-the-prequel-to-baahubali_1553697339.html", "image_url": "http://governancenow.com/temp/anand_neelakanath.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/governancenow.com/news_regular-story_speaking-with-the-author-who-wrote-the-prequel-to-baahubali_1553697339.html", "title": "Speaking with the author who wrote the prequel to Baahubali", "title_page": "Speaking with the author who wrote the prequel to Baahubali -Governance Now", "title_rss": "NULL", "source_domain": "governancenow.com", "text": "Author Anand Neelakantan talks about his books, his views about religion and Leftism\nAnand Neelakantan is known for his style of counter-telling Indian mythology. His first three books followed the counter-telling style, and narrated stories of mythological villains like Ravana and Duryodhana. With his recent book The Rise of Sivagami – which is a prequel to the hit film Bahubali, he has also ventured into the genre of fantasy fiction. Apart from the books, Neelakantan has also written for the TV serials like Siyaa Ke Raam and Adalat.\nCan you tell us about your first book from the Bahubali trilogy?\nThe Rise of Sivagami is an official prequel to the movie Bahubali. Rajamouli [director of the film Bahubali] was familiar with my work, so he was interested. He asked me to write this prequel. It’s part of a trilogy and begins 30 years before the era in which the film was set up. The third book ends where the film begins. I have taken two-three characters from the film, and have made rest of the characters. Rajamouli will be making a mini TV series based on these books. He gave me some boundaries for the characters which have appeared in the film – like the character of Sivagami. He drew these boundaries as he told me about the things these characters can do, and the things they can’t. Other than that, he gave me full freedom for the plots and the characters that I have created.\nIn your previous books like Asura: Tale of the Vanquished or Ajaya: Roll of the Dice, you have presented the narrative from the perspective of the antagonists of the Indian mythological scriptures. How did you come to empathise with them?\nI was always been fascinated with the so called negative characters. The moment you take the divinity, the magic etc. out of them, they become very interesting human beings. So, I was really sympathetic to their cause. One side cannot be totally wrong or totally right, so I wanted to read between the lines. Since my childhood, I was rebellious and used to argue a lot about these things. Actually, when you are not bound by religion, these are the questions that occur naturally to you – like how could it be the ‘dark age’ or the ‘age of Kali’, when it was the war of good vs bad and good always won? I used to ask these questions, and till date, I haven’t got any answer. As the books were well-received and were translated to other languages as well, I think the thought has been accepted by the readers.\nDo you plan to expand beyond the genre of mythological fiction?\nI am new writer and it has been just five years of my career. I have come up with four books and written for TV as well. I would definitely like to write for all the genres and would not stick to just one. I am also thinking of writing a children’s book. Horror is one of my most favourite genres.\nWe have seen that some of the rationalists and atheists, who present an alternate view on religion, are being attacked or even killed today -- not just in India, but all over the world. Your comments.\nThis is not a new thing which is happening. All throughout the history, these things have happened in various societies, various civilisations. Mahabharata talks about one Cārvāka being killed. We’re not sure whether it’s the same Cārvāka, but Cārvāka was an atheist philosopher. After the Mahabharata war, he questioned Krishna. Some of the versions say that he was burnt in the fire of anger of Brahmins. Socrates also died like that.\nReligion is always about extremism. In between, there are brief intervals in history when there’s enlightenment, when liberty and freedom come. We are in that cycle of the history right now, when the religion is ascending again. The interludes are really brief when there exists free thinking. The enlightenment in Europe, the renaissance – all of this has come after thousands of years of dark ages. So, there are 40-50 years of enlightenment, and then we go back to the religion. That’s how religion has survived. We can’t escape the cycle. We’re living in a country, where because of religious extremism, a country was divided into two, and the father of the nation was killed. So, I don’t think anything has suddenly changed. The social media and everything is amplifying it and making it more visible to us, that’s all.\nKerala – your home state – has elected a Left government in these times. How do you perceive that?\nKerala’s leftists are no Leftists at all. Kerala’s leftists are pseudo-leftists. I think, there is nothing left of the Left anywhere. Kerala has always alternated between the two governments – five years of Congress’ rule and five years of Communists’ rule. So after five years, Congress will come back. This is what has been happening in the last 50 years.\nWhere do you see India ten years from now?\nIndian will be a much more developed country in 10 years, but majority of the population – 50 to 60 percent will continue to be poor. If you look at the statistics, nothing much has changed for the bottom 50 percent in the last 20 years. India has been very unsuccessful in alleviating the poverty. It has performed worse than Pakistan and Bangladesh. It will be developed, though. The GDP number will look good, definitely. There will be a lot of rich people in India. There will be a very cocky urban middle class, who will be super sensitive.\nWho do you think can lead India from the young generation of politicians?\nSomebody new has to come. I have no hope from anyone right now, who belongs to the younger generation.\n(The interview appears in the June 1-15, 2017 issue of Governance Now)", "url": "http://www.governancenow.com/news/regular-story/speaking-with-the-author-who-wrote-the-prequel-to-baahubali", "label": 1}