{"authors": [], "date_download": "2019-03-27 14:40:51", "date_modify": "2019-03-27 14:40:51", "date_publish": "2017-07-27 20:20:00", "description": "The fast-paced developments in Bihar politics were triggered when JD(U) leader Nitish Kumar stepped down as CM on Wednesday after his Mahagathbandhan allies, the RJD and the Congress, turned a deaf ear to corruption allegations against Lalu Prasad Yadav's son and deputy CM Tejashwi Yadav. The Lalu family has dismissed Kumar's resignation as", "filename": "news_india_nitish-kumar-live-bihar-trust-vote-tomorrow-lalu-prasad-yadav-threatens-to-move-sc-1474157_1553697651.html", "image_url": "https://images.news18.com/ibnlive/uploads/2017/07/notish-sharad-getty.jpg", "language": null, "localpath": "/home/raj/news-please-repo//data/2019/03/27/news18.com/news_india_nitish-kumar-live-bihar-trust-vote-tomorrow-lalu-prasad-yadav-threatens-to-move-sc-1474157_1553697651.html", "title": "Nitish Kumar Live: Even Sharad Yadav was Not Kept in the Loop, Says MP Ali Anwar", "title_page": "Nitish Kumar Live: Even Sharad Yadav was Not Kept in the Loop, Says MP Ali Anwar - News18", "title_rss": "NULL", "source_domain": "news18.com", "text": "Jul 27, 2017 3:18 pm (IST)\nFormer JD(U) president Sharad Yadav, who is apparently unhappy with Nitish Kumar’s return to the NDA fold, has got in touch with the Congress, according to sources. Sources said Yadav met Congress vice president Rahul Gandhi at Jawahar Bhawan and has called a meeting of party MPs at his residence at 5pm on Thursday. This move comes even as there is a buzz that Yadav will be given a berth in the union cabinet by Prime Minister Narendra Modi. Yadav has so far refused to answer questions on the political upheaval in the state, but sources said the Rajya Sabha MP is not happy with Kumar’s decision to break the grand alliance with the Congress and the RJD.", "url": "https://www.news18.com/news/india/nitish-kumar-live-bihar-trust-vote-tomorrow-lalu-prasad-yadav-threatens-to-move-sc-1474157.html", "label": 1}