{"authors": [], "date_download": "2019-03-27 14:40:41", "date_modify": "2019-03-27 14:40:41", "date_publish": "2016-11-17 02:30:00", "description": "The Opposition on Wednesday went all out in slamming the government’s demonetisation move. While Bengal CM Mamata Banerjee led a fourparty protest march to the", "filename": "news_india_Do-you-pay-for-r_b6f2bc368e1865fdd968813a22f6db74_55464076_1553697641.html", "image_url": "https://static.toiimg.com/photo/imgsize-39817,msid-55464116/55464116.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/punemirror.indiatimes.com/news_india_Do-you-pay-for-r_b6f2bc368e1865fdd968813a22f6db74_55464076_1553697641.html", "title": "Do you pay for rallies with credit card? Oppn asks PM", "title_page": "Do you pay for rallies with credit card? Oppn asks PM", "title_rss": "NULL", "source_domain": "punemirror.indiatimes.com", "text": "Modi Antoinette\nWomen\nYadav\nBengal\nMamata Banerjee\nSharma\nRajya Sabha\nSitaram Yechury\nNarendra Modi\nQueen\nMarie Antoinette\nModi\nRam Gopal Yadav\nBJP\nSharad Yadav\nMayawati\nPiyush Goyal\nTrinamool Congress\nShiv Sena\nCongress\nRahul Gandhi\nVakola\nRajnath Singh\n‘GOVT IS NOT STUPID’\nDebroy\nBiocon\nKiran Mazumdar Shaw\nParliament\nThe Opposition on Wednesday went all out in slamming the government’s demonetisation move. WhileCMled a fourparty protest march to the Rashtrapati Bhavan, Congress’ Anandspearheaded the attack inside“Did you pay for your recent Ghazipur rally through credit card?” asked Sharma, mocking the government for asking people to use plastic money for day to day expenses. He also sought a probe into selective leakage of the demonetisation decision.“Secrecy was not maintained. It was published in a Gujarati newspaper long back and even other newspapers wrote about it,” said Sharma.During the debate, CPI(M) general secretarytook dig at PMby comparing him to a French. “It reminds me ofwho during the French Revolution asked that if the people don’t have bread, why don’t they eat cakes? Now, we haveAntoinette who says: ‘If you don’t have paper, use plastic.’”SP’s, said the move will backfire on the. “If your workers go about seeking votes now, women will beat them with (rolling pins) because they are the worst sufferers,” said Yadav.“The government will not be able to bring back black money from abroad in the next 10 years,” said JD (U) leaderBSP supremo, while supporting the move, said the government should have ensured a smoother transition. “This has created a bandh-like situation,” she said.The government, however, put up a strong defence saying the step was taken in national interest.“There is no politics in it. If anyone has the strength to take on black money and corruption, it is the BJP government and Narendra Modi,” said Power Ministersupremo Mamata Banerjee and leaders of three other parties – AAP, NC and BJP-ally– on Wednesday sought President Pranab Mukherjee’s intervention on the “financial calamity” unleashed by demonetisation: “The move was implemented without any planning, the country has been pushed towards anarchy.”vice-presidentmade an unscheduled stop at an ATM inon Wednesday. “While you are being made to stand in queues, your money will be given to those 15-20 industrialist friends of Modi,” he said.Addressing a rally, Home Ministersaid that the hardship arising out of demonetisation may continue for around a month: “We admit that people will face hardships for at least a month but it will be beneficial in the long term.”dismissed critics saying that the “government is not stupid”. “Do not assume Indians are stupid, they will find ways of circumventing it. What the government is trying to do is preempt it,” said Debroy to a TV channel.too supported the government initiative, which would “flush out ill-gotten wealth”, and termed the united stand of the opposition parties inas a “political vendetta”.", "url": "https://punemirror.indiatimes.com/news/india/Do-you-pay-for-rallies-with-credit-card-Oppn-asks-PM/articleshow/55464076.cms", "label": 1}