{"authors": [], "date_download": "2019-03-27 14:18:13", "date_modify": "2019-03-27 14:18:13", "date_publish": "2015-03-18 23:34:28", "description": "Regional party leaders join bid to thwart NDA Government’s proposed legislation", "filename": "news_national_farmers-take-to-streets-to-protest-land-bill_article7007973_1553696293.html", "image_url": "https://www.thehindubusinessline.com/migration_catalog/article18172664.ece/ALTERNATES/LANDSCAPE_615/BL19_POL_ROTI", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/thehindubusinessline.com/news_national_farmers-take-to-streets-to-protest-land-bill_article7007973_1553696293.html", "title": "Farmers take to streets to protest Land Bill", "title_page": "\nFarmers take to streets to protest Land Bill - The Hindu BusinessLine\n", "title_rss": "NULL", "source_domain": "thehindubusinessline.com", "text": "Street protests are gaining momentum against the proposed Right to Fair Compensation and Transparency in Land Acquisition, Rehabilitation and Resettlement (Amendment) Bill, 2015.\nA large farmers’ protest was organised in Delhi on Wednesday by the Bharatiya Kisan Union (BKU) along with the All India Coordination Committee of Farmers Movement (AICCFM).\nAAP leader Yogendra Yadav joined Naresh and Rakesh Tikait of the BKU to demand 100 per cent of farmers’ consent before land is acquired.\n“Successive governments have cheated farmers for years. Can the government buy or sell any other land without the approval of its owner? In the 2013 version of the Land Acquisition Act, a few allowances were made for farmers but now even these are being removed,” said Yadav.\nHe added that the BJP had been unable to get the green signal from the party’s own farmers’ union but were proceeding with the controversial ordinance in the name of development.\nBKU president Naresh Tikait said farmers do not want to obstruct development but protests would continue unless the Centre meets them and accedes to their demands.\n“These amendments in the Land Acquisition Bill were introduced without any discussions with farmers. Our basic demand is that farmers’ assent is a must and fertile land should not be acquired for private or even public-private projects,” he said.\nYadav also asserted that urea shortages in the country this year had been artificially created and meant to take advantage of farmers.\n“It was created only to decontrol the sector. It’s as if there’s no respect for farmers in the country any longer so the only way to retaliate is through demonstrations like these,” he said.\nHe was addressing a packed assembly that had farmers from all over the country, a sizeable number of whom had made the trip to the Capital from Tamil Nadu, Karnataka and Andhra Pradesh.\nPolitical parties are simultaneously taking to streets in different States. In Bihar, Chief Minister Nitish Kumar sat on a day-long fast last Saturday to register his protest against the proposed Bill while his colleague, Rashtriya Janata Dal (RJD) chief Lalu Prasad, led a march in Patna the very next day. DMK chief M Karunanidhi too has announced that his party will organise a protest in Tiruvarur, Tamil Nadu, later this week.\nA Joint Forum against the Land Acquisition Bill 2015, which includes farmers’ wings of the communist parties and activist groups, has called for observing March 23, the martyrdom day of Bhagat Singh, Sukh Dev and Raj Guru, as Land Rights Day.\nThe All India Kisan Sabha (AIKS) of the CPI will organise district or block-level functions across the country.\n“The AIKS has called upon the peasantry to prepare for an intensive and protracted struggle to defeat the nefarious design of the NDA government to steal the hard won right of the peasants on land,” said RC Yadav on behalf of the AIKS.", "url": "https://www.thehindubusinessline.com/news/national/farmers-take-to-streets-to-protest-land-bill/article7007973.ece", "label": 1}