{"authors": [], "date_download": "2019-03-27 14:35:46", "date_modify": "2019-03-27 14:35:46", "date_publish": "2017-02-14 00:00:00", "description": "Church official speaks on India's medical degree scam. Hundreds of doctors had bribed their way into medical schools", "filename": "news_church-official-speaks-on-indias-medical-degree-scam_78426_1553697346.html", "image_url": "https://www.ucanews.com/uploads/2017/02/1487321174.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/ucanews.com/news_church-official-speaks-on-indias-medical-degree-scam_78426_1553697346.html", "title": "Church official speaks on India's medical degree scam- ucanews.com", "title_page": "\r\nChurch official speaks on India's medical degree scam- ucanews.com", "title_rss": "NULL", "source_domain": "ucanews.com", "text": "A church official in Madhya Pradesh has welcomed the Indian Supreme Court's decision to uphold the disqualification of 634 medical professionals after an investigation found they had bribed their way into medical schools. The Supreme Court's Feb. 13 decision came after a lower court judged that some students had gained access to medical school by illegal means, replacing more meritorious students. But some innocent students have been caught up in the mass revocation of qualifications. \"It is a very good verdict. The court has punished the doctors who managed to get admitted through fraud. But authorities also should punish those running the fraud,\" said Archbishop Leo Cornelio of Bhopal. The Madhya Pradesh Professional Examination Board canceled medical school admissions between 2008-2012 after the scandal came to light in 2013. Investigating officials arrested some 2,000 people, including high ranking officials, in connection with it by 2015. However, no politician has been punished yet. The Supreme Court's decision affects some 1,000 people, including some 400 currently taking five-year courses at different medical schools in the state, Bhaskar Lakshakar, chair of the examination board, told local media. Billed as the biggest education scam in the country, the federal Central Bureau of Investigation began to investigate after more than 50 people associated with it died in mysterious circumstances after news of the scam broke. Archbishop Cornelio, who is based in the Madhaya Pradesh state capital, said the latest verdict was \"laudable\" as it made clear that the judiciary would not tolerate fraud even if it was supposed to help people in the long run. The doctors' lawyers admitted fraud but pleaded that their clients be allowed to keep their degrees if they served society free of cost for some years. \"We have no difficulty in concluding in favor of the rule of law.... Fraud cannot be allowed to trounce, on the stratagem of public good,\" said the three-bench judge consisting of Chief Justice J.S. Khehar and Justices Kurian Joseph and Arun Mishra. Their unanimous order called the actions \"unacceptable\" and \"in complete breach of rule of law. \"National character, in our considered view, cannot be sacrificed for benefits: individual or societal,\" said their 83-page order. However, some students protested their innocence. Bhavesh Nayak, who has been disqualified, said that, while he was not involved in the fraud, the verdict has crippled his carrier. The court has \"left us with no option but to commit suicide,\" he told local media. \"Our entire careers are ruined.\" Archbishop Cornelio said, \"It appears that a really powerful gang operated behind the scam and spoiled the future of many eligible students who could have otherwise been real assets to the country and lost out.\" Media reports said that several top ranking political figures and state officials have been arrested in connection with the scam and are out on bail. No action against them has been taken. \"Complete justice can be done only when those behind it are put behind bars. If they are not punished it will be a blot on the face of every law-abiding citizen,\" Archbishop Cornelio said.", "url": "https://www.ucanews.com/news/church-official-speaks-on-indias-medical-degree-scam/78426", "label": 1}