{"authors": [], "date_download": "2019-03-27 14:29:05", "date_modify": "2019-03-27 14:29:05", "date_publish": "2019-02-12 00:00:00", "description": "The party office in Lucknow buzzed with activity as enthusiastic Congress workers gathered outside the Uttar Pradesh Congress Committee building, even before she returned from an overnight stay in Jaipur. | Priyanka gets cracking after debut in UP as Cong gen secy", "filename": "news_report_priyanka-gets-c_1d04389f19df28d001942c79f317b46b_20190212_1553696945.html", "image_url": "https://im.rediff.com/news/2019/feb/11up10.jpg", "language": null, "localpath": "/home/raj/news-please-repo//data/2019/03/27/rediff.com/news_report_priyanka-gets-c_1d04389f19df28d001942c79f317b46b_20190212_1553696945.html", "title": "Priyanka gets cracking after debut in UP as Cong gen secy", "title_page": "Priyanka gets cracking after debut in UP as Cong gen secy - Rediff.com India News", "title_rss": "NULL", "source_domain": "rediff.com", "text": "February 12, 2019 17:23 IST\nPhotograph: Atul Yadav/PTI Photo\nA day after making her debut in Uttar Pradesh's political arena as Congress's general secretary, Priyanka Gandhi Vadra on Tuesday got down to business, holding strategy sessions to script her party's victory in the upcoming parliamentary polls.\nReturning to the state capital after a short visit to Jaipur, where her husband Robert Vadra and his mother Maureen appeared before the Enforcement Directorate in connection with a probe into an alleged land scam in Rajasthan's border town of Bikaner, Gandhi got cracking at the UP Congress headquarters.\nThe party office in Lucknow buzzed with activity as enthusiastic Congress workers gathered outside the Uttar Pradesh Congress Committee building, even before she returned from an overnight stay in Jaipur.\nImmediately after reached the party office, she was closeted with senior leaders and office bearers of Lucknow, Mohanlalganj, Prayagraj, Ambedkar Nagar, Sitapur, Kaushambi, Fatehpur, Bahraich, Phulpur and Ayodhya Lok Sabha constituencies to galvanise the party's preparations for the upcoming Lok Sabha elections.\nPriyanka Gandhi is slated to continue this exercise on Wednesday and Thursday with leaders of other constituencies which she has been asked to take care of in eastern Uttar Pradesh by Congress president Rahul Gandhi, party sources said.\nIn an adjoining room, the newly appointed Congress general secretary in-charge of western UP, Jyotiraditya Scinda, held deliberations with leaders from the constituencies he has been asked to groom.\nScindia too will hold strategy sessions over the next two days to ensure victory of candidates of the Congress, which has decided to go alone in all the 80 Lok Sabha seats in the state, they said.\nPriyanka Gandhi and Scindia, along with Rahul Gandhi, had held a grand roadshow here on Monday, raising hopes of a turnaround in the party's fortunes.\nVirtually launching the party's Lok Sabha poll campaign, Rahul Gandhi asserted that it was the time to uproot the Bharatiya Janata Party and form government in the state.\nAsserting that the party would 'play on front foot', Rahul Gandhi on Monday said, \"Till a Congress ideology government is installed here (UP), we will not rest, and ensure justice for farmers, the youth and the poor.\"\n\"Their (Priyanka and Scindia) aim is definitely the Lok Sabha elections, but it is also to bring a Congress government here,\" he had said, adding, 'the Congress began its journey from Uttar Pradesh and it cannot remain weak in the state... the Congress has to improve its performance in UP in the LS polls and from government in the next assembly elections'.\nGiving a sense what her entry means to the party workers in UP where the Congress has been struggling electorally for years, posters showed Priyanka Gandhi in 'Durga Mata' (a Hindu Goddess) avatar riding a lion.\n'Maa Durga ka roop behen Priyankaji (Sister Priyankaji is Maa Durga's incarnation),' said one poster, while some others highlighted her resemblance to Indira Gandhi, her grandmother.\nPriyanka Gandhi's entry into active politics has been at a time when the party is not only witnessing one of the most difficult times electorally but has also been sidelined by prospective allies for 'mahagatbandhan', with the Samajwadi Party and Bahujan Samaj Party totally ignoring it while forming their alliance.\n\"An alliance is also in the contest here and I have clearly said that I respect Mayawati ji and Akhilesh Yadav ji...but the Congress will fight with all its might for its ideology to change Uttar Pradesh,\" Rahul Gandhi had said.\nThe Congress had fared miserably during the 2014 Lok Sabha elections by winning just two of 80 seats in the state.\nThe eastern UP, Priyanka Gandhi's area of responsibility, has Prime Minister Narendra Modi's constituency Varanasi. The region is also seen as a stronghold of Uttar Pradesh Chief Minister Yogi Adityanath.\nOn the day of her political debut in UP, Priyanka Gandhi also joined Twitter and garnered a massive response with tens of thousands following her on the social media platform within hours.\nA day before her maiden visit to Uttar Pradesh as Congress general secretary, Priyanka Gandhi had said that together with the people of the state she hopes to start a 'new kind of politics' in which everyone will be a stakeholder.", "url": "https://www.rediff.com/news/report/priyanka-gets-cracking-after-debut-in-up-as-cong-gen-secy/20190212.htm", "label": 1}