{"authors": [], "date_download": "2019-03-27 14:35:42", "date_modify": "2019-03-27 14:35:42", "date_publish": "2015-11-18 15:07:00", "description": "The Assam Rifles today denied that it had issued any \"gag order\" to the media in Nagaland on matters relating to NSCN(K).", "filename": "news_politics-and-nation_as_720dcddd036f2639f843b248dda142ba_49830148_1553697342.html", "image_url": "https://img.etimg.com/thumb/msid-49830159,width-1070,height-580,imgsize-114781,overlay-economictimes/photo.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/economictimes.indiatimes.com/news_politics-and-nation_as_720dcddd036f2639f843b248dda142ba_49830148_1553697342.html", "title": "Assam Rifles denies issuing gag order to media in Nagaland", "title_page": "Assam Rifles denies issuing gag order to media in Nagaland - The Economic Times", "title_rss": "NULL", "source_domain": "economictimes.indiatimes.com", "text": "KOHIMA: The Assam Rifles today denied that it had issued any \"gag order\" to the media in Nagaland on matters relating to NSCN(K), which was recently banned by the Ministry of Home Affairs.\"The Assam Rifles had written the letter to the editors of five media houses of Nagaland on October 24 highlighting the fact that NSCN(K) has been notified as an unlawful association under the Unlawful Activities (Prevention) Act 1967 by the Ministry of Home Affairs and amplified some of the clauses of the Gazette Notification which have its own legal implications,\" a statement issued by the office of the Inspector General of Assam Rifles (North) (IGAR(N)) said here.The Assam Rifles also said that a copy of the MHA Notification was enclosed with the letter and the editors of the newspapers were requested to publish articles of NSCN(K) in consonance with the Act.Publishing an \"extortion notice\" of a \"banned organisation\" against business establishments is akin to abetting the \"banned organisation\" in collection of funds which will be used to carry out subversive activities against the government agencies and security forces, the IGAR(N) said.\"If media houses feel it is correct to issue them to public through their medium it's their call, and answer the Press Council of India for violation of the Unlawful Activities (Prevention) Act 1967,\" it said.The media houses are free to publish any article about the NSCN(K) organisation which would add to the peace process, air their opinion about the security forces and their conduct of operations, it said.The IGAR(N) also maintained that at no stage had the media been asked to dilute their free reporting.The contents of the advisory making the media houses aware of the MHA notification and the Unlawful Activities (Prevention) Act are being deliberately misinterpreted, the IGAR(N) statement said.The intent of the letter was to prevent contact of NSCN(K) with the public for conveying their \"extortion demands\" or \"extortion threats\" through a medium of mass communication, it said.The IGAR(N) said that the sequence of events over the past couple of days appeared to be a \"well conceived plan by vested interests\" to use the press and muzzle the voice of the Assam Rifles, which, it said, was the only organisation that had \"faced the full brunt of terrorist actions and achieved tangible results against a terrorist organisation.\"Five newspapers in Nagaland were without any editorial on Monday while the Naga Press Association (NPA) extended support to the editors in protest against the alleged attempt of the Assam Rifles to suppress the freedom of media.", "url": "https://economictimes.indiatimes.com/news/politics-and-nation/assam-rifles-denies-issuing-gag-order-to-media-in-nagaland/articleshow/49830148.cms", "label": 1}