{"authors": [], "date_download": "2019-03-27 14:18:26", "date_modify": "2019-03-27 14:18:26", "date_publish": "2019-03-26 00:00:00", "description": "The Union minister has also asked for students to be taught about the mythical 'Pushpak Vimaan', a flying chariot mentioned in Ramayana.", "filename": "news_india_teach-students-that-an-indian-made-the-first-aircraft-union-minister-satya-pal-singh-1523707_1553696306.html", "image_url": "https://images.news18.com/ibnlive/uploads/2017/09/Satya-Pal-Singh.jpg", "language": null, "localpath": "/home/raj/news-please-repo//data/2019/03/27/news18.com/news_india_teach-students-that-an-indian-made-the-first-aircraft-union-minister-satya-pal-singh-1523707_1553696306.html", "title": "Teach Students That an Indian Made the First Aircraft: Union Minister Satya Pal Singh", "title_page": "Teach Students That an Indian Made the First Aircraft: Union Minister Satya Pal Singh - News18", "title_rss": "NULL", "source_domain": "news18.com", "text": "Junior HRD minister Satya Pal Singh, the former Police commissioner of Mumbai and a MPhil in Chemistry, has called for educational institutions to teach students about the 'actual' inventor of the airplane — Shivkar Bapuji Talpade.The Union minister has also asked for students to be taught about the mythical 'Pushpak Vimaan', a flying chariot mentioned in Ramayana.“Why are students not taught that before the Wright brothers, an Indian called Shivakar Babuji Talpade was the first to invent the airplane. This person invented the plane eight years before the Wright brothers. Are our students taught these things in IITs or not? They should be,” he said on Tuesday at a function, reported Hindustan Times.According to popular notions, Talpade invented the aircraft by drawing upon ideas outlined in Vedic texts. It's claimed that Talpade held a thrilling demonstration of his aircraft in 1895 on Bombay's Chowpatty beach in front of a large crowd that included the king of Baroda. The aircraft is said to have attained an elevation of nearly 1,500 feet and stayed airborne for several minutes. Some claim Talpade used mercury as a fuel for the aircraft, while others say it was some type of urine.The Vedic Ion Design, which was supposedly used by Talpade, has been debunked by researchers as a feasible method to build any aircraft.Singh also called for engineering students to be taught about the Hindu deity of craftsmen and engineers — Vishwakarma. The Hindu god is said to have built Heaven, Demon King Ravana's Lanka, Puri's Jagannath Temple and Lord Krishna's capital Dwarka. He could supposedly build these immense structures overnight.\"Plants in Ravana's kingdom were not watered as they contained Chandramani. Such ancient technology should be taught to our students,\" further added Singh.Chandramani, the mythical elixir purportedly keeps its possessor revelled in a permanent state of ecstasy.According to his Wikipedia page, Singh is the author of two bestselling books: one on tackling the Naxal menace, and the other a self-help book, Talash Insaan Ki (The Search for Man) which deals with \"mankind’s continuous quest in search of the truth\", that has sold over a lakh copies and has been translated into several languages.", "url": "https://www.news18.com/news/india/teach-students-that-an-indian-made-the-first-aircraft-union-minister-satya-pal-singh-1523707.html", "label": 1}