{"authors": ["Aman Sharma"], "date_download": "2019-03-27 14:35:24", "date_modify": "2019-03-27 14:35:24", "date_publish": "2015-03-28 16:52:00", "description": "Mizoram Governor Aziz Qureshi, who has had a running feud with the Centre and even approached the Supreme Court against attempts to ease him out, was sacked today.", "filename": "news_politics-and-nation_mi_991fe1ab2c872b37bd54b8d6de0fd6ba_46726713_1553697324.html", "image_url": "https://img.etimg.com/thumb/msid-46726800,width-1070,height-580,imgsize-75712,overlay-economictimes/photo.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/economictimes.indiatimes.com/news_politics-and-nation_mi_991fe1ab2c872b37bd54b8d6de0fd6ba_46726713_1553697324.html", "title": "Mizoram gets 7th Governor in 8 months, Aziz Qureshi sacked", "title_page": "Mizoram gets 7th Governor in 8 months, Aziz Qureshi sacked - The Economic Times", "title_rss": "NULL", "source_domain": "economictimes.indiatimes.com", "text": "NEW DELHI: The government on Saturday sacked Aziz Qureshi as the Governor of Mizoram, within three months of transferring him to the north-eastern state from Uttarakhand . He had a term till 2017.The President House issued orders on Saturday saying Qureshi will \"cease to hold\" the position of Mizoram Governor and gave no fresh assignment to him. In the process, Qureshi has suffered the fate of Kamla Beniwal, the former Gujarat Governor who was also transferred to Mizoram before being sacked within a couple of months. With West Bengal Governor Kesari Nath Tripathi being given additional charge of Mizoram now, the north-eastern state has now got a seventh Governor in eight months, making many in the government speculate if Mizoram has become a dumping ground for Governors that the Centre wish would rather quit. Qureshi had dragged the government last year to the Supreme Court after then Home Secretary Anil Goswami had called him few months ago, nudging him to put in his papers or face a sacking or transfer for certain alleged inappropriate comments on rapes in Uttar Pradesh when he had held additional charge of Governor of that state. Qureshi had then reportedly said \"even God cannot stop rapes in UP\", a statement that he alleged was misinterpreted and twisted out of context. Government sources said the same comments were \"instrumental\" in the Home Ministry convincing the President to sack Qureshi. When transferred to Mizoram from Uttarakhand last December, Qureshi had said he will not quit and serve his remaining term in Mizoram till 2017.The musical chairs for Governors in Mizoram had begun last July when the new BJP Government has announced that the then Mizoram Governor Vakkom Purushothaman would be shifted to Nagaland. He however chose to resign though he still had a term left of nearly two years. The Centre them announced the transfer of Gujarat Governor Kamla Beniwal to the Mizoram Raj Bhawan in July and she duly joined there though she has a tent left of only a few months. But she was removed as a Governor on August 6 on orders of the President after the Centre forwarded a report on alleged irregularities committed by her as the Gujarat Governor. Centre then announced K. Sankarnarayanan, the Maharashtra Governor , as the Governor of Mizoram but he resigned in protest and did not join at Mizoram Raj Bhawan.The Centre then gave additional charge of Mizoram Raj Bhawan, first to Manipur Governor VK Duggal and then to Meghalaya Governor KK Paul in September. In December, Qureshi was given permanent charge of the Mizoram Raj Bhawan with Paul headed to Uttarakhand. Keshari Nath Tripathi, the Governor of West Bengal, will now discharge the functions of the Governor of Mizoram, in addition to his own duties, until regular arrangements for the office of the Governor of Mizoram are made, the President House said.Nearly 10 states are presently functioning with Governors holding their additional charge and no permanent appointments being made.", "url": "https://economictimes.indiatimes.com/news/politics-and-nation/mizoram-gets-7th-governor-in-8-months-aziz-qureshi-is-sacked/articleshow/46726713.cms", "label": 1}