{"authors": ["Relatives Have Turned Political Rivals Many A Time", "State Has Seen Good Translators", "Some Not So Good Ones"], "date_download": "2019-03-27 14:35:10", "date_modify": "2019-03-27 14:35:10", "date_publish": "2016-09-13 02:51:56", "description": "Stray incidents of protests outside Karnataka Bank and State Bank of Mysore", "filename": "news_national_tamil-nadu_5-_a4c291ae860f8bca5b56232d8988cd24_article14635046_1553697310.html", "image_url": "https://www.thehindu.com/migration_catalog/article14613634.ece/ALTERNATES/LANDSCAPE_615/12-vbk-vandalised", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/thehindu.com/news_national_tamil-nadu_5-_a4c291ae860f8bca5b56232d8988cd24_article14635046_1553697310.html", "title": "5 Karnataka vehicles vandalised in T.N.", "title_page": "\n5 Karnataka vehicles vandalised in T.N. - The Hindu\n", "title_rss": "NULL", "source_domain": "thehindu.com", "text": "Five tourist vehicles bearing Karnataka registration numbers were vandalised by members of pro-Tamil outfits, including the Naam Tamizhar Katchi, Tamizhaga Vazhvuirmai Katchi and Tamil Nationalist Movement, on Monday at Rameswaram in south Tamil Nadu following reports of violence against Tamils in Karnataka over the Cauvery row.\nEight persons were arrested in connection with the incident even as various parts of Tamil Nadu witnessed stray incidents of protests and demonstrations against Karnataka establishments, particularly the branches of Karnataka Bank Ltd. and State Bank of Mysore. However, no one was injured. Pro-Tamil groups staged demonstrations outside the bank branches in Chennai, Kancheepuram, Nagercoil and Erode besides blocking vehicles bearing Karnataka registration numbers in some places including Pudukottai.\nFollowing the sporadic violence, police escorted some vehicles bearing Karnataka registration numbers out of Tamil Nadu. Five tourist vehicles bound for Karnataka were escorted from Rameswaram to Bengaluru by armed police in a convoy on Monday evening.\nPolice said the vehicles — a tourist bus, two cars and two motorbikes (one with Tamil Nadu registration) — were escorted by the respective district and city police en route Bengaluru.\n“An officer in the rank of Inspector was present in the team that piloted the convoy,” a police officer said. Similarly, KSRTC buses were escorted to a safe place in Madurai. “Otherwise, these buses are parked along the roadside,” a police officer said.", "url": "https://www.thehindu.com/news/national/tamil-nadu/5-Karnataka-vehicles-vandalised-in-T.N./article14635046.ece", "label": 1}