{"authors": ["Known As The Poor Man S Cocaine", "Mephedrone Is Cheaper", "More Easily Available", "Therefore More In Demand", "Say Police"], "date_download": "2019-03-27 14:40:37", "date_modify": "2019-03-27 14:40:37", "date_publish": "2017-05-20 00:37:39", "description": "Congress criticises petrol surcharge hike by ₹2", "filename": "news_cities_mumbai_govt-com_d924ec1c9516be10d60a5e76c93d8033_article18511614_1553697637.html", "image_url": "https://www.thehindu.com/news/cities/mumbai/article18511613.ece/ALTERNATES/LANDSCAPE_615/20BMASHOK", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/thehindu.com/news_cities_mumbai_govt-com_d924ec1c9516be10d60a5e76c93d8033_article18511614_1553697637.html", "title": "Govt. comes under attack for ‘financial indiscipline’", "title_page": "\nGovt. comes under attack for ‘financial indiscipline’ - The Hindu\n", "title_rss": "NULL", "source_domain": "thehindu.com", "text": "Mumbai: Coming out strongly against the increase in surcharge on petrol, the Congress on Friday said it will protest across Maharashtra against the BJP-led State government’s poor financial planning and rising expenditure.\n“The rate of petrol in Maharashtra is the highest in the country. This, despite the Centre reducing petrol prices. The surcharge on petrol is now ₹11 and the State Congress will protest against this,” senior party leader and former Chief Minister Ashok Chavan said on Friday. Mumbai Congress chief Sanjay Nirupam added that the party will hold demonstrations in Mumbai on May 26.\nEarlier this week, the Devendra Fadnavis government increased surcharge on petrol by ₹2, which coincided with a reduction in petrol prices by ₹2.16 by the Central government. Also, the increase in surcharge comes barely four weeks after the State government announced a hike in petrol prices. “There is no proper financial planning and the state’s expenditure is mounting. The common man is at the receiving end because of a slew of taxes,” Mr. Chavan claimed.\nThe State government is staring at losses well beyond the budget estimate of ₹4,511 crore in revenue deficit. It stands to lose around ₹7,000 crore in revenue after the Supreme Court ban on sale of liquor within 500 metres of national highways came into force. When taken together with the extra amount to be spent on salaries when the Seventh Pay Commission’s recommendations are implemented, the government is apparently at wit’s end to make ends meet.\nIt is facing embarrassment after the State Cabinet decision to hike stamp duty on gift deeds from ₹500 to a steep 3% of the property’s market value was rolled back on Thursday, barely 72 hours after it was announced. According to sources, the pressure came from within the coalition from the Shiv Sena.", "url": "https://www.thehindu.com/news/cities/mumbai/govt-comes-under-attack-for-financial-indiscipline/article18511614.ece", "label": 1}