{"authors": ["Bikash Singh"], "date_download": "2019-03-27 14:41:07", "date_modify": "2019-03-27 14:41:07", "date_publish": "2017-02-28 21:34:00", "description": "BJP has maintained that with Prime minister assuring that territorial integrity of Manipur will not be disturbed there is no need for making the document public.", "filename": "news_politics-and-nation_fr_7bf5e69684bc5d40a9ab08382612851d_57396905_1553697667.html", "image_url": "https://img.etimg.com/thumb/msid-57396912,width-1070,height-580,imgsize-49653,overlay-economictimes/photo.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/economictimes.indiatimes.com/news_politics-and-nation_fr_7bf5e69684bc5d40a9ab08382612851d_57396905_1553697667.html", "title": "Framework agreement with NSCN-IM a pre-paid accord: Congress Vice president", "title_page": "Framework agreement with NSCN-IM a pre-paid accord: Congress Vice president - The Economic Times", "title_rss": "NULL", "source_domain": "economictimes.indiatimes.com", "text": "IMPHAL: With framework agreement inked by NDA led Centre and NSCN-IM becoming a major poll issue in Manipur, congress Vice president Rahul Gandhi on Tuesday termed the same as pre paid accord.Picking up from the Manipur power reforms where Manipur introduced pre paid power system, Rahul who campaigned for congress on Tuesday launched tirade on Prime minister, Narendra Modi and said, \"As congress ruled Manipur has launched pre paid power, a model presented before UK prime minister and appreciated by the British Prime minister, Modi thought of doing pre paid Naga accord.”There is a campaign in Manipur asking the Centre to make the contents of framework agreement public. Modi last week in an election rally in Manipur assured there is nothing in the accord which will harm the interest of Manipur.BJP has maintained that with Prime minister assuring that territorial integrity of Manipur will not be disturbed there is no need for making the document public.Gandhi said that only congress can safeguard the territorial integrity and dared Modi to make public the contents of framework inked in August 2015.\"Why are the people of Manipur being kept in the dark about the contents of the agreement?. Centre should put it up on the website, so that the people can have a look at it and decide whether it will compromise the territorial integrity of the state (Manipur) or not.”Territorial integrity is an emotive issue in the Manipur. Stating the ideology of Modi and RSS will find no ground in Manipur, Rahul said, \"Manipur is a state with distinct identity and pride. Nagpur’s ideology (RSS headquarters) will crush them all”.Rahul narrated, \"Soniaji one day told me Prime minister (modi) had called her for the first time and informed about the signing of the agreement.”Rahul added, \"She asked me to get in touch with Manipur chief minister, O Ibobi Singh. I asked the chief minister if he had any knowledge of the same, Ibobi pleaded ignorance. I then asked other ministers at the Centre. They also didn’t have any information. It became very clear to me by then that the entire agreement is in Modiji’s mind.”Rahul choose not to speak on the ongoing economic blockade in the state. The state is witnessing blockade on two of its highways since November 1 last year. The blockade is sponsored by United Naga Council in protest against the creation of seven districts by congress government.BJP has stated that despite assurance that Centre will provide all assistance necessary to lift the blockade state government has failed in its constitutional duty of maintaining law and order and lift the blockade.Ibobi Singh added that Modi is doing \"Maan Ki Baat” however it is time for \" Kaam ki Baat”. Ibobi reminded how Manipur erupted in protest when Atal Bihari Vajpayee government extended ceasefire with NSCN (IM) to Manipur in 2001.", "url": "https://economictimes.indiatimes.com/news/politics-and-nation/framework-agreement-with-nscn-im-a-pre-paid-accord-congress-vice-president/articleshow/57396905.cms", "label": 1}