{"authors": ["Until Now", "This Procedure Had Been Reserved For Old Patients Who Might Not Survive Open Heart Surgery"], "date_download": "2019-03-27 14:29:01", "date_modify": "2019-03-27 14:29:01", "date_publish": "2016-11-22 00:39:27", "description": "Aam Aadmi Party leaders say demonetisation is a ‘scam’ that won’t tackle black money; Mamata Banerjee plans agitations in Delhi, U.P., Bihar and Punjab", "filename": "news_cities_Delhi_AAP-to-gh_4dfca9c54280194a29f6058deb10e47e_article16672775_1553696941.html", "image_url": "https://www.thehindu.com/news/cities/Delhi/article16672773.ece/ALTERNATES/LANDSCAPE_615/21TH-THGRP-ATM", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/thehindu.com/news_cities_Delhi_AAP-to-gh_4dfca9c54280194a29f6058deb10e47e_article16672775_1553696941.html", "title": "AAP to gherao Parliament today, Didi to protest tomorrow", "title_page": "\nAAP to gherao Parliament today, Didi to protest tomorrow - The Hindu\n", "title_rss": "NULL", "source_domain": "thehindu.com", "text": "The Aam Aadmi Party (AAP) and the Trinamool Congress, which have made common cause over the Centre’s demonetisation of Rs.500 and Rs.1,000 notes, announced they will hit the streets in protest against the decision.\nWhile the AAP will ‘gherao’ Parliament on Tuesday, West Bengal Chief Minister Mamata Banerjee said in Kolkata that she will be in Delhi on Wednesday and Thursday to organise protests. The AAP’s protest march will start from Jantar Mantar and will be led by Deputy Chief Minister Manish Sisodia along with other Ministers of the Delhi government.\n‘Common man suffering’\n“We will be undertaking a Sansad march under the leadership of Mr. Sisodia,” AAP leader Ashish Khetan said while addressing a press conference on Monday.\nAlleging that the demonetisation drive by the Narendra Modi government was a ‘scam’, Mr. Khetan said that the common man was suffering while the loans given to big industrialists were being waived.\nCiting the Central Board of Direct Taxes report of 2011, the AAP leader said that the data clearly stated that black money will not be affected through demonetisation. “It is shocking that Prime Minister Narendra Modi ignored the advice of all experts and went ahead with demonetisation. It makes it clear that Mr. Modi’s purpose was not to tackle black money at all,” said Mr. Khetan.\nMany protest planned\nMs Banerjee, an ‘ally’ of Delhi Chief Minister Arvind Kejriwal, said she would also hold protest rallies in Uttar Pradesh, Bihar and Punjab over the next few weeks. After Delhi, she will hold a rally in Lucknow on November 29 followed by Bihar on December 1-2 and then Punjab.\n“We are ready to join any political programme and anyone can join. This is a movement of the people. I have no personal interest in this,” Ms. Banerjee said during a press conference in Kolkata. Her announcement comes after a self-declared 72-hour deadline, which she had declared in Delhi during a joint protest rally with Mr. Kejriwal.\nShe had stated that if the Centre does not withdraw demonetisation within three days, nationwide protests would follow.\nMr. Kejriwal, who has been protesting against demonetisation, is currently in Punjab and will be addressing several rallies in the poll-bound State.\nFrom December, Mr. Kejriwal will hold rallies in western Uttar Pradesh. “Mr. Kejriwal is holding rallies in Punjab and Uttar Pradesh to make the people aware of the Rs.8 lakh crore scam done in the name of demonetisation,” Mr. Khetan said.", "url": "https://www.thehindu.com/news/cities/Delhi/AAP-to-gherao-Parliament-today-Didi-to-protest-tomorrow/article16672775.ece", "label": 1}