{"authors": [], "date_download": "2019-03-27 14:25:45", "date_modify": "2019-03-27 14:25:45", "date_publish": "2017-10-16 20:43:00", "description": "Hundreds of BJP workers took part in the march which commenced at the party's state headquarters here and concluded at the historic Gandhi Maidan", "filename": "news_politics-and-nation_bj_819e0fa39ee950166e4cc221a5f515d8_61105737_1553696745.html", "image_url": "https://img.etimg.com/thumb/msid-61105948,width-1070,height-580,imgsize-268569,overlay-economictimes/photo.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/economictimes.indiatimes.com/news_politics-and-nation_bj_819e0fa39ee950166e4cc221a5f515d8_61105737_1553696745.html", "title": "BJP takes out march against killing of its workers in Kerala", "title_page": "kerala: BJP takes out march against killing of its workers in Kerala - The Economic Times", "title_rss": "NULL", "source_domain": "economictimes.indiatimes.com", "text": "PATNA: BJP Bihar unit took out a 'Jan Raksha March' (march for protection to the people) here today to protest the killing of its workers in Kerala by those allegedly enjoying the patronage of CPI(M), the main constituent of the ruling Left Democratic Front in that state.Hundreds of BJP workers took part in the march which commenced at the party's state headquarters here and concluded at the historic Gandhi Maidan , a couple of km away.Addressing party workers, Bihar BJP president Nityanand Rai said most incidents of killings of BJP workers in Kerala were reported from the home district of Chief Minister Pinnarayi Vijayan which hints at the patronage enjoyed by the attackers.\"The BJP under the leadership of Prime Minister Narendra Modi and party national president Amit Shah is on its way to achieving national footprint and our workers will not take such intimidatory tactics lying down. Even after CPI(M) depletes its cache of ammunition, there will be no dearth of BJP workers ready to take it on without any fear,\" he said.BJP workers are capable of responding to violence but they are disciplined and believe in democracy, he added.Meanwhile, RJD leader and former Bihar Deputy Chief Minister Tejashwi Yadav in a statement questioned the permission granted to BJP for taking out the march when his party was denied it.\"I wish to ask Chief Minister Nitish Kumar whether law is different for those in power and those in the opposition. He should explain why our workers were not allowed to take out a march to Raj Bhavan on October 12 in protest against Srijan scam and why BJP was allowed to take out the Jan Raksha March,\" he said here in a statement.", "url": "https://economictimes.indiatimes.com/news/politics-and-nation/bjp-takes-out-march-against-killing-of-its-workers-in-kerala/articleshow/61105737.cms", "label": 1}