{"authors": ["P Pavan", "Gladwin Emmanuel"], "date_download": "2019-03-27 14:34:51", "date_modify": "2019-03-27 14:34:51", "date_publish": "2015-04-09 02:00:00", "description": "Protests erupted in Tamil Nadu on Wednesday over the controversial killing of 20 people by Andhra Pradesh police, many of them woodcutters from the state, on ch", "filename": "news_india_Encounter-questi_fef5ccdedc8dae5f60d153ec7b86dfe7_46855671_1553697291.html", "image_url": "https://static.toiimg.com/photo/imgsize-32982,msid-46855701/46855701.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/ahmedabadmirror.indiatimes.com/news_india_Encounter-questi_fef5ccdedc8dae5f60d153ec7b86dfe7_46855671_1553697291.html", "title": "‘Encounter’ questioned as MHA asks for report", "title_page": "‘Encounter’ questioned as MHA asks for report", "title_rss": "NULL", "source_domain": "ahmedabadmirror.indiatimes.com", "text": "Tamil Nadu\nAndhra Pradesh police\nAndhra Pradesh\nAndhra Pradesh government\nTamil Nadu government\nAP chief secretary\nchief Justice\nAndhra Pradesh Civil Liberties Association\nRaghunath\nHigh Court\nSVR Ruia Hospital\ndivisional officer\nVijay Chander\nAIMIMpresident\nHyderabad MP\nProtests erupted inon Wednesday over the controversial killing of 20 people by, many of them woodcutters from the state, on charges of red sanders smuggling in the forests near Tirupati. Bus services to and fromwere suspended by both state transport corporations. However, themaintained that it was an encounter and the police had retaliated in self-defence. Meanwhile, the Union home ministry sought a report from the Andhra Pradesh government on the incident. Political parties and rights groups condemned the incident as a violation of human rights saying the woodcutters, in search of jobs, were picked up from a bus and killed in cold blood.Meanwhile, theannounced a solatium of Rs 3 lakh each to the kin of labourers killed in Tuesday’s police action. Issuing notices toand DGP, National Human Rights Council (NHRC)K G Balakrishnan said in Delhi that the council will examine whether the ‘encounter’ was genuine. Meanwhile,presidentfiled an urgent lunch motion in theseeking a direction to register a murder case against the police involved in the incident.The court called upon the DGP to file a reply by Friday. Doctors at thein Tirupati completed post-mortems on 15 bodies by Wednesday evening. As of now, seven have been identified. Chittoor revenue(RDO)said the identified bodies would be handed over to the families. “We will wait for one week for identification. If nobody comes forward, we will hand over bodies to Tamil Nadu government after next Tuesday,” he said. It is believed that 18 to 19 of the deceased were from Tamil Nadu.andAsaduddin Owaisi on Wednesday called for a CBI probe into Tuesday’s alleged encounter, in which terror suspects Viqaruddin and four others were killed by their police escort team near Alair in Telangana. The police claim that Viqaruddin had tried to escape is being questioned after photographs of him lying dead in the bus with handcuffs on emerged in the media. “How can the police say persons sitting in the van with handcuffs tried to attack them, prompting firing?” Asaduddin said. Meanwhile, doctors videographed the postmortem examination .", "url": "https://ahmedabadmirror.indiatimes.com/news/india/Encounter-questioned-as-MHA-asks-for-report/articleshow/46855671.cms", "label": 1}