{"authors": [], "date_download": "2019-03-27 14:18:26", "date_modify": "2019-03-27 14:18:26", "date_publish": "2017-01-09 17:33:02", "description": "Trinamool launches nationwide protest se...Terming as \"flop show\" Modi's November 8...\"Trinamool Congress is organising nationwide ...Banerjee, who has been demanding a rollback of dem...Holding placards with slogan \"Modi ...", "filename": "news_articles_a708189_1553696306.html", "image_url": "https://www.prokerala.com/res/images/topics/132-prime-minister-narendra-modi-in-addresses-at-the-321470_450.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/prokerala.com/news_articles_a708189_1553696306.html", "title": "Trinamool launches nationwide protest seeking Modi's ouster", "title_page": "Trinamool launches nationwide protest seeking Modi's ouster", "title_rss": "NULL", "source_domain": "prokerala.com", "text": "Kolkata/New Delhi, Jan 9 : Flaying the Centre over demonetisation, the Mamata Banerjee-led Trinamool Congress on Monday launched a three-day countrywide protest demanding removal of Prime Minister Narendra Modi to \"save the country\".\nTerming as \"flop show\" Modi's November 8 decision of spiking Rs 1,000 and Rs 500 notes, Trinamool supremo and West Bengal Chief Minister Banerjee said the party will hold demonstrations in Odisha, Punjab, Bihar, Manipur, Tripura, Assam and Jharkhand, besides West Bengal and the national capital.\n\"Trinamool Congress is organising nationwide protest against Modi Babu's shameless flop-show,\" Banerjee said in Kolkata.\nBanerjee, who has been demanding a rollback of demonetisation, also called for removal of restrictions on the withdrawal of cash from banks and ATMs.\nHolding placards with slogan \"Modi Hatao Desh Bachao\" (remove Modi, save the country), some 35 Trinamool MPs demonstrated in the national capital calling for setting up of a \"National Government\" at the Centre.\n\"Even after two months of the draconian decision, countless people across the country continue to suffer, while over a 100 people have lost their lives.\n\"Modi's removal is a must to save the country. A National Government should be formed at the Centre,\" Trinamool MP Sultan Ahmed said.\nBanerjee on January 6 called for President Pranab Mukherjee's intervention to \"save the country\" and mooted a National Government headed by BJP veteran L.K. Advani or Union Finance Minister Arun Jaitley or Union Home Minister Rajnath Singh.", "url": "https://www.prokerala.com/news/articles/a708189.html", "label": 1}