{"authors": [], "date_download": "2019-03-27 14:35:37", "date_modify": "2019-03-27 14:35:37", "date_publish": "2016-11-06 14:20:38", "description": null, "filename": "news__1553697337.html", "image_url": "http://www.siasat.com/wp-content/uploads/2016/11/Rajnath-Singh2-660x330.jpeg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/archive.siasat.com/news__1553697337.html", "title": "Rajnath must intervene to 'protect' Marathis in K'taka: Shiv Sena", "title_page": "Rajnath must intervene to 'protect' Marathis in K'taka: Shiv Sena | The Siasat Daily", "title_rss": "NULL", "source_domain": "archive.siasat.com", "text": "Mumbai: Shiv Sena has sought intervention of Home Minister Rajnath Singh to “protect” Marathi-speaking populace in border areas of Karnataka, saying they are being subjected to “atrocities” in the adjoining State.\n“Atrocities are being committed on Marathi-speaking populace in Belgaum and other border areas of Karnataka. Singh should intervene to protect them,” Shiv Sena leader Neelam Gorhe said.\nReferring to the arrest of Marathi youths and activists of Maharashtra Ekikaran Samiti (MES), a regional outfit, for taking part in a ‘Black Day’ protest rally in Belgaum on Karnataka Rajyotsava Day on November 1, Gorhe said, “what is happening in Karnataka now is very painful.”\nMaharashtra Chief Minister Devendra Fadnavis should take due cognisance of what is happening in Karnataka and also speak to his counterpart in the Congress-ruled State, she said.\n“Shiv Sena has always championed the cause of a united Maharashtra. We are fighting for the rights of Marathi people there,” said the Sena legislator.\nMES leaders have alleged their activists are being beaten and tortured by Karnataka Police. MES observes Black Day on November 1, which is celebrated across Karnataka as Kannada Rajyotsava Day or the day on which the State was formed.\nThe MES wants 814 villages, where the Marathi-speaking population is dominant, to be integrated with Maharashtra. In its report 50 years ago, the Centre-appointed Mahajan Commission had recommended that these villages remain in Karnataka.\nMaharashtra Government has been fighting the case in the Supreme Court for nearly 12 years to get Belgaum and adjoining areas back from Karnataka.\nPTI", "url": "https://archive.siasat.com/news/rajnath-must-intervene-protect-marathis-ktaka-shiv-sena-1058862/", "label": 1}