{"authors": [], "date_download": "2019-03-27 14:35:52", "date_modify": "2019-03-27 14:35:52", "date_publish": "2016-11-19 18:48:00", "description": "Mamata visited RBI office in Kolkata to inquire about the availability of Rs 100 and Rs 500 notes. She also made a surprise visit to Burrabazzar, known as the hub for cash transactions.", "filename": "news_politics-and-nation_de_d1bbf149d27b8be361314d1cbfaef420_55513448_1553697352.html", "image_url": "https://img.etimg.com/thumb/msid-55513598,width-1070,height-580,imgsize-268184,overlay-economictimes/photo.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/economictimes.indiatimes.com/news_politics-and-nation_de_d1bbf149d27b8be361314d1cbfaef420_55513448_1553697352.html", "title": "Demonetisation: Mamata continues protest in Kolkata; visits RBI office, Burrabazzar", "title_page": "Demonetisation: Mamata continues protest in Kolkata; visits RBI office, Burrabazzar - The Economic Times", "title_rss": "NULL", "source_domain": "economictimes.indiatimes.com", "text": "KOLKATA: Continuing her protest against Centre's demonetisation drive, West Bengal Chief Minister Mamata Banerjee hit the street yet again, this time in Kolkata. She visited RBI office in Kolkata to inquire about the availability of Rs 100 and Rs 500 notes. She also made a surprise visit to Burrabazzar that is known as the hub for cash transactions.“I paid surprise visit to Asia’s biggest market, Burrabazar. I have listened to problems of hawkers, traders, mazdoors, shopkeepers, commoners. All expressed their deep anguish and spoke about the problems. They belong to different states, especially Uttar Pradesh, Bihar and Punjab. They said everything has come down to almost zero in the last ten days. It's a sad situation,” Mamata Banerjee posted on micro-blogging site Twitter.She added that she understands the pain and stress of bank employees. My heart goes out to bank employees and officers. \"All are under severe stress. Sadly, they are also the victims of circumstance. The whole of rural India is crying, farmers are crying. If food is not available what will the common people eat? Plastic?,” she asked.She further accused the Centre of following biased approach in sending currencies. “Not a single Rs 500 note has reached Bengal while the same has been sent to Madhya Pradesh and some other states. Why this step motherly attitude? People are crying. They cannot buy food. If this situation persists, there will be a famine,” she said.According to sources, she has instructed her party men to intensify the agitation in and outside Bengal. On November 23, TMC will take out a mass rally in the city to protest against demonetisation. Banerjee is likely to attend in the programme.", "url": "https://economictimes.indiatimes.com/news/politics-and-nation/demonetisation-mamata-continues-protest-in-kolkata-visits-rbi-office-burrabazzar/articleshow/55513448.cms", "label": 1}