{"authors": [], "date_download": "2019-03-27 14:40:41", "date_modify": "2019-03-27 14:40:41", "date_publish": "2019-03-28 00:00:00", "description": "New Delhi [India], Feb 11 (ANI): Telugu Desam Party president and Andhra Pradesh Chief Minister N Chandrababu Naidu began his day-long hunger strike in Delhi on", "filename": "news_259481398_chandrababu-naidu-begins-dharma-porata-deeksha-in-delhi_1553697641.html", "image_url": "https://cdn.bignewsnetwork.com/ani1549857814.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/indiagazette.com/news_259481398_chandrababu-naidu-begins-dharma-porata-deeksha-in-delhi_1553697641.html", "title": "Chandrababu Naidu begins 'Dharma Porata Deeksha' in Delhi", "title_page": "Chandrababu Naidu begins 'Dharma Porata Deeksha' in Delhi", "title_rss": "NULL", "source_domain": "indiagazette.com", "text": "New Delhi [India], Feb 11 (ANI): Telugu Desam Party president and Andhra Pradesh Chief Minister N Chandrababu Naidu began his day-long hunger strike in Delhi on Monday.\nDressed in black as a mark of protest, Naidu and his party members and ministerial colleagues paid floral tributes to Mahatma Gandhi at Rajghat ahead of the strike.\nNaidu is observing a hunger strike or 'Dharma Porata Deeksha' (a day-long protest for justice) against the central government over the issue of special status to Andhra Pradesh.\nThe chief minister is accompanied by his ministers, party MLAs, MLCs, and MPs in the hunger strike.\nAs per an official statement, he will be submitting a memorandum to President Ram Nath Kovind on Tuesday.\nIn October 2013, Naidu had staged an indefinite fast at the Andhra\nPradesh Bhavan here, demanding that if a separate state is carved out of then unified AndhraPradesh, both should get equal rights. On the fifth day of his protest, he was forcibly shifted to Ram Manohar Lohia Hospital after his health deteriorated.\nHe had also observed a fast in Vijayawada in April last year demanding special status for the state.\nThe Telugu Desam Party had pulled out of the NDA last year over the Centre\n's refusal to grant special category status to Andhra Pradesh. (ANI)", "url": "https://www.indiagazette.com/news/259481398/chandrababu-naidu-begins-dharma-porata-deeksha-in-delhi", "label": 1}