{"authors": [], "date_download": "2019-03-27 14:35:02", "date_modify": "2019-03-27 14:35:02", "date_publish": "2018-01-28 10:22:54", "description": "Chennai(Tamil Nadu) [India] January 28 (ANI): Tamil Nadu Opposition parties, including the Dravida Munnetra Kazhagam (DMK), will on Monday hold a protest against hiked bus fares in the state.", "filename": "news_national_general-news__1553697302.html", "image_url": "https://aniportalimages.s3.amazonaws.com/media/details/stalin.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/aninews.in/news_national_general-news__1553697302.html", "title": "DMK to protest against bus fare hike tomorrow", "title_page": "DMK to protest against bus fare hike tomorrow", "title_rss": "NULL", "source_domain": "aninews.in", "text": "Chennai(Tamil Nadu) [India] January 28 (ANI): Tamil Nadu Opposition parties, including the Dravida Munnetra Kazhagam (DMK), will on Monday hold a protest against hiked bus fares in the state.\nSpeaking to media, DMK working president MK Stalin said, \"DMK and its alliance partners will hold protest to press upon total roll back of hiked bus fares across Tamil Nadu. Partial reduction in bus fares by the government is nothing but an eyewash. It can't be accepted and is also not correct. We demand total rollback of fares.\"\nThe All India Anna Dravida Munnetra Kazhagam-led Tamil Nadu Government on January 19 hiked the fares of Metropolitan Transport Corporation (MTC) buses in Chennai from Rs 3 to Rs 5, and the maximum from Rs 14 to Rs 23.\nThe move riled the Opposition parties, who have demanded resignation of Tamil Nadu Chief Minister K Palaniswami for failing to withdraw the fare hike\n\"This protest is not going to stop today. The bus fare price hike should be rolled back at once. If it is not possible, then the Chief Minister should resign and go home\", Stalin said yesterday.\nEarlier also, the DMK leader had raised an objection on the fare hike, saying, \"horse-traded and 'commission agent' government should roll it back immediately\".(ANI)", "url": "https://www.aninews.in/news/national/general-news/dmk-to-protest-against-bus-fare-hike-tomorrow201801281551580001/", "label": 1}