{"authors": ["Sreeradha Basu"], "date_download": "2019-03-27 14:18:24", "date_modify": "2019-03-27 14:18:24", "date_publish": "2017-04-06 00:57:00", "description": "Campus insiders said just 5 IIMs Bangalore, Indore, Calcutta, Lucknow and Tiruchirappalli this season placed more than 50 PWD candidates with disorders.", "filename": "news_company_corporate-tren_f4b07281aeb885e0df0eccc49fd1bbad_58037371_1553696304.html", "image_url": "https://img.etimg.com/thumb/msid-58037371,width-1070,height-580,imgsize-26854,overlay-economictimes/photo.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/economictimes.indiatimes.com/news_company_corporate-tren_f4b07281aeb885e0df0eccc49fd1bbad_58037371_1553696304.html", "title": "India Inc opens doors wide for differently-abled IIM graduates", "title_page": "IIMs: India Inc opens doors wide for differently-abled IIM graduates - The Economic Times", "title_rss": "NULL", "source_domain": "economictimes.indiatimes.com", "text": "MUMBAI: Kshitiz Aneja stands out among the IIM graduates that Hindustan Coca-Cola Beverages, the bottling arm of Coca-Cola, has recruited as management trainees this year. He doesn’t have hands. He lost them in an accident when he was eight.Darshi Vasavada of IIM Indore’s class of 2017 has only 50% vision, meaning she often needed a writer for her exams, and suffers from a rare genetic disorder called Kartagener’s syndrome that caused her dextrocardia, a defect where the heart is on the right side of the chest. But that has not stopped her from bagging a pre-placement offer from Tata Steel to work in Jamshedpur.Aneja and Vasavada are among tens of differently abled 2017 graduates from Indian Institutes of Management ( IIMs ) who have been snapped up by companies including the Mahindra Group, L’Oreal, Samsung , Accenture, Asian Paints, HCCB, PwC, ICICI Bank Amazon and TCS , campus insiders said.Companies are increasingly appointing persons with disabilities (PWDs), not just to meet their corporate social responsibility (CSR) obligations but also to tap a loyal talent pool, sources said.These firms are encouraged by the government’s inclusive initiatives such as the Accessible India campaign.“Across IIMs, courtesy initiatives such as Accessible India, there’s been a new high in terms of differently abled candidates being recruited,” said Prakash Singh, placements chairperson at IIM Lucknow.Campus insiders said just five IIMs — Bangalore, Indore, Calcutta, Lucknow and Tiruchirappalli — this season placed more than 50 PWD candidates with disorders ranging from visual and hearing to locomotive. They were offered salaries up to Rs 20 lakh.“Our PWD students are no different from the rest of the batch in terms of what they can achieve. The fact that they have been able to leverage their abilities and make it to the PGP (post-graduate programme in management) despite the not-so-accessible environment in our country, itself speaks volumes of their capabilities,” said Rajluxmi V Murthy, chairperson, office of disability services, at IIM Bangalore.Sapna Agarwal, head of placements at IIM Bangalore, said all 12 differently abled students in the batch have been placed. IIM Calcutta has placed nearly 14 differently abled students across various domains, with finance throwing up the maximum job opportunities for those with special needs.IIM Lucknow placed six differently abled students in Amazon, Dabur , L’Oreal, Janalakshmi Financial Services, TCS and Value Prospects. The list included 21-year-old Paridhi Verma, who has only 10% vision. She will join Janalakshmi Financial Services.At IIM Indore, the figure is as high as 18. Organisations including Capgemini, Cognizant Business Consulting, L&T, Tata Power , Tata Steel and Tata Trust have hired multiple candidates in roles such as consulting, finance, general management, marketing and operations, said Bhavya Kapoor, placement officer at IIM Indore.Abhishek Totawar, placements chairperson at IIM Trichy, said three differently abled students got placed from the 2015-17 batch in HCL, Muthoot Housing Finance, and Dr Agarwal’s Health Care.Educational institutions have 3% reservation for students with disabilities, though several are unable to fulfil the quota.Companies say differently abled candidates are often untapped pools of talent.“Our experience of recruiting such talent has been very positive and a great learning experience,” said Roshni Wadhwa, HR director at L’Oréal India, which started hiring differently abled candidates last year. It has recruited two candidates this year: Aditya Bagda from IIM Lucknow and Sunny Joon from IIM Kozhikode. Both suffer from locomotor disability. “As part of our diversity and inclusion agenda, by 2018, our goal is to have 2% of our total employee strength in India to be constituted by employees with disabilities,” Wadhwa said.Some organisations such as the Mahindra Group provide better physical infrastructure for their PWD employees and conduct sensitisation exercises among other employees.The group this year recruited visually challenged Aditya Singhvi from IIM Bangalore to work with Mahindra Holidays and Leisure. “We would definitely look at hiring more differently abled candidates provided we are able to match the right candidates to the right roles,” said Prince Augustin, EVP-group human capital and leadership development at Mahindra & Mahindra.Those working for the betterment of PWDs welcome the change in India Inc’s attitude towards the differently abled. “It is a fantastic thing that organisations are focusing on creating an inclusive culture,” said BS Nagesh, founder of Trust for Retailers and Retail Associates of India (TRRAIN) that runs Pankh, an initiative to train PWDs to make them part of inclusive growth in retail sector.“We have seen the impact this has at the lowest level. At management levels, when students from institutes such as the IIMs go on to become managers, not only does the effect percolate down, they also become brand ambassadors of inclusiveness in the organisation,” Nagesh said.Top differently abled students such as Vasavada and Aneja have already overcome several challenges in life that they are ready to lead by example.“People like me, who face certain challenges, tend to be that much more focused and dedicated. I feel I need to prove something,” said Vasavada, who once had to give up an opportunity to pursue her engineering at NIT in favour of another engineering college in her hometown in Gujarat. She is positive about her internship stint in Tata Steel’s supply chain management function and said people were always there to guide her.Aneja, 24, took a gap after his schooling to live without the support of his parents and figure out if he could manage on his own. An SRCC (Shri Ram College of Commerce, New Delhi) graduate, Aneja started writing with his leg, and then his mouth when artificial limbs did not suit him. “Life doesn’t end, not with an accident, not with disability. You keep trying till you succeed,” he said.", "url": "https://economictimes.indiatimes.com/news/company/corporate-trends/india-inc-opens-doors-wide-for-differently-abled-iim-graduates/articleshow/58037371.cms", "label": 1}