{"authors": ["Sandhya Dangwal"], "date_download": "2019-03-27 14:35:19", "date_modify": "2019-03-27 14:35:19", "date_publish": "2017-01-26 15:04:07", "description": "Inspired by the Jallikattu agitation in Tamil Nadu,protesters in Andhra Pradesh took to social media platforms and called for a silent protest at Ramakrishna Beach in Vizag. - Visakhapatnam: Protesters demanding special status for Andhra Pradesh detained", "filename": "news_india__1553697319.html", "image_url": "https://www.india.com/wp-content/uploads/2017/01/C3FMjs8UYAAGjpF.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/india.com/news_india__1553697319.html", "title": "Visakhapatnam: Protesters demanding special status for Andhra Pradesh detained", "title_page": "Visakhapatnam: Protesters demanding special status for Andhra Pradesh detained | India News, India.com", "title_rss": "NULL", "source_domain": "india.com", "text": "Vizag, Jan 26: Soon after the Jallikattu row in Tamil Nadu came to an end, protesters in Visakhapatnam have been demanding special status for Andhra Pradesh. Many protesters have been detained by Police on Thursday. As per report by PTI, more than 100 people have been detained by police which includes Telugu actor Sampoornesh Babu. The protesters on Wednesday called for a silent protest, demanding special category status (SCS) to Andhra Pradesh at Ramakrishna Beach Beach on the Republic Day. Inspired by the Jallikattu mass demonstrations across Tamil Nadu, that went on for a week, the protesters in Andhra Pradesh took to social media platforms and called for a silent protest at Ramakrishna Beach in Vizag.\nLeaders from various political parties have been demanding special category status since Andhra Pradesh got bifurcated in 2014. The first one to support youths for this protest was filmstar and Jana Sena chief Pawan Kalyan. Many movie actors like Sai Dharma Tej, Varun, Sampoornesh Babu, Sundeep Kishan posted tweets supporting the protests for a special category status to Andhra Pradesh. It was also reported that actor Sampoornesh had arrived in Vizag today to take part in the protest but was detained along with 100 youths.\nVisakhapatnam : Protesters in Vizag demanding special status for Andhra Pradesh detained by Police pic.twitter.com/v6TFzKjPJ4 — ANI (@ANI_news) January 26, 2017\nAndhra Pradesh Chief Minister Chandrababu Naidu termed the protest as an attempt to scuttle the two-day Partnership Summit which is going to take place on January 27 and 28. Security has been tightened along the Ramakrishna Beach to maintain law and order while all roads leading to the beach have been sealed by the Police. The Police on Wednesday imposed Section 144 of CrPc in the coastal city and banned any group of five or more people in an area.\nAs per reports by PTI, Police Commissioner T Yoganand warned people that they would be arrested if any one violated the prohibitory orders. Meanwhile, DGP (in-charge) Nanduri Sambasiva Rao said, “Nobody has sought permission for the protest and in any case permission cannot be granted for such agitations,” DGP (in-charge) Nanduri Sambasiva Rao said yesterday.", "url": "https://www.india.com/news/india/visakhapatnam-protesters-demanding-special-status-for-andhra-pradesh-detained-1785842/", "label": 1}