{"authors": [], "date_download": "2019-03-27 14:18:24", "date_modify": "2019-03-27 14:18:24", "date_publish": "2016-09-29 12:20:00", "description": null, "filename": "news_will-go-on-hunger-strike-if-cauvery-dispute-continues-uma-bharti-news-national-qj3rOiigfiecf_1553696304.html", "image_url": "http://static.sify.com/cms/image/qf0ssLbajdgib_small.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/sify.com/news_will-go-on-hunger-strike-if-cauvery-dispute-continues-uma-bharti-news-national-qj3rOiigfiecf_1553696304.html", "title": "Will go on hunger strike if Cauvery dispute continues: Uma Bharti", "title_page": "Will go on hunger strike if Cauvery dispute continues: Uma Bharti", "title_rss": "NULL", "source_domain": "sify.com", "text": "New Delhi: Union Water Resources Minister Uma Bharti on Thursday said that if the tension between Tamil Nadu and Karnataka prevailed with regard to the sharing of the water of the River Cauvery, she would sit on hunger strike on the border of that separates the two states.\nUnable to settle the ongoing dispute between the two states as instructed by the Supreme Court, Bharti said, \"If tension rises between Karnataka and Tamil Nadu, I am going to sit on a hunger strike on the border of both states.\"\nBharti requested both the states to sit down together and approach the court after finding some solution to their problems.\n\"I really appreciate that both states are trying to find some solution. They tried even then, ultimately, the solution cannot be achieved outside the court, and now, things are again in front of Supreme Court,\" Bharti said.\nThe representatives of both states met Uma Bharti today a day after the Karnataka government failed to comply with the Supreme Court's order to release more water from the Cauvery river to Tamil Nadu.\nThe apex court, has expressed its displeasure over Karnataka's inaction, saying that it violates the spirit of federalism or cooperation between states.\nThe apex court on Tuesday directed the Karnataka government to release 6000 cusecs of water till Friday.\nThe court also asked Attorney General Mukul Rohatgi to facilitate a meeting between the governments of the two states to find a solution to this long-standing problem.\nKarnataka government had said it was not in a position to release water to Tamil Nadu citing 'acute shortage' of water.\nThe Tamil Nadu government, on the other hand, has said that Karnataka is acting as a judge in its own cause and refusing to comply with apex court orders that are sub-judice.\nOver the past month, both states are fighting a legal battle in various courts over the sharing and distribution of Cauvery waters.\nThe Cauvery River originates in Karnataka but flows into Tamil Nadu and the matter of how much water each state should get has been a recurring dispute for decades.", "url": "http://www.sify.com/news/will-go-on-hunger-strike-if-cauvery-dispute-continues-uma-bharti-news-national-qj3rOiigfiecf.html", "label": 1}