{"authors": ["Imh", "Bs Motoring.Com", "Business Standard Motoring"], "date_download": "2019-03-27 14:40:47", "date_modify": "2019-03-27 14:40:47", "date_publish": null, "description": "Hyundai Motor India has inaugurated country’s first ever digital automotive outlet in the capital – ‘Unity Hyundai’. The company said that the new showroom offers a unique car buying experience to modern shoppers by adopting the digital screens and artworks as per the changing taste of customers. It will provide a customer-centric experience allowing visitors to research, test-drive, part-exchange their old car and purchase a new Hyundai car – either with cash or through various fina", "filename": "news_hyundai-opens-indias-first-digital-outlet_12939_1553697647.html", "image_url": "https://www.bsmotoring.com/bsm_icons/apple-icon-57x57.png", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/bsmotoring.com/news_hyundai-opens-indias-first-digital-outlet_12939_1553697647.html", "title": "Hyundai Opens India's First Digital Outlet", "title_page": "Hyundai Opens India's First Digital Outlet", "title_rss": "NULL", "source_domain": "bsmotoring.com", "text": "Workers’ strike at Tata Motors plant at Sanand entered its second day on Wednesday as workers refused to budge from their demands of re-instating the suspended labourers and the company, on its part, maintained its stand to take action only after an inquiry.\nAs many as 422 workers at the Sanand site had gone on a strike on Tuesday after making demonstrations at the unit on Monday. The workers were demanding that the suspension order of 28 colleagues be immediately revoked. It is learnt the workers had also damaged some cars at the plant on Monday. The state labour department had sprung into action immediately and officials tried to mediate the agitating workers with the company, however, no consensus has been reached yet.\nWhen contacted, a Tata Motors spokesperson claimed there had been no significant production loss at the site due to the strike. It may be noted here that the Tata plant had been hardly utilising its installed capacity due to lack of demand for the Nano car.\n42,561 Nano cars were produced from the Sanand factory from January 2014 to December 2015, against an installed capacity of 250,000 cars per annum, the state government on Wednesday informed at the assembly in response to a question.\nDeputy labour commissioner of Ahmedabad zone, V V Pandya, said, “There have been no change in the situation at the site. The company has claimed that their production is not much affected due to the strike, and thereby, the deadlock continues.”\nPolice sources inform the workers commute to the plant in company buses, sit on a dharna, and then head home in the same buses after the shift ends.\nTata Motors had suspended two workers around two months ago for indiscipline, and had not taken them back in, after an inquiry. Protesting against this, a few hundred workers staged a demonstration at the site on Monday, and eventually another 26 were suspended. As many as 400 workers had gone on strike since Tuesday.\nStriking workers have formed a seven-member committee to negotiate with company management and the Gujarat government as there is no union. Pandya said the workers had indicated that they do not seek any outside support.\nA company spokesperson highlighted that Tata Motors continued to engage with the workers and hold talks.\nIncidentally, the Tata Motors plant was shifted from Singur in West Bengal to Sanand in Gujarat in 2008, following protests over land acquisition.", "url": "https://www.bsmotoring.com/news/hyundai-opens-indias-first-digital-outlet/12939", "label": 1}