{"authors": ["Pti Feeds"], "date_download": "2019-03-27 14:35:21", "date_modify": "2019-03-27 14:35:21", "date_publish": "2017-06-06 22:13:12", "description": "New Delhi, Jun 6 (PTI) Heavy security was deployed outside the CPI(M) headquarters here, anticipating protests by cow-vigilante groups against Kerala Chief Minister Pinarayi Vijayan, who is in the national capital for the two-day politburo meeting of the party. - Security beefed up at CPI(M) headquarters", "filename": "news_agencies__1553697321.html", "image_url": "https://s3.india.com/wp-content/uploads/2015/06/indiacom-image-banner_01.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/india.com/news_agencies__1553697321.html", "title": "Security beefed up at CPI(M) headquarters", "title_page": "Security beefed up at CPI(M) headquarters | Agencies News, India.com", "title_rss": "NULL", "source_domain": "india.com", "text": "New Delhi, Jun 6 (PTI) Heavy security was deployed outside the CPI(M) headquarters here, anticipating protests by cow-vigilante groups against Kerala Chief Minister Pinarayi Vijayan, who is in the national capital for the two-day politburo meeting of the party.\nVijayan has drawn the ire of right-wing organisations for his criticism of the Centre’s notification banning sale and purchase of cattle at animal markets for slaughter.\nAccording to a senior police officer, security personnel, including those from paramilitary forces, were deployed outside AK Gopalan Bhavan, the CPI(M) headquarters, as a precautionary measure.\nThe police had received information that some people might try to create a ruckus outside the CPI(M) office, protesting the recent beef fests in Kerala and the chief minister’s views on the issue, the officer said, adding that the area around the office, along Bhai Veer Singh Marg, had been heavily barricaded.\nThe Left party, however, had not asked for an additional security deployment ahead of the meeting which got underway today.\nBeef fests were recently held in Kerala and Tamil Nadu to protest the Centre’s decision to ban the sale and purchase of cattle at the animal markets for the purpose of slaughter.\nSome Youth Congress activists had even butchered a calf in full public view in Kerala as a mark of protest, drawing criticism from various quarters.\nThis is published unedited from the PTI feed.", "url": "https://www.india.com/news/agencies/security-beefed-up-at-cpim-headquarters-2208248/", "label": 1}