{"authors": ["Tribune News Service"], "date_download": "2019-03-27 14:41:01", "date_modify": "2019-03-27 14:41:01", "date_publish": "2018-05-20 00:00:00", "description": "TheTribune: BENGALURU: Protesting against the high petrol and fuel prices, Congress president Rahul Gandhi on Monday rode a bicycle as he led a march on the issue while campaigning in Karnataka’s Kolar district.", "filename": "news_nation_rahul-gandhi-on_597daf558fbbe12e07a1d40fd5aa8fc4_585710_1553697661.html", "image_url": "https://images.tribuneindia.com/cms/gall_content/2018/5/2018_5$largeimg07_Monday_2018_183727993.JPG", "language": null, "localpath": "/home/raj/news-please-repo//data/2019/03/27/tribuneindia.com/news_nation_rahul-gandhi-on_597daf558fbbe12e07a1d40fd5aa8fc4_585710_1553697661.html", "title": "Rahul Gandhi on bicycle leads protest march on petrol price in Karnataka", "title_page": "\r\n\tRahul Gandhi on bicycle leads protest march on petrol price in Karnataka\r\n", "title_rss": "NULL", "source_domain": "tribuneindia.com", "text": "Bengaluru, May 7\nProtesting against the high petrol and fuel prices, Congress president Rahul Gandhi on Monday rode a bicycle as he led a march on the issue while campaigning in Karnataka’s Kolar district.\nLater, standing on a bullock cart, he addressed a gathering where he alleged that the BJP-led government wanted to take money from the common man to give it to its “rich friends” and asked it to tell the people why they were not reducing the price of petrol in the country.\nGandhi, who resumed his poll campaign for the May 12 assembly polls, took out a protest march in Maluru in Kolar against rising petrol prices by riding a bicycle with other Congress workers walking or running behind him.\nThe world over, petrol prices are decreasing, but in India prices were still high, he lamented.\n“Earlier in international market, the price was USD 140 per barrel, now it is USD 70 per barrel. So lakhs of crores of money is being saved by the government. Where is the money going?” Gandhi asked.\n“Why are you not saying to people that you don’t want to put GST on petrol and diesel? You want to take away money from common man and want to give it to your five or ten industrialist friends,” he said before the gathering.\n“You want to take money from the pockets of those driving scooter, truck, bus and other vehicles in the country and want to give it your rich friends,” the Congress leader said.\nDuring his three-day visit, Gandhi will be campaigning in Kolar, Bengaluru Rural, Chikkballapura, Tumakuru districts and Bengaluru city. — PTI", "url": "https://www.tribuneindia.com/news/nation/rahul-gandhi-on-bicycle-leads-protest-march-on-petrol-price-in-karnataka/585710.html", "label": 1}