{"authors": [], "date_download": "2019-03-27 14:25:46", "date_modify": "2019-03-27 14:25:46", "date_publish": "2017-06-09 09:41:08", "description": "Overall internet protocol traffic per month is expected to grow to 6.5 Exabytes by 2021", "filename": "news_regular-story_internet-users-in-india-to-double-by-2021-cisco_1553696746.html", "image_url": "http://governancenow.com/temp/internet4.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/governancenow.com/news_regular-story_internet-users-in-india-to-double-by-2021-cisco_1553696746.html", "title": "Internet users in India to double by 2021: Cisco", "title_page": "Internet users in India to double by 2021: Cisco -Governance Now", "title_rss": "NULL", "source_domain": "governancenow.com", "text": "Overall internet protocol traffic per month is expected to grow to 6.5 Exabytes by 2021\nInternet users will grow to 829 million in 2021, up from 373 million in 2016, said a Cisco report that was released on Friday.\nIn its visual networking index (VNI) forecast, Cisco said that there will be two billion networked devices in 2021, up from 1.4 billion in 2016. The overall internet protocol (IP) traffic is expected to grow four-fold from 2016 to 2021, a compound annual growth rate of 30 percent and reach 6.5 Exabytes of data per month in 2021, up from 1.7 Exabytes per month in 2016.\nThe report said that the machine to machine (M2M) connections will represent 22 percent of the total two billion devices and connections and will account for five percent of IP traffic by 2021. The advancements in the internet of things (IoT) applications such as smart meters, package tracking, digital health monitors and a host of other next-generation M2M services is driving this incremental growth—nearly 21 percent increase in the next five years.\nThe video will continue to dominate IP traffic and overall internet traffic growth—representing 76 percent of all internet traffic in 2021, up from 57 percent in 2016. India will reach 84 billion Internet video minutes per month by 2021, which is one hundred and sixty thousand years of video per month, or about 32,000 video minutes every second.\n“Mobile networks, devices and connections in India are not only getting smarter in their computing capabilities but are also evolving from lower-generation network connectivity (2G) to higher-generation network connectivity (3G, 3.5G, and 4G or LTE). Combining device capabilities with faster, higher bandwidth and more intelligent networks is leading to wide adoption of high bandwidth data, video and advanced multimedia applications that contribute to increased mobile and Wi-Fi traffic,” said Sanjay Kaul, managing director, service provider business, Cisco India and SAARC.\nHe added, “We are witnessing a burgeoning rise in usage of mobile applications and connectivity by end users. The need for optimized bandwidth management, network automation, end to end security and ultimately network monetization through cost efficient data production is fuelling the growth of network automation, mass market 4G deployments and adoption, soon to be followed with 4.5G and 5G.”\nHere are some key facts from the Cisco report:\n1. Increase in internet users, devices & connection\n• There will be 829 million total Internet users (59% of population) in 2021, up from 373 million (28% of population) in 2016\n• There will be 2.0 billion networked devices in 2021, up from 1.4 billion in 2016\n2. Increase in IP traffic & internet traffic\n• Consumer internet video traffic will reach 3.0 Exabytes per month in 2021, the equivalent of 756 million DVDs per month, or 1 million DVDs per hour\n• Consumer internet video traffic was 535 Petabytes per month in 2016, the equivalent of 134 million DVDs per month, or 183,261 DVDs per hour\n• Internet video traffic will be 77% of all consumer Internet traffic in 2021, up from 58% in 2016\n• Internet traffic will grow 4.0-fold from 2016 to 2021, a compound annual growth rate of 32%\n• In 2021, the gigabyte equivalent of all movies ever made will cross the Internet every 54 minutes\n• Indian Internet traffic in 2021 will be equivalent to 291x the volume of the entire Indian Internet in 2005\n3. Increase in Per capita Usage\n• IP traffic will reach 5 Gigabytes per capita in 2021, up from 1 Gigabytes in 2016\n4. Internet users & faster broadband speed\n• There will be 829 million total Internet users (59% of population) in 2021, up from 373 million (28% of population) in 2016\n• The average fixed broadband speed will grow 2.8-fold from 2016 to 2021, from 6.6 Mbps to 18.2 Mbps\n5. Increase in mobile, internet video\n• Mobile data traffic will grow 7-fold from 2016 to 2021, a compound annual growth rate of 49%\n• Mobile data traffic in 2021 will be equivalent to 88x the volume of the entire Indian Internet in 2005\n• IP video will be 83% of all IP traffic in 2021, up from 69% in 2016\n• Internet video traffic will grow 5-fold from 2016 to 2021, a compound annual growth rate of 40%\n• Total internet video traffic (business and consumer, combined) will be 76% of all Internet traffic in 2021, up from 57% in 2016\n• HD will be 51.4% of Internet video traffic in 2021, up from 12.0% in 2016 (87.9% CAGR)\n• 84 billion minutes (159,201 years) of video content will cross the Internet each month in 2021. That's 31,840 minutes of video streamed or downloaded every second\n• Internet video traffic will grow 5-fold from 2016 to 2021, a compound annual growth rate of 40%\n6. Increase in networked devices\n• There will be 2.0 billion networked devices in 2021, from 1.4 billion networked devices in 2016, and 1.3 billion in 2015\n• 67% of all networked devices will be mobile-connected in 2021\n7. Growth in internet video & gaming traffic\n• Internet video traffic will be 77% of all consumer Internet traffic in 2021, up from 58% in 2016\n• Gaming traffic will grow 7-fold from 2016 to 2021, a compound annual growth rate of 49%\nKey Findings & Milestones from Global Traffic Projections and Service Adoption Trends\n1. Strong growth in IP and internet traffic\n• Global IP traffic is expected to reach 278 Exabytes per month by 2021, up from 96 Exabytes per month in 2016. Global IP traffic is expected to reach an annual run rate of 3.3 zettabytes by 2021.\n• Busy hour internet traffic is increasing faster than average Internet traffic. Busy hour Internet traffic will grow 4.6-fold (35% CAGR) from 2016 to 2021, reaching 4.3 Pbps by 2021, compared to average Internet traffic that will grow 3.2-fold (26% CAGR) over the same period reaching 717 Tbps by 2021.\n• Content delivery networks (CDNs), will carry 71 percent of all Internet video traffic by 2021 (up from 52 percent in 2016).\n1. Average DDoS (Distributed Denial of Service) attacks size increasing steadily and approaching 1.2 Gpbs— enough to take most organizations completely offline\n• DDoS incidents can paralyze networks by flooding servers and network devices with traffic from multiple IP sources.\n• The peak attack size increased 60% Y/Y and represents up to 18 percent of a country’s total Internet traffic while they are occurring.\n• Average DDoS attack size increased to 22 percent which is relatively the same rate as Internet traffic at 29 percent Y/Y.\n• The DDoS attacks grew 172% in 2016 and will increase 2.5-fold to 3.1 million by 2021 globally.\n2. Globally, total public W-Fi hotspots (including homespots) will grow 6-fold from 2016 to 2021 from 94 million in 2016 to 541.6 million by 2021.\n• Globally, total Wi-Fi homespots will grow from 85 million in 2016 to 526.2 million by 2021.\n• Globally there were 91 percent of public Wi-Fi hotspots in 2016 and by 2021 it is projected to reach 97 percent.\n• Leading hotspot countries: China (170M by 2021), US (86M by 2021), Japan (33M by 2021), and France (30M by 2021).\n3. By 2021, more than half (56 percent) of connected flat panel TV sets will be 4K up from 15% in 2016\n• Installed/In-service 4K TV sets will increase from 85M in 2016 to 663M by 2021.", "url": "http://www.governancenow.com/news/regular-story/internet-users-in-india-to-double-by-2021-cisco", "label": 1}