{"authors": ["In This New Podcast Series Tracking Major Campaign Speeches Across The Country", "Varghese K George Is In Conversation With Jayant Sriram To", "Opposition Shows Video Of", "Bjp Leader", "Exchanging Old Currency Past Deadline"], "date_download": "2019-03-27 14:40:38", "date_modify": "2019-03-27 14:40:38", "date_publish": "2015-01-17 12:22:47", "description": "Amid protests in some parts of Tamil Nadu against a ban on traditional bull-taming sport, Union Minister Maneka Gandhi has said that jallikattu is a Western concept that leads to killings of humans an", "filename": "news_national_maneka-jallik_8a5562924b66fe15fddc9033ad1dca2f_article6796717_1553697638.html", "image_url": "https://www.thehindu.com/migration_catalog/article10478254.ece/ALTERNATES/LANDSCAPE_615/MANEKA", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/thehindu.com/news_national_maneka-jallik_8a5562924b66fe15fddc9033ad1dca2f_article6796717_1553697638.html", "title": "Maneka says jallikattu a Western concept", "title_page": "\nManeka says jallikattu a Western concept - The Hindu\n", "title_rss": "NULL", "source_domain": "thehindu.com", "text": "Amid protests in some parts of Tamil Nadu against a ban on traditional bull-taming sport, Union Minister Maneka Gandhi has said that jallikattu is a Western concept that leads to killings of humans and animals.\n“Jallikattu tradition is western culture and BJP is against it. The Supreme Court’s decision to ban it is a welcome step,” said Ms. Maneka.\nShe said that in this tradition cows and bulls, which are very useful for the farmers, are killed.\n“Not only the animals, but humans are also killed in this tradition,” she said.\nTension prevailed in Palamedu and Alanganallur, two of the famous venues for the traditional sport, with shops remaining closed and buildings sporting black flags, as residents were upset jallikattu could not be held this year.\nMs. Maneka said that Makar Sankranti should be celebrated by worshipping plants and trees, but in Tamil Nadu it starts with atrocities, which is wrong.", "url": "https://www.thehindu.com/news/national/maneka-jallikattu-a-western-concept-bjp-against-it/article6796717.ece", "label": 1}