{"authors": ["Until Now", "This Procedure Had Been Reserved For Old Patients Who Might Not Survive Open Heart Surgery"], "date_download": "2019-03-27 14:40:56", "date_modify": "2019-03-27 14:40:56", "date_publish": "2018-07-11 01:35:06", "description": "Students demand inquiry committee to bring a permanent solution to crisis", "filename": "news_cities_Delhi_protest-t_2c66fa743467897c4158923361cb0f65_article24383697_1553697656.html", "image_url": "https://www.thehindu.com/news/cities/Delhi/3x9im3/article24383696.ece/ALTERNATES/LANDSCAPE_615/10DELPRIYAMANIPURPROTEST", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/thehindu.com/news_cities_Delhi_protest-t_2c66fa743467897c4158923361cb0f65_article24383697_1553697656.html", "title": "Protest to end ‘paralysis’ at Manipur varsity", "title_page": "\nProtest to end ‘paralysis’ at Manipur varsity - The Hindu\n", "title_rss": "NULL", "source_domain": "thehindu.com", "text": "A number of tribal student bodies came together for a protest at Jantar Mantar on Tuesday to highlight the “paralysis” being faced at Manipur University since May 30. The students said that steps need to be taken to ensure that the Central university, which comprises 86 colleges and institutions, returns to normalcy.\nThey demanded that a high-level independent inquiry committee needs to be set up to bring a “permanent solution to the frequent problems in Manipur University in the last decade”.\nBlames State govt\nUnder the banner of Joint Tribal Students’ Bodies, Manipur, the protesters blamed the State government, which is responsible for maintaining law and order situation of the university for not taking any effective measure for restoration of normalcy.\nSince May 30, the Manipur University Students’ Union (MUSU) with the support of the Manipur University Teacher’s Association (MUTA) have been on protest over their demand for removal of the Vice-Chancellor.\nThe protesters said, “Due to the current impasse created by the MUSU volunteers inside the university, disrupting all administrative and academic affairs, the careers of all bachelor’s and master’s degree students are in great jeopardy. This is tantamount to assassination of students’ career and is an irreparable loss for the whole society.”\nThey added that the blame game should stop immediately and the students’ body should immediately withdraw its agitation to pave way for resumption of normal administrative and academic activities in the university. They felt that the agitation was counter-productive.\nThe Federation of Central University Teachers’ Association (FEDCUTA) had come out with a statement on Monday saying its complete solidarity with the MUTA as well as other sections of the Manipur University community, and appeals to the President to immediately institute an independent inquiry into the charges of misgovernance, pending which the Vice-Chancellor must be sent on leave.\nThe FEDCUTA also appealed to Chancellor Najma Heptullah who is also Governor of Manipur to intervene in the matter to ensure that normalcy is restored in the University and students’ careers are not jeopardised.\nStudents and teachers have been on strike for more than a month, demanding the resignation of Vice-Chancellor A.P. Pandey for “gross dereliction of duty and blatant flouting of all financial and administrative rules and norms”.", "url": "https://www.thehindu.com/news/cities/Delhi/protest-to-end-paralysis-at-manipur-varsity/article24383697.ece", "label": 1}