{"authors": [], "date_download": "2019-03-27 14:40:54", "date_modify": "2019-03-27 14:40:54", "date_publish": "2019-02-01 01:48:01", "description": "Guwahati (Assam), [India], Feb 1 (ANI):  All Assam Students' Union (AASU) held a massive candlelight protest against the Citizenship Amendment Bill, 2016, here on Thursday.", "filename": "news_national_general-news__1553697654.html", "image_url": "https://aniportalimages.s3.amazonaws.com/media/details/Assam_protest.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/aninews.in/news_national_general-news__1553697654.html", "title": "AASU holds candlelight protest against Citizenship Amendment Bill", "title_page": "AASU holds candlelight protest  against Citizenship Amendment Bill", "title_rss": "NULL", "source_domain": "aninews.in", "text": "Guwahati (Assam), [India], Feb 1 (ANI): All Assam Students' Union (AASU) held a massive candlelight protest against the Citizenship Amendment Bill, 2016, here on Thursday.\n\"We are not in favour of this bill. Thousands of students from AASU have gathered here to tell the government that we don’t want this bill as it will create problems for us. Assam’s peace will be at stake if this bill is passed,\" a protester said.\nThe Citizenship Amendment Bill, 2016, was passed in the Lok Sabha on January 8.\nThe bill will facilitate citizenship of six identified minority communities namely Hindus, Sikhs, Jains, Buddhists, Christians and Parsis from Afghanistan, Pakistan and Bangladesh who came to India before 31 December 2014.\nThe proposed amendment in the Bill will make these persecuted migrants eligible to apply for citizenship. Under the proposed amendment, the minimum residency period for citizenship is being reduced from the existing 12 years under the present law to seven years. However, citizenship will be given to them only after due scrutiny and recommendation of district authorities and the state government.\nSix student bodies including Meira Paibis protested against the bill in New Delhi on January 30, and also boycotted the 70th Republic Day celebration in Manipur. (ANI)", "url": "https://www.aninews.in/news/national/general-news/aasu-holds-candlelight-protest-against-citizenship-amendment-bill20190201071748/", "label": 1}