{"authors": ["Press Trust Of India"], "date_download": "2019-03-27 14:34:56", "date_modify": "2019-03-27 14:34:56", "date_publish": "2016-09-13 13:55:13", "description": "Narenda Modi should invite the Chief Ministers of Tamil Nadu (J Jayalalithaa) and Karnataka (Siddaramiah) soon for talks and ensure a cordial atmosphere (in the two states),", "filename": "news_india__1553697296.html", "image_url": "https://www.india.com/wp-content/uploads/2016/09/Narendra-Modi1.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/india.com/news_india__1553697296.html", "title": "Cauvery row: DMK seeks Narendra Modi's intervention to solve crisis", "title_page": "Cauvery row: DMK seeks Narendra Modi's intervention to solve crisis  | India News, India.com", "title_rss": "NULL", "source_domain": "india.com", "text": "Chennai, Sep 13: Opposition DMK today sought Prime Minister Narendra Modi’s intervention in the Cauvery crisis, urging him to convene a meeting of chief ministers of Tamil Nadu and Karnataka and “ensure a cordial atmosphere” in both states. “Prime Minister Narenda Modi should invite the Chief Ministers of Tamil Nadu (J Jayalalithaa) and Karnataka (Siddaramiah) soon for talks and ensure a cordial atmosphere (in the two states),” DMK Treasurer and Opposition Leader in Tamil Nadu Assembly, M K Stalin, said.\nModi should also ensure the safety of Tamils in Karnataka, he told reporters here. Referring to the Supreme Court directive to Karnataka to release Cauvery water to Tamil Nadu, Stalin said that it was the duty of the Centre to ensure that the upper riparian state complied with the apex court order. Meanwhile, the party said it will discuss the issue during a meeting of its key office-bearers here on September 18. (ALSO READ: Cauvery row: Narendra Modi pained over violence in Karnataka, Tamil Nadu )\nDMK President M Karunanidhi will chair a meeting of the party’s district secretaries here on Sunday where the Cauvery issue and the upcoming local body polls will be discussed, party General Secretary K Anbazhagan said in a release. The protests over the Cauvery dispute turned violent in Karnataka and Tamil Nadu yesterday, with Bengaluru witnessing police firing on protestors and torching and damaging of Tamil Nadu vehicles including buses.\nOne person was killed and another injured in the firing. In Tamil Nadu, a popular hotel owned by a Kannadiga was targeted by protestors while vehicles bearing Karnataka registration were attacked in Rameswaram. Protests were also held outside branches of Bank of Karnataka in Tamil Nadu and Puducherry.", "url": "https://www.india.com/news/india/cauvery-row-dmk-seeks-narendra-modis-intervention-to-solve-crisis-1484236/", "label": 1}