{"authors": ["Pragati Ratti Sharma"], "date_download": "2019-03-27 14:35:21", "date_modify": "2019-03-27 14:35:21", "date_publish": "2017-03-31 13:14:15", "description": "After DMK MP Kanimozhi, Congress Vice President Rahul Gandhi also on Friday met Tamil Nadu farmers protesting at Jantar Mantar in the national capitals for over two weeks now. - Rahul Gandhi follows Kanimozhi, meets Tamil Nadu farmers staging skull protest at Jantar Mantar", "filename": "news_india__1553697321.html", "image_url": "https://www.india.com/wp-content/uploads/2017/03/rahul-gandhi-meets-tamil-farmers-1.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/india.com/news_india__1553697321.html", "title": "Rahul Gandhi follows Kanimozhi, meets Tamil Nadu farmers staging skull protest at Jantar Mantar", "title_page": "Rahul Gandhi follows Kanimozhi, meets Tamil Nadu farmers staging skull protest at Jantar Mantar | India News, India.com", "title_rss": "NULL", "source_domain": "india.com", "text": "New Delhi, March 31: After DMK MP Kanimozhi, Congress Vice President Rahul Gandhi also on Friday met Tamil Nadu farmers protesting at Jantar Mantar in the national capitals for over two weeks now. Gandhi interacted with the farmers and heard their pleas. Gandhi sat with the farmers at Jantar Mantar and said that they must be heard by Prime Minister Narendra Modi. “The Prime Minister has given debt relief to the richest people in the country, why not for people who have built this country, the farmers,” Gandhi questioned. “Neither the Centre, nor the PM is listening to these farmers’ voices. Their pleas deserve to be heard by the Prime Minister,” he added.\nEarlier in the day, DMK MP Kanimozhi also met the protesting farmers at Jantar Mantar and heard their please. After the meeting, she said that the DMK has raised the issue many a times in Parliament but to no avail. Kanimozhi added that it has 19 days that the farmers have been protesting in the scorching heat, but no one is hearing them.\nAt least 84 farmers from Tamil Nadu have been staging a protest at Jantar Mantar for the past 19 days demanding loan waiver and drought relief. The farmers are demonstrating with skulls, which they say, are of the farmers who died in Tamil Nadu last year due to drought. The farmers have demonstrated in many unusual ways in a hope that their protest will be noticed by the government. On Tuesday, they held dead snakes in their mouths as a mark of protest, hoping that eating snake meat will get them the Prime Minister’s attention. Earlier last week, the farmers also put live mice in their mouths while protesting. They also climbed a tree shouting out their demands. The farmers also demonstrated as corpses of dead farmers as a mark of their protest.\nThe agitating farmers are also demanding the formation of a Cauvery Management Committee, linking of all rivers by Smart Waterways Project and profitable prices for agricultural produce, along with a loan waiver. The Tamil Nadu government had demanded Rs 40,000 crore from the Centre for drought-hit farmers. However, the farmers say that the Centre has allocated only Rs 2,000 crore so far. The protesting farmers claim that there has been no outcome even after meetings with the Finance Minister, Home Minister, Agriculture Minister. They say that they have received assurances that Prime Minister Narendra Modi will get in touch with them but that has not yet happened. The farmers have refused to end their protest till PM Modi hears their pleas or till their demands are met.", "url": "https://www.india.com/news/india/rahul-gandhi-follows-kanimozhi-meets-tamil-nadu-farmers-staging-skull-protest-at-jantar-mantar-1979344/", "label": 1}