{"authors": [], "date_download": "2019-03-27 14:40:47", "date_modify": "2019-03-27 14:40:47", "date_publish": null, "description": "ALLAHABAD: A gang of six masked robbers looted Rs 5 lakh from Gramin Shakha of Bank of Baroda at Jagesharganj in Pratapgarh district after taking staff and customers hostage at gun point on Friday.\nThey entered the bank at around 11:45 am and escaped after looting the cash within 40 minutes.”“Apart from the bank staff, as many as 35 customers were inside the bank when the robbers struck.\nIt seems they had carried out recee of the bank,” said Antoo police under whose jurisdiction the area comes.\nThey threatened to open fire if anyone dared to raise alarm.“The robbers were well acquainted with the layout of the bank as well as the timing of cash distribution.\nThe robbers, who were carrying country-made pistols, damaged two CCTV sets before fleeing,” he added.“We have obtained some CCTV footage and sought the assistance of police from neighbouring districts.", "filename": "news_allahabad_1212189__1553697647.html", "image_url": "https://www.nyoooz.com/df-images/allahabad/df-allahabad-2.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/nyoooz.com/news_allahabad_1212189__1553697647.html", "title": "Six masked men take bank staff, customers hostage, loot Rs 5 lakh", "title_page": "Six masked men take bank staff, customers hostage, loot Rs 5 lakh | ALLAHABAD NYOOOZ", "title_rss": "NULL", "source_domain": "nyoooz.com", "text": "Advertisement\nALLAHABAD: A gang of six masked robbers looted Rs 5 lakh from Gramin Shakha of Bank of Baroda at Jagesharganj in Pratapgarh district after taking staff and customers hostage at gun point on Friday. They entered the bank at around 11:45 am and escaped after looting the cash within 40 minutes.”“Apart from the bank staff, as many as 35 customers were inside the bank when the robbers struck. It seems they had carried out recee of the bank,” said Antoo police under whose jurisdiction the area comes. They threatened to open fire if anyone dared to raise alarm.“The robbers were well acquainted with the layout of the bank as well as the timing of cash distribution. The robbers, who were carrying country-made pistols, damaged two CCTV sets before fleeing,” he added.“We have obtained some CCTV footage and sought the assistance of police from neighbouring districts.", "url": "https://www.nyoooz.com/news/allahabad/1212189/six-masked-men-take-bank-staff-customers-hostage-loot-rs-5-lakh/", "label": 1}