{"authors": ["India.Com News Desk"], "date_download": "2019-03-27 14:35:10", "date_modify": "2019-03-27 14:35:10", "date_publish": "2017-09-08 16:44:04", "description": "New Delhi, Sept 8: The Supreme Court instructed the Tamil Nadu government to ensure no protest is held against the the National Eligibility-cum-Entrance Test (NEET) in the state. The bench led by Chief Justice of India Deepak Misra said anyone agitating against the NEET is liable to be charged under contempt of court. - Supreme Court Bans Agitation Against NEET, Instructs Tamil Nadu Govt to Maintain Law and Order", "filename": "news_india__1553697310.html", "image_url": "https://www.india.com/wp-content/uploads/2017/09/SupremeCourtPTI-1.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/india.com/news_india__1553697310.html", "title": "Supreme Court Bans Agitation Against NEET, Instructs Tamil Nadu Govt to Maintain Law and Order", "title_page": "Supreme Court Bans Agitation Against NEET, Instructs Tamil Nadu Govt to Maintain Law and Order | India News, India.com", "title_rss": "NULL", "source_domain": "india.com", "text": "New Delhi, Sept 8: The Supreme Court instructed the Tamil Nadu government to ensure no protest is held against the the National Eligibility-cum-Entrance Test (NEET) in the state. The bench led by Chief Justice of India Deepak Misra said anyone agitating against the NEET is liable to be charged under contempt of court.\nThose involved in both small-case and large-scale protest should be cracked down, the apex court reportedly directed the Chief Secretary of Tamil Nadu.\nThe bench was hearing a PIL filed by senior SC lawyer GS Mani seeking judicial intervention in the matter. The next hearing would be held on September 18, with the court instructing Tamil Nadu’s Advocate General to remain present at the proceeding.\nThe court order came in the backdrop of widespread protest being witnessed in the state, following the suicide of 17-year-old girl S Anitha, who failed to clear the NEET.\nAnitha, who had scored 1176 out of 1200 marks in Class 12th, was not able to afford the academic classes for NEET preparations. Belonging to a Dalit family in Ariyalur district, Anitha’s father was a farmer, while her brother was a daily-wage earner.\nShe was among the six students who were being represented in the top court by senior advocate Nalini Chidambaram, challenging the implementation of NEET in the state.\nThe news of her suicide came last Friday, after the first round of medical admissions concluded. The minor girl hung herself to death at her home in Sendurai village in Ariyalur.\nFollowing her suicide, students groups, along with political parties protested against the state and central governments over the implementation of NEET.\nState’s prime opposition DMK said the government led by AIADMK should issue a public apology for its failure to safeguard the interests of the state.\nThe protests had soared over the weekend, with angry villages in Ariyalur blocking roads and highways. Students from various outfits, including Dalit bodies, also gathered at the Jaya memorial in Chennai to mark their dissent.", "url": "https://www.india.com/news/india/supreme-court-bans-agitation-against-neet-instructs-tamil-nadu-govt-to-maintain-law-and-order-2458307/", "label": 1}