{"authors": [], "date_download": "2019-03-27 14:40:45", "date_modify": "2019-03-27 14:40:45", "date_publish": "2018-03-12 21:59:22", "description": "For the sixth consecutive day, both Houses of Parliament failed to transact any substantive business, with regional parties disrupting proceedings over various issues.Since the Budget session resumed", "filename": "news_rows-protests-mar-business-in-both-houses_article23163157_1553697645.html", "image_url": "https://www.thehindubusinessline.com/migration_catalog/article23163156.ece/ALTERNATES/LANDSCAPE_615/BL13POLTDP", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/thehindubusinessline.com/news_rows-protests-mar-business-in-both-houses_article23163157_1553697645.html", "title": "Rows, protests mar business in both Houses", "title_page": "\nRows, protests mar business in both Houses - The Hindu BusinessLine\n", "title_rss": "NULL", "source_domain": "thehindubusinessline.com", "text": "For the sixth consecutive day, both Houses of Parliament failed to transact any substantive business, with regional parties disrupting proceedings over various issues.\nSince the Budget session resumed on March 5, it has been a series of washouts in Parliament, with the Opposition and the government blaming each other for the pandemonium.\nOn Monday, both the Houses were mainly disrupted by the AIADMK, which has been protesting over the constitution of the Cauvery Board for the division of river water.\nOther parties, namely the TRS, TDP and the YSR Congress, added their bit by storming the well of the Lok Sabha with placards and raising slogans.\nThe Rajya Sabha was adjourned in the morning amid protests by opposition parties and NDA ally TDP on various issues including the demand for special status for Andhra Pradesh, the Cauvery row, sealing in Delhi and bank fraud.\nAs soon as the Upper House reconvened at 2 pm after an adjournment earlier in the day, Trinamool Congress (TMC) member Sukhendu Sekhar Roy stood up, seeking the Chair’s permission to raise a point of order.\nHowever, Deputy Chairman of the Rajya Sabha PJ Kurien, who was in the Chair, said the House needs to be in order first.\nUnrelenting members from the TDP stormed the well, carrying placards demanding special status for Andhra Pradesh while the AIADMK demanded the setting up of a Cauvery water management board. The House had to be adjourned for the day as the protests continued.\nIntroduction of Bills\nIn the Lok Sabha, Speaker Sumitra Mahajan first adjourned the House immediately after the Question Hour started, as the TRS, TDP, AIADMK and YSR Congress members stormed the well.\nThere was no let-up in protests as the House met again at noon but the Speaker went ahead with the proceedings, including the introduction of two Bills by Minister of State for Finance Shiv Pratap Shukla, amid the din.\nBhartruhari Mahtab of the BJD opposed the introduction of the Fugitive Economic Offenders Bill, saying its provisions violated citizens’ fundamental rights and that it is based on the premise of “guilty till proven innocent” and not the other way round. He questioned the provision of seizing assets of an accused before he was proven guilty.\nHowever, Shukla said these provisions can be debated during the discussion on the Bill, and introduced it. Soon after this, the House was adjourned.\nDiverse issues\nThe Lok Sabha has been witnessing similar scenes since March 5, with opposition parties besides the TDP, which remains a member of the ruling NDA though it has pulled out of the Central government, raising a host of issues such as special status for Andhra Pradesh, enhanced reservation in Telangana and constitution of the Cauvery river board to settle Tamil Nadu’s water dispute with neighbours.", "url": "https://www.thehindubusinessline.com/news/rows-protests-mar-business-in-both-houses/article23163157.ece", "label": 1}