{"authors": [], "date_download": "2019-03-27 14:25:44", "date_modify": "2019-03-27 14:25:44", "date_publish": "2018-11-15 14:59:49", "description": "India News – The meeting comes two days after the Supreme Court decided to review its decision allowing women of all ages to enter the hilltop shrine.", "filename": "news_india-kerala-chief-minister-pinarayi-vijayan-all-party-meeting-latest-updates-sabarimala-temple-opening-opposition-protest-sc-verdict-482941_1553696744.html", "image_url": "https://resize.indiatvnews.com/en/resize/newbucket/715_-/2018/11/sabarimala-1542274139.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/indiatvnews.com/news_india-kerala-chief-minister-pinarayi-vijayan-all-party-meeting-latest-updates-sabarimala-temple-opening-opposition-protest-sc-verdict-482941_1553696744.html", "title": "Sabarimala issue: Congress, BJP boycott all-party meeting ahead of temple opening; will abide by SC decision, says CM Vijayan", "title_page": "Kerala CM Pinarayi Vijayan convenes all-party meeting ahead of Sabarimala temple opening tomorrow, says will abide by SC verdict | India News – India TV", "title_rss": "NULL", "source_domain": "indiatvnews.com", "text": "The meeting comes two days after the Supreme Court decided to review its decision allowing women of all ages to enter the hilltop shrine.\nKerala Chief Minister Pinarayi Vijayan on Thursday held an all-party meeting in Thiruvananthapuram on Thursday to discuss the protests against the entry of women of all ages into the Sabarimala temple. The temple will open for Mandala pooja Mahotsavam on Friday and close on December 27.\nMeanwhile, the Opposition parties including the Congress and BJP have boycotted the meet.\nThe meeting comes two days after the Supreme Court decided to review its decision allowing women of all ages to enter the hilltop shrine. The apex court, however, had iterated that it was not putting a stay on the decision and that women will be allowed to enter the temple when it opens on Friday. The Congress and the BJP — the Opposition parties in the state — had welcomed the SC’s decision to hear review petitions. A total of 48 review petitions will be taken up on January 22.\nSpeaking to reporters after the meeting, CM Vijayan said ; \"Supreme Court clearly says that the September 28 verdict stands. It means that the entry of women should be allowed. Government cannot take any stand against this verdict. We respect the feelings of the devotees. We are bound to implement court verdict.\"\nThe temple complex and nearby areas had witnessed violent protests by Ayyappa devotees against the entry of young women when it was opened for last month's poojas from October 17-22.\nAt least 12 women had made a vain attempt to trek the hills soon after the Supreme Court verdict permitting women in the 10-50 age group to offer prayers at the shrine.\nOver 3,345 protesters who prevented women from entering the shrine have been arrested since October 26 while 517 cases have been registered at various police stations across Kerala.\nMeanwhile, a total of 550 women from the hitherto banned age group of 10 to 50 years have registered online for prayers at the Sabarimala temple during the upcoming festival season beginning on November 16.\nEarlier on September 28, in a 4:1 verdict the five member constitution bench, headed by the then Chief Juctice of India, Dipak Misra lifted the decade-old ban, paving the way for entry of women of all ages into the Sabarimala temple.\nSince the September 28 verdict, large-scale protests and counter protests have brought Kerala to a standstill.", "url": "https://www.indiatvnews.com/news/india-kerala-chief-minister-pinarayi-vijayan-all-party-meeting-latest-updates-sabarimala-temple-opening-opposition-protest-sc-verdict-482941", "label": 1}