{"authors": ["The Forest Fire That Erupted In Bandipur Tiger Reserve Last Month Devastated Hundreds Of Acres Of Pristine Forest. R. Krishna Kumar", "E.M. Manoj Report On The Mammoth Effort That Went Into Containing The Fire", "The Need To Upgrade Fire-Fighting Capabilities", "Vijayapura Admn. Making Transportation", "Other Arrangements At Polling Booths"], "date_download": "2019-03-27 14:35:31", "date_modify": "2019-03-27 14:35:31", "date_publish": "2016-11-05 00:00:00", "description": "MES leadershad observed November 1as ‘black day’", "filename": "news_national_karnataka_Activists-protest-against-MES-rally_article16437197_1553697331.html", "image_url": "https://www.thehindu.com/static/theme/default/base/img/og-image.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/thehindu.com/news_national_karnataka_Activists-protest-against-MES-rally_article16437197_1553697331.html", "title": "Activists protest against MES rally", "title_page": "\nActivists protest against MES rally - The Hindu\n", "title_rss": "NULL", "source_domain": "thehindu.com", "text": "Activists of Karnataka Rakshana Vedike staged a protest in the city on Friday demanding stern action against Maharashtra Ekikaran Samithi (MES) for taking out a rally to observe ‘black day’ on Rajyotsava in Belagavi.\nAddressing the protest meet, M.R. Venkatesh, district unit president of Vedike said the MES leaders insulted Kannadigas by observing ‘black day’. MES activists were also indulging in stone pelting and burning of flags and buntings in Belagavi and surrounding areas on November 1. The State government should conduct a thorough probe into the incident and arrest the miscreants who tried to disturb peace immediately, Mr. Venkatesh said.\nAs the leaders of MES are repeatedly involved in efforts to breach peace, the State government should impose a ban on the organisation. In the wake of the participation of most of the members of Belagavi City Corporation, including the Mayor, in the rally organised to observe ‘black day’, the State government should supersede the Corporation, he added.\nThe protesters also submitted a memorandum to the office of Deputy Commissioner in this regard. Functionaries of the Vedike R. Manju, Dhananjay and T. Shailesh took part in the protest.", "url": "https://www.thehindu.com/news/national/karnataka/Activists-protest-against-MES-rally/article16437197.ece", "label": 1}