{"authors": ["Tribune News Service"], "date_download": "2019-03-27 14:40:50", "date_modify": "2019-03-27 14:40:50", "date_publish": "2018-03-20 00:00:00", "description": "TheTribune: MUMBAI: Ignoring last minute calls from leaders in the ruling BJP, social activist Anna Hazare is all set to begin his indefinite fast to bring about a competent Lokpal and ensure fair prices for farmers.", "filename": "news_nation_anna-hazare-all-set-for-fast-unto-death-in-delhi_561915_1553697650.html", "image_url": "https://images.tribuneindia.com/cms/gall_content/2018/3/2018_3$largeimg22_Thursday_2018_174321240.jpg", "language": null, "localpath": "/home/raj/news-please-repo//data/2019/03/27/tribuneindia.com/news_nation_anna-hazare-all-set-for-fast-unto-death-in-delhi_561915_1553697650.html", "title": "Anna Hazare all set for fast-unto-death in Delhi", "title_page": "\r\n\tAnna Hazare all set for fast-unto-death in Delhi\r\n", "title_rss": "NULL", "source_domain": "tribuneindia.com", "text": "Shiv Kumar\nTribune News Service\nMumbai, March 22\nIgnoring last minute calls from leaders in the ruling BJP, social activist Anna Hazare is all set to begin his indefinite fast to bring about a competent Lokpal and ensure fair prices for farmers.\nAccording to Hazare’s associates at Ralegan Siddhi in Maharashtra’s Ahmednagar district, the Gandhian has turned down last-minute overtures from ministers in Chief Minister Devendra Fadnavis’s government in Maharashtra to call off his hunger strike. Earlier this week, Maharashtra’s Irrigation Minister Girish Mahajan had a meeting with Hazare and sought to persuade him to give up his fast.\nHowever Hazare, who has put together a team of around 6,000 people cross the country for the purpose, indicated that he would go continue his fast till Prime Minister Narendra Modi’s government came up with a concrete proposal to empower the Lokpal.\n“Hazare will leave for Rajghat from Maharashtra Sadan on Friday morning. After paying respects to the Father of the Nation, Hazare will visit Shahidi Park where he will pay tributes to martyrs. He will then leave for Ramlila Maidan in the capital where he will start his campaign,” an associate of the activist said from Ralegan Siddhi.\nEarlier, Hazare had indicated that the beginning of his satyagraha would coincide with Shaheed Diwas or Martyr’s Day, which falls on Friday.\nHazare’s supporters told reporters in Ahmednagar that the 6,000-plus people who have vowed to participate in his new agitation have given undertakings that they would not join politics.\nThe core team of 20 members have been drawn from Maharashtra, Delhi, Punjab, Rajasthan, Orissa and other places. Apart from professionals Hazare’s team also comprise of ex-servicemen as well, according to his office.", "url": "https://www.tribuneindia.com/news/nation/anna-hazare-all-set-for-fast-unto-death-in-delhi/561915.html", "label": 1}