{"authors": [], "date_download": "2019-03-27 14:29:27", "date_modify": "2019-03-27 14:29:27", "date_publish": "2017-04-02 18:46:00", "description": "The Delhi High Court had on March 31 dismissed Singh and his wife's plea seeking quashing of the disproportionate assets case filed by the CBI.", "filename": "news_politics-and-nation_ma_10a9b0c7dd4ca58345fc4f039270747e_57975854_1553696967.html", "image_url": "https://img.etimg.com/thumb/msid-57975873,width-1070,height-580,imgsize-48099,overlay-economictimes/photo.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/economictimes.indiatimes.com/news_politics-and-nation_ma_10a9b0c7dd4ca58345fc4f039270747e_57975854_1553696967.html", "title": "Maharashtra BJP to launch protest against Himachal Pradesh CM Virbhadra Singh", "title_page": "Maharashtra BJP to launch protest against Himachal Pradesh CM Virbhadra Singh - The Economic Times", "title_rss": "NULL", "source_domain": "economictimes.indiatimes.com", "text": "MUMBAI: The Maharashtra BJP will launch protest against Himachal Pradesh chief minister Virbhadra Singh after the Delhi High Court observed that an FIR filed against him was appropriate.\"Singh in his Income Tax returns filed during the years 2008-09 to 2010-11 has shown profit of Rs six crore from apple farming. But before and after that period, Singh has shown zero profit. It clearly indicates some discrepancies,\" BJP spokesperson Madhu Chavan told reporters here today.\"In a day or two we will finalise our course of protests after discussions with central party leadership,\" said Chavan.Had a BJP leader's name cropped up in any such irregularities, Congress would have launched nation-wide protests.\"Today, not a single party (Congress) leader is distancing Singh. It clearly means that the party is silently supporting him,\" Chavan alleged.The Delhi High Court had on March 31 dismissed Singh and his wife's plea seeking quashing of the disproportionate assets case filed by the CBI.The High Court also vacated the Himachal Pradesh High Court's interim order of October 1, 2015 restraining CBI from arresting, interrogating or filing a charge sheet in the case without the court's permission.Singh has sought directions from the court to quash the FIR registered against him and his wife under the Prevention of Corruption Act and IPC by the CBI on September 23, 2015.", "url": "https://economictimes.indiatimes.com/news/politics-and-nation/maharashtra-bjp-to-launch-protest-against-himachal-pradesh-cm-virbhadra-singh/articleshow/57975854.cms", "label": 1}