{"authors": [], "date_download": "2019-03-27 14:40:30", "date_modify": "2019-03-27 14:40:30", "date_publish": "2017-10-05 00:00:00", "description": "However, due to fringe threat multiplex owners have refused to screen the film in various cities, with Patna being the latest one. RSS Chief Mohan Bhagwat has asked Sanjay Leela Bhansali to refrain from showing the film. Karni Sena has refused to back down and continued its violent protest in various parts of Gujarat, Madhya Pradesh Uttar Pradesh, Haryana and even Delhi.", "filename": "news_movies_padmaavat-live-makers-hope-indians-across-all-states-get-to-watch-the-film-1641211_1553697630.html", "image_url": "https://images.news18.com/ibnlive/uploads/2017/10/57.jpg", "language": null, "localpath": "/home/raj/news-please-repo//data/2019/03/27/news18.com/news_movies_padmaavat-live-makers-hope-indians-across-all-states-get-to-watch-the-film-1641211_1553697630.html", "title": "Padmaavat LIVE: Makers Hope Indians Across All States Get To Watch The Film", "title_page": "Padmaavat LIVE: Makers Hope Indians Across All States Get To Watch The Film - News18", "title_rss": "NULL", "source_domain": "news18.com", "text": "Despite Supreme Court's nod to the release of Sanjay Leela Bhansali's magnum opus Padmaavat, the fringe outfits refuse to back down and several acts of vandalism and arson have been committed in various parts of Haryana, Uttar Pradesh, Rajasthan, Delhi, Gujarat and Madhya Pradesh. The state governments and cinema owners are also fearful of more violent acts in the future and hence, are calling off the scheduled screenings of the film. Meanwhile, SC is expected to hear a contempt plea against Karni Sena on Monday and Delhi HC has refused to hear a plea against the film and an FIR registered into Wednesday’s attack on a school bus in Gurugram names the Karni Sena. Eighteen men, who attacked a school bus full of children in Gurugram, have now been sent to a 14-day judicial custody. Haryana DGP BS Sandhu also said that no attackers will be spared and theatres will be given adequate protection. Karni Sena leader Suraj Pal Amu, who had threatened Deepika Padukone, got arrested in Gurugram. Despite threats, several state governments are trying their best to offer a smooth release to the film and the initial reviews are out with Ranveer Singh's act as Alauddin Khilji being the most impressive.\nCatch the live updates to find out more:\nJan 25, 2018 6:33 pm (IST)\nWhile the film fails to release across states in India, Pakistan censor board has cleared the controversial Indian film Padmaavat without any cuts for screening in the Muslim majority country. Islamabad-based Central Board of Film Censors (CBFC) chairman Mobashir Hasan took to the social media to announce that the film has been passed by the board. \"Central Board of Film Censors (CBFC) has declared a feature film containing Indian cast and crew, Padmaavat, without any excision suitable for public exhibition in the cinemas with a 'U' certification,\" he wrote on Twitter. With the clearance, Bhansali's period drama is all set to be released in Pakistan, removing fears that the film could face cuts due to the negative portrayal of Alauddin Khilji, a Muslim ruler of the Delhi Sultanate \"CBFC isn't biased in arts, creativity and healthy entertainment,\" Hasan added.\nJan 25, 2018 6:25 pm (IST)\nMeanwhile, Deepika's fans managed to create a #DP1stDay1stShow club on social media where they posted pictures with tickets despite all th hullaballo around the film. Touched by the reactions, Deepika tweeted: \"I cannot believe what I'm seeing!!! What a show of pure genuine love and commitment! I'm not only touched and overjoyed, but extremely humbled seeing this absolutely unique initiative. #DP1stDay1stShow.\" I cannot believe what I’m seeing!!! @dp1stday1stshow what a show of pure genuine love & commitment!im not only touched & over joyed but extremely humbled seeing this absolutely unique initiative!lots & lots of love to each & every one of you!!!🙏 #DP1stDay1stShow pic.twitter.com/HcP6NKl7Lm — Deepika Padukone (@deepikapadukone) January 25, 2018\nJan 25, 2018 6:23 pm (IST)\nThe makers of Padmaavat on Thursday thanked viewers for the unconditional support they've received for the film. \"We are humbled with the response we have received for 'Padmaavat'. Over 1 million Indians have already watched the film and occupancy levels for shows are very strong across more than 4,000 screens - with most running houseful. The feedback for the film has been overwhelming. We are grateful to the government, state authorities, police and our fans for making the opening a stellar success. We are hopeful that every Indian - across all states- will get a chance to see the film especially as we celebrate our great nation's 69th Republic Day,\" a Viacom18 Motion Pictures spokesperson said in a statement.\nJan 25, 2018 6:14 pm (IST) Meanwhile, Chittorgarh turned into a fortress with heavy police presence at every nook and corner of the town on Thursday. Nagaur, Banswara, Udaipur, Jodhpur, Sikar, Jaisalmer, Sawai Madhopur, Pratapgarh and Khetdi also witnessed the impact of the shutdown. The plying of buses in Udaipur and Banswara was temporarily stopped to avert any untoward incident. According to sources, tourists were also stopped from visiting Chittorgarh fort and Jaisalmer.\nJan 25, 2018 6:11 pm (IST) Acclaimed tabla maestro Zakir Hussain on Thursday underplayed the ongoing Padmaavat controversy, dubbing it is as media hype, over-emphasized for \"TRPs and to sell the newspapers\". Hussain, who had participated in a session titled 'A Life In Music' at Jaipur Literature Festival, said that the controversy will go down once the film goes out of the theaters but crying issues of environment, health and hygiene are not receiving the emphasis from the media that they should.\nJan 25, 2018 6:06 pm (IST) Padmaavat was not screened in Rajasthan today due to a 'bandh' called by the Rajput Karni Sena, whose activists held rallies and protests in several cities and towns against the film. The movie wasn't screened in around 179 screens. The Karni Sena took out a bike rally in Jaipur where its members were seen flouting traffic norms, leading to a traffic jam, as police stood mute on the sidewalks. #BREAKING -- #PadmaavatRow: Rajput Karni Sena protests in Jaipur, takes out bike rally and blocks traffic | @Zebaism with more details #Padmaavat #IWillSeePadmaavat pic.twitter.com/L8TBoa5vgE — News18 (@CNNnews18) January 25, 2018\nJan 25, 2018 5:43 pm (IST) As Padmaavat, gets released across the country, theatre owners in Madhya Pradesh announced their decision not to screen the movie showing respect to the public sentiments. However, fearing a violent backlash from Karni Sena and affiliate groups, markets in several towns including Dewas, Ratlam, Jhabua, Mandsaur, Shajapur, Vidisha and others remained closed. Madhya Pradesh Chief Secretary Basant Pratap Singh also clarified that there was no ban on movie and theatre owners, if they wanted to screen it, were free to do so and administration was committed to offering them security cover. “We won’t allow law and order to deteriorate,” he affirmed. “There is no law and order issue as the movie is not screened,” he said.\nJan 25, 2018 5:25 pm (IST) For the uninitiated, Amu had reportedly made remarks about doubling the offer that was made by a youth from Meerut announcing a Rs. 5 crore bounty for beheading Deepika Padukone and Sanjay Leela Bhansali. \"We will reward the ones beheading them with Rs 10 crore and also take care of their family needs...We know very well how to treat those who insult the Rajput community,\" Amu had reportedly said. The Haryana BJP had immediately distanced itself from Amu's remarks, saying he had made them in his personal capacity.\nJan 25, 2018 5:14 pm (IST) Karni Sena leader and ex-BJP member Suraj Pal Amu, who had announced a Rs. 10 crore bounty for beheading Sanjay Leela Bhansali and Deepika Padukone, got arrested in Gurugram on Thursday.\nJan 25, 2018 5:02 pm (IST) An RSS official has alleged that Sanjay Leela Bhansali's film Padmaavat is an attempt to \"hurt\" public sentiments by presenting heroic characters and their lives on the basis of unconfirmed and controversial information. RSS north-west regional sanghchalak Bhagwati Prakash said that films should spread the message of social harmony and brotherhood.\nJan 25, 2018 4:55 pm (IST) Meanwhile, Bollywood actors Alia Bhatt and Ranbir Kapoor, who have joined hands for Ayan Mukherji's Dragon, were snapped at a special screening of the film.\nJan 25, 2018 4:46 pm (IST) Many theatres and multiplexes in Uttar Pradesh, including the state capital, on Thursday, refused to screen controversial film Padmaavat, citing \"lack of security\". The 10.15 a.m. show at the Wave multiplex in Gomti Nagar here was cancelled as owners of the mall feared for the safety of the property and cinegoers, states a report in IANS.\nJan 25, 2018 4:36 pm (IST) The single screen and multiplex cinema owners in Lucknow have decided not to bow down to the pressure and protest by the Karni Sena and release Sanjay Leela Bhansali’s movie Padmaavat. Initially, the multiplex chain owners were undecided but as the day progressed, they also decided to release the movie and also started its online booking.\nJan 25, 2018 3:58 pm (IST) According to a statement from Viacom18, one of the co-producers of the film, Sanjay Leela Bhansali's magnum opus has managed to mint over 5 crores in India with just paid previews so far despite challenges and threats from fringe outfits.\nJan 25, 2018 3:46 pm (IST) Haryana DGP BS Sandhu has now said that the Haryana police is prepared and all halls will be given adequate protection. Meanwhile, 8 people have been taken into preventive custody, while 18 were held for the attack on Gurugram school bus. \"The police is out in full force and have been posted both inside and outside the theatres,\" he said adding that no attackers will be spared. The show is on in 9 cities and 33 screens.\nJan 25, 2018 3:39 pm (IST) The eighteen men have been sent to 14-day judicial custody by the Sohna court. While being taken to court, their faces were covered.\nJan 25, 2018 3:30 pm (IST)\nEighteen men, suspected to be from the Karni Sena, who attacked a school bus full of children in Gurugram on Wednesday have been brought to the Sohna court and will be produced before a judge shortly.\nJan 25, 2018 3:01 pm (IST) The IP Mughal multiplex in Chandauli was allegedly attacked by a petrol bomb in the wee hours of the day. The petrol bomb caused an explosion in the transformer and was set off in protest against the screening of Sanjay Leela Bhansali's Padmaavat. The security personnel present extinguished the fire and also reported more petrol bombs in the vicinity.\nJan 25, 2018 2:41 pm (IST) The Congress attacked the Centre and the BJP governments in Rajasthan, Haryana, Gujarat and Madhya Pradesh for the violent protests against Padmaavat. “Why is the Centre not doing anything to stop this violence. The BJP must answer to the people. The governments must be ashamed for their inaction,” said Congress spokesperson Priyanka Chaturvedi.\nJan 25, 2018 2:31 pm (IST)\nWhile the nation continues to comprehend the curious case of Padmaavat and Karni Sena, the ever-vocal Rishi Kapoor decided to voice his \"funny\" opinion on Twitter.\nWhile the nation continues to comprehend the curious case of Padmaavat and Karni Sena, the ever-vocal Rishi Kapoor decided to voice his \"funny\" opinion on Twitter. Ranveer Singh has announced that if Karni Sena tries to stop the release of Padmavat , he will do Johar 😜 pic.twitter.com/xWlDldYr7a — Rishi Kapoor (@chintskap) January 25, 2018\nJan 25, 2018 2:18 pm (IST)\nJan 25, 2018 2:03 pm (IST)\nOn another note, a Facebook page named 'Jaato Ka Adda' is currently live streaming Sanjay Leela Bhansali's Padmaavat. The group, which has been raising objections against their community members' way of protesting, decided to feature the magnum opus live as a mark of protest against their own community. The first half garnered over 3 lakh views in a short span of time.\nJan 25, 2018 1:54 pm (IST) Congress chief Sonia Gandhi's son-in-law Robert Vadra on Thursday lashed out on Karni Sena for the \"inhuman attack\" on \"helpless children\". He further added,\"This is the land where Mahatma Gandhi got us freedom, through non-violence. Protests can be peaceful too; it is surely not required to put the point across, through violent protests. There is no justification for this heinous act. I strongly condemn the attack on the bus..\" It’s really inhuman to attack a school bus,with helpless children. I have seen a video where school kids were so petrified & were hiding under the seats.What future are we offering to these kids?Can we look into their eyes & teach them to feel, “Mera Bharat Mahaan”? 1/2 pic.twitter.com/oQpshOYUoU — Robert Vadra (@irobertvadra) January 25, 2018", "url": "https://www.news18.com/news/movies/padmaavat-live-makers-hope-indians-across-all-states-get-to-watch-the-film-1641211.html", "label": 1}