{"authors": [], "date_download": "2019-03-27 14:35:41", "date_modify": "2019-03-27 14:35:41", "date_publish": "2019-03-27 00:00:00", "description": null, "filename": "news_newsDisplay.aspx_newsID=335114_1553697341.html", "image_url": "http://daijiworld.com/images/daijiSquareLogo.png", "language": null, "localpath": "/home/raj/news-please-repo//data/2019/03/27/daijiworld.com/news_newsDisplay.aspx_newsID=335114_1553697341.html", "title": "AAP demands ouster of MP governor,CM over Vyapam", "title_page": "\r\n\tAAP demands ouster of MP governor,CM over Vyapam - Daijiworld.com\r\n", "title_rss": "NULL", "source_domain": "daijiworld.com", "text": "Bhopal, July 11 (IANS): After CBI took over Vyapam scam case, the AAP staged a protest against the scam and demanded resignations of Madhya Pradesh Chief Minister Shivraj Singh Chouhan and Governor Ram Naresh Yadav.\nSocial activist and senior Aam Aadmi Party (AAP) leader Sanjay Singh and Delhi unit Secretary Dilip Pandey along with other party workers organised the rally.\n\"Both the chief minister and the governor's involvement in the case is well known, hence they should resign immediately,\" said Sanjay Singh to the mediapersons.\nAccording to AAP leaders, people who destroy the future of young generation have no right to remain in the power. While CBI is investigating the scam, the chief minister must resign for a fair probe.\nMany activists participated in the rally organised by the AAP and the heavy rain in Delhi failed to dampen the spirit of party leaders. The rally began from Subhash nagar office where people shouted slogans and held placards against Shivraj Singh Chauhan and Prime Minister Narendra Modi.\nThe Vyapam scam is an admission and recruitment scam involving politicians, senior officials and businessmen in Madhya Pradesh. Madhya Pradesh Professional Examination Board (MPPEB) and is laso popularly known by its Hindi acronym Vyapam. The Supreme Court issued an order to transfer the case to Central Bureau of Investigation (CBI)", "url": "http://www.daijiworld.com/news/newsDisplay.aspx?newsID=335114", "label": 1}