{"authors": [], "date_download": "2019-03-27 14:35:01", "date_modify": "2019-03-27 14:35:01", "date_publish": "2017-07-20 17:10:06", "description": "Around 80 farmers shouted slogans against the state lawmakers calling the salary move \"shameless\" and describing their own condition as \"worse than beggars\".", "filename": "news_india_tamil-nadu-farmers-protesting-at-jantar-mantar-beat-themselves-to-protest-100-salary-hike-for-mlas-326238_1553697301.html", "image_url": "https://media.indiatimes.in/media/facebook/2017/Jul/fb_1500549054_800x420.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/indiatimes.com/news_india_tamil-nadu-farmers-protesting-at-jantar-mantar-beat-themselves-to-protest-100-salary-hike-for-mlas-326238_1553697301.html", "title": "Tamil Nadu Farmers Protesting At Jantar Mantar Beat Themselves To Protest 100% Salary Hike For MLAs", "title_page": "Tamil Nadu Farmers Protesting At Jantar Mantar Beat Themselves To Protest 100% Salary Hike For MLAs - Indiatimes.com", "title_rss": "NULL", "source_domain": "indiatimes.com", "text": "Tamil Nadu farmers reeling under a financial crisis, are protesting at Delhi’s Jantar Mantar to demand loan waiver and drought-relief package. The farmers today beat themselves with flip-flops to protest the almost two-fold salary hikes state legislators have given themselves.\nBCCL\nAround 80 farmers shouted slogans against the state lawmakers calling the salary move \"shameless\" and describing their own condition as \"worse than beggars\".\n\"Farmers do not have food to eat or money to survive due to prolonged drought in our state. Instead of taking steps to provide them relief, our MLAs chose to increase their own salaries. We have been left speechless by their shameless action. We condemn it in very strong words,\" farmer leader P Ayyakannu told IANS.\nDon't Miss 3.1 K SHARES 289 SHARES 411 SHARES\nbccl\nOn Wednesday, Tamil Nadu legislators approved a hike in their salaries from Rs 55,000 to Rs 1.05 lakh per month, apart from an increase in MLA Development Fund from Rs 2 crore to Rs 2.5 crore.\nNearly 100 farmers from the agrarian crisis-hit state, who had suspended their 41-day long protest following government assurance in April, turned up again at the Jantar Mantar on Sunday to press for their demands.\nWith Inputs From IANS", "url": "https://www.indiatimes.com/news/india/tamil-nadu-farmers-protesting-at-jantar-mantar-beat-themselves-to-protest-100-salary-hike-for-mlas-326238.html", "label": 1}