{"authors": [], "date_download": "2019-03-27 14:18:31", "date_modify": "2019-03-27 14:18:31", "date_publish": "2015-10-27 14:32:00", "description": "Reacting to the episode, the Kerala chief minister said some people were unnecessarily creating a row over the beef ban.", "filename": "news_politics-and-nation_ke_a4a7618ce6bf5b42ce18ab4c809f8d73_49551229_1553696311.html", "image_url": "https://img.etimg.com/thumb/msid-49551247,width-1070,height-580,imgsize-91506,overlay-economictimes/photo.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/economictimes.indiatimes.com/news_politics-and-nation_ke_a4a7618ce6bf5b42ce18ab4c809f8d73_49551229_1553696311.html", "title": "Kerala CM Oommen Chandy, political leaders slam Kerala House beef row", "title_page": "Kerala CM Oommen Chandy, political leaders slam Kerala House beef row - The Economic Times", "title_rss": "NULL", "source_domain": "economictimes.indiatimes.com", "text": "KOZHIKODE | THIRUVANANTHAPURAM: Kerala Chief Minister Oommen Chandy today accused Delhi Police of carrying out \"searches\" at New Delhi's Kerala House over an allegation of beef being served there and termed the matter \"unfortunate\".A call by a person claiming to belong to a fringe right- wing group in the afternoon yesterday complaining that beef was being served at Kerala House's canteen had seen Delhi Police personnel rush to the state-run guest house in the national capital.Reacting to the episode, the Kerala chief minister said some people were unnecessarily creating a row over the beef ban and that his government would take up the issue of Delhi Police's action with the Centre after collecting details in this regard. A senior official had said yesterday in Delhi that a team was sent to Kerala House following the call.\"Kerala House is not a private hotel or an institution run for making profit. It is an official guest house of the state government. The police action was really unfortunate. They should have shown some restraint before carrying out searches,\" Chandy told a press meet at Kozhikode.State Home Minister Ramesh Chennithala echoed Chandy, saying the incident amounted to an infringement of the powers of the state. Kerala government would soon send a letter to the Lieutenant Governor of Delhi expressing the state's strong protest over the issue, he added.New Delhi DCP Jatin Narwal had said yesterday in reference to the incident that police \"dealt with the matter with necessary alertness and took their position. The objective was to ensure that law and order was not disrupted\".Meanwhile, strong reactions to the epiode poured in from opposition parties as well in Kerala with former Defence Minister and senior Congress leader AK Antony saying, \"It is the individual's freedom to decide what to eat and wear, and that freedom should not be infringed upon.\"CPI(M), too, condemned the police action with party Politburo member Pinarayi Vijayan alleging that the searches at the state-run guest house was part of a Sangh Parivar agenda.\"The same forces who killed Mohd Iqlakh in Dadri are behind the raid at Kerala House also. The raid at state-run guest house is a warning that they will barge into any kitchen in the country,\" he said in a Facebook post.\"There is neither any ban on beef in Delhi nor any restriction to cook or sell it at Kerala House. The Delhi Police's illegal action, according to communal forces, is part of the Sangh Parivar agenda,\" he added.", "url": "https://economictimes.indiatimes.com/news/politics-and-nation/kerala-cm-oomen-chandy-political-leaders-slam-kerala-house-beef-row/articleshow/49551229.cms", "label": 1}