{"authors": [], "date_download": "2019-03-27 14:18:31", "date_modify": "2019-03-27 14:18:31", "date_publish": "2015-03-13 10:32:41", "description": "Leaders of the opposition parties staged a protest against Kerala Finance Minister K.M. Mani outside the state assembly on Friday. - 'Violent' protest outside Kerala Assembly, several injured", "filename": "news_india__1553696311.html", "image_url": "https://www.india.com/wp-content/uploads/2015/03/ldf2.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/india.com/news_india__1553696311.html", "title": "'Violent' protest outside Kerala Assembly, several injured", "title_page": "'Violent' protest outside Kerala Assembly, several injured | India News, India.com", "title_rss": "NULL", "source_domain": "india.com", "text": "Thiruvananthapuram, Mar 13: Leaders of the opposition parties staged a protest against Kerala Finance Minister K.M. Mani outside the state assembly on Friday. Members of the LDF and the BJP’s youth wing gathered around the assembly complex in large numbers to prevent Mani, who is facing a vigilance probe in the bar scam case, from presenting the state budget.\nSeveral people were injured as the police used water cannons and tear gas to bring the situation under control. The police, which is taking no chances and has deployed a 2,500-strong force, also baton charged some of the protestors as the protests turned violent.\nThe chaos began early this morning as the opposition MLAs moved to stop Mani from entering the assembly. There was uproar in the Kerala Assembly as Mani read out the budget surrounded by his party men and security personnel. Several MLAs were also injured in the clash inside the assembly as the Speaker’s chair and mics were thrown by the legislators.\nThe CPI-M led Left Democratic Front (LDF) has been demanding Mani’s resignation since the Budget Session began.", "url": "https://www.india.com/news/india/violent-protest-outside-kerala-assembly-several-injured-314723/", "label": 1}