{"authors": [], "date_download": "2019-03-27 14:18:29", "date_modify": "2019-03-27 14:18:29", "date_publish": "2018-07-08 18:48:01", "description": "The Left parties will hold a 'dharna' outside Parliament in Delhi on July 24 to protest against the \"murder of democracy in West Bengal and Tripura\", CPI-M General Secretary Sitaram Yechury said here on Sunday.\"Democracy and the ...", "filename": "news_articles_a843537_1553696309.html", "image_url": "https://www.prokerala.com/news/photos/imgs/1024/cpm-general-secretary-sitaram-yechuri-addresses-a-708810.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/prokerala.com/news_articles_a843537_1553696309.html", "title": "Left to protest at Parliament against Tripura lawlessness: Yechury", "title_page": "Left to protest at Parliament against Tripura lawlessness: Yechury", "title_rss": "NULL", "source_domain": "prokerala.com", "text": "Agartala, July 8 : The Left parties will hold a 'dharna' outside Parliament in Delhi on July 24 to protest against the \"murder of democracy in West Bengal and Tripura\", CPI-M General Secretary Sitaram Yechury said here on Sunday.\n\"Democracy and the people's rights have been totally destroyed in West Bengal and Tripura. Total lawlessness prevails in these states. To draw national attention to the issue, all Left parties will hold a sit-in outside Parliament on July 24,\" Yechury told the media.\nHe said: \"After the BJP (Bharatiya Janata Party) led alliance government came to power in Tripura in March, four CPI-M members and leaders have been murdered.\"\nBesides, hundreds of Left party offices were bulldozed, thousands of houses belonging to Left supporters and leaders were attacked or burnt down, and hundreds of leftists attacked by ruling party cadres.\n\"On the pretext of child-abductions, four people were lynched. The BJP government's own Minister is involved in spreading rumours that caused much hysteria across Tripura. State's law and order under BJP has gone down. The state of affairs in Tripura and West Bengal is worse than the 1975 Emergency,\" he said after attending a meeting of the Tripura state committee of the Communist Party of India-Marxist (CPI-M).\nYechury also said hatred and violence allegedly patronised by the RSS (Rashtriya Swayamsevak Sangh) and the BJP continued unabated across the country.\nTerming the government's recent announcement of Minimum Support Price for certain crops as \"fraudulent actions\", the CPI-M leader said the government should follow the Swaminathan Commission's recommendations on MSP.\nHe said that to oppose the BJP government's anti-people policies, workers and farmers will organise \"jail bharo\" (fill prisons) and protest rallies on August 9 and September 5 across the country.\n\"The BJP is trying to get political mileage and electoral victory through communal polarisation in the country.\n\"They are trying to keep the situation in Jammu and Kashmir volatile for political gain. It was expected that during the Governor's Rule, the situation will improve but it has remained as earlier. Three people, including a young girl, were killed just two days back,\" the CPI-M leader said.\nTo a question, the former parliamentarian said his party has decided on the \"appropriate electoral tactics\" in the light of the political situation and elections in different states.\n\"Our main slogan is to 'save the country, defeat BJP'. But in West Bengal it will be 'save Bengal, defeat Trinamool Congress' and in Tamil Nadu it will be to 'save Tamil Nadu, defeat AIADMK',\" Yechury said.", "url": "https://www.prokerala.com/news/articles/a843537.html", "label": 1}