{"authors": [], "date_download": "2019-03-27 14:35:09", "date_modify": "2019-03-27 14:35:09", "date_publish": "2018-05-24 16:36:54", "description": "Internet remains suspended in Tuticorin and adjoining districts of Tirunelveli and Kanyakumari after state government ordered to suspend services for five days to prevent spread of rumours through social media.", "filename": "news_india_tuticorin-live-congress-asks-if-pm-modis-fitness-challenge-extends-to-tamil-nadu-cms-governance-1758207_1553697309.html", "image_url": "https://images.news18.com/ibnlive/uploads/2018/05/abhishek_manu_pc02.jpg", "language": null, "localpath": "/home/raj/news-please-repo//data/2019/03/27/news18.com/news_india_tuticorin-live-congress-asks-if-pm-modis-fitness-challenge-extends-to-tamil-nadu-cms-governance-1758207_1553697309.html", "title": "Tuticorin LIVE: Congress Asks if PM Modi’s Fitness Challenge Extends to Tamil Nadu CM’s Governance", "title_page": "Tuticorin LIVE: Congress Asks if PM Modi’s Fitness Challenge Extends to Tamil Nadu CM’s Governance - News18", "title_rss": "NULL", "source_domain": "news18.com", "text": "Stay tuned for live updates\nRead More Sterlite protest LIVE updates | Senior Congress leader Abhishek Manu Singhvi slammed the EK Palaniswami-led Tamil Nadu government for the deaths of 13 people in police firing and asked who had ordered the police to open fire. He also questioned why no one has been suspended so far and the government response has been restricted to only transfers. He also questioned the silence of Prime Minister Narendra Modi and asked why has he not spoken on the violence here when he has time to respond to fitness challenges on Twitter. Earlier, home minister Rajnath Singh appealed to the people of Tuticorin in Tamil Nadu to remain calm and maintain peace in the wake of the violence that has claimed 13 lives. The Home Ministry has sought a report from the Tamil Nadu government on the police firing and the prevailing situation in the port city, the minister said. After DMK working president MK Stalin staged a protest outside Tamil Nadu chief minister's office, CM E Palaniswami rubbished Stalin's claim and said that \"DMK not getting an appointment is a false thing\". He alleged that the opposition parties are instigating people to protest. Stalin was lifted by police officers and evicted from outside Tamil Nadu chief minister's office after he sat on a protest along with other party members. The party has already called for a dawn-to-dusk bandh on Friday, however, the workers sat on a protest after they did not get an appointment to meet the CM.Stay tuned for live updates May 24, 2018 4:36 pm (IST) \"After clear proof showing shooting and killing of protestors, not a single person has been suspended, only transferred. Talking about the inquiry that's going to be held, what sort of an inquiry does not have a time limit? The government is thinking that it will shift into oblivion of public memory the horrors of Tuticorin. Has anybody tried to find which officer readily accepted this project when it was shifted from Maharashtra to Tamil Nadu? I want to ask the PM if CM EPS is fit to continue. This is another kind of challenge that we are throwing at the PM. The state government has lost the ethical and moral right to govern. The job of the government is to save human rights and improve their standards of living,\" says Abhishek Manu Singhvi. May 24, 2018 4:25 pm (IST) The Congress party is holding a press conference at its HQ in New Delhi. The Grand Old Party is questioning the central and state government over its decisions regarding the Tuticorin Sterlite protests. \"It is the polluted mindset of the government, both state and central, that has led to the killing of innocents. Why is our Prime Minister still silent on the violence in Tuticorin? Why is our oratorical, tweet-happy Prime Minister still silent? He has the free time to accept fitness challenges and even throw counter-challenges but has no time to speak on challenges of violence and rising fuel prices. Why did the government reverse the Congress' decision that no clearance will be given to industries in zones where ther eis a clear chance of environment hazards,\" says Abhishek Manu Singhvi. May 24, 2018 4:14 pm (IST) Tuticorin collector Sandeep Nanduri has said that 65 people have been arrested and remanded for indulging in violence during the Sterlite Protests. Another 68 people have been arrested and will be produced in front of the magistrate for causing damage to public property and indulging in violence. Meanwhile, Supreme Court lawyer GS Mani has filed a writ petition the Court seeking registration of FIR and investigation by the CBI against Tuticorin Collector, Superintendent of Police and other police officials. This came as a meeting was being held at the Collector's Office, which was chaired by government monitoring officers, Davidhar and Gagandeep Singh Bedi. The meeting was held to discuss how normalcy can be brought in the region May 24, 2018 4:11 pm (IST) Plea Seeks NHRC Intervention in TN Protest Firing | A plea was today moved in the Delhi High Court seeking direct intervention of National Human Rights Commission (NHRC) into the killing of people in police action during protests against the Vedanta's Sterlite copper factory in Tamil Nadu's Tuticorin district. The court is likely to hear tomorrow the petition filed by A Rajarajan. The plea said he gave a representation to the NHRC yesterday seeking its earliest intervention into the \"unlawful killings\". The petition, filed through advocate Sabrish Subramanian, claimed the NHRC refused to consider their representation as a matter of urgency and ignored the ground realities. It said the commission simply requested a report from the chief secretary and DGP of Tamil Nadu government. It alleged that \"human rights violation and continuous unlawful killings by indiscriminate police firing was happening even after the case was suo motu taken and report was requested by respondent (NHRC).\" The petition alleged that unless the NHRC directly intervenes in the issue at the earliest or through an independent agency, the \"unlawful killings by police\" would continue and there is a possibility of destruction of evidence. It sought direction to the commission to consider their representation as a matter of great urgency. May 24, 2018 3:02 pm (IST) Taking to Twitter, Tamil Nadu chief minister Palaniswami defended the police action against protesters, he said, \"When someone hits you, you naturally tend to defend yourselves. so on such situations, no one acts in a pre-planned manner.\" He also accused the political parties of 'misguiding the protesters'. 'Some anti-social elements intruded into the agitation on May 22 and attacked the police, torched the police vehicles. Under tense situation, police resorted to firing and the firing was not pre-planned,' he tweeted. When someone hits you, you naturally tend to defend yourselves. so on such situations, no one acts in a pre-planned manner. #SterliteProtest — Edappadi K Palaniswami (@CMOTamilNadu) May 24, 2018 May 24, 2018 2:39 pm (IST) Tuticorin Fallout in Chennai: DMK working president MK Stalin Detained | Dravida Munnetra Kazhagam (DMK) working president MK Stalin was lifted by police officers and evicted from outside Tamil Nadu chief minister's office on Thursday after he sat on a protest along with other party members. The party has already called for a dawn-to-dusk bandh on Friday, however, the workers sat on a protest after they did not get an appointment to meet the CM. Even as fresh violence has not been reported in Tuticorin, the death toll has risen to 13. May 24, 2018 2:19 pm (IST) DMK Protest in Chennai | DMK workers are now protesting in Chennai's Ice House area against Tuticorin violence. May 24, 2018 2:14 pm (IST) Fight Against Incompetent EPS Government Will Not Stop, Says Stalin | \"The Tamil Nadu government has been unable to give answers to Tuticorin Massacre. We will ensure the protestors' and peoples' voices from Tuticorin are heard in Chennai. Our fight against this Incompetent EPS Government will NOT stop till the resignations of the CM and DGP,\" MK Stalin tweeted. அங்கே போராட்டத்தை முடக்க நினைத்தால்,இங்கே போராட்டம் நடக்கும்.மக்களை நோக்கித் துப்பாக்கியால் சுட்ட,அராஜக காவல்துறையினர்,மக்கள் பிரதிநிதிகளான எங்கள் மீது துப்பாக்கி சூடு நடத்திப் பார்க்கட்டும். நீதி கிடைக்கும்வரை தி.மு.கழகம் தனது போராட்டத்தைத் தொடரும் #TuticorinShootout pic.twitter.com/pUquhub8JW — M.K.Stalin (@mkstalin) May 24, 2018 May 24, 2018 2:12 pm (IST) Stalin Forcibly Removed from Outside CM's Office | DMK working president MK Stalin was lifted by police officers and forcibly removed from outside the chief minister's officer after he along with other party members sat on dharna. The party members sought an appointment to meet the CM, however, they were allegedly denied by Palaniswami's office. Meanwhile, chief minister said that no such appointment was sought, and he got to know about it by the media. May 24, 2018 1:30 pm (IST) Palaniswami Says No One Stopped Stalin from Meeting Him | E Palaniswami also denied charges that he refused to meet MK Stalin earlier in the day. “Just to stage a political drama, Stalin staged demonstration in front of my office. Stalin did not say he wanted to meet me. It was a pre-planned move by DMK to protest right outside my office,” he said. May 24, 2018 1:28 pm (IST) Jayalalithaa Had Cancelled Sterlite’s Permission, CM Says | “In April, Sterlite approached TNPCB to continue running smelter and we denied permission. Amma's government has always requested people's feelings while Jayalalithaa was the chief minister, she cancelled Sterlite's permission. NGT gave a ruling that they can run a smelter, if they follow rules. Jaya went to the Supreme Court, and this case is going on,” the CM said. May 24, 2018 1:27 pm (IST) Sterlite Protest Turned Violent Because of Opposition, Says CM | “Amma's government is taking the legal route to ensure that Sterlite is shut down. Section 144 has been imposed to avoid any untoward incident. But despite this, for selfish reasons, opposition leader decided to go ahead with protests. So far the protests were peaceful, but this time because of the opposition it turned violent. It is because of this instigation so many people have died. And we are really saddened by the deaths,” says E Palaniswami while addressing the media over the issue. May 24, 2018 1:18 pm (IST) Home Minister Seeks Report on Tuticorin Violence | “I am deeply pained at the loss of precious lives during the agitation in Tamil Nadu’s Tuticorin. The MHA has taken cognisance of the situation and sought a report on the incident and the prevailing situation from the state government. My thoughts are with bereaved families. I also pray for the speedy recovery of the injured. I appeal to the people in Tuticorin to remain calm and maintain peace and tranquility in the region,” says Rajnath Singh. May 24, 2018 12:59 pm (IST) Tamil Nadu chief minister E Palaniswami addresses media on Tuticori unrest | Calling DMK working president MK Stalin protest outside TN Seretariat a political drama, Palaniswami said I didn't refuse an appointment to meet him. Stalin did not seek any appointment and doing all this to gain political mileage, says CM. May 24, 2018 12:49 pm (IST) MK Stalin After Getting Detained | I'm not scared of getting arrested. I knew this will happen. They have already killed 13 people. If they want they can kill me too. DMK and Congress have been protesting for Tuticorin as it has been in a terrible condition. For namesake the collector has made few changes but no action has been taken against the police. CM has still not visited the victims, this proves how terrible the govt is. We have seen many govts like MGR, Anna, Kamraj and Kalaignar, when they were in power but atleast then CMs took action in such situations. May 24, 2018 12:38 pm (IST) Violence Unfortunate, Cooperating With Govt and Court: Vedanta Chairman Anil Agarwal | “I am really sad to hear about the incident that occurred in Tuticorin. This was very unfortunate and my full sympathies with the families. The plant is closed because of annual shutdown and we are waiting for clearance from the court and the government to restart the plant. We are strictly following the court and government orders. We always make sure that the community and the Tuticorin people at large prosper with us. I am totally committed to the people, and with the wish and will of the residents we would like to continue with this business. Once again, I assure you that I am fully committed to the development of Tuticorin people and Tamil Nadu,” said Vedanta Group Chairman Anil Agarwal. May 24, 2018 12:15 pm (IST) MK Stalin evicted from outside CM's office | There was high drama outside Tamil Nadu Chief Minister E Palaniswami’s office on Thursday. DMK working president MK Stalin was forcibly evicted from the area after he was leading a protest by party leaders for not getting an appointment with CM over Sterlite protests in Tuticorin. He has been detained for staging protest oustide CM's office. May 24, 2018 11:50 am (IST) DMK creates ruckus over delay in appointment with the CM | DMK Working President MK Stalin with other party leaders staging a protest outside Tamil Nadu secretariat after not getting an appointment with CM Palaniswami over Sterlite protests in Thoothukudi. On Wednesday, M K Stalin has demanded the resignation of the CM and DGP T K Rajendran over the anti-Sterlite violence at Tuticorin in which 13 people have been killed and scores injured. He had said Palaniswami and Rajendran should take moral responsibility for the incident and resign. May 24, 2018 11:30 am (IST) Congress slams Tamil Nadu Govt for poor law and order situation | Tamil Nadu government knew that this being 100th day of agitation, it's going to be bigger. They should've made better arrangements to maintain law and order but nothing was done. They simply resorted to firing. It was a massacre, almost like Jallianwala Bagh, said senior Congress leader Ghulam Nabi Azad. May 24, 2018 11:26 am (IST) Tuticorin Collector Sandeep Nanduri on Sterlite protest | Thoothukudi's District Collector Sandeep Nanduri said his first priority would be to bring normalcy in Tuticorin. \"As far as the violence, the shooting and who gave the orders for the shooting is concerned, an inquiry will be done by a judge appointed by the Tamil Nadu govt,\" he said. May 24, 2018 11:06 am (IST) One more killed in TN, death toll is 13 | One more person killed in police firing in Tuticorin today taking the death toll to 13. On Tuesday, police firing killed 11 people, most of them from nearby villages who were demanding the closure of the Sterlite Copper smelting plant they said was destroying the farm lands and leading to severe health issues in the region. On Wednesday, the police fired at crowds in Anna Nagar, killing a young man. The demonstrators insisted that the police action was unprovoked. The police accused the crowds of stoning the police. May 24, 2018 10:53 am (IST) Akhilesh Yadav condemns Tuticorin Violence | Samajwadi Party chief Akhilesh Yadav took to Twitter to condemn the Tuticorin violence. He wrote: No logic of development can justify this. The environment is crying, Ganga is drying, Yamuna is dying. Forests are depleting. Animals are straying. What are we getting in return...erratic climate; weather extremes and suffocating pollution. #StopItNow No logic of development can justify this. The environment is crying, Ganga is drying, Yamuna is dying. Forests are depleting. Animals are straying. What are we getting in return...erratic climate; weather extremes and suffocating pollution. #StopItNow pic.twitter.com/srQSKswV8Z — Akhilesh Yadav (@yadavakhilesh) May 24, 2018 May 24, 2018 10:47 am (IST) Amnesty Condemns Tamil Nadu Firing Deaths | Amnesty International India on Wednesday condemned the Tamil Nadu Police for its handling of anti-Sterlite protest in which at least 11 people were shot dead and several more injured over two days, terming it a \"damning indictment\"of the state government, reports IANS. \"The Tamil Nadu Police were shockingly under-prepared to peacefully control protests of this magnitude. Despite knowing there would be a massive protest on Tuesday, the state police did little to implement crowd control measures that would have avoided the need to resort to force. \"This could have prevented the death of protestors. The Tamil Nadu police have many questions to answer. Those responsible for deaths and injuries caused to protestors must be brought to justice,\" Abhirr V. P., Senior Campaigner at Amnesty International India, said in a statement. May 24, 2018 10:46 am (IST) Internet Remains Suspended in Tuticorin Today | Internet remains suspended in Tuticorin and adjoining districts of Tirunelveli and Kanyakumari after state government ordered to suspend services for five days to prevent spread of rumours through social media and help bring public tranquility. Noting that anti-social elements were trying to exploit the situation, the government directed nodal officers of Internet Service Providers in these three districts to suspend internet services till May 27. May 24, 2018 10:34 am (IST) Electricity Supply to Sterlite Plant Cut off Around 5 AM | The electricity supply to Sterlite Copper Smelter plant in Thoothukudi was disconnected early on Thursday morning after Tamil Nadu Pollution Control Board (TNPCB) ordered its closure with immediate effect. In its orders, the TNPCB said that during inspections it was found that “the unit was carrying out activities to resume its production operations\". May 24, 2018 10:16 am (IST) DMK, Allies Call Dawn-to-Dusk Bandh Tomorrow Over Tuticorin Violence Condemning the police action against protesters in Tuticorin, the DMK and other opposition parties in Tamil Nadu called for a dawn-to-dusk bandh on May 25. In a statement issued late Wednesday night, the DMK said instead of the all-party protest, a bandh would be observed on May 25 to condemn the police action and demand the closure of the Sterlite copper smelting plant in Tuticorin district. \"The DMK, the All India National Congress, the Dravidar Kazhagam, the Marumalarchi Dravida Munnetra Kazhagam, the CPI, the CPI(M), the Indian Union Muslim League, the Viduthalai Chiruthaigal Katchi and the Manithaneya Makkal Katchi will participate in the day-long state-wide protest,\" it added. May 24, 2018 10:11 am (IST) Tuticorin's Police Chief, Collector Shunted Out After Fresh Violence, Man's Death The Tamil Nadu government on Wednesday transferred Tuticorin District Collector and Superintendent of Police as fresh violence rocked the port city for the second consecutive day. Tuticorin District Collector N Venkatesh has been transferred and Tirunelveli District collector, Sandeep Nanduri has been appointed in his place, an official release said. District Superintendent of Police P Mahendran, who is the eye of a storm over police firing on protesters that led to the death of 12 persons, has been transferred to Chennai. Nilgiris District SP Murali Rambha will replace him. Venkatesh has been posted as Additional State Project Director for the implementation of \"Samagra Shiksha Abhiyan,\" under the control of state project director, Sarva Shiksha Abhiyan, the release said. Mahendran will assume charge as Deputy Commissioner (Traffic-North) here, it said. The present Deputy Commissioner (Traffic-North), D Shanmuga Priya will take over as SP, Nilgiris district. Shilpa Prabhakar Satish will replace Nanduri as Tirunelveli Collector.​ May 24, 2018 10:10 am (IST) Tamil Nadu Govt Blames Social Media for Violence in Tuticorin, Suspends Internet The Tamil Nadu government on Wednesday ordered suspension of internet services in Tuticorin and adjoining districts of Tirunelveli and Kanyakumari for five days to prevent spread of rumours through social media and help bring public tranquility. Blaming provocative messages spread through social media, the government in an order said such messages led to massive gathering of about 20,000 people on Tuesday in Tuticorin against Sterlite's copper plant which subsequently resulted in violence and police action. Noting that anti-social elements were trying to exploit the situation, the government directed nodal officers of Internet Service Providers in these three districts to suspend internet services till May 27 effective from on Wednesday. Passing the order under Temporary Suspension of Telecom Services (Public Emergency or Public Safety) Rules, 2017 -Stoppage of internet services- the government said a public emergency has arisen necessitating immediate action to bring public tranquility.​ May 24, 2018 10:10 am (IST) Tamil Nadu Govt Sets Up One-member Committee to Probe the Killings The Madras High Court on Wednesday, while hearing a PIL against the police firing, ordered that the bodies of those killed will be preserved and autopsies will be conducted at the government hospital. The Tamil Nadu government has also appointed a retired high court judge to head a one-member inquiry committee to probe the killings. May 24, 2018 10:06 am (IST) Death toll in Tuticorin violence reaches 12 On Wednesday, at least one more person was killed and five more were injured in fresh police firing in Tamil Nadu’s Tuticorin town taking the death toll since Tuesday’s violent anti-Sterlite protests to 12. Enraged over Tuesday's killings, protesters took to streets and showered stones and brickbats at police, prompting security personnel to open fire at Anna Nagar. The body of the man killed in firing, and those injured have been rushed to a government hospital. The SP of Tuticorin was also injured in the clashes.\nCongress leader Abhishek Manu Singhvi addresses a news conference in Delhi on Thursday. (News18)\nEven as fresh violence has not been reported in Tuticorin, the death toll has risen to 13. The electricity supply to Sterlite Copper Smelter plant in Thoothukudi was also disconnected in the morning after Tamil Nadu Pollution Control Board (TNPCB) ordered its closure with immediate effect. In its orders, the TNPCB said that during inspections it was found that “the unit was carrying out activities to resume its production operations\". Meanwhile, internet remains suspended in Tuticorin and adjoining districts of Tirunelveli and Kanyakumari after state government ordered to suspend services for five days to prevent spread of rumours through social media and help bring public tranquility. Noting that anti-social elements were trying to exploit the situation, the government directed nodal officers of Internet Service Providers in these three districts to suspend internet services till May 27. A day earlier, the National Human Rights Commission issued notices to Tamil Nadu chief secretary and the director general of police, asking them to submit a detailed report in two weeks on the large-scale violence in the srea, while the Madras High Court stayed the proposed expansion of the plant. At least 11 people were killed in alleged police firing, while 30 others were left injured as a mob of 20,000 people went on a rampage in Tamil Nadu's Thoothukudi demanding the copper unit be shut down as it has been causing pollution the area. Condemning the police action against protesters, DMK and other opposition parties in Tamil Nadu have called for a dawn-to-dusk bandh on Friday in Tuticorin.", "url": "https://www.news18.com/news/india/tuticorin-live-congress-asks-if-pm-modis-fitness-challenge-extends-to-tamil-nadu-cms-governance-1758207.html", "label": 1}