{"authors": [], "date_download": "2019-03-27 14:40:50", "date_modify": "2019-03-27 14:40:50", "date_publish": "2019-03-26 00:00:00", "description": "A group of farmers from Puntambe village, the epicentre of the recent agrarian protests in Maharashtra, on Monday expressed unhappiness over the loan waiver scheme announced by the state government.", "filename": "news_india_maharashtra-farmers-who-regularly-repay-loans-want-more-benefits-1443967_1553697650.html", "image_url": "https://images.news18.com/ibnlive/uploads/2016/11/farmer.jpg", "language": null, "localpath": "/home/raj/news-please-repo//data/2019/03/27/news18.com/news_india_maharashtra-farmers-who-regularly-repay-loans-want-more-benefits-1443967_1553697650.html", "title": "Maharashtra Farmers who Regularly Repay Loans Want More Benefits", "title_page": "Maharashtra Farmers who Regularly Repay Loans Want More Benefits - News18", "title_rss": "NULL", "source_domain": "news18.com", "text": "A group of farmers from Puntambe village, the epicentre of the recent agrarian protests in Maharashtra, on Monday expressed unhappiness over the loan waiver scheme announced by the state government.The farmers want more benefits for those who regularly repay their crop loans.A delegation of eight farmers from the village in Ahmednagar district today met NCP chief Sharad Pawar here in connection with their demands.The farmers claimed that Pawar assured to look into their issues. The cultivators also said that they are planning to meet Chief Minister Devendra Fadnavis on Tuesday.The BJP-led government had on Saturday unveiled a Rs 34,022 crore farm loan waiver scheme, under which debts of up to Rs 1.5 lakh would be written off, giving relief to some 89 lakh farmers.However, the steering committee of farmer leaders yesterday rejected the mega loan waiver scheme, saying there should be no upper limit for the waiver.Under the scheme, the farmers who regularly repay loan will get 25 per cent relief on paid amount, capped at Rs 25,000.Abhay Chavan, a farmers' leader from Puntambe, said, \"We regularly repay our crop loans. The government's loan waiver scheme helps us up to Rs 25,000 only whereas those who have outstanding loans up to Rs 1.50 lakh are going to benefit more.\"\"We think this is unfair to us as we repay crop loan from time to time,\" he said.Dattatray Dhanwate, another member of the farmers' delegation, claimed that Pawar has \"assured to look into the matter\".\"We met Pawar because he understands our issues thoroughly. Our demand is that we should get benefit up to Rs 50,000 because many farmers would not benefit from the existing scheme.\"If a farmer gets Rs 25,000 return under the scheme, it is quite less,\" he said.\"Some senior farmers from Puntambe village are going to meet Fadnavis tomorrow regarding the same issue. Loan waiver scheme announced by the state government is not satisfactory,\" Dhanwate told reporters after their meeting with Pawar at Y B Chavan centre near the state Secretariat.Asked about the reasons behind their dissatisfaction, Chavan said, \"Most of us grow grapes, sugarcane and soyabean.Our crop loan limit is also quite high as compared to farmers growing food grains.\"Hence, when our loan turns bad, its amount is much more than that of farmers growing cereals and pulses. We are not going to benefit much from such loan waiver schemes,\" he claimed.On the legal cases filed against the cultivators, Amol Teke, who was a part of the farmers' delegation, said, \"The state government should withdraw all cases against the farmers without any condition.\"Early this month, several parts of Maharashtra witnessed large scale protests by farmers over their demands for a loan waiver and remunerative price for their produce, among others.The protests started from Puntambe and then spread to other places in the state.", "url": "https://www.news18.com/news/india/maharashtra-farmers-who-regularly-repay-loans-want-more-benefits-1443967.html", "label": 1}