{"authors": ["Sowmya Aji"], "date_download": "2019-03-27 14:18:30", "date_modify": "2019-03-27 14:18:30", "date_publish": "2015-09-30 03:12:00", "description": "RJD are not taking All India Majlis-e Ittahadul Muslimeen president Asaduddin Owaisi very seriously in the upcoming Bihar assembly polls, the Congress.", "filename": "news_politics-and-nation_co_300bf0ac102a32a9db21cbd613427a6d_49160736_1553696310.html", "image_url": "https://img.etimg.com/thumb/msid-49160740,width-1070,height-580,imgsize-63955,overlay-economictimes/photo.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/economictimes.indiatimes.com/news_politics-and-nation_co_300bf0ac102a32a9db21cbd613427a6d_49160736_1553696310.html", "title": "Congress to shadow Owaisis to give them Bengaluru-type drubbing in Bihar", "title_page": "Congress to shadow Owaisis to give them Bengaluru-type drubbing in Bihar - The Economic Times", "title_rss": "NULL", "source_domain": "economictimes.indiatimes.com", "text": "RJD are not taking All India Majlis-e Ittahadul Muslimeen president Asaduddin Owaisi very seriously in the upcoming Bihar assembly polls, the Congress, the junior partner in the Mahaghatbandhan, is seeking to replicate methods used by its partymen in the recent civic polls in Bengaluru to counter him in Seemanchal.\nOwaisi has had much success in Telangana and Andhra Pradesh and to a smaller extent even in Maharashtra. Now he claims that he will do well in Bihar: \"No one else is talking about the backwardness of Seemanchal. We will do well.\" In Bengaluru, Owaisi put up 30 candidates in Muslim and Dalit dominated wards. But the highest number of votes that his party got was just 2,121 n Padarayanapura, a constituency dominated by Muslims and Dalits.\nThe seat was won by the JD(S). The AIMIM candidates lost deposits in all the seats they contested, with several of the Dalit seats won by the BJP. It was the Congress, though, that gave AIMIM the most number of defeats in Bengaluru, as the party won 15 of the seats that Owaisi’s party contested. Muslim leaders of the party got together, tracked the movements of Asaduddin and his brother Akbaruddin, MLA from Chandrayagutta in Telangana and worked out the details of how to counter them.\n\"Both the brothers camped in Bengaluru for a month. They couldn’t hold public rallies as the Karnataka High Court had stopped them. But they went to every mosque and community leader in all the wards they contested seeking support,\" Congress’ young Muslim face in Karnataka, Rizwan Arshad, told ET. The Congress Muslim leaders in Bengaluru went to the same mosques and met the same leaders that Asaduddin and Akbaruddin spoke to.\n\"We worked with the community and the religious leaders, explained about the AIMIM’s communal agenda and how it will defeat the welfare of the community and the nation. The Muslims, as well as the Dalits of Bengaluru rejected the AIMIM after this,\" Arshad added.", "url": "https://economictimes.indiatimes.com/news/politics-and-nation/congress-to-shadow-owaisis-to-give-them-bengaluru-type-drubbing-in-bihar/articleshow/49160736.cms", "label": 1}