{"authors": [], "date_download": "2019-03-27 14:35:03", "date_modify": "2019-03-27 14:35:03", "date_publish": "2019-02-08 06:00:00", "description": "Prime minister Narendra Modi will visit three states today. He will address a rally in Raigarh, Chhattisgarh. This will be his first visit to the state after BJP lost the assembly elections there last", "filename": "news_top-five-things-to-watch-out-for-on-february-8-2018_article26205413_1553697303.html", "image_url": "https://www.thehindubusinessline.com/incoming/gphgwg/article26042812.ece/ALTERNATES/LANDSCAPE_615/narendramodijpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/thehindubusinessline.com/news_top-five-things-to-watch-out-for-on-february-8-2018_article26205413_1553697303.html", "title": "Top five things to watch out for on February 8, 2019", "title_page": "\nTop five things to watch out for on February 8, 2019 - The Hindu BusinessLine\n", "title_rss": "NULL", "source_domain": "thehindubusinessline.com", "text": "Prime minister Narendra Modi will visit three states today. He will address a rally in Raigarh, Chhattisgarh. This will be his first visit to the state after BJP lost the assembly elections there last year. The PM will then proceed to West Bengal, and address a rally inJalgaipur. He is scheduled to proceed to Assam from there for a night stay. In Guwahati, he will meet BJP members to discuss election strategies.\nCongress president Rahul Gandhi will address a farmers rally at the BHEL Jamboree Maidan, Bhopal today. The Congress has termed this rally as a \"thanksgiving rally\" where farmers would felicitate Gandhi for the farm loan waiver that was announced by the Congress-led in the state. All top Congress leaders from the state, including Cheif Minister Kamal Nath, Jyotiraditya Scindia, and Digvijay Singh are expected to attend the rally.\nThe CBI is scheduled to question Kolkata Police Commissioner Rajeev Kumar in Shillong today. The CBI is probing the Saradha chit fund scam and they believe that that Police Commissioner has evidence that could be useful in the case. The 9 member team will question Kumar. On Tuesday, top officials of the West Bengal government, including Chief Minister Mamata Banerjee, held a dharna to protest against the CBI questioning Kumar.\nMany top companies will announce their quarterly results today. Look out for the results of Mahindra & Mahindra, NHPC, BPCL and Engineers India.\nThe Tamil Nadu government will announce the State Budget for 2019-2020 in the Assembly on February 8. The budget session will begin from 10 AM. With the Lok Sabha elections around the corner, will the state government provide sops to woo the voters of the state?", "url": "https://www.thehindubusinessline.com/news/top-five-things-to-watch-out-for-on-february-8-2018/article26205413.ece", "label": 1}