{"authors": ["The Cave Houses More Than Images In Red Ochre", "One Composition In White"], "date_download": "2019-03-27 14:35:00", "date_modify": "2019-03-27 14:35:00", "date_publish": "2016-12-27 08:27:07", "description": "Indu Makkal Katchi-Tamizhagam on Monday petitioned the State Government to remove the ban on ‘jallikattu’ and ‘sevarkattu’.In a petition submitted to the Collector at the weekly grievance meeting, the", "filename": "news_cities_Coimbatore_%E2%_c5df49787f99813cbfe69d38feac904b_article16948783_1553697300.html", "image_url": "https://www.thehindu.com/news/cities/Coimbatore/article16948782.ece/ALTERNATES/LANDSCAPE_615/CB27-GRIEV", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/thehindu.com/news_cities_Coimbatore_%E2%_c5df49787f99813cbfe69d38feac904b_article16948783_1553697300.html", "title": "‘Take steps to conduct jallikattu’", "title_page": "\n‘Take steps to conduct jallikattu’ - The Hindu\n", "title_rss": "NULL", "source_domain": "thehindu.com", "text": "Indu Makkal Katchi-Tamizhagam on Monday petitioned the State Government to remove the ban on ‘jallikattu’ and ‘sevarkattu’.\nIn a petition submitted to the Collector at the weekly grievance meeting, the party’s V.V. Manickam said that with the objective of harming the rearing of native breeds, animal welfare organisations had moved the court, which had banned the bull and rooster sport.\nThe two along with others were part of Tamil tradition and therefore, the Government should take steps to remove bull from the list of performing animals so that ‘jallikattu’ could be held during Pongal 2017.\n‘Disburse gratuity’\nThe Nava India-RKI-RVS Workers’ Struggle Committee petitioned the District Collector seeking early disbursement of gratuity.\nIn a petition, the organisation’s coordinator P.V. Gopal said that to date the organisation had not paid 50 per cent of the employees’ gratuity. It had also violated the agreement arrived at in the presence of Assistant Commissioner, Labour, in July 2004. It also did not honour the order for payment of gratuity within 30 days.\n‘Check drunk driving’\nRashtriya Hindu Parishad has urged the Collector to ensure that there is no drunk driving on new year’s eve and that the revelry around midnight did not disturb the public. It also urged the Collector to keep HR and CE-run temples closed as opening the temples went against Hindu customs that guide temple functioning.\n‘Declare TN drought-hit’\nThe Coimbatore district unit of Tamil Nadu Farmers’ Association staged a protest near the Collectorate and urged the Central Government to declare the State drought-hit.\nIt also wanted the Government to declare Chennai, Cuddalore, Kanchipuram and Tiruvallur cyclone-affected and compensate the kin of farmers who committed suicide.\nIt also asked the Government to pay Rs. 30,000 an acre compensation for farmers who lost standing crops.", "url": "https://www.thehindu.com/news/cities/Coimbatore/%E2%80%98Take-steps-to-conduct-jallikattu%E2%80%99/article16948783.ece", "label": 1}