{"authors": ["Anupa Kujur"], "date_download": "2019-03-27 14:40:45", "date_modify": "2019-03-27 14:40:45", "date_publish": null, "description": "While the Congress and BJP have called each other's fast a 'farce', several elected officials in the past have undertaken dharnas for various reasons.", "filename": "news_india_fast-or-farce-a-brief-history-of-politicians-who-have-gone-on-hunger-strike-2546565_1553697645.html", "image_url": "https://static-news.moneycontrol.com/static-mcnews/2017/10/GettyImages-187864817-770x433.jpg", "language": null, "localpath": "/home/raj/news-please-repo//data/2019/03/27/moneycontrol.com/news_india_fast-or-farce-a-brief-history-of-politicians-who-have-gone-on-hunger-strike-2546565_1553697645.html", "title": "Fast or farce? A brief history of politicians who have gone on hunger strike", "title_page": "Fast or farce? A brief history of politicians who have gone on hunger strike - Moneycontrol.com", "title_rss": "NULL", "source_domain": "moneycontrol.com", "text": "Leading from the front, Prime Minister Narendra Modi will be observing fast on April 12 as Bharatiya Janata Party (BJP) lawmakers will protest against the washout of the Budget Session of Parliament.\nModi's announcement comes days after Congress President Rahul Gandhi led his party's one-day fast over atrocities on Dalits under the BJP-led government.\nWhile both the national parties have called each other's fast a 'farce', several elected officials have staged demonstrations for various reasons. Here's a list of elected officials who have observed fast in past:\nAlso read — Modi's fast a farce: Congress\nK Chandrashekhar Rao\nIn 2009, Telangana Rashtra Samiti (TRS) leader K Chandrasekhara Rao undertook an indefinite fast demanding a resolution on a separate state for Telangana. Rao was later elected as the first chief minister of Telangana.\nMamata Banerjee\nWest Bengal Chief Minister Mamata Banerjee, then opposition leader, went on a fast for 26 days to protest against the West Bengal government's \"forcible\" acquisition of farm land at Singur for Tata Motor's small car project. Banerjee's fast led the Tata's to shun the project.\nIn 2006, the then chief minister of Gujarat, went on a 51-hour fast to support the Narmada dam project, promising to deliver water to drought-prone Saurashtra and Kutch regions in the state.\nModi staged protests against the 'anti-development' stance of the central government, however, Prime Minister Manmohan Singh assured that the work on the dam would not been halted.\nArvind Kejriwal\nIn 2014, the Delhi CM went on a hunger strike over a stand-off between the Aam Aadmi Party (AAP) and the Delhi Police.\nN Chandrababu Naidu\nThe TDP chief went on a hunger strike in 2013 while protesting against bifurcation of Andhra Pradesh.", "url": "https://www.moneycontrol.com/news/india/fast-or-farce-a-brief-history-of-politicians-who-have-gone-on-hunger-strike-2546565.html", "label": 1}