{"authors": ["Known As The Poor Man S Cocaine", "Mephedrone Is Cheaper", "More Easily Available", "Therefore More In Demand", "Say Police"], "date_download": "2019-03-27 14:40:36", "date_modify": "2019-03-27 14:40:36", "date_publish": "2015-11-27 02:20:34", "description": "The Shiv Sena on Thursday distanced itself from the Ludhiana unit of the party which announced Rs. 1 lakh cash reward for slapping actor Aamir Khan as a protest over his remarks on “intolerance” in In", "filename": "news_cities_mumbai_sena-dis_21555afdd98efe8e675f75eacf030a7f_article7920297_1553697636.html", "image_url": "https://www.thehindu.com/static/theme/default/base/img/og-image.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/thehindu.com/news_cities_mumbai_sena-dis_21555afdd98efe8e675f75eacf030a7f_article7920297_1553697636.html", "title": "Sena distances itself from ‘slap Aamir’ call", "title_page": "\nSena distances itself from ‘slap Aamir’ call - The Hindu\n", "title_rss": "NULL", "source_domain": "thehindu.com", "text": "The Shiv Sena on Thursday distanced itself from the Ludhiana unit of the party which announced Rs. 1 lakh cash reward for slapping actor Aamir Khan as a protest over his remarks on “intolerance” in India.\n“The Shiv Sena party has nothing to do with a sporadic statement made in the context of Aamir Khan in Ludhiana. The said statement is not the official view of the party or its leaders. The party does not support or endorse such views,” a statement from the Sena said.\nThe activists of Ludhiana unit of the Shiv Sena had on Wednesday staged a protest outside the MBC Radisson Blu hotel in Ludhiana where the actor is staying for the duration of the shooting of his forthcoming film. The activists allegedly used derogatory language against the actor and burnt his photographs condemning his remarks.\nDuring the protest, Rajeev Tandon, chief of Shiv Sena’s Punjab unit, had announced that “any person who will slap Aamir Khan will get Rs. 1 lakh for each slap from the Shiv Sena.”", "url": "https://www.thehindu.com/news/cities/mumbai/sena-distances-itself-from-slap-aamir-call/article7920297.ece", "label": 1}