{"authors": ["Pti Feeds"], "date_download": "2019-03-27 14:18:16", "date_modify": "2019-03-27 14:18:16", "date_publish": "2017-02-25 19:47:08", "description": "Chennai, Feb 25 (PTI) The Tamil Nadu government today protested against Karnataka's", "filename": "news_agencies__1553696296.html", "image_url": "https://s3.india.com/wp-content/uploads/2015/06/indiacom-image-banner_01.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/india.com/news_agencies__1553696296.html", "title": "TN CM writes to PM on construction of reservoir across Cauvery", "title_page": "TN CM writes to PM on construction of reservoir across Cauvery | Agencies News, India.com", "title_rss": "NULL", "source_domain": "india.com", "text": "Chennai, Feb 25 (PTI) The Tamil Nadu government today protested against Karnataka’s “unilateral action” of constructing a reservoir across river Cauvery at Mekedatu and sought Prime Minister Narendra Modi’s intervention in the matter.\nCiting media reports, Chief Minister E K Palaniswami told Modi in a letter that the Karnataka government “has decided to implement Rs 5,912 crore Mekedatu Multipurpose (drinking and power) Project across the river Cauvery, which involves building a balancing reservoir with a capacity of 66 TMC ft.” “Further, Karnataka has proposed to approach the Central Water Commission and Supervisory Committee of the Supreme Court and Union Ministry of Environment for getting required clearances,” he said.\nThese reports have caused “serious concern” to the people of Tamil Nadu, he said in the letter.\nPalaniswami recalled Karnataka and Kerala filing civil appeals in the Supreme Court against the 2007 final award of the Cauvery Water Disputes Tribunal, even as Tamil Nadu had also filed a Special Leave petition on certain aspects of the final order of the Tribunal.\n“Even as hearing is underway in these appeals, Tamil Nadu filed Interlocutory Applications in the apex court against the Karnataka government from proceeding with the Hydro-electric Projects,” he said.\n“These applications are pending before the court and the entire matter is sub judice,” he asserted.\nLast year, the Centre had informed Tamil Nadu that Karnataka had been advised to share their plans for Mekedatu and other projects with the co-basin states as required under the Tribunal order and to bring them on board before taking up their Detailed Project Report/Construction, he pointed out.\nFurther, Karnataka had also assured Tamil Nadu “that it has no plans to proceed with the construction of the project without first informing the Supreme Court,” he said.\n“The unilateral action of the Government of Karnataka to construct a balancing reservoir across the river Cauvery near Mekedatu without obtaining the prior concurrence of the co-basin states and in violation of the order of the Tribunal will be detrimental to the interests of people of Tamil Nadu,” the Chief Minister said. (MORE)\nThis is published unedited from the PTI feed.", "url": "https://www.india.com/news/agencies/tn-cm-writes-to-pm-on-construction-of-reservoir-across-cauvery-1872535/", "label": 1}