{"authors": ["Rumellen", "The Washington Post"], "date_download": "2019-03-27 14:18:29", "date_modify": "2019-03-27 14:18:29", "date_publish": "2018-08-10 18:27:03", "description": null, "filename": "news_article_Indian-lawmaker-shows-up-to-parliament-dressed-as-13147252_1553696309.html", "image_url": "https://s.hdnux.com/photos/75/01/30/15996430/3/rawImage.jpg", "language": null, "localpath": "/home/raj/news-please-repo//data/2019/03/27/sfgate.com/news_article_Indian-lawmaker-shows-up-to-parliament-dressed-as-13147252_1553696309.html", "title": "Indian lawmaker shows up to parliament dressed as Hitler, sparks very little outrage", "title_page": "Indian lawmaker shows up to parliament dressed as Hitler, sparks very little outrage - SFGate", "title_rss": "NULL", "source_domain": "sfgate.com", "text": "Indian lawmaker shows up to parliament dressed as Hitler, sparks very little outrage\nIndian film actor-turned-politician Naramalli Sivaprasad arrives at parliament dressed as Adolf Hitler to press for government funding for his home state of Andhra Pradesh, in New Delhi on Aug. 9, 2018. Sivaprasad, 67, an icon for the low-caste Dalit community, often dresses up in outlandish costumes. (AFP/Getty Images) less Indian film actor-turned-politician Naramalli Sivaprasad arrives at parliament dressed as Adolf Hitler to press for government funding for his home state of Andhra Pradesh, in New Delhi on Aug. 9, 2018. ... more Photo: -/AFP/Getty Images Photo: -/AFP/Getty Images Image 1 of / 13 Caption Close Indian lawmaker shows up to parliament dressed as Hitler, sparks very little outrage 1 / 13 Back to Gallery\nIndian lawmaker Naramalli Sivaprasad is known for dressing up to make a statement.\nThe member of the Telugu Desam Party has repeatedly shown up to parliament in various costumes to protest Indian Prime Minister Narendra Modi's refusal to give his state more funds for development.\nEnsembles have included that of a magician, Hindu deity, folk dancer and schoolboy.\n\"Modi is the bad boy of the class,\" Sivaprasad reportedly said in April, while holding a notebook, pencil and ruler, according to the Indian news site First Post.\nOn Thursday, the former film actor took his form of protest to another degree when he appeared in parliament dressed as Adolf Hitler, wearing a Nazi-style uniform and toothbrush mustache.\nSivaprasad performed a Nazi salute for reporters and told them that his outfit was a warning to Modi, according to the Associated Press.\n\"I was greedy for power and as a result became responsible for World War II, which resulted in the death of several [tens of millions of] people and I also killed myself,\" Sivaprasad said impersonating Hitler, according to the Guardian.\n\"My suggestion to Modi is not to go down that way,\" he added.\nThe AP said the stunt did not spark any outrage among other legislators.\nThe impersonation of the German dictator responsible for the deaths of millions of people during World War II, including the extermination of approximately 6 million Jews, sparked little outrage in a country where Hitler is not as incendiary a topic as in other places. India has a history of using Hitler's name for branding in stores, restaurants and television shows.\nIn 2012, a men's clothing store called Hitler with a swastika displayed over the \"i\" opened in the state of Gujarat to international outrage. The shop's owners said they didn't name the store after the dictator, but rather after one of their grandfathers, who earned the nickname \"Hitler\" for his strictness.\nHitler also appeared in a 2016 Indian children's book about inspiring leaders alongside Modi, former U.S. president Barack Obama and former president of South Africa and anti-apartheid activist Nelson Mandela.\nThe strange interest and at times admiration for Hitler could be because the Holocaust isn't taught explicitly in many Indian schools. A 2015 U.N. study found that Indian textbooks rarely used the term \"Holocaust\" when describing the events of World War II.\n\"Indians have never experienced what Hitler was, unlike the West and Russians,\" Anirudh Deshpande, an associate professor of history at Delhi University, told the Guardian.", "url": "https://www.sfgate.com/news/article/Indian-lawmaker-shows-up-to-parliament-dressed-as-13147252.php", "label": 1}