{"authors": [], "date_download": "2019-03-27 14:29:07", "date_modify": "2019-03-27 14:29:07", "date_publish": "2016-11-24 12:38:28", "description": null, "filename": "news__1553696947.html", "image_url": "http://www.arabtimesonline.com/news/file/2015/09/57.png", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/arabtimesonline.com/news__1553696947.html", "title": "India's reform architect trashes PM Modi's cash crackdown", "title_page": "India's reform architect trashes PM Modi's cash crackdown - ARAB TIMES - KUWAIT NEWS", "title_rss": "NULL", "source_domain": "arabtimesonline.com", "text": "NEW DELHI, Nov 24 (Reuters) – Former Indian Prime Minister Manmohan Singh on Thursday tore into his successor Narendra Modi’s clampdown on the cash economy, calling it an “organised loot and legalised plunder” of the country.\nSingh – the architect of economic reforms that led to years of rapid growth – dubbed Modi’s shock move to scrap 500 and 1,000 rupee banknotes a “monumental mismanagement” that could shave at least 2 percentage points off economic growth.\nThe so-called demonetisation drive is part of a crackdown on corruption, tax evasion and militant financing, but the decision to suck out 86 percent of cash in circulation threatens to push Asia’s third-largest economy into a liquidity crisis.\nOpposition parties led by Congress have stalled parliament, demanding a reply from Modi and compensation for the families of dozens of people reported to have died while queuing at banks to swap old money for new.\nBelying his reticent image, Singh launched a broadside on the Indian leader, urging him to find pragmatic ways to ease the distress caused by the cash crunch.\n“What has been done can erode our people’s confidence in the currency and banking system,” said Singh. “In fact, it’s a case of organised loot and legalised plunder.”\nModi, citing a survey he launched via a smartphone app, says that 90 percent of people expressed their support for the ban on old banknotes. The survey was not representative but drew half a million responses.\nWith a small stock of smaller notes available and people struggling to get hold of scarce new 500 and 2,000 rupee bills, consumers are holding back spending and businesses are suffering.\nDelays in replacing cancelled notes and restrictions on cash withdrawals “reflect very poorly” on Modi’s team, the finance ministry and the Reserve Bank of India, Singh said.\nIn the year to March 2017, the cash crunch is expected to pull down economic growth from last year’s 7.6 percent by as much as 4.1 percentage points, brokerage Ambit Capital reckons.\nMoody’s Investors Service on Thursday warned the persistent cash crunch could worsen asset quality at Indian banks.", "url": "http://www.arabtimesonline.com/news/indias-reform-architect-trashes-pm-modis-cash-crackdown/", "label": 1}