{"authors": ["Relatives Have Turned Political Rivals Many A Time", "State Has Seen Good Translators", "Some Not So Good Ones"], "date_download": "2019-03-27 14:35:01", "date_modify": "2019-03-27 14:35:01", "date_publish": "2017-04-19 19:09:59", "description": "They wear badges, pressing for the publication of UGC’s Seventh Pay Review Committee report", "filename": "news_national_tamil-nadu_co_de97fdd945008a27aea6955cbf46b0f3_article18143345_1553697301.html", "image_url": "https://www.thehindu.com/static/theme/default/base/img/og-image.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/thehindu.com/news_national_tamil-nadu_co_de97fdd945008a27aea6955cbf46b0f3_article18143345_1553697301.html", "title": "College teachers protest ‘undemocratic attitude’ of the Centre", "title_page": "\nCollege teachers protest ‘undemocratic attitude’ of the Centre - The Hindu\n", "title_rss": "NULL", "source_domain": "thehindu.com", "text": "TIRUNELVELI\nUrging the Ministry of Human Resources Development to publish immediately the report of University Grant Commission’s Seventh Pay Review Committee, most of the college teachers here discharged their duty on Wednesday, wearing badges displaying their demand.\nAccording to S. Subbaraju, vice-president, All India Federation of University and College Teachers’ Organisations (AIFUCTO), the teaching fraternity across the country observed Wednesday (April 19) as ‘Demands Day’ by wearing badges, urging the Central government and the Ministry of Human Resources Development to immediately publish the report of the UGC’s Seventh Pay Review Committee and share the report with the AIFUCTO.\nThe National Executive Committee (NEC) meeting of the AIFUCTO held at Periyar University, Salem, on March 19 expressed its displeasure over the “undemocratic and apathetic attitude” of the Central government and decided to observe April 19 as ‘Demands Day’ with members wearing badges, carrying their demand.\nIn the past, the UGC and the Ministry had made public the UGC’s Pay Review Committee reports and allowed discussions not only on pay- related recommendations but also on issues such as enhancing quality of higher education, retaining talents in teaching profession, etc.\n“However, this time, the MHRD is keeping the PRC report a secret, avoiding any meaningful discussion on the issues pertaining to higher education. This is unprecedented and undemocratic,” Prof. Subbaraju said.\nIn the first week of April, the associations affiliated to the AIFUCTO sent letters to the MHRD and the UGC, urging them to publish the UGC’s Seventh Pay Review Committee report. In Tamil Nadu, the major constituents of the AIFUCTO and several faculty associations of State universities participated in this campaign.\n“If the indifferent attitude of the MHRD persists, the AIFUCTO will be forced to resort to all sorts of democratic struggles,” Prof. Subbaraju added.", "url": "https://www.thehindu.com/news/national/tamil-nadu/college-teachers-protest-undemocratic-attitude-of-the-centre-tirunelveli/article18143345.ece", "label": 1}