{"authors": [], "date_download": "2019-03-27 14:40:55", "date_modify": "2019-03-27 14:40:55", "date_publish": "2017-06-29 20:53:21", "description": "North-East Forum For International Solidarity (NEFIS) Manipur Unit in coordination with Manipur University Students Union (MUSU) held a protest demonstration against the continued presence of Assam Rifles Camp in Manipur University Campus on Thursday.", "filename": "node_19339_1553697655.html", "image_url": "https://www.assamtimes.org/sites/default/files/styles/thumbnail/public/field/image/manipur%20univ.jpg?itok=9BHpw4c9", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/assamtimes.org/node_19339_1553697655.html", "title": "Protest against Assam Rifles", "title_page": "Protest against Assam Rifles | Assam Times", "title_rss": "NULL", "source_domain": "assamtimes.org", "text": "North-East Forum For International Solidarity (NEFIS) Manipur Unit in coordination with Manipur University Students Union (MUSU) held a protest demonstration against the continued presence of Assam Rifles Camp in Manipur University Campus on Thursday. Raising demands of demilitarization and restoration of academic space NEFIS submitted a memo to Chief Minister Office. It should be known that NEFIS has continuously decried the military presence in Manipur University and in 2015 it has organized an extensive signature campaign against “campus militarization” and submitted it to President of India. Renewing its struggle for de-militarization of Manipur University campus, NEFIS has given an All India Protest Call for 29th June following these different state units have held protest demonstrations raising same demand. Simultaneous Protests were held in Delhi, Chandigarh, Guwahati, Hyderabad, Bangalore, Dehradun, and Gwalior.\nAssam Rifles has been stationed in Manipur University for past 30 years with the permission of State Government and this has continuously perpetuated an environment of fear among students. Army presence has not only destroyed academic life but students are even afraid to raise their democratic demands. Army presence has taken away all the space for academic freedom because every discussion and debate is under scrutiny. NEFIS believes that the Army presence has been continued to crush students’ movement by nipping it in bud. NEFIS believes that university campuses are spaces for academic purposes and are no place to station army.\nNEFIS condemns militarization of Manipur University campus and pledges to continue its struggle until its demands are met and the democratic space of university is restored.", "url": "https://www.assamtimes.org/node/19339", "label": 1}