{"authors": ["Cases Of Sexual Assault", "Blackmail Must Be Pursued Swiftly", "The Guilty Brought To Book"], "date_download": "2019-03-27 14:35:27", "date_modify": "2019-03-27 14:35:27", "date_publish": "2015-11-24 01:51:46", "description": "On November 16, a day marked as National Press Day, three newspapers made a statement in that cause by publishing blank spaces on their editorial pages. They were protesting against >a notice", "filename": "opinion_editorial_pressing-for-free-speech_article7909208_1553697327.html", "image_url": "https://www.thehindu.com/static/theme/default/base/img/og-image.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/thehindu.com/opinion_editorial_pressing-for-free-speech_article7909208_1553697327.html", "title": "Pressing for free speech", "title_page": "\nPressing for free speech - The Hindu\n", "title_rss": "NULL", "source_domain": "thehindu.com", "text": "On November 16, a day marked as National Press Day, three newspapers made a statement in that cause by publishing blank spaces on their editorial pages. They were protesting against >a notice served by the Assam Rifles to the editors of newspapers in Nagaland, warning them on coverage of the banned National Socialist Council of Nagalim (Khaplang). The editors were told they could be violating the Unlawful Activities (Prevention) Act (UAPA), 1967. This expression of defiance draws attention to the problems faced by the press in places described as conflict zones, trapped as mediapersons are between the state armed with the law to enforce varying degrees of censorship, and militant groups who use all methods of intimidation to have their versions published. In its defence, the Assam Rifles has drawn attention to a clause in the UAPA, under which the press can be made accountable in the interests of the sovereignty and integrity of the country. The editors, however, contest the Assam Rifles’ remit in asking them to refrain from carrying press releases of banned groups such as the NSCN (K). Such crucial technicalities apart, the diktat begs the larger question about both the freedom of expression and the independence of the press. What are — or, should be — the red lines in safeguarding free speech and fair reportage, critical to holding power to account?\nThe Press Council of India (PCI), often described as a toothless tiger, has taken suo motu note of the case and served notices to the paramilitary force and the State government. The PCI has the power to review any development likely to restrict the supply and dissemination of news of public interest and importance. The Nagaland government and the Assam Rifles’s reaction, and the PCI’s next move thereupon, will be instructive for the case at hand. Every effort should be made to check the authorities’ use of the law to curb reportage and opinion just because it challenges their line. It is far too common to use the pretext of safeguarding the sovereignty of India merely to hush legitimate critiques of governments and, equally, the security forces. There also needs to be a more broad-based appraisal of other ways and means by which freedom of the press is sought to be fettered, and what remedial measures there should be. For instance, government advertisements are often denied to ‘unfriendly’ publications. putting them at an unfair material disadvantage. The Press Council, for its part, appears to be shedding its image of an ageing tiger — from directing the Maharashtra government to withdraw its circular on the Sedition Act, to asking the Delhi government to do the same. On the “blank editorial” protest by Morung Express, Nagaland Page and Eastern Mirror, the Council must expand its investigation to the instruments of intimidation, passive and aggressive, that are utilised by state and non-state actors alike to both censor and get a favourable press.", "url": "https://www.thehindu.com/opinion/editorial/pressing-for-free-speech/article7909208.ece", "label": 1}