{"authors": [], "date_download": "2019-03-27 14:25:48", "date_modify": "2019-03-27 14:25:48", "date_publish": "2018-09-26 05:26:00", "description": null, "filename": "opinion_columnists_260918_church-sex-abuse-its-not-just-about-religion-but-also-gender_1553696748.html", "image_url": "https://s3.ap-southeast-1.amazonaws.com/images.asianage.com/images/aa-Cover-o83b3a15bbuut9o67jm71u9875-20180926015509.jpeg", "language": null, "localpath": "/home/raj/news-please-repo//data/2019/03/27/asianage.com/opinion_columnists_260918_church-sex-abuse-its-not-just-about-religion-but-also-gender_1553696748.html", "title": "Church sex abuse: It’s not just about religion, but also gender", "title_page": "Church sex abuse: It’s not just about religion, but also gender", "title_rss": "NULL", "source_domain": "asianage.com", "text": "In short, Sister Lucy had scored a goal. Bishop Mulakkal had lost. But the match is no longer religious. It is secular. Women 1, Men 0.\nWhile there are no definitive statistics on the number of Christian priests in India accused of sexual misconduct, and often even rape, the Church, whether it is the popular Roman Catholic or Malankara Syrian Orthodox (founded on the evangelical legacy of St. Thomas, who believers would like to think arrived in Kerala to spread the gospel in AD 52), has been inclined to leave the resolution of the matter, of the personal conduct of priests, generally to God. Men, in short. In shorts, too.\nBut not when it comes to rogue nuns. Sister Lucy Kalappura, who has been protesting in public against the inaction of the Church — in relation to Jalandhar Bishop Franco Mulakkal’s victimisation of a nun — had been asked to stop prayer activities in her parish in Vayanadu, northern Kerala. On Monday, her parishioners broke into the church office and forced the Mother Superior and the bishop of the diocese to retract the oral orders prohibiting Sister Lucy from catechism and other activities, Kerala owes a lot to Christian missionaries who came in numbers since the fourth century AD. They set up schools, took pains to learn the local dialects, and through catechism classes contributed to the culture and sustenance of the natives. The collateral damage was conversion. Though many considered this an incursion, there was no religious persecution on that count.\nOne of the more popular churches, then as now, is the Roman Catholic Church, to which Father Mulakkal belongs. By the 17th century it had become a well-run institution. It would not be entirely off the mark to see the Roman Catholic Church as the first multinational corporation that Kerala, and perhaps India, has seen. Portuguese, Italian and Irish Jesuits preached the gospel of Jesus Christ. Kerala’s progressive life indices, like literacy and health, trace their provenance and tradition to a foreign god and capital. Evangelical Protestantism was later spread to India by the efforts of British, American, German and Scottish missionaries. The Protestant missions were also responsible for introducing English education in India in an organised manner. The very many translated versions of the Bible meant Jesus could speak in Malayalam; the accessibility of God in the local language meant intimacy with the Church and the cross. Heaven and hell suddenly had Malayalam signposts. The Church grew.\nThat growth and its influence in public and private lives are in question now, specifically with the emergence of three disturbing cases of sexual assault charges against Christian priests.\nA married woman and the mother of two children had filed a complaint with the police in Kayamkulam, in central Kerala, alleging that a priest belonging to the Malankara Orthodox Syrian Church had raped her in the church office after calling her to discuss a family dispute. Second, a married schoolteacher had accused four priests belonging to different dioceses of the Malankara Orthodox Syrian Church of blackmailing her over a confession she had made in church a decade ago and sexually assaulting her over the years on the basis of that confession, which in any Christian school of divinity is sacrosanct.\nAnd, only weeks ago, a nun belonging to the Catholic congregation of Missionaries of Jesus in Jalandhar had filed a police complaint against Jalandhar Bishop Franco Mulakkal alleging he raped her and subjected her to perform the sexual act 13 times since 2014 at a convent in Kerala.\nThe last had especially caught the imagination of the public, because it focused on the precise repeatability of the incident which lent muscle to the sexist position that if the act was repeated, say 12, times over a period of years, how could it be termed as forced the 13th time? In fact, at least one prominent politician scoffed at the Mulakkal episode, saying the nun in question was making a big thing of the 13th “act of rape” as a reaction to her not being a promotion after the 12 incidents. Perhaps there is an element of truth in what he said. But what he failed to note was that the woman in question had every right to say “no” to Mulakkal at any time, and that 12 times do not justify the 13th. The prolonged nature of the duress and the establishment’s lack of rigour in pursuing the case also enraged the public.\nTo this writer, it’s not the sexual misconduct of Christian priests and the disrepute that brings to their institution that is so interesting as the fact that nuns are coming out of their convents and taking to the streets in solidarity with the victim. Among the supporters of the Mulakkal victim was Sister Lucy, who is by all accounts extremely popular in her parish of some 400 people.\nShe had emphatically supported the five nuns who had been for a while fasting in protest outside the Kerala high court in Kochi. That action had eventually led to the arrest of Father Mulakkal late last week. The nuns’ assertion of their rights is clearly a threat against the male bastions of Christianity. The Pope, after all, is a male, and so is Jesus. Both of course are set to change gender in the not too far future.\nWhen Sister Lucy of St. Mary’s Church was issued strictures, the eruption came not from her, but from her parishioners. On Monday, they broke into the church office and questioned the functionaries of the godly wisdom of their actions. The interrogation procedures were not subtle. The results were gratifying and immediate: Sister Lucy’s right to spread the good word was restored.\nFor her part, the good sister, without batting an eyelid, said to TV cameras recording the proceedings that this was a God-sent opportunity to hold fast to the truth, and that her Mother Superior, who orally issued the strictures, and others higher up should not for a moment look back on any of the activities on the ground as a source of offence.\nIn short, Sister Lucy had scored a goal. Bishop Mulakkal had lost. But the match is no longer religious. It is secular. Women 1, Men 0.", "url": "https://www.asianage.com/opinion/columnists/260918/church-sex-abuse-its-not-just-about-religion-but-also-gender.html", "label": 1}