{"authors": [], "date_download": "2019-03-27 14:40:56", "date_modify": "2019-03-27 14:40:56", "date_publish": null, "description": "Human rights defenders assume key responsibility to realize civil, political, economic, social and cultural rights and in advancing democratic principle, practices and further in securing sustainable development in Manipur as outlined in Sustainable Devel", "filename": "page_items_47257__1553697656.html", "image_url": "http://www.ifp.co.in/assets/images/favicon.ico", "language": null, "localpath": "/home/raj/news-please-repo//data/2019/03/27/ifp.co.in/page_items_47257__1553697656.html", "title": "Challenges Of Human Rights Defenders In Manipur", "title_page": "Challenges Of Human Rights Defenders In Manipur", "title_rss": "NULL", "source_domain": "ifp.co.in", "text": "Challenges Of Human Rights Defenders In Manipur\nHuman rights defenders assume key responsibility to realize civil, political, economic, social and cultural rights and in advancing democratic principle, practices and further in securing sustainable development in Manipur as outlined in Sustainable Development Goals. Human rights defenders also assume critical role to hold the governments accountable for violations of human rights, to support efforts to strengthen conflict prevention, and to maintain peace and security and rule of law. The United Nations Declaration on Human Rights Defenders, 1998 outlined rights for human rights defenders, obligating all States, including India to promote and protect the rights of all human rights defenders.\nThe declaration also established that states have the primary responsibility to protect defenders against violence, threats, discrimination, or any other arbitrary action as a consequence of the legitimate exercise of their rights. Governments have an obligation to ensure an enabling environment for human rights defenders so they can do their work without hindrance or undue restriction and free from fear of retribution against them and their families.\nSince the adoption of the UN Declaration on the Protection of Human Rights Defenders (HRDs), twenty years back, government of India continue to suppress rights defenders as impediments to their economic, development and political agenda. Defenders promoting fundamental rights and freedoms, environmental rights, land rights in Manipur are targeted in the form of restrictive laws that undermine freedom of association, expression, and peaceful assembly; prosecution on false charges; surveillance; death threats, arbitrary arrests and detention, torture, and extra judicial executions. Women human rights defenders also confront gender-based violence, stigmatization, criminalization and physical violence.\nIt is well established that human rights defenders in democratic and non-democratic countries are subjected to these forms of intimidation simply for being critical of government policies. India’s non–ratification of UN Convention against Torture and reservations with International Covenant on Civil and Political Rights and other human rights treaties abetted such violations on human rights defenders. Indeed, there are no legislative or institutional frameworks providing effective protection to HRDs in India. Threats to HRDs, as has been repeatedly held by experts, violate a series of rights, such as the freedoms of expression, opinion and association. In addition, as HRDs are the spokesperson of victims, silencing a HRD directly affects and demoralizes the victim.\nSituation of HRDs in Manipur: The human rights defenders in Manipur work in a situation of armed conflict with serious scale of violations perpetrated by the law enforcing agencies and the armed forces of India with impunity. The prolonged legislative and executive impunity of human rights violations persisting in Manipur in pretext of national security, with promulgation of emergency legislations, viz, Armed Forces Special Powers Act, 1958, the National Security Act, 1980, Unlawful Activities Prevention Act, 1967 etc led to targeting of innocent people, including human rights defenders.\nThreats to HRDs are not new or rare phenomena in India. Human rights defenders are subjected to violations, ranging from arbitrary killings, torture, arbitrary arrest, sexual harassment, etc. The persisting threats, ill treatment and harassment of human rights defenders of Manipur by State actors and others for their human rights activism, for promotion of right to life, right to land and natural resources, for women’s and children’s rights etc, in the context of increasing economic liberalization and related development aggressions is a serious concern. In the context of India’s economic policies, defenders engaged in denouncing development projects that threaten or destroy the land, natural resources and livelihood of their community or of other communities are also targeted by State agents.\nJournalists who investigate and uncover human rights violations or who otherwise challenge powerful interests are especially vulnerable. Human rights defenders who endeavored for preservation of indigenous peoples’ land and their rights have also suffered severe threats, often with the compliance and sometimes with direct support of the security forces. The impact of repression and the prevalence of impunity go well beyond the murdered or imprisoned human rights defenders and their families. This has also adversely affected the general public’s level of engagement with human rights issues and organizations due to the fear of reprisal.\nWomen leaders who denounced and seek redressal to human rights violations are subjected to arbitrary arrest and detention under various provisions of security laws. Several women who protested the extra judicial execution of Chungkham Shanjit by Manipur Police commandoes on 23rd July 2009 were arbitrarily arrested and detained under the National Security Act, 1980 and the Unlawful Activities Prevention Act, 1967. Ms. Irom Chanu Sharmila, a human rights defender who launched hunger strike from November 2, 2000 in protest against the AFSPA was detained for “attempting Suicide” (Section 309 of the Criminal Code). The Manipur police charged at the women with batons during a protest at the Thanga Ithing Village in Chingjin in the Bishenpur District on December 19, 2011. All the injured women were taking part in a protest organized by All Manipur Thanga People’s Welfare Association to repeal Manipur Loktak Lake Protection Act, 2006 and to decommission the Ithai Barrage of 105 MW Loktak Multipurpose Hydroelectric Project.\nMs. Margaret Sekaggya, Special Rapporteur on the situation of human rights defenders, at the press statement in the conclusion of her visit to India from 10th to 21st January 2011 stated, “I heard numerous testimonies about male and female human rights defenders, and their families, who have been killed, tortured, ill-treated, disappeared, threatened, arbitrarily arrested and detained, falsely charged, under surveillance, forcibly displaced, or their offices raided and files stolen, because of their legitimate work in upholding human rights and fundamental freedoms. These violations are commonly attributed to law enforcement authorities; however, they have reportedly also shown collusion and/or compliance with abuses committed by private actors against defenders”.\nShe also expressed concerned about the arbitrary application of security laws, the Armed Forces Special Powers Act, the Unlawful Activities Prevention Act, National Security Act, 1980 etc, which direly affects the work of human rights defenders. HRDs are stigmatized and branded as “terrorists”, “militants”, “insurgents”, “anti-development” etc.\nMs. Margarett also observed, “Although the judiciary is the primary avenue for legal redress, I have observed that its functioning is hampered by backlog and significant delays in administrating cases of human rights violations.” “The National Human Rights Commission and the existing State Human Rights Commissions is an important additional avenue where human rights defenders can seek redress. However, all the defenders I met during the mission voiced their disappointment and mistrust in the current functioning of these institutions. They have submitted complaints related to human rights violations to the Commissions, but reportedly their cases was either hardly taken up, or the investigation, often after a significant period of delay, concluded that no violations occurred. Their main concern lies in the fact that the investigations into their cases are conducted by the police, which in many cases are the perpetrators of the alleged violations.\nAnother challenge of Human Rights defenders is the increased restrictions on the functioning of human rights organizations that are critical of the State policies facilitate impunity to law enforcing agencies and armed forces for violations, and also for favoring corporate expropriation of land and resources in Manipur. Ms. Margarett expressed concern with amendment to the Foreign Contribution Regulations Act and opined such provisions are used to censor, restrict and curb the functioning of NGOs critical of Government’s policies in India, which is true for Manipur.\nThe Special Representative of the Secretary General on the situation of human rights defenders, Ms. Hina Jilani, expressed concern about increasing threats, intimidation and even murders of HRDs, often with impunity, at the hands of the state, in her report E/CN.4/2006/95/Add.5 on India. The security of HRDs is increasingly becoming a concern in the country.\nRecommendations: The importance of human rights defenders in an armed conflict afflicted state like Manipur to end all forms of human rights violations and to seek justice, and further, in fostering respect of democratic values, of culture of rights and in seeking social, economic, environmental, gender, civil and political justice and their contribution in building sustainable peace need be recognized as well.\nA law on the protection of human rights defenders should be developed in full and meaningful consultation with civil society and on the basis of technical advice from relevant UN entities should be enacted. Prompt and impartial investigations on violations committed against human rights defenders should be conducted, and perpetrator should be prosecuted.\nThe Government of India and the Government of Manipur should publicly acknowledge the importance and legitimacy of the work of human rights defenders. The Foreign Contribution Regulation Act should be critically reviewed and Government effort to curb the legitimate functioning of human rights organization should be stopped. All security legislations that provide impunity to the Government to target human rights defenders and adversely affects their safety and security, viz, the Armed Forces Special Powers Act, 1958, the National Security Act, 1980, Unlawful Activities Prevention Act, 1967 etc should be repealed Many of these laws are colonial-era laws that breach contemporary international human rights standards. The Government of India should ratify all human rights conventions, especially the UN Convention against Torture and its Optional Protocol, and fulfill its international human rights obligations. The Draft Bill on Prevention against Torture should be adopted without further delay. All parties to armed conflict in Manipur, State and non-State Actors should adhere to the principles and norms established under International humanitarian law (Common Article 3 of Geneva Convention). To protect human rights defenders, the instrumental role that human rights defenders have in building societies that embrace democratic values and human rights principles and standards need be recognized.", "url": "http://www.ifp.co.in/page/items/47257/challenges-of-human-rights-defenders-in-manipur/", "label": 1}