{"authors": [], "date_download": "2019-03-27 14:40:30", "date_modify": "2019-03-27 14:40:30", "date_publish": "2016-10-03 16:54:07", "description": "Hundreds of RJD workers in Bihar's Siwan district took to the streets on Monday to protest against their own government -- led by Chief Minister Nitish Kumar -- for the arrest of former party MP Mohammad Shahabuddin.", "filename": "patna_shahabuddin-row-rjd-workers-protest-against-own-government-bihar-2225598_1553697630.html", "image_url": "https://www.oneindia.com/img/2016/09/mohammad-shahabuddin-600-19-1474272632.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/oneindia.com/patna_shahabuddin-row-rjd-workers-protest-against-own-government-bihar-2225598_1553697630.html", "title": "Shahabuddin row: RJD workers protest against own government in Bihar", "title_page": "Shahabuddin row: RJD workers protest against own government in Bihar - Oneindia News", "title_rss": "NULL", "source_domain": "oneindia.com", "text": "Shahabuddin row: RJD workers protest against own government in Bihar\nPatna\noi-IANS\nBy Ians\nPatna, Oct 3: Hundreds of RJD workers in Bihar's Siwan district took to the streets on Monday to protest against their own government -- led by Chief Minister Nitish Kumar -- for the arrest of former party MP Mohammad Shahabuddin.\nShahabuddin had to surrender in court and was sent back to jail after the Supreme Court cancelled his bail on Friday.\nThe Rashtriya Janata Dal protestors shouted slogans, carried placards and banners and even blocked the busy JP Chowk in Siwan town disrupting traffic for hours.\nThey protested against the state's decision challenging the RJD strongman's bail which resulted in its cancellation.\n\"Slogans against Chief Minister Nitish Kumar were also raised,\" a district police official said.\nRJD is an ally of the ruling grand alliance of JD-U and Congress in Bihar.\nMost of the protestors are considered to be supporters of Shahabuddin.\nAfter surrendering in court, Shahabuddin attacked Nitish Kumar saying that his supporters would give him a fitting reply in the next assembly elections.\nThe former Lok Sabha member also stood by his earlier comment that \"Nitish Kumar is a Chief Minister of circumstances\".\nAfter Justice Jitendra Mohan Sharma of Patna High Court granted him bail on September 7, he was released from Bhagalpur Central Jail on September 10 after spending 11 years in prison.\nSiwan is considered a stronghold of Shahabuddin, who represented it in the Lok Sabha four times and twice in the state assembly.\nIANS", "url": "https://www.oneindia.com/patna/shahabuddin-row-rjd-workers-protest-against-own-government-bihar-2225598.html", "label": 1}