{"authors": ["Co-Authored Anushka Shah Zeenab Aneez"], "date_download": "2019-03-27 14:35:01", "date_modify": "2019-03-27 14:35:01", "date_publish": "2018-03-01 00:00:00", "description": "The English-language media's coverage of the farmer protests of 2017 reinforced the notion that the press has been inept in covering rural India, and presented a highly distorted picture of the protests. ​", "filename": "perspectives_indian-media-unsettling-coverage-2017-farmer-protests_1553697301.html", "image_url": "https://lh3.googleusercontent.com/PjQxnhzKUGZrPgmow4FtqVgiNq6MZuMYOkkKbr5Erygse-rnj4oUUZ2NQXcDAQ8xhIqM6uyo3ql6XtKgzhkSTvWo=w1200-h630-pp", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/caravanmagazine.in/perspectives_indian-media-unsettling-coverage-2017-farmer-protests_1553697301.html", "title": "The Indian media’s unsettling coverage of the 2017 farmer protests", "title_page": "The Indian media’s unsettling coverage of the 2017 farmer protests", "title_rss": "NULL", "source_domain": "caravanmagazine.in", "text": "Around mid March last year, a group of roughly 40 farmers from Tiruchirappalli in Tamil Nadu began a protest at Delhi’s Jantar Mantar. The protest was part of a larger agitation in the state where farmers had been demanding a waiver of all debts from nationalised banks, a drought-relief package of Rs 40,000 crore, the inter-linking of Tamil Nadu’s rivers and the setting up of a water-management board for the Kaveri.\nThe farmers decided to come to Delhi to attract the attention of the national media and thus tailored their protests for its consumption. They came up with innovative, even provocative, ways to protest: they held rats and snakes between their teeth, wore a garland of skulls which they claimed belonged to farmers who had committed suicide, threatened to consume their own urine and stripped when they were denied an audience with Prime Minister Narendra Modi. In a skit they staged, a farmer was whipped by a man wearing a Modi mask.\nThe farmers found limited success in getting responsible media coverage. While their methods saw coverage in mainstream media, the issues they had been raising barely got any attention. Given that the protest was not accompanied by digital outreach and social media campaigns, the mainstream media’s coverage formed the primary narrative of the protests. Apart from a few shows of solidarity, the protest in Jantar Mantar in Delhi was largely limited to the farmers.", "url": "https://caravanmagazine.in/perspectives/indian-media-unsettling-coverage-2017-farmer-protests", "label": 1}