{"authors": [], "date_download": "2019-03-27 14:34:48", "date_modify": "2019-03-27 14:34:48", "date_publish": "2016-06-14 08:53:55", "description": "The Congress is prone to describing the ongoing rebellion in its ranks, as also the departure of leaders from its fold, as glowing examples of opportunism bedevilling Indian politics. What the Congress fails to comprehend is that opportunism is inevitable in a system which privileges dynasty over ideology", "filename": "politics_death-of-dynastic-rule-heres-why-the-congress-is-unravelling-rapidly-2833326_1553697288.html", "image_url": "https://images.firstpost.com/wp-content/uploads/2016/06/RTS1Z5Kpost.jpg", "language": null, "localpath": "/home/raj/news-please-repo//data/2019/03/27/firstpost.com/politics_death-of-dynastic-rule-heres-why-the-congress-is-unravelling-rapidly-2833326_1553697288.html", "title": "Death of dynastic rule? Here's why the Congress is unravelling rapidly", "title_page": "Death of dynastic rule? Here's why the Congress is unravelling rapidly - Firstpost", "title_rss": "NULL", "source_domain": "firstpost.com", "text": "The Congress is prone to describing the ongoing rebellion in its ranks, as also the departure of leaders from its fold, as glowing examples of opportunism bedevilling Indian politics. What the Congress fails to comprehend is that opportunism is inevitable in a system which privileges dynasty over ideology.\nThe Congress does indeed have an ideology, nebulous though it may be seem to observers. The problem, however, arises from the fact that the Gandhis personify the party ideology. It is consequently subordinated to the family in the hierarchy of importance, exposing the Congress to the perils inherent to any dynastic rule.\nFor one, the dissidents in the Congress frame their rebellion against the wrong choices of the dynasty. What constitutes a wrong choice is defined by whether a particular strategy of the Gandhis has led the party to victory or defeat. It mounts pressure on the Gandhis to deliver, to not fail — pressure under which Rahul Gandhi palpably finds himself. Only victory can enable him to shepherd the flock together.\nParties that do not have dynasts leading them — the Bharatiya Janata Party and the Left parties for instance — do not encounter such problems. Defeat is considered a function of both the leadership failure and ideological failings.\nThis is why dissidence in such parties usually involves rebels accusing the leadership of deviating from the party’s ideology, to which they promise to adhere. No doubt, their motivation too is personal gain — acquisition of greater power and influence — but the recourse to ideology to justify their rebellion ensures internecine battles do not get unduly personalised.\nThe Gandhis don’t have such comfort.\nSince they personify the party ideology, every rebellion, willy-nilly, gets directed against them. The defiance of the Gandhis will continue to grow unless they bring a turnaround in the electoral fortunes of the Congress. As such, the Congress has been moribund in several electorally-crucial states. Defeat in other less significant states dashes the hope of Congress leaders that the Gandhis can help the party to stage a comeback.\nRegional leaders in the Congress, therefore, have little incentives in remaining loyal to the Gandhis. They feel they can better embody the Congress ideology in their personalities and enhance their power on their own.\nMamata Banerjee has demonstrated this in West Bengal, as has Himanta Biswa Sarma in Assam, albeit by switching to the BJP. Sharad Pawar has illustrated this partially in Maharashtra. Ajit Jogi and perhaps even Bhupinder Singh Hooda think they can do this in Chhattisgarh and Haryana, respectively.\nThe defeat of the Congress in the 2014 Lok Sabha, and a clutch of state Assembly elections thereafter, has sped up the breakdown of the dynastic arrangement that the Congress under Indira Gandhi had put in place.\nUnder it, a Gandhi is to lead the Congress and become prime minister in case the party wins the Lok Sabha election. Sonia Gandhi is the only exception to this rule. PV Narasimha Rao became prime minister because no Gandhi was in active politics then.\nThe political families in the states are allowed carve out their pockets of influence, their little fiefdoms, so to speak. They are given ample leeway to field their relatives or candidates of their own choice in the electoral fray, subject to the formal approval of the high command. On the death of the local dynast, one of his or her children usually inherits his or her constituency.\nThis dynastic arrangement is symbiotic — because of the charisma of the Gandhis the state-based dynasts are empowered. In turn, they organise the machinery to mobilise people and their votes for the Congress. They also accept the right of the Gandhi leading the Congress to decide who among them is to become the chief minister.\nBut this dynastic arrangement has come under crisis because the Gandhis have lost their earlier dominance and, therefore, the power to impose their will on the ‘little dynasts’. Thus, whenever the Gandhis seek to impose their will on them, the more ambitious among them don’t hesitate to rebel.\nThey often invoke the dynastic principles, not ideology, to justify their rebellion. Take the example of YS Rajasekhara Reddy in Andhra Pradesh. Not only did he vanquish N Chandrababu Naidu, he ensured a rich harvest of seats for the Congress in the 2004 Lok Sabha elections that enabled it to unexpectedly return to power at the Centre. He repeated the feat in the 2009 elections, as well.\nHis death in a plane crash in 2009 prompted Rajasekhara’s son, Jagan Mohan, to demand he succeed his father. The Gandhis blanched at his demand — how could a regional political family make such a demand on the Gandhis? After all, it is their right to choose who rules the Congress-ruled states.\nBut Jagan Mohan Reddy’s argument was that if the Gandhis could invoke the dynastic principle to preside over the Congress, why couldn’t he over Andhra Pradesh? The Congress refused to acquiesce and paid a heavy price for it in 2014.\nThe Gandhis can’t but accept the demand of regional leaders or else they must countenance rebellion. This is because the Gandhis of today, unlike Indira Gandhi, can’t guarantee victory to their regional satraps, who believe they have a better chance to succeed without the interference from the family.\nThis is the reason why Mamata Banerjee established her own party, reposing more faith in her ability rather than relying on the Gandhis to dislodge the Left. She is now grooming her nephew for politics. You can’t push Sharad Pawar around unless you have it in you to weaken him on his home turf. He has his own party, which one from his family will inherit.\nBut the logic of dynastic rule cuts the other way round, too. Once the Gandhis throw their weight behind a regional leader, they accept others to accept the decision. Rahul Gandhi backed Tarun Gogoi, triggering the departure of Sarma who was, in a way, opposing the extension of hereditary rule to Assam.\nRahul Gandhi had brought Gogoi’s son, Gaurav, into politics, and given him the ticket to fight the 2014 Lok Sabha election. Sarma feared his chance of becoming chief minister was now remote – the baton from Tarun would be eventually passed to Gaurav.\nSarma was sagacious enough to figure out that a weak high command couldn’t possibly disallow Tarun from anointing Gaurav as his successor. It could undermine the very legitimacy of Rahul’s leadership, based as it also is on the hereditary principle. Sarma’s departure had disastrous consequences for the Congress in the recent Assembly election.\nThe Gandhis expect loyalty from those whom they back in the states. But regional satraps now think this endorsement is the compulsion of the Gandhis, who can’t win the states for the party on their own. They, therefore, feel offended whenever Sonia or Rahul seek to impose decisions on them that are not to their liking.\nCall it a case of the Gandhis spoiling the regional chieftains. Jogi perhaps became too accustomed to having his way to tolerate interference from the Congress high command, bruised and battered now. In addition, Jogi has a son to bequeath his political legacy. Under the dynastic system of the Congress, it makes sense for Jogi to float his own party.\nFormer Uttarakhand chief minister Vijay Bahuguna smarted under the humiliation of having been deposed for mishandling the floods in Uttarakhand. As the eldest son of Congress veteran HN Bahuguna, he must have grown with a sense of entitlement. His logic to leave the Congress must have been thus — if Rahul can’t be asked to step down despite the many defeats he has suffered, how can a Bahuguna be removed from the chief ministership?\nNo doubt, the Gandhi must be feeling let down at Hooda’s rebellion — which has yet to become a full-fledged one. After all, they supported him right through his two tenures as chief minister. Hooda, however, thinks he has built his own support base and, anyway, he can’t blindly hitch his future to the Gandhis whose clout is rapidly diminishing. Hooda must protect his interests.\nSo if the Congress is unravelling, it is because the dynastic arrangement has begun to come apart. The glue holding the party together is undeniably the Gandhis. But the adhesiveness of the glue depends on whether or not the Gandhis can script victories for the party. Until then, the dynastic arrangement of the Congress will continue to disintegrate, regardless of pundits claiming that the party won more seats than the BJP in the recent Assembly elections.\nWorse, at every regional satrap’s rebellion, it will become even more difficult for Rahul to discover the winning touch. Even Rahul will admit that he isn’t interested in increasing the number of Congress MLAs as he is in counting the states in which his party in power. This is because only through acquisition of power can he keep the dynastic arrangement of the Congress intact.\nThe author is a journalist in Delhi. His novel, The Hour Before Dawn, has as its backdrop the demolition of the Babri Masjid. It is available in bookstores.\nFirstpost is now on WhatsApp. For the latest analysis, commentary and news updates, sign up for our WhatsApp services. Just go to Firstpost.com/Whatsapp and hit the Subscribe button.", "url": "https://www.firstpost.com/politics/death-of-dynastic-rule-heres-why-the-congress-is-unravelling-rapidly-2833326.html", "label": 1}