{"authors": ["Dharani Thangavelu"], "date_download": "2019-03-27 14:35:10", "date_modify": "2019-03-27 14:35:10", "date_publish": "2018-09-19 00:00:00", "description": "M. K. Stalin said the government at the centre has a role in the state government's corruption and both should be removed from power", "filename": "Politics_LKHS0JU9NyjCNk1dNNLAVJ_DMK-holds-protests-in-TN-seeks-resignation-of-CM-other-min_1553697310.html", "image_url": "https://images.livemint.com/rf/Image-621x414/LiveMint/Period2/2018/09/19/Photos/Processed/dmk1-k0EE--621x414@LiveMint.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/livemint.com/Politics_LKHS0JU9NyjCNk1dNNLAVJ_DMK-holds-protests-in-TN-seeks-resignation-of-CM-other-min_1553697310.html", "title": "DMK holds protests in TN, seeks resignation of CM, other ministers over graft charges", "title_page": "DMK holds protests in TN, seeks resignation of CM, other ministers over graft charges", "title_rss": "NULL", "source_domain": "livemint.com", "text": "Chennai: The opposition Dravida Munnetra Kazhagam (DMK) held a statewide protest on Tuesday demanding the resignation of Tamil Nadu chief minister Edappadi K. Palaniswami and other ministers of the ruling All India Anna Dravida Munnetra Kazhagam (AIADMK) over a slew of corruption charges.\nThis has added to the woes of the ruling party in the state, which is already facing flak over Tamil Nadu minister Kadambur Raju allegedly saying on Monday that DMK founder M. Karunanidhi was buried at Chennai’s iconic Anna Memorial because “we took pity\".\n“The AIADMK government will be removed before the 2019 Lok Sabha polls,\" said DMK president M.K. Stalin, who led a protest in the chief minister’s home town in Salem.\nStalin also trained the gun at the Bharatiya Janata Party (BJP), saying that the government at the centre has a role in the state government’s corruption and both should be removed from power.\nThe protests come against the backdrop of the Central Bureau of Investigation (CBI) earlier this month searching the residences of health minister C. Vijayabaskar and director general of police T.K. Rajendran, who are suspected of being involved in a multi-crore scam to allow the manufacture and sale of gutkha, which is banned in the state. Last year, tax authorities had searched Vijayabaskar’s properties over the same case.\nStalin alleged that the ministers and officials are in a race to abduct people’s money and that state local administration minister S. P. Velumani topped the list.\nLast week, the DMK had filed a complaint with the state Directorate of Vigilance and Anti-Corruption (DVAC) against Velumani for alleged “criminal misconduct, bribery, misappropriation and accumulation of disproportionate assets.\" The DMK accused Velumani of influencing government contracts to favour his own benami companies and laundering money.\nRecently, the DMK had also accused Palaniswami, who also holds the highways portfolio, of not using the online tender system and manipulating in the award of tenders.\nAbout seven companies, run by Velumani’s brother and close aides, have won government contracts worth hundreds of crores, the DMK complaint said.\nThis was the “fourth complaint given by the opposition party against the chief minister, deputy chief minister and the ministers for health and municipal administration\", the party said.\nWhile the allegations against the AIADMK have been increasing, the ruling party has been denying the charges and Palaniswami has been defending his cabinet colleagues. The chief minister recently claimed that the opposition parties were levelling “baseless\" charges against his government as they were “unable to withstand the growing popularity of the AIADMK government\".\nThe AIADMK last week appointed Vijayabaskar as one of the organising secretaries of the party, a key role, even as there were strong demands for his resignation as health minister.", "url": "https://www.livemint.com/Politics/LKHS0JU9NyjCNk1dNNLAVJ/DMK-holds-protests-in-TN-seeks-resignation-of-CM-other-min.html", "label": 1}