{"authors": [], "date_download": "2019-03-27 14:40:28", "date_modify": "2019-03-27 14:40:28", "date_publish": "2017-06-15 20:00:06", "description": "Congress vice-president Rahul Gandhi on Thursday slammed the Madhya Pradesh government for not lodging any FIR in the killing of protesting farmers in the state.", "filename": "politics_farmers-protest-rahul-gandhi-slams-madhya-pradesh-govt-for-no-fir-in-mandsaur-killings-3664613_1553697628.html", "image_url": "https://images.firstpost.com/wp-content/uploads/2017/06/Rahul-Gandhi_380_PTI.jpg", "language": null, "localpath": "/home/raj/news-please-repo//data/2019/03/27/firstpost.com/politics_farmers-protest-rahul-gandhi-slams-madhya-pradesh-govt-for-no-fir-in-mandsaur-killings-3664613_1553697628.html", "title": "Farmers' protest: Rahul Gandhi slams Madhya Pradesh govt for no FIR in Mandsaur killings", "title_page": "Farmers' protest: Rahul Gandhi slams Madhya Pradesh govt for no FIR in Mandsaur killings - Firstpost", "title_rss": "NULL", "source_domain": "firstpost.com", "text": "New Delhi: Congress vice-president Rahul Gandhi on Thursday slammed the Madhya Pradesh government for not lodging any FIR in the killing of protesting farmers in the state.\n\"Nine days on, 45 FIRs against protesting farmers, but not one against those who murdered six farmers in cold blood in Mandsaur,\" wrote Gandhi on his official Twitter account.\nNine days on, 45 FIRs against protesting farmers, but not one against those who murdered 6 farmers in cold blood? #Mandsaur https://t.co/IZB3qaZR24 — Office of RG (@OfficeOfRG) June 15, 2017\nFarmers in Madhya Pradesh were on protest from 1 June demanding better prices for their produce and debt relief. The agitation turned violent on 6 June when five farmers were killed in police firing in Mandsaur.\nFirstpost is now on WhatsApp. For the latest analysis, commentary and news updates, sign up for our WhatsApp services. Just go to Firstpost.com/Whatsapp and hit the Subscribe button.", "url": "https://www.firstpost.com/politics/farmers-protest-rahul-gandhi-slams-madhya-pradesh-govt-for-no-fir-in-mandsaur-killings-3664613.html", "label": 1}