{"authors": [], "date_download": "2019-03-27 14:28:59", "date_modify": "2019-03-27 14:28:59", "date_publish": "2018-12-12 00:00:00", "description": "Uttar Pradesh BJP spokesperson Rakesh Tripathi said the party has given no such instructions", "filename": "politics_fearing-black-flag-protests-bjp-and-congress-impose-unofficial-ban-on-dark-clothes-at-rallies-even-undergarments-not-spared-5788411_1553696939.html", "image_url": "https://images.firstpost.com/wp-content/uploads/2018/12/1280.jpeg", "language": null, "localpath": "/home/raj/news-please-repo//data/2019/03/27/firstpost.com/politics_fearing-black-flag-protests-bjp-and-congress-impose-unofficial-ban-on-dark-clothes-at-rallies-even-undergarments-not-spared-5788411_1553696939.html", "title": "Fearing black flag protests, BJP and Congress impose unofficial ban on dark clothes at rallies; even undergarments not spared", "title_page": "Fearing black flag protests, BJP and Congress impose unofficial ban on dark clothes at rallies; even undergarments not spared - Firstpost", "title_rss": "NULL", "source_domain": "firstpost.com", "text": "The colour of one's socks is nobody's business. Certainly not the country's largest political parties. However, if one is headed to a public rally of their top leaders, they'd like to know. And it better not be black. Of late, security at political rallies have been instructed to make sure no one wearing black — not even a stitch of it — gets past the gate.\nNo exceptions: Be it men, women or even children. Inner or outer wear. Sikh men with black turbans or Muslim women in burkhas. Behind this diktat, lies the politicos' anxiety that dissenters may sneak in as audience members, turn the black clothing into a flag and thus leave a black mark on their image building programme. This past year saw multiple instances of individuals being denied entry to political rallies for the sin of wearing black, being asked to take off their clothing and even having had the colour of their inner wear inspected.\nBJP's fear of black\nFor Prime Minister Narendra Modi's public meeting in Jaipur on 7 July — he was scheduled to interact with beneficiaries of a government scheme — unsuspecting audience members were summarily told to discard their black clothing or leave. A heap of clothes — mufflers, handkerchiefs, bags, jackets, caps, socks and inner wear — was seen piling up at the entrance. Those who donned black shirts or pants stood helpless outside the venue, pleading with security to let them in, to no avail.\nIt was later reported that local administration was given strict instructions to prohibit any black items to avoid a repeat of the 8 March public rally in Jhunjhunu, Rajasthan. At this event, when Modi was on stage with the then chief minister Vasundhara Raje, a few disgruntled contract workers disrupted Raje's speech by waving black flags and raising slogans. A Jaipur-based journalist who did not wish to be identified said that after this incident, police became extra cautious about not allowing in black clothing to enter such high-profile events.\nIn January, BJP president Amit Shah and Uttar Pradesh chief minister Yogi Adityanath held a rally in Varanasi. The authorities refused entry to individuals wearing black. In October, Shah addressed a women's convention in Chhattisgarh. The same protocol was followed and pictures of black clothing being confiscated at the entrance of the venue went viral. It was also reported that women's undergarments were inspected and searched, all to ensure no black flags were smuggled into the venue.\nA senior journalist — working for an international publication — covering this event witnessed this first-hand. Requesting anonymity, the journalist narrated how each person entering the venue was inspected diligently. A local journalist pointed out how at the time, the then state Congress president Bhupesh Baghel — now Chhattisgarh chief minister — was jailed over a sex CD case and that Congress members threatened to show black flags to BJP leadership to express dissent at his arrest. The journalist said it was this threat which spurred on vigilance about black clothing from the administration.\nIn September, a balloon seller in Madhya Pradesh's Satna was arrested and taken to court because the black balloons he sold were released — in protest — at a convention presided over by the then chief minister Shivraj Singh Chouhan. In August, Uttar Pradesh-based journalist Kumari Ranjana — a veteran political scribe — detailed in a Facebook post how, at an event, a member of Chouhan's security team objected to her black dupatta.\nIn her post, she said that while she had often heard and read about this, it was the first time this was happening to her in an 18-year career. Ranjana said she refused to give in and walked past security. Ranjana said she didn't take this incident seriously and has not been stopped on other occasions, perhaps because she's a regular face at government programmes.\nA couple of months earlier, Ankit Singh Babu, a student leader at Lucknow University, spent more than a week behind bars for showing a black flag to Adityanath's convoy and raising slogans against him. Though Babu's later demonstrations against Adityanath — blocking his convoy and jumping on his car — attracted criminal charges, he was earlier jailed for merely waving black flags at Adityanath (from across the road) and sloganeering: as this reporter witnessed.\nThe BJP's alleged intolerance of black flags goes back more than a year. As per a report from Dehradun, last December, even as Modi held a rally in the Himalayan state capital, the public was asked to remove their black clothing and headgear despite the biting cold.\nCongress no better\nThe Congress isn't immune from this black flag phobia either. Rajasthan's new chief minister and his deputy, Ashok Gehlot and Sachin Pilot, have openly criticised Modi and Raje for barring the entry of people wearing black in their rallies, calling them \"paranoid\" of criticism. However, the election rally of Congress president Rahul Gandhi in Chhattisgarh in November, too, saw those wearing black being halted at the gate.\nThis reporter, wearing a black T-shirt, was barred from entering the venue in Bastar. The Central Reserve Police Force (CRPF) men at the gate said they had orders from above, although they failed to specify who issued the order (despite persistent questioning). One CRPF jawan pleaded, \"Sir, please understand. Change your T-shirt. You can have my shirt, but we can't let you in with black clothes. You and I have no bad blood, but if we let you in wearing black, we might lose our jobs.\"\nOn seeking the intervention of senior Chhattisgarh Congress leader TS Singh Deo — who was in the race for the chief minister's post — this reporter was informed (by his personal assistant) in no uncertain terms that if the T-shirt was not changed, the reporter would be not be allowed to enter the venue. Five days later, this reporter was stopped at the gate of Modi's election rally in Ambikapur for the same reason.\nWhodunnit\nUttar Pradesh BJP spokesperson Rakesh Tripathi said he has received complaints of people being denied entry at party events for wearing black. He said the party has given no such instructions and that it is the local authorities who undertake such initiatives to impress their political masters. Tripathi said such criticism is a sign of a healthy democracy. He recalled how, as a student leader, he showed black flags to politicos on more than one occasion. He further added that action should be taken against protesters only when security is breached.\nDinesh Tripathi, Superintendent of Police (City Range) Saharanpur — where Modi addressed a rally in April — said officers aren't given any written or oral orders regarding barring people in black. He said police act on their own to prevent any black flag protest. Samajwadi Party spokesperson Abdul Hafiz Gandhi said criticism, including showing black flags to politicians, is part of the fundamental right to freedom of speech and expression. He said it has become commonplace to harass those who show up at political rallies wearing black and called this scrutiny \"illegal\".\nJournalist Indrajit Singh — who has been in the professional since the days of Indira Gandhi — noted that the politicos' intolerance of black flags is a new phenomenon. He said leaders such as Atal Bihari Vajpayee stopped their convoy and heard the protesters out, but today's politicians lack such pluck.\n\"Such a protest is considered healthy for a democracy,\" Singh said. \"Everyone has a right to do so. However, this new trend of not barring people at public gatherings, stopping journalists or charging those protesting in this manner with serious criminal offences is most unfortunate.\"\nSaurabh Sharma is a Lucknow- based freelance writer and a member of 101Reporters.com\nFirstpost is now on WhatsApp. For the latest analysis, commentary and news updates, sign up for our WhatsApp services. Just go to Firstpost.com/Whatsapp and hit the Subscribe button.", "url": "https://www.firstpost.com/politics/fearing-black-flag-protests-bjp-and-congress-impose-unofficial-ban-on-dark-clothes-at-rallies-even-undergarments-not-spared-5788411.html", "label": 1}