{"authors": [], "date_download": "2019-03-27 14:18:19", "date_modify": "2019-03-27 14:18:19", "date_publish": "2018-05-24 00:00:00", "description": "H.D. Kumaraswamy was sworn in as the 24th chief minister of Karnataka in Bengaluru today at 4.30pm. Here are the latest updates and developments", "filename": "Politics_TtTxd3gDtnO4oRINnOQtbI_Karnataka-LIVE-Kumaraswamy-swearing-in-today-Congress-JDS_1553696299.html", "image_url": "https://images.livemint.com/rf/Image-621x414/LiveMint/Period2/2018/05/24/Photos/Home Page/Karnataka2-U20572770713w8H--621x414@LiveMint.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/livemint.com/Politics_TtTxd3gDtnO4oRINnOQtbI_Karnataka-LIVE-Kumaraswamy-swearing-in-today-Congress-JDS_1553696299.html", "title": "Karnataka highlights: H.D. Kumaraswamy sworn in as chief minister", "title_page": "Karnataka highlights: H.D. Kumaraswamy sworn in as chief minister", "title_rss": "NULL", "source_domain": "livemint.com", "text": "Mamata, Naidu pitch for all regional parties to band together\nWest Bengal CM Mamata Banerjee and her Andhra Pradesh counterpart Chandrababu Naidu today pitched for all regional parties to come together for development of a federal setup in the country. Both Banerjee and Naidu said they were happy that the leader of a regional party was assuming office and they were here to express their solidarity with the JDS. “We will keep in touch with all the regional parties so that we can work for the development of the nation, development of the people and development of the federal set-up also,” the West Bengal chief minister added. On his part, Naidu expressed happiness about a leader of a regional party taking over as the chief minister of Karnataka. “I met Mamata ji and we all have come here to witness the swearing-in ceremony of Kumaraswamy. He is from a regional party and we are very happy that he has become the Chief Minister of Karnataka,” he said.", "url": "https://www.livemint.com/Politics/TtTxd3gDtnO4oRINnOQtbI/Karnataka-LIVE-Kumaraswamy-swearing-in-today-Congress-JDS.html", "label": 1}