{"authors": ["Abhiram Ghadyalpatil"], "date_download": "2019-03-27 14:40:27", "date_modify": "2019-03-27 14:40:27", "date_publish": "2017-06-08 00:00:00", "description": "PM Narendra Modi holds emergency meeting with key ministers over Madhya Pradesh farmers protests, state govt announces sops but no farm loan waivers", "filename": "Politics_phxjkcbWLuQR6TIHx53AFI_Farmers-stir-continues-in-Madhya-Pradesh-govt-tries-to-dou_1553697627.html", "image_url": "https://images.livemint.com/rf/Image-621x414/LiveMint/Period2/2017/06/08/Photos/Processed/MadhyaPradesh-kN3C--621x414@LiveMint.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/livemint.com/Politics_phxjkcbWLuQR6TIHx53AFI_Farmers-stir-continues-in-Madhya-Pradesh-govt-tries-to-dou_1553697627.html", "title": "Madhya Pradesh farmers protests continue even as govt tries to douse fire", "title_page": "Madhya Pradesh farmers protests continue even as govt tries to douse fire", "title_rss": "NULL", "source_domain": "livemint.com", "text": "Mumbai/New Delhi: The farm unrest in Bharatiya Janata Party (BJP)-ruled Madhya Pradesh escalated on Wednesday even as Prime Minister Narendra Modi held an emergency meeting with home minister Rajnath Singh, agriculture minister Radhamohan Singh, external affairs minister Sushma Swaraj (who is an MP from Vidisha in Madhya Pradesh) and minister for road transport and highways Nitin Gadkari in Delhi to take stock of the situation. What transpired at this meeting was not known till the filing of this report.\nFollowing the escalation of violence, the Madhya Pradesh home ministry has written to the Union home ministry asking for additional troops. Senior officials have said that additional companies of the Central Reserve Police Force (CRPF) will be deployed soon to contain violence.\nMadhya Pradesh farmers protest: A timeline\nIn Bhopal, chief minister Shivraj Singh Chouhan met members his cabinet and announced several measures to defuse the situation. The state government is yet to announce a farm loan waiver.\nA press release issued by the Madhya Pradesh government said government procurement centres have been set up to start purchase of moong (green gram), urad (split black gram), and tur (pigeon pea or red gram) from 10 June, at the government-determined minimum support prices (MSPs) of Rs5,225, Rs5,000 and Rs5,050 per quintal. Chouhan said the government had already started procuring onions at Rs8 per kilogram at 48 centres spread over 22 onion-growing districts. Madhya Pradesh is also creating a Rs1,000 crore price stabilization corpus to help the government and farmers tide over price fluctuations.\nChouhan also announced formation of the Madhya Pradesh Agriculture Investment and Marketing Commission to study the cost of production of farm produce and determine the quantum of profit to be paid to farmers over and above MSP.\nFarmers in Madhya Pradesh have been protesting since 1 June demanding better prices for their produce including onions, arhar, and moong. On Tuesday, a farmers’ protest in Mandsaur district of western Madhya Pradesh turned violent, where six were killed in firing. The state government has ordered a judicial probe into the firing.\nThe protests which began in Mandsaur spread to adjoining districts of Ujjain, Ratlam, Dewas and Neemach on Wednesday. News channels reported that angry farmers torched vehicles, shops, automobile showrooms, and blocked roads and the Ratlam-Neemach railway line. News agency ANI reported that protesting farmers scuffled with Mandsaur district collector Swatantra Kumar Singh and chased away officials. Several public transport buses on the Indore-Bhopal road were damaged and torched.\nA statewide bandh called by the opposition Congress party was near total in western Madhya Pradesh and evoked mixed response elsewhere, according to news channels. Arun Yadav, president of Madhya Pradesh Congress Committee, told Mint over the telephone that the bandh was a “historic success\".\nThe Mandsaur-Neemach belt in Madhya Pradesh borders Rajasthan while the Gujarat border is also not far from the adjoining Jhabua district. The six persons who were killed in firing on Tuesday belong to the powerful Patidar community which has a strong presence in the Mandsaur-Neemach belt. Madhya Pradesh Patidar Samaj is one of the organizations participating in the protest and the BJP fears the farmers’ unrest may lead to further alienation of the Patidar community from the party in the wake of the Patidar agitation in Gujarat.\nMadhya Pradesh BJP spokesperson Hitesh Bajpai told Mint that the opposition Congress had joined the Patidars in Mandsaur belt in a bid to create a “replica of the Patidar stir in Gujarat\" in Madhya Pradesh. “They want to turn this into another Patidar versus BJP stir. We have addressed each and every demand of farmers and we have reason to believe that no farmer has resorted to the kind of violence and arson unleashed in the region. There are non-farm actors in this conspiracy who have created a riot-like situation,\" Bajpai said.\nHe also claimed a link between violent protests in the neighbouring BJP-ruled state of Maharashtra and Madhya Pradesh. “This is not a farmers’ agitation. This is an anti-BJP agitation in both the states sponsored by opposition parties,\" he said.\nThe BJP spokesperson said Madhya Pradesh, with an average annual agriculture sector growth rate of more than 13% since 2010, was the most unlikely place for a farmers’ protest. “There is no other state in India which has the kind of farmer-centric policies as Madhya Pradesh does. Their genuine demands for better prices for arhar, urad, moong, and onion have been addressed,\" Bajpai added.\nYadav, however, dismissed these claims saying the Congress would stand with farmers. “No farm produce in Madhya Pradesh is getting MSP. Farmers have also been demanding loan waiver but Chouhan is busy making grand statements. Madhya Pradesh has passed an amendment to the Central Land Acquisition Act of 2013 by which the state government is free to pay compensation to farmers only two times higher than the market value when the central law mandates that it should be four times higher,\" Yadav added.\nIndore-based progressive farmer, businessman, and Bharatiya Kisan Sangh (BKS) functionary Shreekant Zamindar, also rejected the claims made by Bajpai. BKS is a Rashtriya Swayamsevak Sangh (RSS) affiliate and it was BKS which initially spearheaded the agitation in Madhya Pradesh but called it off after Chouhan promised onion procurement. He said the farm scenario in Madhya Pradesh is not as rosy as the statistics the government presents. “Farmers in Madhya Pradesh are in deep crisis. In addition to the lack of better prices, farmers are also angry over the land acquisition Act passed by the Chouhan government two months back. The Act gives sweeping powers to development authorities and bodies to acquire farm land and unilaterally determine the quantum of compensation to farmers. Farmers have no say in this,\" Zamindar told Mint", "url": "https://www.livemint.com/Politics/phxjkcbWLuQR6TIHx53AFI/Farmers-stir-continues-in-Madhya-Pradesh-govt-tries-to-dou.html", "label": 1}