{"authors": ["Nidheesh M.K."], "date_download": "2019-03-27 14:25:46", "date_modify": "2019-03-27 14:25:46", "date_publish": "2017-02-25 00:00:00", "description": "Sangh Parivar outfits oppose Kerala CM Pinarayi Vijayan's visit to Mangalore tomorrow for his 'involvement' in violence against their activists in his home turf, Kannur", "filename": "Politics_WB8BACGwjfbqD6jlutsyvO_Sangh-Parivar-activists-oppose-Kerala-CMs-visit-to-Mangalor_1553696746.html", "image_url": "https://images.livemint.com/rf/Image-621x414/LiveMint/Period2/2017/02/25/Photos/Processed/pinarayivijayan2-kQc--621x414@LiveMint-b7d6.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/livemint.com/Politics_WB8BACGwjfbqD6jlutsyvO_Sangh-Parivar-activists-oppose-Kerala-CMs-visit-to-Mangalor_1553696746.html", "title": "Sangh Parivar activists oppose Kerala CM’s visit to Mangalore tomorrow", "title_page": "Sangh Parivar activists oppose Kerala CM’s visit to Mangalore tomorrow", "title_rss": "NULL", "source_domain": "livemint.com", "text": "Bengaluru: Tension prevails in South Karnataka district after Sangh Parivar outfits started protests against Kerala chief minister Pinarayi Vijayan’s scheduled visit to Mangalore on Saturday.\nWhile the police have tightened security in the area ahead of his visit, the office of Vijayan’s Communist Party of India (Marxist), or CPM, was set on fire by unidentified persons in Mangalore’s Thokkottu on Thursday.\nVijayan is supposed to attend a peace rally for communal harmony in the district. However, Hindu nationalist associations, including Rashtriya Swayamsevak Sangh (RSS) and Vishwa Hindu Parishad (VHP), are opposed to hs visit. They are alleging that the CM is involved in political violence against Sangh Parivar activists in his home turf, Kannur.\nRSS spokesperson Rajesh Padmar was unavailable for comment.\nJagadish Shenava, district president of VHP and Hindu Jagarana Vedike, said in a press statement that they were “anguished over the participation of Vijayan in the convention and were not against the event per se,\" reported The Hindu on Friday.\nIn December, Vijayan was forced to abandon a felicitation programme in Bhopal after security threats over RSS protests.\nIn January, he was again forced to cut short a trip to Delhi over intelligence reports, which said that a RSS protest march to where he was staying could turn violent.\nThis time, however, Vijayan is firm on going ahead of the visit, said CPM Karnataka secretary G. V. Srirama Reddy.\n“I’ve spoke to him, he is firm on coming. We also met (Karnataka) with chief minister Siddharamaiah. He has assured all help on the law and order front,\" said Reddy.", "url": "https://www.livemint.com/Politics/WB8BACGwjfbqD6jlutsyvO/Sangh-Parivar-activists-oppose-Kerala-CMs-visit-to-Mangalor.html", "label": 1}