{"authors": [], "date_download": "2019-03-27 14:18:28", "date_modify": "2019-03-27 14:18:28", "date_publish": null, "description": "Warning that simultaneous elections goes against the basic tenets of the Constitution, DMK opposed the idea, saying it was unwarranted and practically not possible.", "filename": "politics_simultaneous-polls_3de3f911b6984b46c347527a964840e8_84636_1553696308.html", "image_url": "https://www.btvi.in/media/images/news/2e31f3cba9296851a45bd3a5d4016360.jpg", "language": null, "localpath": "/home/raj/news-please-repo//data/2019/03/27/btvi.in/politics_simultaneous-polls_3de3f911b6984b46c347527a964840e8_84636_1553696308.html", "title": "Simultaneous polls unwarranted, practically not possible: DMK", "title_page": "Simultaneous polls unwarranted, practically not possible: DMK", "title_rss": "NULL", "source_domain": "btvi.in", "text": "New Delhi: Warning that simultaneous elections goes against the basic tenets of the Constitution, the DMK on Sunday opposed the idea, saying it was unwarranted and practically not possible.\n\"In sum, the present proposal of the Law Commission seems to be a complete misadventure that will decimate the federal structure. I respectfully submit my party's whole hearted opposition to the proposal,\" DMK Working President M.K. Stalin informed the Law Commission in writing.\n\"The DMK is of the firm opinion the the proposed call for simultaneous elections goes against the basic tenetes of the Constitution and established principles of democratic functioning,\" he said.\nThe DMK on Sunday attended the meeting convened by the Law Commission on the feasibility of holding simultaneous polls for the Lok Sabha and state Assemblies.\nSenior DMK leader Tiruchi Siva attended the meeting, which began here on Saturday, and presented his party's view in writing too.\n\"Our contention is that the Constitution has to be upheld in all manner. Though Parliament is empowered to amend the Constitution, there are basic features of the Constitution which cannot be abrogated. Any proposal to amend basic fundamental tenets threatens to tear apart the fabric holding the nation together,\" Siva told reporters after the meeting.\nWhile opposing the idea of simultaneous polls, Siva slammed the government, saying the attempt was to divert people's focus from the issues of their concern.\n\"Country does not need simultaneous polls. We have got so many crucial issues which the government has to address. They are trying to divert the focus of the people from real issues of concern. It is unwarranted and practically not possible,\" he said.\nHe also dismissed the idea that conducting simultaneous elections in the country would save the government \"massive expenditures\".\n\"Procurement of EVMs and VVPATs alone for conducting simultaneous elections would cost about 10,000 crore (recurring every 15 years). The entire expenditure borne by the central government for conducting general elections in 2014 was only Rs 3,870 crore or roughly Rs 45 per elector. It is not clear how this can be considered massive or how spending thousands of crore would be more efficient,\" he said.\nThe DMK leader also said that comparing Sweden (population of 1 crore), Belgium (1.1 crore) and South Africa (5.5 crore) - countries which hold simultaneous elections - is \"logically fallacious and completely misleading\" considering the population of India (132 crore).\n\"The population of Tamil Nadu is around eight crore,\" he said.\nConveying its views to the Law Commission in writing, the party said the proposal was a \"useless\" exercise, both from a legal and political point, which could put the credibility of the Law Commission in danger.\n\"The Law Commission, on the request of the previous BJP-led government under Atal Bihari Vajpayee, studied and reported on this very same issue in its 1999 report. No action has been taken upon its recommendations so far.\n\"Meanwhile, the Parliamentary Standing Committee on Personnel, Public Grievances, Law and Justice, in its 2015 report has concluded that gaining consensus of all political parties may be difficult and that holding simultaneous elections may not be feasible in 2016 or even in a decade,\" the party said.\n(IANS)", "url": "https://www.btvi.in/politics/simultaneous-polls-unwarranted--practically-not-possible--dmk/84636", "label": 1}