{"authors": [], "date_download": "2019-03-27 14:18:30", "date_modify": "2019-03-27 14:18:30", "date_publish": null, "description": "Jitendra Singh said BJP has set an example by breaking its alliance with PDP without any pressure as discrimination with Jammu region was not acceptable.", "filename": "politics_bjp-has-set-exampl_e6118342cf5323d6e26c0e5e4120e46c_84640_1553696310.html", "image_url": "https://www.btvi.in/media/images/news/d1cba04a3f3cbd6ae306342dad67e6c9.jpg", "language": null, "localpath": "/home/raj/news-please-repo//data/2019/03/27/btvi.in/politics_bjp-has-set-exampl_e6118342cf5323d6e26c0e5e4120e46c_84640_1553696310.html", "title": "BJP has set example by breaking alliance with PDP over discrimination against Jammu: Minister", "title_page": "BJP has set example by breaking alliance with PDP over discrimination against Jammu: Minister", "title_rss": "NULL", "source_domain": "btvi.in", "text": "Jammu: Weeks after the fall of Mehbooba Mufti government, Union minister Jitendra Singh today said BJP has set an example by breaking its alliance with PDP without any pressure as discrimination with Jammu region was not acceptable to the party.\nHe said the decision of the BJP has baffled the opposition parties in Jammu and Kashmir which have never witnessed such a thing in their political history.\nBJP is the only party which can become part of any government to carry forward developmental agenda or can break away if it is not satisfied with the pace of development works It is not acceptable to the BJP to stay in power while compromising with the interests of the people of Jammu region, he said.\nSingh, the minister of state in Prime Minister's office, was speaking to reporters on the sidelines of a party function in Kathua district.\nBJP broke its alliance with PDP last month leading to the collapse of the coalition government and imposition of Governor's rule.\nWhatever the circumstances, there will be no compromise with the interests of the Jammu region, he said, adding BJP has set an example by walking out of the government.\nHe said the opposition parties are frustrated because they are not able to understand what had happened that led to the decision.\nTheir tradition and their politics have not seen such an example in the past. They have not learnt it.\nThe opposition is puzzled when without any pressure you come out of power because you feel you are not able to fulfil your developmental agenda for the people, he said.\nBJP is the only party which can be part of the government for the interest of the people of Jammu region and can say goodbye to the power for the sake of the people, he said.\nSingh addressed party workers at Barnoti village in the district.\nAsked whether the meeting was part of the party's preparation for the next year's Lok Sabha elections, he said, BJP is the only political party in the country which is ready for any type of polls all the time.\nSuch meetings are taking place all the time round-the-year to discuss current issues being faced by the people. It is not focused on elections.\n\"BJP is the only party which holds such meetings round the year and always prepared to face all type of elections. BJP is the only party which is linked to the people at the gross-roots level, he said.\nThe minister said there is no possibility of discrimination with Jammu region under the leadership of Prime Minister Narendra Modi,\nWith full authority, I want to make it clear that over the last four years of Modi government, there was no discrimination with any part of the region as far as financial and development packages are concerned,\" he said.\nThis year, Rs 3800 crore was sanctioned under PMGSY for the state, out of which Rs 2100 crore were meant for Jammu region, he said.\nThis included Rs 1700 crore for Kathua, Udhampur and Doda districts - three medical colleges were to be established here and two others there (Kashmir), the minister said.\nThe Union Cabinet recently decided to seek seven acre of land at Udhmapur from defence ministry and yesterday the land was identified for setting up of Kendriya Vidyalaya, he said.\nWhen there is discrimination due to some local reasons, then BJP showed it can give up power without a second thought, he said.\nIn response to a question about the prolonged agitation by Anganwadi workers and helpers in support of their demands including hike in honorarium, the union minister said he had personally suggested the state government look into the issue and increase the honorarium from its resources like other states of the country such as Delhi had done.\nThe Anganwadi workers and helpers are on strike since February 1 in support of their demands which include implementation of the pension scheme, release of pending salaries and gratuity of Rs two lakh for workers and Rs one lakh for helpers on retirement.\n(PTI)", "url": "https://www.btvi.in/politics/bjp-has-set-example-by-breaking-alliance-with-pdp-over-discrimination-against-jammu--minister/84640", "label": 1}