{"authors": [], "date_download": "2019-03-27 14:35:32", "date_modify": "2019-03-27 14:35:32", "date_publish": "2015-02-25 22:57:00", "description": "National News – CLP members protest against resignation of MP Governor", "filename": "politics_national_congress-stages-protest-demanding-mp-governor-s-resignation-26810_1553697332.html", "image_url": "https://resize.indiatvnews.com/en/resize/newbucket/715_-/politicsnational/IndiaTvb066c3_Satyadev-Katare.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/indiatvnews.com/politics_national_congress-stages-protest-demanding-mp-governor-s-resignation-26810_1553697332.html", "title": "Congress stages protest demanding MP Governor's resignation", "title_page": "Congress stages protest demanding MP Governor's resignation|IndiaTV News | National News – India TV", "title_rss": "NULL", "source_domain": "indiatvnews.com", "text": "congress stages protest demanding mp governor s resignation\nBhopal:Congress Legislature Party (CLP) members today staged a protest demanding the resignation of Madhya Pradesh Governor Ram Naresh Yadav, amid intense speculation that he has resigned from his post after an FIR was registered against him in connection with the MPPEB scam.\nCLP members led by Leader of Opposition Satyadev Katare staged the protest outside Raj Bhawan and expressed surprise that despite his name figuring in the MPPEB or Vyapam mega recruitment scam, he has not tendered his resignation.\nThe Congress MLAs gathered in front of the Raj Bhawan and raised slogans against Yadav and Madhya Pradesh Chief Minister Shivraj Singh Chouhan, demanding their resignations.\nKatare said that the Governor has not yet put in his papers and alleged that Chouhan is trying to shield him. If he failed to resign immediately, the Congress would intensify its agitation against him, he said.\nFormer Leader of Opposition Ajay Singh said that since 2013, people knew that the Governor has been shielding the Shivraj Singh Chouhan government. He should have resigned after the arrest of his officer on special duty Dhanraj Yadav in the scam, if he had any morality, Singh said.\nMeanwhile, despite media reports stating that Yadav\nhas resigned, top Raj Bhawan Officials maintained that he has\nnot resigned so far", "url": "https://www.indiatvnews.com/politics/national/congress-stages-protest-demanding-mp-governor-s-resignation-26810.html", "label": 1}