{"authors": [], "date_download": "2019-03-27 14:29:21", "date_modify": "2019-03-27 14:29:21", "date_publish": null, "description": "He attacked the Congress, the SP and the BSP for allegedly exploiting and dividing voters through caste politics and appeasement to suit their needs.", "filename": "politics_bjp-govt-achieved-_8fa2e83725d6518a060a6953e433f8ec_54483_1553696961.html", "image_url": "https://www.btvi.in/media/images/news/a1d9b74685ee73e581988ab9fc4dc932.jpg", "language": null, "localpath": "/home/raj/news-please-repo//data/2019/03/27/btvi.in/politics_bjp-govt-achieved-_8fa2e83725d6518a060a6953e433f8ec_54483_1553696961.html", "title": "BJP govt achieved goals not attained by previous govts: Yogi", "title_page": "BJP govt achieved goals not attained by previous govts: Yogi", "title_rss": "NULL", "source_domain": "btvi.in", "text": "Rampur: Uttar Pradesh Chief Minister Yogi Adityanath today said the BJP government in the state had, in ten months, achieved development goals which were not achieved by the former BSP and SP dispensations during their long tenures.\nAdressing a public gathering here, he attacked the Congress, the SP and the BSP for allegedly exploiting and dividing voters through caste politics and appeasement to suit their needs.\nAdityanath said Prime Minister Narendra Modi had given a very clear message against appeasement policies.\nThe chief minister said the BJP government in the state had achieved development goals in the last ten months which the SP and the BSP could not achieve during their long tenures.\nHe also enumerated several welfare schemes of the government, including enhancement of pension for Divyangs from Rs 300 to Rs 500.\nHe also hit out at former state minister Azam Khan, without naming him, over the \"hooliganism\" allegedly prevailing in the city.\nAdityanath alleged that the worst type of hooliganism existed in the city as shops and residences of people were demolished \"mercilessly\".\nHe also hit out at the previous government, alleging that on the pretext of constructing a jail, it had planned to displace 250 families from a colony.\nAdityanath termed it as anarchy and said that as long as the BJP was in power such incidents would not occur.\n(PTI)", "url": "https://www.btvi.in/politics/bjp-govt-achieved-goals-not-attained-by-previous-govts--yogi/54483", "label": 1}