{"authors": [], "date_download": "2019-03-27 14:29:21", "date_modify": "2019-03-27 14:29:21", "date_publish": null, "description": "The Jammu and Kashmir unit of the BJP said it would press for early panchayat polls at the all party meeting to be chaired by Chief Minister Mehbooba Mufti tomorrow.", "filename": "politics_j-k-bjp-to-press-f_c3fc579cdf67b13332262e0b390b7c66_54477_1553696961.html", "image_url": "https://www.btvi.in/media/images/news/eca4b99b0bb8d83e2ad601bb33e232f9.jpg", "language": null, "localpath": "/home/raj/news-please-repo//data/2019/03/27/btvi.in/politics_j-k-bjp-to-press-f_c3fc579cdf67b13332262e0b390b7c66_54477_1553696961.html", "title": "J-K BJP to press for early panchayat polls at all-party meet", "title_page": "J-K BJP to press for early panchayat polls at all-party meet", "title_rss": "NULL", "source_domain": "btvi.in", "text": "Jammu: The Jammu and Kashmir unit of the BJP said today it would press for early panchayat polls at the all party meeting to be chaired by Chief Minister Mehbooba Mufti tomorrow.\nMinister for Rural Development, Panchayati Raj, Law and Justice, Abdul Haq Khan, said yesterday the meeting was called with an to seek views of all political parties on the polls. The BJP governs the state in alliance with Mufti's PDP.\nA BJP state unit spokesman said its state president Sat Sharma and other leaders will represent the party at the meeting.\n\"The BJP will press for early panchayat elections in the state,\" he said after a meeting of state core committee.\nThe spokesman said the core committee unanimously decided that it is mandatory to hold elections in a time-bound manner which would eventually lead to the decentralisation of power.\nThe government had decided to hold the panchayat polls from February 15 after a meeting between Mufti and Governor N N Vohra in December.\nTwo days after their meeting, separatist leaders Syed Ali Geelani, Mirwaiz Umar Farooq and Mohammad Yasin Malik in a joint statement called for boycotting the upcoming elections.\nMilitant-outfit Hizbul Mujahideen last month threatened to throw acid on those who will participate in the polls.\n(PTI)", "url": "https://www.btvi.in/politics/j-k-bjp-to-press-for-early-panchayat-polls-at-all-party-meet/54477", "label": 1}