{"authors": [], "date_download": "2019-03-27 14:18:30", "date_modify": "2019-03-27 14:18:30", "date_publish": "2016-08-09 16:05:00", "description": "Aiming to expand the base of Trinamool Congress outside West Bengal, party chief Mamata Banerjee addressed a rally in Agartala, Tripura on Tuesday.", "filename": "politics_mamata-banerjee-in-agartala-tmc-chief-raises-cpm-quit-tripura-slogan-in-rally-2944856_1553696310.html", "image_url": "https://images.firstpost.com/wp-content/uploads/2016/07/Mamata_Banerjee_PTI.jpg", "language": null, "localpath": "/home/raj/news-please-repo//data/2019/03/27/firstpost.com/politics_mamata-banerjee-in-agartala-tmc-chief-raises-cpm-quit-tripura-slogan-in-rally-2944856_1553696310.html", "title": "Mamata Banerjee in Agartala: TMC chief raises 'CPM quit Tripura' slogan in rally", "title_page": "Mamata Banerjee in Agartala: TMC chief raises 'CPM quit Tripura' slogan in rally - Firstpost", "title_rss": "NULL", "source_domain": "firstpost.com", "text": "Kolkata/Agartala: Aiming to expand the base of Trinamool Congress outside West Bengal, party chief Mamata Banerjee addressed a rally in Agartala, Tripura on Tuesday. The West Bengal chief minister raised the slogan of \"CPM quit Tripura\" in the rally.\nWB CM Mamata Banerjee raises the slogan of \"CPIM Quit Tripura\" in her rally in Agartala, Tripura. — ANI (@ANI_news) August 9, 2016\nThe Trinamool Congress has already carved a place for itself in the Marxist bastion emerging as the principal Opposition party after six dissident Congress MLAs had joined it last June.\nSudip Ray Barman, who led the Congress dissidents in the sensitive North-Eastern state, told PTI on Monday, \"Mamata Banerjee's rally will be the first nail in the coffin of the corrupt and inefficient Left Front government of Tripura.\"\nBarman said that Banerjee would give the Tripura unit 'direction' to emerge victorious in the next Assembly polls due in 2018. All MLAs and other leaders who have joined the TMC from other parties, including the Congress are expected at the rally.\nBarman said the people of Tripura had become fed up with the Left Front regime and disapproved of the tie-up between the Congress and the Left Front in West Bengal. \"With this, the tacit understanding between the Left Front and the Congress came out in the open. Why will the people vote for the Congress as an alternative to the Left Front in Tripura?\" he wondered.\nIf the Left is to be ousted from Tripura, Trinamool Congress is the best option because it is the only \"anti-dote for the Left\", Barman said.\nAfter her landslide victory in West Bengal, Banerjee and her trusted lieutenant Mukul Roy have been working to expand her party's influence in the North East with Tripura being the prime target. The Bengali population in the state forms the largest ethno-linguistic group in the state with nearly about 70 percent of the population.\nAccording to TMC sources in Kolkata, Tripura and the North East hold a key to TMC's pan-India political ambition with an eye on the 2019 Lok Sabha polls where TMC wants to play a vital role.\n\"We are already the main Opposition party in Tripura and if we manage to win Tripura it will be an added advantage in 2019. The North-Eastern states have mostly remained untapped politically for us,\" a senior TMC leader said.\nFirstpost is now on WhatsApp. For the latest analysis, commentary and news updates, sign up for our WhatsApp services. Just go to Firstpost.com/Whatsapp and hit the Subscribe button.", "url": "https://www.firstpost.com/politics/mamata-banerjee-in-agartala-tmc-chief-raises-cpm-quit-tripura-slogan-in-rally-2944856.html", "label": 1}