{"authors": ["September", "Updated Ist"], "date_download": "2019-03-27 14:34:58", "date_modify": "2019-03-27 14:34:58", "date_publish": null, "description": "The proposed indefinite fast of YS Jagan Mohan Reddy demanding special status for the State stands postponed as the TDP Government has denied permission and it will be held once the High Court gives its verdict, YSR Congress has said.", "filename": "politics_gossip_jagan-fast-deferred-ysrcp-to-move-court-69313_1553697298.html", "image_url": "https://www.greatandhra.com/newphotos4/jagan91443188000.jpeg", "language": null, "localpath": "/home/raj/news-please-repo//data/2019/03/27/greatandhra.com/politics_gossip_jagan-fast-deferred-ysrcp-to-move-court-69313_1553697298.html", "title": "Jagan Fast Deferred; YSRCP To Move Court", "title_page": "Jagan Fast Deferred; YSRCP To Move Court | greatandhra.com", "title_rss": "NULL", "source_domain": "greatandhra.com", "text": "Jagan Fast Deferred; YSRCP To Move Court\nHyderabad: The proposed indefinite fast of YS Jagan Mohan Reddy demanding special status for the State stands postponed as the TDP Government has denied permission and it will be held once the High Court gives its verdict, YSR Congress has said.\n\"We have moved the court and we have confidence that our plea will be considered favourably and the fast will begin once the verdict is pronounced,\" party leader P Ramachandra Reddy told reporters here on Friday.\n\"TDP government denying permission for the protest programme, slated for September 26 at Guntur, and the Chief Minister’s remarks on our leader’s fast are highly objectionable and it shows that the Government is not inclined towards getting the special status for its own reasons and wants to scuttle any move by anyone in that direction.\nAs the denial of permission was conveyed after all the arrangements were made, we moved the court through a house motion petition and the Court has directed us to come in the regular form and we will submit out plea on Monday and are confident that the verdict will come in our favour as there are many a precedence for expressing protest.\nChandrababu Naidu himself has gone on fast at Delhi and also at MLA quarters and Tamil Nadu Chief Minister J Jayalalithaa went on a hunger strike on the Cauvery water issue. We have full faith in judiciary and the fast will be taken up once we get a clearance from the court. Till such a date, the indefinite fast stands postponed,\" he said.\nDenying permission to the indefinite fast is an act of irresponsibility as people have the right to express their dissent and TDP has been cold-shouldering the special status issue and the central aid which was announced yesterday is a pittance he said.", "url": "https://www.greatandhra.com/politics/gossip/jagan-fast-deferred-ysrcp-to-move-court-69313", "label": 1}