{"authors": ["Rahul Chandrasekharan"], "date_download": "2019-03-27 14:35:20", "date_modify": "2019-03-27 14:35:20", "date_publish": "2016-09-14 00:00:00", "description": "How the Cauvery water dispute between Karanataka and Tamil Nadu played out over the years, pre- and post-Independence", "filename": "Politics_ZwA3r1o6wzcPgJUHr5sQ3L_Cauvery-water-war-What-Karnataka-and-Tamil-Nadu-are-fightin_1553697320.html", "image_url": "https://images.livemint.com/rf/Image-621x414/LiveMint/Period2/2016/09/14/Photos/Processed/Cauvery--621x414.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/livemint.com/Politics_ZwA3r1o6wzcPgJUHr5sQ3L_Cauvery-water-war-What-Karnataka-and-Tamil-Nadu-are-fightin_1553697320.html", "title": "Cauvery water war: What Karnataka and Tamil Nadu are fighting for", "title_page": "Cauvery water war: What Karnataka and Tamil Nadu are fighting for", "title_rss": "NULL", "source_domain": "livemint.com", "text": "Bengaluru: The dispute over the sharing of Cauvery river water has lasted for more than a 150 years during which Karnataka and Tamil Nadu, the two main states involved, have accused each other of reneging on several agreements.\nHistorically, Karnataka had fewer irrigation systems than Tamil Nadu, both in terms of volume and sophistication, but the state played catch up to its southern neighbour’s numbers throughout the 20th century.\nKarnataka expanded its irrigation facilities, increased the area under farming and changed cultivation patterns to grow water-guzzling rice and sugarcane in place of millets grown in arid conditions, which worried Tamil Nadu, according to historian Ramachandra Guha’s book India After Gandhi .\n“Tamil Nadu feared that the frenetic canal building in the upper reaches threatened its farmers downstream. Karnataka argued that its late start should not preclude the fullest development of waters in its territory,\" Guha wrote.\nAfter decades of wrangling that pulled in politicians, film actors and other prominent personalities apart from the common people of the two states, the Central government set up the Cauvery Water Dispute Tribunal in 1990 to resolve the issue.\nThe tribunal eventually submitted its final order to the government for approval in 2007 after 16 years of hearings, testimonies of 20 witnesses running into 10,000 pages, and representations made by the lawyers of Karnataka, Tamil Nadu and Kerala, the three main states involved, and Union Territory Puducherry.\nThe Tribunal awarded 419 tmc ft (thousand million cubit feet) of water for Tamil Nadu and 270 tmc ft for Karnataka. Kerala was awarded 30 tmc ft and Pondicherry 7 tmc ft.\nHere’s a timeline of how the dispute played out over the years, pre- and post-Independence.\n1892: The Cauvery river water dispute starts between what was then Madras Presidency (under the British rule) and the Princely state of Mysore. Madras seeks to restrain Mysore from building irrigation systems that would impede the flow of water from 15 rivers (the Cauvery, the Tungabhadra and the Pennar rivers and their tributaries)\n1913: The Mysore government writes to Madras Presidency, seeking permission to build a reservoir. Madras, which plans to build a dam of its at Mettur, refuses consent. This leads to a dispute that results in the arbitration of July 1913. The arbitrator, H.D. Griffin, gives his decision in May 1914, allowing Mysore to go ahead with the construction of the dam up to 11 tmcft.\n1915: Griffin’s decision is challenged by Madras. The secretary to the public works department (irrigation) writes to the government of India, disagreeing with the findings of Griffin. In the same year the Diwan of Mysore also challenges certain parts of the ruling.\n1916: The government of India says it sees no reason to alter or amend the arbitrator’s award. Madras says it is unable “to acquiesce to the decision of the government of India\" and escalates matters to the Secretary of State for India, who stops the arbitrator’s award. He, however, says Mysore is free to enter into talks with Chennai or approach a new tribunal.\n1924: The dispute comes close to being resolved when Mysore and Madras reach an agreement under which Mysore is allowed to build a dam at Kannambadi village. The agreement is to be valid for 50 years and reviewed thereafter. Based on this agreement, Karnataka builds the Krishnaraja Sagar dam.\n1929: An agreement is reached, meant to clarify the 1924 agreement allowing the construction of the Krishnaraja Sagar dam in Mysore and to specify exactly how much water would be released to Madras. Krishnaraja dam becomes functional in 1931 and the Mettur dam in 1934.\nPost-Independence\nAfter India’s Independence, states are reorganized on the basis of language in 1956. Further disputes arise between Karnataka and Tamil Nadu over the former’s plan to build four more reservoirs across the four tributaries of the Cauvery.\nAugust 1971: Tamil Nadu files a case in the Supreme Court asking that a tribunal be set up to adjudicate in the water dispute. That suit is withdrawn in 1972.\nMay 1972: Chief ministers of the two states decide to constitute the Cauvery Fact Finding Committee.\n1974: The government of Karnataka says in 1974—the year the 1924 agreement expires after 50 years—that the 1924 and the 1892 agreements were in fact weighed against it because the then Madras Presidency was administered by the British, while Mysore was administered by the king of that state.\n1986: Tamil Nadu approaches the Centre asking that a tribunal be set up.\n4 May 1990: The Supreme Court directs the Central government to set up a tribunal to hear a writ petition filed by a Tamil Nadu organisation called Neerppasana Vilaiporulgal Vivasayigal Nala Urimai Padhugappu Sangam.\n2 June 1990: The Cauvery Water Disputes Tribunal is notified by the government of India. The tribunal passes an interim order in June 1991 and clarifications in April 1992 and December 1995.\n25 June 1991: The Cauvery Water Disputes Tribunal passes an interim order directing Karnataka to release water from its reservoirs to ensure 205 thousand million cubic feet (tmcft) of water into the Mettur reservoir of Tamil Nadu in a water year (1 June to 31 May) with monthly and weekly stipulations. The 1991 interim order escalates tension between the states.\nJuly 1991: Karnataka passes an ordinance in a move to nullify the interim awards.\nThe Supreme Court later steps in and strikes down the ordinance issued by Karnataka and upholds the tribunal’s award. In December, the Centre publishes the interim award in the Government of India gazette.\nKarnataka Chief Minister S. Bangarappa responds by declaring a bandh in the state.\nJuly 1993: Tamil Nadu chief minister J. Jayalalithaa goes on a fast to demand the state’s share of water as mentioned in the Tribunal’s interim order.\nAugust 1998: The Centre constitutes the Cauvery River Authority for the implementation of the interim award of the Cauvery Water Disputes Tribunal.\nSeptember 2002: The Cauvery River Authority, presided over by then Prime Minister Atal Bihari Vajpayee directs Karnataka to release 9,000 cusecs per day of Cauvery water to Tamil Nadu.\nUnhappy with the order, Tamil Nadu says it will move the Supreme Court. Protesting against the release of water to Tamil Nadu, a Karnataka farmer jumps into the Kabini Reservoir and dies.\nTamil Nadu’s Congress MP Mani Shankar Aiyar blames the AIADMK for not raising the issue in Parliament. Jayalalithaa, who refutes Aiyar’s charges, issues a nine-page statement.\nOctober 2003: Water experts say the Centre has not been pro-active in ensuring effective functioning of the Cauvery River Authority.\nJuly 2005: Karnataka rules out releasing Cauvery water to Tamil Nadu.\nFebruary 2007: Cauvery Water Disputes Tribunal gives final award.\nKarnataka protests the final award and a state-wide bandh follows.\nMarch 2007: Jayalalithaa goes on a fast in Chennai demanding publication of the final award in the Official Gazette of the Centre.\nJune 2008: Senior counsels of Karnataka on the Cauvery dispute meet top officials of the state government.\nJuly 2010: Cauvery river rises owing to good rainfall in the catchment areas in Kodagu district. In December the same year, the Stanley reservoir, the lifeline of the Cauvery delta, touches the full reservoir level of 120 feet in Tamil Nadu.\nMay 2012: Jayalalithaa seeks immediate Cauvery River Authority meet.\nSeptember 2012: After nine years, at the seventh Cauvery River Authority meet, then Prime Minister Manmohan Singh directs Karnataka to release 9,000 cusecs of Cauvery water per day to Tamil Nadu. Supreme Court slams Karnataka government for not complying with PM’s direction at the Cauvery River Authority meet.\nFebruary 2013: The Centre notifies final award of the Cauvery Water Disputes Tribunal on sharing the waters of the Cauvery system among the basin states of Karnataka, Tamil Nadu and Kerala and union territory of Puducherry.\nThe Central government mandates to constitute the Cauvery Management Board (CMB) simultaneously with the gazette notification of the final award of the Tribunal.\nMarch 2013: Tamil Nadu moves the Supreme Court seeking directions to the water ministry for the constitution of Cauvery Management Board.\nMay 2013: Tamil Nadu moves the Supreme Court, seeking ₹ 2,480 crore in damages from Karnataka for not following the orders of the Cauvery Water Disputes Tribunal.\nJune 2013: The Union water resources secretary heads the first meeting of the supervisory committee. Tamil Nadu demands its share of water for June as mentioned in the award.\nKarnataka chief minister Siddaramaiah says water cannot be released as and when Tamil Nadu demands and says cannot release 134 tmcft of water between June and September.\nThe Cauvery Supervisory Committee terms Tamil Nadu’s plea as not feasible. Tamil Nadu decides to file contempt plea against Karnataka for its stand on the Cauvery Supervisory Committee.\nJayalaithaa says the Tamil Nadu government will approach the Supreme Court for the formation of the Cauvery Management Board and Cauvery Water Regulatory Authority.\nArguing that the setting up of a supervisory committee was a failed step, Tamil Nadu moves the Supreme Court for constitution of the Cauvery Management Board.\nFiles contempt petition against Karnataka CM Siddaramaiah for his aggressive stand against the supervisory committee.\nJuly 2013: Clashes erupt between Karnataka and Tamil Nadu during the third meeting of the Cauvery Supervisory Committee. While Tamil Nadu sought 34 tmcft in July and 50 tmcft in August, Karnataka says that it has already released 34 tmcft between June and July.\nApril 2014: Ahead of the Lok Sabha polls, Jayalalithaa says the people of Tamil Nadu could not expect anything good from the Bharatiya Janata Party (BJP) for resolving the Cauvery water dispute and that Narendra Modi, the prime ministerial candidate, was trying to divert the issue.\nJune 2014: Karnataka opposes Tamil Nadu’s demand for a Cauvery Board, as appeals by all riparian states against the Cauvery Water Disputes Tribunal award were pending in the Supreme Court.\nApril 2015: Tamil Nadu raises concerns over construction of a dam by Karnataka near the popular tourist destination of Mekedatu, about 100 km from Bengaluru.\nSeptember 2015: The Centre advises Karnataka and Tamil Nadu governments to “cooperate\" with each other on the sharing of Cauvery waters.\nAugust 2016: Tamil Nadu files a petition in the Supreme Court, seeking direction to the state of Karnataka to release water to Tamil Nadu. Siddaramiah says there is no water in the reservoirs, protests erupt in Tamil Nadu.\nSeptember 2016: The Supreme Court directs Karnataka to release 15,000 cusecs a day till 15 September. Protests break out in Karnataka.\nOn 6 September night, Karnataka releases 10,000 cusecs of water from the Krishna Raja Sagara dam to Tamil Nadu.\nSeptember 12, 2016: Supreme Court modifies its order on the release of Cauvery water to Tamil Nadu, directing the state to release 12,000 cusecs a day till 20 September instead of the earlier 15,000 cusecs per day till 16 September.\nViolence is unleashed across Karnataka, including in capital Bengaluru apart from Mysuru and Mandya by farmers and pro-Karnataka groups. One protester is killed in police firing in Rajgopal Nagar, Bengaluru.\nNidheesh M.K., Sharan Poovanna and Dharani Thangavelu contributed to this story.", "url": "https://www.livemint.com/Politics/ZwA3r1o6wzcPgJUHr5sQ3L/Cauvery-water-war-What-Karnataka-and-Tamil-Nadu-are-fightin.html", "label": 1}