{"authors": [], "date_download": "2019-03-27 14:41:13", "date_modify": "2019-03-27 14:41:13", "date_publish": "2015-03-20 13:37:32", "description": "Mumbai, March 20 In an unexpected twist, the ruling allies Bharatiya Janata Party and Shiv Sena decided to boycott the election to the post of chairman of the Maharashtra legislative council here on Friday. BJP's Eknath Khadse and Sena's Ramdas Kadam, both senior ministers in Chief Minister Devendra Fadnavis's cabinet,", "filename": "politics_bjp-shiv-sena-boycott-legislative-council-chairman-poll-63345_1553697673.html", "image_url": "http://www.economylead.com/wp-content/uploads/2015/03/SHIVSENA.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/economylead.com/politics_bjp-shiv-sena-boycott-legislative-council-chairman-poll-63345_1553697673.html", "title": "BJP, Shiv Sena boycott legislative council chairman poll", "title_page": "BJP, Shiv Sena boycott legislative council chairman poll | EconomyLead", "title_rss": "NULL", "source_domain": "economylead.com", "text": "Mumbai, March 20 In an unexpected twist, the ruling allies Bharatiya Janata Party and Shiv Sena decided to boycott the election to the post of chairman of the Maharashtra legislative council here on Friday.\nBJP’s Eknath Khadse and Sena’s Ramdas Kadam, both senior ministers in Chief Minister Devendra Fadnavis’s cabinet, jointly made the announcement on their party’s decision a short while ago.\n“We stand united on this issue… there is no question of supporting either the Congress of Nationalist Congress Party… hence we have decided to boycott the election,” Khadse told media persons near the state legislature.\nThe decision would smoothen the way for the election of NCP candidate Ramraje Nimbalkar for the prestigious post, given the arithmetic in the 78-member house. The elections are scheduled to be held later Friday afternoon.\nThe chairman’s election was necessitated after council chairman Shivajirao Deshmukh in an unprecedented no-confidence motion was voted out of the office. The veteran Congress leader held the august post in the upper house for 11 years.\nThe NCP enjoys a brute strength of 28 in the house, followed by the Congress (21), BJP (12), Shiv Sena (seven), and the rest belonging to other parties.\non March 19, the Shiv Sena tried to corner ally BJP by fielding Neelam Gorhe for the post in what would be a four-cornered contest between Gorhe, the NCP’s Nimbalkar, the Congress’ Sharad Ranpise and an Independent from Amravati teachers’ constituency, Shrikant Deshpande.\nIn the March 16 voting of the no-confidence motion against Deshmukh, the opposition NCP was virtually “helped” by the BJP to defeat the Congress in the house. Both BJP and NCP were accused of having an “understanding” between them over ousting Deshmukh.\n(IANS)", "url": "http://www.economylead.com/politics/bjp-shiv-sena-boycott-legislative-council-chairman-poll-63345", "label": 1}