{"authors": [], "date_download": "2019-03-27 14:35:23", "date_modify": "2019-03-27 14:35:23", "date_publish": "2016-01-08 16:56:38", "description": "National News – West Bengal chief minister Mamata Banerjee has said that there is no communal violence in the state.", "filename": "politics_national_days-after-malda-incident-mamata-claims-there-is-no-communal-tension-in-bengal-34670_1553697323.html", "image_url": "https://resize.indiatvnews.com/en/resize/newbucket/715_-/politicsnational/IndiaTvb6e513_mamta.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/indiatvnews.com/politics_national_days-after-malda-incident-mamata-claims-there-is-no-communal-tension-in-bengal-34670_1553697323.html", "title": "Days after Malda incident, Mamata claims there is no communal tension in Bengal", "title_page": "Days after Malda incident, Mamata claims there is no communal tension in Bengal | National News – India TV", "title_rss": "NULL", "source_domain": "indiatvnews.com", "text": "days after malda incident mamata claims there is no communal tension in bengal\nKolkata: Days after thousands of protestors, most of them Muslims, went on a rampage in Malda district raising concerns of communal tension in the area, West Bengal chief minister Mamata Banerjee has said that there is no communal violence in the state.\nMamata was addressing a gathering at the Bengal Global Business Summit in Kolkata. Mamata and the Trinamool Congress are hoping to bring in some big-ticket investments into the state which goes to polls later this year.\nThe state has suffered in terms of flight of capital in view of strong unionism and the alleged high-handedness of the chief minister. There is a vast majority of unemployed youth in the state and setting things in order will require roping in investors to set shop in the state.\nPushing a peaceful image of West Bengal will be crucial to draw such investments. “Unity in diversity is the mantra of the TMC regime,” Mamata said. She further claimed that Maoist violence has come down in West Bengal.\n“Even the people residing in the hills are smiling. There is no tension,” she said.\nThe comments gain significance as they come barely four days after violent mobs ransacked a police station in Malda district of West Bengal. The violence began with a 1 lakh-strong crowd protesting against derogatory comments on Prophet Mohammed made by Bharat Hindu Mahasabha leader Kamlesh Tiwari. It soon spread from a rally organised by the Anjuman Ahle Sunnatul Jamat (ASJ).\nHowever, an ASJ official later claimed that “outsiders” had masterminded the rampage.\nAccording to a report in The Indian Express, violence erupted when a bus was trying to negotiate past the crowd on National Highway 34. As the passengers got off the bus, the protesters burnt it down.\nA little later, another BSF vehicle coming from Malda was also set ablaze. The mob then turned towards the nearby Kaliachak Police Station. The protesters drove out the policemen and set a part of the police station on fire, including the barracks, eyewitnesses said.\nA suo motu FIR lodged by the police a day later named 30 suspects responsible for causing the riot. 10 were arrested, six of who walked on bail soon after.\nThe area, in the north Bengal district of Malda bordering Bangladesh is known to be a hub of criminal activities including smuggling, running of counterfeit currency rackets, opium farming and human trafficking. No surprises then that the police station would have housed records of such organised crimes and their destruction would benefit criminals who may be internationally connected.\nBJP has attacked the Trinamool Congress government in West Bengal over the \"rampaging communalism\" in Malda, alleging that the accused behind it are indulging in violence under its protection.\nThe BJP has also accused Banerjee's Trinamool Congress of protecting those behind Sunday's violence.\nThe Union Home Ministry has already sought a report from the West Bengal government on the Malda violence.\nOn 3 December, Tiwari called Prophet Mohammad the world's first homosexual. He is also reported to have allegedly circulated pamphlets against the Muslim community. He was arrested in Lucknow the same day.\nOn December 4, the Hindu Mahasabha stated that Tiwari was not a part of the outfit and that the controversy was an attempt by the BJP, the RSS and other groups to tarnish the image of the party.", "url": "https://www.indiatvnews.com/politics/national/days-after-malda-incident-mamata-claims-there-is-no-communal-tension-in-bengal-34670.html", "label": 1}