{"authors": [], "date_download": "2019-03-27 14:40:34", "date_modify": "2019-03-27 14:40:34", "date_publish": "2015-09-01 07:31:39", "description": "By holding the 'Swabhiman rally' at the historic Patna Gandhi Maidan, Nitish Kumar had hoped to generate an emotive wave which would weigh heavily over Prime Minister Narendra Modi’s pitch for aspirational Bihar", "filename": "politics_more-losses-than-gains-for-sonia-nitish-as-lalu-steals-show-at-swabhiman-rally-in-patna-2415008_1553697634.html", "image_url": "https://images.firstpost.com/wp-content/uploads/2015/08/SwabhimanRallyPatna380PTI.jpg", "language": null, "localpath": "/home/raj/news-please-repo//data/2019/03/27/firstpost.com/politics_more-losses-than-gains-for-sonia-nitish-as-lalu-steals-show-at-swabhiman-rally-in-patna-2415008_1553697634.html", "title": "More losses than gains for Sonia, Nitish as Lalu steals show at Swabhiman Rally in Patna", "title_page": "More losses than gains for Sonia, Nitish as Lalu steals show at Swabhiman Rally in Patna - Firstpost", "title_rss": "NULL", "source_domain": "firstpost.com", "text": "By holding the 'Swabhiman Rally' at the historic Patna Gandhi Maidan, Nitish Kumar had hoped to generate an emotive wave that would weigh heavily on Prime Minister Narendra Modi’s pitch for an aspirational Bihar. His other purpose was to showcase himself as the unchallenged leader of a 'secularist' Mahagathbandhan.\nThe size of the crowd was big enough to give an ordinary onlooker the sense that the electoral fight in the state was going to be a very close one. But by the time Sunday’s rally concluded, there were obvious signs that Nitish’s well-conceived script had gone completely haywire.\nIn the end, it turned out to be Lalu Prasad Yadav’s personal show of strength that for all practical purposes hijacked the rally. He spoke at the very end, indicating his primacy of place among those seated on the dais. In terms of political protocol, the speaking order is decided on the basis of the senior-most leader, ergo the biggest crowd-puller, speaking last, with the aim of keeping the audience's attention till the very end.\nIn this particular case, the worst-affected by the speaking order was Sonia Gandhi, whose national stature was certainly the biggest among all the leaders present, but she was made to speak much earlier, well ahead of Nitish Kumar, Sharad Yadav and Lalu Yadav. For another hour-and-a-half, she sat on the podium listening to their speeches, nodding vigorously and laughing her approval at Lalu’s raving and ranting. This was perhaps the first occasion that saw her sit quietly on the podium for long hours and listen to three others speak, long after she had completed her own speech. She has clearly accepted the tertiary position the Congress holds in this coalition, notwithstanding her own personal stature as leader of the UPA.\nThe JD (U) may well wonder if its leader Nitish benefited in any way from the rally. After all, the RJD chief did not once hail Nitish’s leadership, nor did he equate Nitish’s DNA, political or otherwise, with the pride of Bihar. He instead let the hundreds of thousands present at the rally and those watching it live on TV that as an alliance partner, he felt free to call Nitish and ensure what he said was duly delivered by the state government. In doing so, he openly contradicted Nitish.\nMinutes earlier, Nitish had said, “They (BJP) point fingers towards Lalu Yadav and claim that jungle raj is back. I can tell you that Lalu Yadav has never called me for a recommendation, and when he has not made a single recommendation, how could they allege the return of a jungle raj situation?” Lalu knew that his core Yadav social support base would not take a weak portrayal too kindly. There is already a feeling among section of Yadavs that Lalu has surrendered before Nitish, a Kurmi, in his pursuit to protect his own family’s political turf.\nThe RJD chief went on to detail how he forced Nitish to arrest one criminal JD (U) MLA, Anant Singh after he allegedly tortured and killed a Yadav boy. Singh, a dreaded gangster, had been roaming freely for last 10 years.\nLalu’s incredibly regressive caste-ist statements included: “Yadav ko bewfoof banata hai. Kehta hai Yadav ko phodo. Backward aur Yadav Lalu ko chhodne wale nahin. Jab bhains Yadav ko nahi patak saka toh Modi Yadav ko kaise patak dega. (He (Modi) tries to fool Yadavs. He says destroy the Yadavs. The backward castes and Yadavs won't leave Lalu. If a buffalo couldn't knock the Yadavs down, how is Modi going to knock them down?)” He then went on to claim that the publication of a caste census was the only solution to empower the backward castes and turn this election into a “Mandal Part II”. He was more than overtly pitching for a 'Yadav/backward castes versus upper castes' social conflict.\nBy doing so, he demolished Nitish’s carefully planned 'larger than life' campaign persona that would potentially tower over all the contradictions that lay within this Mahagathbandhan. Worse for Nitish, Lalu happily introduced Samajwadi leader Shivpal Yadav as his samdhi and Rabri Devi as 'Begum Lalu Yadav'. Lalu's daughter Misa Bharti was seated in between Sonia Gandhi and Meira Kumar.\nHe also made sure not to miss the chance to tell Sonia that she had been making a mistake by undermining his strength — making him wait and not addressing the differences that occasionally cropped up between the Congress and RJD. Whether or not he was hinting at the pitfalls of Rahul Gandhi’s increased role in decision-making is not clear.\nNitish on his part didn’t say anything that could have helped him capitalise on his 'sushasan babu' (governance man) image. He did not talk about a single achievement by his government, and devoted 80 percent of his speech to targeting Modi. He then spoke of Bihar’s pride from ancient times to the present — from Gautam Buddha, Vardman Mahavir, and Jaiprakash Narayan, to Rajendra Prasad, Kunwar Singh, Nalanda and Vikramshila University.\nAgain, not a word on what his government delivered in his present term in office.\nHe said Bihar will be ushered on a new path of development and growth once the state is granted “special status state” by the Centre — unmindful of the fact that it is near impossible to get into that favoured category. His speech that lasted over 30 minutes, was an indicator that his fight with Modi had become more personal than political. His shrill tone did evoke some cheers, but ultimately failed to capture the sort of enthusiastic crowd response that he probably expected.\nThe problem for Nitish is that the leaders on the podium belonged to the Congress and Janata Parivar. Since Independence, all 22 chief ministers who have governed Bihar have either belonged to the Congress or the Janata Parivar. From Mahamaya Prasad Sinha in 1960s, Karpoori Thajoor in 1970s and 1980s, to Lalu Yadav, Rabri Devi, Jitan Ram Manjhi and Nitish Kumar, they have all been part of the Janata Parivar. So, he can’t blame any of his political rivals for the ills of the state.\nAll eyes will now be on Modi’s rally tomorrow in Bhagalpur. This rally — coming 48 hours after the Swabhiman Rally — is likely to evoke much curiosity about what Modi's response to the combined Nitish-Lalu-Sonia onslaught will be.\nFirstpost is now on WhatsApp. For the latest analysis, commentary and news updates, sign up for our WhatsApp services. Just go to Firstpost.com/Whatsapp and hit the Subscribe button.", "url": "https://www.firstpost.com/politics/more-losses-than-gains-for-sonia-nitish-as-lalu-steals-show-at-swabhiman-rally-in-patna-2415008.html", "label": 1}