{"authors": [], "date_download": "2019-03-27 14:34:56", "date_modify": "2019-03-27 14:34:56", "date_publish": "2015-01-17 11:52:00", "description": "National News – Pilibhit: Amid protests in some parts of Tamil Nadu against a ban on traditional bull taming sport, Union Minister Maneka Gandhi has said that", "filename": "politics_national_jallikattu-a-western-concept-maneka-gandhi-25108_1553697296.html", "image_url": "https://resize.indiatvnews.com/en/resize/newbucket/715_-/politicsnational/IndiaTv359305_maneka_gandhi.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/indiatvnews.com/politics_national_jallikattu-a-western-concept-maneka-gandhi-25108_1553697296.html", "title": "Jallikattu a western concept: Maneka Gandhi", "title_page": "Jallikattu a western concept: Maneka Gandhi | National News – India TV", "title_rss": "NULL", "source_domain": "indiatvnews.com", "text": "jallikattu a western concept maneka gandhi\nPilibhit: Amid protests in some parts of Tamil Nadu against a ban on traditional bull taming sport, Union Minister Maneka Gandhi has said that Jallikattu is a western concept that leads to killings of humans and animals.\n\"Jallikattu tradition is western culture and BJP is against it. Supreme Court's decision to ban it is a welcome step,\" said Maneka, who is on a two-day tour to her parliamentary constituency.\nShe said that in this tradition cows and bulls, who are very useful for the farmers, are killed.\n\"Not only the animals, but humans are also killed in this tradition,\" she said.\nTension prevailed in Tamil Nadu's Palamedu and Alanganallur, two of the famous venues for the traditional sport, with shops remaining closed and buildings sporting black flags as residents were upset Jallikattu could not be held this year.\nThe Union Minister of Women and Child Development said that Makar Sankranti should be celebrated by worshipping plants and trees, but in Tamil Nadu it start with atrocities which is wrong.\nJallikattu is a bull taming sport played in Tamil Nadu as a part of Pongal celebrations on Mattu Pongal day.\nThe Supreme Court last year banned using bulls for Jallikattu events or bullock-cart races across the country and directed governments and Animal Welfare Board of India (AWBI) to take steps to prevent the infliction of unnecessary pain or suffering on animals.\nIt had said all living creatures, including animals, have inherent dignity and a right to live peacefully and right to protect their well-being.", "url": "https://www.indiatvnews.com/politics/national/jallikattu-a-western-concept-maneka-gandhi-25108.html", "label": 1}