{"authors": [], "date_download": "2019-03-27 14:40:31", "date_modify": "2019-03-27 14:40:31", "date_publish": "2016-11-24 18:42:22", "description": "National News – Delhi Chief Minister Arvind Kejriwal will ddress six rallies across the nation, including one in Prime Minister Narendra Modi’s constituency Varanasi, against the central government’s decision to demonetise high-denomination currency notes.", "filename": "politics_national-arvind-kejriwal-to-hold-6-rallies-against-demonetisation-including-in-varanasi-358068_1553697631.html", "image_url": "https://resize.indiatvnews.com/en/resize/newbucket/715_-/2016/11/keju1-1479993092.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/indiatvnews.com/politics_national-arvind-kejriwal-to-hold-6-rallies-against-demonetisation-including-in-varanasi-358068_1553697631.html", "title": "Arvind Kejriwal to hold 6 rallies against demonetisation, including in Varanasi", "title_page": "Arvind Kejriwal to hold 6 rallies against demonetisation, including in Varanasi | National News – India TV", "title_rss": "NULL", "source_domain": "indiatvnews.com", "text": "Arvind Kejriwal to hold 6 rallies against demonetisation, including in Varanasi\nDelhi Chief Minister Arvind Kejriwal will address six rallies across the nation, including one in Prime Minister Narendra Modi’s constituency Varanasi, against the central government’s decision to demonetise high-denomination currency notes.\nMaking the announcement in this regard, the Aam Aadmi Party (AAP) leader Ashish Khetan today said that Kejriwal will raise questions on the “Rs 8 trillion scam” related to ‘demonetisation’ during his rallies.\nArvind Kejriwal will hold three rallies in poll-bound Uttar Pradesh (UP) starting from 1 December in Meerut, followed by a rally in Varanasi and Lucknow on 8 and 18 December respectively, AAP leader Ashish Khetan said.\nModi has defeated Kejriwal from the Varanasi Lok Sabha seat in May 2014 by a massive margin of 3.37 lakh votes. The rallies assume significance as UP goes to polls early next year.\nOn 20 December, Kejriwal will hold a rally in Bhopal, followed by two more in Ranchi and Jaipur on 22 and 23 December respectively. Notably, all three are Bharatiya Janata Party (BJP)-ruled states.\n“We will raise important questions about demonetisation and Rs8 trillion scam related to it,” said Khetan.\nKejriwal is currently in Punjab, campaigning for the party for the Assembly elections scheduled early next year.\n(With PTI inputs)", "url": "https://www.indiatvnews.com/politics/national-arvind-kejriwal-to-hold-6-rallies-against-demonetisation-including-in-varanasi-358068", "label": 1}