{"authors": [], "date_download": "2019-03-27 14:40:36", "date_modify": "2019-03-27 14:40:36", "date_publish": "2015-12-07 00:00:00", "description": null, "filename": "print_80088-tmc-observes-babri-masjid-demolition-day_1553697636.html", "image_url": "https://static.thenews.com.pk/front/img/no-img-fb.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/thenews.com.pk/print_80088-tmc-observes-babri-masjid-demolition-day_1553697636.html", "title": "TMC observes Babri Masjid demolition day", "title_page": "TMC observes Babri Masjid demolition day | World | thenews.com.pk | Karachi", "title_rss": "NULL", "source_domain": "thenews.com.pk", "text": "TMC observes Babri Masjid demolition day KOLKATA: The ruling Trinamool Congress in West Bengal on Sunday held a rally near Gandhi statue in the heart of the city to mark the Babri Masjid demolition anniversary as “Sanhati Divas” (Unity Day). “Ours is a democratic and secular country, there should be an atmosphere of brotherhood among all and everybody should be able to live freely,” party MP Sudip Bandopadhyay said at the rally. “Nobody should attempt to decide on who will eat what,” Bandopadhyay said referring to the recent controversy over beef eating and alleged serving of buffalo meat at Kerala House in Delhi. Attended by several thousand people, the rally was addressed by TMC secretary-general Partha Chatterjee, MP Idris Ali and others, who said that West Bengal had always been a land of religious harmony. “The BJP should not try to disturb this and any such attempt by it will be thwarted by the people of the state,” Chatterjee said. An oath of unity was taken, with representatives of all major faiths, including Hindus, Muslims, Sikhs and Buddhists administering it to those present. The party also held processions in different parts of the state to mark the day. Meanwhile, Bihar Chief Minister Nitish Kumar on Sunday accused the BJP of raking up the Ram temple issue to garner political advantage in Assembly elections in Uttar Pradesh, which will be held in 2017. “If the BJP is serious, it should specify a date for the construction of the temple,” Kumar remarked, pointing to the demand of BJP ally Shiv Sena, which, too, has demanded a date. “When everyone knows the temple can be built only by taking all parties along, this issue’s being raised means the BJP is hardly serious. It was raised just to whip up passions in the run-up to the Assembly elections in Uttar Pradesh in 2017,” said Mr Kumar in Patna today. Sunday, December 6, was the 23rd anniversary of the Babri Masjid demolition and in its run-up, Mohan Bhagwat — the chief of BJP’s ideological mentor the Rashtriya Swayamsevak Sangh - had said the temple will be built in his lifetime. In an editorial in Saamna yesterday, the Shiv Sena said he should now announce a date for its commencement. As the opposition Samajwadi Party and the Bahujan Samaj Party took on the BJP in Parliament, Kumar accused the party of using Lord Ram as a “political tool”.\nKOLKATA: The ruling Trinamool Congress in West Bengal on Sunday held a rally near Gandhi statue in the heart of the city to mark the Babri Masjid demolition anniversary as “Sanhati Divas” (Unity Day).\n“Ours is a democratic and secular country, there should be an atmosphere of brotherhood among all and everybody should be able to live freely,” party MP Sudip Bandopadhyay said at the rally.\n“Nobody should attempt to decide on who will eat what,” Bandopadhyay said referring to the recent controversy over beef eating and alleged serving of buffalo meat at Kerala House in Delhi.\nAttended by several thousand people, the rally was addressed by TMC secretary-general Partha Chatterjee, MP Idris Ali and others, who said that West Bengal had always been a land of religious harmony. “The BJP should not try to disturb this and any such attempt by it will be thwarted by the people of the state,” Chatterjee said.\nAn oath of unity was taken, with representatives of all major faiths, including Hindus, Muslims, Sikhs and Buddhists administering it to those present.\nThe party also held processions in different parts of the state to mark the day.\nMeanwhile, Bihar Chief Minister Nitish Kumar on Sunday accused the BJP of raking up the Ram temple issue to garner political advantage in Assembly elections in Uttar Pradesh, which will be held in 2017.\n“If the BJP is serious, it should specify a date for the construction of the temple,” Kumar remarked, pointing to the demand of BJP ally Shiv Sena, which, too, has demanded a date.\n“When everyone knows the temple can be built only by taking all parties along, this issue’s being raised means the BJP is hardly serious. It was raised just to whip up passions in the run-up to the Assembly elections in Uttar Pradesh in 2017,” said Mr Kumar in Patna today.\nSunday, December 6, was the 23rd anniversary of the Babri Masjid demolition and in its run-up, Mohan Bhagwat — the chief of BJP’s\nideological mentor the Rashtriya Swayamsevak Sangh - had said the temple will be built in his lifetime. In an editorial in Saamna yesterday, the Shiv Sena said he should now announce a date for its commencement.\nAs the opposition Samajwadi Party and the Bahujan Samaj Party took on the BJP in Parliament, Kumar accused the party of using Lord Ram as a “political tool”.", "url": "https://www.thenews.com.pk/print/80088-tmc-observes-babri-masjid-demolition-day", "label": 1}