{"authors": [], "date_download": "2019-03-27 14:29:05", "date_modify": "2019-03-27 14:29:05", "date_publish": "2017-03-02 13:00:30", "description": "Jawahar Bagh case: HC orders CBI inquiry", "filename": "pti-feed_story_jawahar-bagh-case-hc-orders-cbi-inquiry-884032-2017-03-02_1553696945.html", "image_url": "https://www.indiatoday.in/sites/all/themes/itg/favicon.ico", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/indiatoday.in/pti-feed_story_jawahar-bagh-case-hc-orders-cbi-inquiry-884032-2017-03-02_1553696945.html", "title": "Jawahar Bagh case: HC orders CBI inquiry", "title_page": "Jawahar Bagh case: HC orders CBI inquiry           - PTI feed News", "title_rss": "NULL", "source_domain": "indiatoday.in", "text": "Allahabad, March 2 (PTI) The Allahabad High Court today ordered a CBI probe into the Jawahar Bagh Park case of Mathura where more than 20 persons, including two police officials, were killed last year during a drive to evict squatters.\nA division bench comprising Chief Justice D B Bhosle and Justice Yashwant Verma passed the order on a bunch of PILs demanding a CBI probe.\nThe court had reserved its judgement on February 20 after hearing arguments from both sides.\nAmong those who had moved the court with the demand for a CBI inquiry are Delhi-based BJP leader and Supreme Court lawyer Ashwini Upadhyay and Mathura resident Vijay Pal Singh Tomar.\nBesides, interlocutory applications were filed at a later stage by Archana Dwivedi and Prafull Dwivedi, wife and brother respectively of slain Superintendent of Police Mukul Dwivedi.\nThe order comes as a jolt to the ruling Samajwadi Party in Uttar Pradesh.The state government had remained opposed to a CBI inquiry into the matter, pointing out that it had set up a commission of inquiry comprising a retired judge of the High Court.\nIn a statement issued from Delhi, Upadhyay welcomed the order, saying, \"The violence at Jawahar Bagh in June last year was not an ordinary law and order issue.It related to unlawful occupation of public land, worth about Rs 5000 crore, by self-styled cult leader Ram Vriksh Yadav and his followers\".\nThe Uttar Pradesh government had, in January 2014, granted permission to Ram Vriksh Yadavs organization Swadhin Bharat Vidhik Satyagrah to hold a demonstration inside Jawahar Bagh for two days.\nHowever, members of the group went on to occupy the sprawling public park for more than two years.\nFollowing a High Court order, the squatters were evicted from the park amid large scale violence.\nA huge cache of arms, ammunition and explosives were recovered from the huts that had been erected inside the park during the period of illegal occupation.\nThere were reports that the park had been converted into a \"quasi republic\" with its own currency and penal system and people staying there had been issued ration cards and cooking gas cylinders with Jawahar Bagh as the address.PTI CORR NAC DV", "url": "https://www.indiatoday.in/pti-feed/story/jawahar-bagh-case-hc-orders-cbi-inquiry-884032-2017-03-02", "label": 1}