{"authors": ["Priyanka Vora"], "date_download": "2019-03-27 14:29:17", "date_modify": "2019-03-27 14:29:17", "date_publish": "2017-09-26 14:30:00", "description": "Centres running the state’s pilot project to treat blood disorders have run short of a critical iron chelation drug since April this year.", "filename": "pulse_851738_thalassemia-drug-shortage-hurts-patients-at-maharashtras-free-treatment-centres_1553696957.html", "image_url": "https://d1u4oo4rb13yy8.cloudfront.net/book/69265-dldsxptyjr-1506251790.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/scroll.in/pulse_851738_thalassemia-drug-shortage-hurts-patients-at-maharashtras-free-treatment-centres_1553696957.html", "title": "Thalassemia drug shortage hurts patients at Maharashtra’s free treatment centres", "title_page": "Thalassemia drug shortage hurts patients at Maharashtra’s free treatment centres", "title_rss": "NULL", "source_domain": "scroll.in", "text": "Over the past few months, photographer Sunil Vartak has spent about Rs 10,000 on iron chelation medicines for his 13-year-old daughter Sakshi, who has thalassemia. She had been getting the medicine for free under a Maharashtra government programme to treat blood disorders. However, since April this year, the programme has run short of the drug.\n“I was buying the drugs,” said Sunil Vartak. “There was no other option.”\nThalassemia is a blood disorder in which the body forms little or no haemoglobin – the molecules in red blood cells that carry oxygen to various parts of the body. It can cause severe anaemia and the lack of oxygen due to anaemia can disrupt the normal functioning of organs. Thalassemia is treated through repeated blood transfusion, which has the dangerous and potentially fatal side-effect of causing a build-up of iron in the body. Patients need iron chelation drugs to remove this excess iron from the body.\nTill April, Sakshi Vartak had been getting her iron chelation medicines free-of-cost at the Thane civil hospital. The hospital has one of four centres set up by the Maharashtra health department to treat blood disorders. The pilot project launched in 2013 aims to provide free prevention, detection and treatment to patients with thalassaemia, haemophilia and sickle cell disease and is funded by the National Health Mission. The other three centres are at Amravati, Satara and Nashik. The centres provide blood transfusions, iron-chelation therapy and other medical support, including genetic counseling for patients and carriers of thalassemia. There are about 2,000 patients with thalassemia registered for treatment at these centres.\nSince April, these patients have either had to buy the expensive medicines or wait for the free medication from the centres as their conditions deteriorate.\nUnlike Sunil Vartak, Ganesh Gosavi cannot afford to buy medicines for his seven-year-old thalassemic son Pushkar. The boy needs to take 750 mg of the medicine every day, which costs Rs 1,800 per month. Ganesh Gosavi, who works as a clerk with a small company in Nashik, earns about Rs 6,000 a month.\n“Doctors have told me that if Pushkar’s iron levels keep rising his organs will suffer irreparable damage,” he said.\nPushkar Gosavi, 7, a resident of Nashik who is suffering from thalassemia.\nIron in the body is measured by serum ferritin levels. The normal range for serum ferritin is between 20 and 500 nanograms per millilitre for men and between 20 and 200 nanograms per millilitre for women.\nPushkar Gosavi’s serum ferritin level was usually between 500 and 1,200 nanograms per millilitre because of his thalassemia treatments. But in August, it rose to a worrying 2,200 nanograms per millilitre. Ganesh Gosavi said that this is because the boy did not get his iron chelation drugs in from the Nashik centre where he is being treated in May, June and July.\nShortages at all four centres\nAccording to Maharashtra health department data, the blood disorder treatment centre at Nashik had only 630 tablets of 500 mg and no tablets of 250 mg of the iron chelation drug at the end of June. The centre has 377 thalassemia patients and the stock would last less than a week.\n“In April, they [the doctors] told us that there is a shortage and handed us dose for just 10 days,” said Ramashankar Jadhav, father of 13-year-old thalassemia patient Harsh. “In May, we did not get any medicines and in June, we again got the drugs only for 10 days.”\nIn the second week of September, Jadhav was still trying find money to buy the medicine from the market.\nThe civil hospital in Amravati district of Maharashtra did not have a single tablet of the iron chelation drug on June 30. The centre has 296 registered thalassemia patients.\nAt around the same time, the Satara centre ran out of 500 mg tablets of the drug. Two-and-a-half months later, in mid-September, doctors at the centre were still trying to make do without these medicines. “We are giving the 250 mg tablets to patients who require the 500 mg tablets,” said a doctor who did not wish to be identified. “At this rate, we will soon run out of the 250 mg tablets also.”\nDespite this, Dr Girish Chaudhary who is in charge of the programme admitted to only a only a minor shortage at the Thane centre. “We cannot deny patients who come from other districts and states, so we ran out of medicines in Thane,” he said. “But, we made the arrangements quickly by calling for the surplus stock from other centres.”\nMeanwhile, doctors at the treatment centres have given patients and their families varying explanations for the drug shortage.\n“I was told that owing to the implementation of GST, the company which was supposed to supply the drug did not do so and later they did not have the raw material to manufacture the drug,” said Vartak. “The next time, they told us that there was some delay in the process of procurement.”\nAfter their repeated appeals to the Maharashtra health department went unheeded, Vartak and other parents of children with thalassemia staged a protest in Mumbai on August 10.\n“The Maharashtra health minister and government officials assured us that there will be no shortage henceforth,” he said. “But even today [September 22], the Thane centre is providing drugs only for 10 to 15 days instead of the monthly dose. Some patients come from remote villages and it is torturous for them to travel every fortnight for the drugs.”\nNo private sector support\nBefore the blood disorder treatment pilot project was launched, non-profit organisations that work with thalassemia patients like Think Foundation and Thalassemia Foundation would procure the drugs from pharmaceutical companies and supply them to thalassemia patients. Patients who could afford the drugs, would buy them directly from chemists.\nOnce the government’s programme began in 2013, companies that were supplying the medicine to non-profit organisations as part of their corporate social responsibility initiatives withdrew their support, said Dr Vijay Gawli from the Thalassemia Foundation.\nGawli pointed out that companies saw no point in supplying drugs to the NGOs once the government pilot programme began catering to the same group of patients.\n“These companies have strict policies and once the government committed to supply the drugs to the patients, they stopped the funding [for free medicine to NGOs],” said Gawli. “Once the government centres ran out of the drugs, we tried contacting individual donors and [corporate entities] to arrange supply of the medicines but it is not possible to do it for all patients.”\nIn the last two months, Harsh Jadhav has not received a single tablet of the iron chelation drug. His serum ferritin level has crossed 4,000 units.\nGawli pointed out that patients like Pushkar Gosavi and Harsh Jadhav are at risk of permanent damage of the brain and heart because of excess iron deposition. “When the iron levels in their blood increase, the immunity of these children drops putting them at risk of various infections,” he said. “The children who are already suffering also develop indigestion, loss of appetite among other complications because of excess iron.”\n“I don’t have the money to buy the drugs from the market,” said Ramashankar Jadhav. “We can only wait for the drugs.”", "url": "https://scroll.in/pulse/851738/thalassemia-drug-shortage-hurts-patients-at-maharashtras-free-treatment-centres", "label": 1}