{"authors": ["Ht Correspondent"], "date_download": "2019-03-27 14:18:23", "date_modify": "2019-03-27 14:18:23", "date_publish": "2017-04-07 11:57:32", "description": "Panjab University (PU) students gate-crashed into vice-chancellor AK Grover’s office complex, blockading it for six hours, demanding the roll back of tuition fee hike on Thursday. The increase is manifold for many courses.", "filename": "punjab_protestors-gatecrash_b0d21f687da3b863b58af644b9768e99_story-5AOi6PwqClfbYbu5nhxA4I_1553696303.html", "image_url": "https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2017/04/07/Pictures/chandigarh-chandigarh-activists-protesting-thursday-hindustan-university_cff69072-1b55-11e7-aa2a-1591876ff7cf.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/hindustantimes.com/punjab_protestors-gatecrash_b0d21f687da3b863b58af644b9768e99_story-5AOi6PwqClfbYbu5nhxA4I_1553696303.html", "title": "Video: Protesters gatecrash V-C office, student bodies call for ‘bandh’ in Panjab University", "title_page": "Video: Protesters gatecrash V-C office, student bodies call for ‘bandh’ in Panjab University | punjab | chandigarh | Hindustan Times", "title_rss": "NULL", "source_domain": "hindustantimes.com", "text": "Panjab University (PU) students gate-crashed into vice-chancellor AK Grover’s office complex, blockading it for six hours, demanding the roll back of tuition fee hike on Thursday. The increase is manifold for many courses.\nFor instance, the annual fee for a BA that a new student will pay this year will be Rs 10,000 against Rs 2,200 now. Some students received minor injuries after facing lathi-charge and water cannons. No detention of students whose attendance is and short and recruitment of teachers are other demands.\nStudents caught in scuffle with the police at Panjab University in Chandigarh on Thursday. ( Anil Dayal/HT Photo )\nStudents for Society (SFS) had given the call for protest, but the Students Organisation of India (SOI), the National Students Union of India (NSUI), Panjab University Students’ Union and NSUI-SF joined it. Members of All India Students’ Association from Khalsa College, Sector 26; DAV College, Sector 10, and Post Graduate Government College, Sector 11 also joined the protest.\nDEMANDS Roll back of fee hike that is manifold in some courses. For instance, BA fee Rs 10,000 new; now Rs 2,200\nNo detention of students who are short of attendance\nRecruitment of teachers\nV-C invited students for talks that failed\nAt 11am, the V-C invited representatives of all student bodies — including the ABVP and office bearers of PU Campus Students’ Council — for talks. However, the students walked out.\nSFS president Damapreet said, “The V-C justified the fee hike, saying that the government was not funding the varsity and that there was no option.”\nIt was then that he gave a call to cross barricades. At this, police resorted to lathi-charge. Some turbans were removed, even as students also threw slippers and sandals.\nFirst Published: Apr 07, 2017 11:57 IST", "url": "https://www.hindustantimes.com/punjab/protestors-gatecrash-v-c-office-student-bodies-call-for-bandh-in-panjab-university/story-5AOi6PwqClfbYbu5nhxA4I.html", "label": 1}