{"authors": [], "date_download": "2019-03-27 14:29:13", "date_modify": "2019-03-27 14:29:13", "date_publish": "2016-09-22 00:00:00", "description": "National Repentance Day was observed for the first time today in the Manipur Press Club hall here, under the aegis of Coalition for Indigenous Right Campaign, Manipur.", "filename": "states_north-east_repentance-over-merger-agreement_cid_1419760_1553696953.html", "image_url": "https://www.telegraphindia.com/assets/images/default_social_image.png?v=13", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/telegraphindia.com/states_north-east_repentance-over-merger-agreement_cid_1419760_1553696953.html", "title": "Repentance over merger agreement", "title_page": " Repentance over merger agreement ", "title_rss": "NULL", "source_domain": "telegraphindia.com", "text": "Imphal, Sept. 21: National Repentance Day was observed for the first time today in the Manipur Press Club hall here, under the aegis of Coalition for Indigenous Right Campaign, Manipur.\nA discussion held at Manipur University on August 21 on the theme \"Restoration Movement for Pre-Merger Political Status of Manipur\" had resolved to declare and observe September 21 as National Repentance Day.\nThokchom Somorendro, the convener of the citizens' organisation, said the merger of Manipur with India on September 21, 1949, brought about all the issues prevailing in Manipur now.\nHe said it has created the integrity problem, the issue of Irom Sharmila and Armed Forces (Special Powers) Act, inner-line permit issue, social restlessness and difference of opinions among intellectuals in the state.\nSaying India is the biggest democratic country but also the biggest suppressor, Somorendro said despite appeals from international human rights bodies and Supreme Court directives, the army act has not yet been repealed in Manipur. \"We are not saying we want independence, but are trying to find a way to escape from the suppression of India,\" the convener said.\nProfessor W. Nabakumar of the Centre for Myanmar Studies in Manipur University was the moderator of the panel discussion.\nTh. Suresh, retired director, health service, Manipur, said, \"We need a mega discussion along with intellectuals of different backgrounds related to the issue of Manipur's merger with India. We need to make our voice reach the Centre for any issue.\"\nAll the speakers showed repentance on the merger agreement signed between the Indian government and the then king of Manipur Maharaja Bodhchandra Singh. They pointed out that the king was coerced into signing the agreement. He was put under house arrest at his Redlands Palace in Shillong by a guard of the Jat Regiment, on the pretext of VIP security.\nIn protest against the manner in which Manipur merged with India, the National Revolutionary Front Manipur called a 24-hour general strike from midnight last night. Manipur remained paralysed today.", "url": "https://www.telegraphindia.com/states/north-east/repentance-over-merger-agreement/cid/1419760", "label": 1}