{"authors": [], "date_download": "2019-03-27 14:18:28", "date_modify": "2019-03-27 14:18:28", "date_publish": "2015-09-01 00:00:00", "description": "Tripura chief minister Manik Sarkar has said if bank employees only protest to demand more salary, allowances and pensions without any political consideration, the future would spell doom for them.", "filename": "states_north-east_sarkar-questions-banks-demands_cid_1394367_1553696308.html", "image_url": "https://www.telegraphindia.com/assets/images/default_social_image.png?v=27", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/telegraphindia.com/states_north-east_sarkar-questions-banks-demands_cid_1394367_1553696308.html", "title": "Sarkar questions banks' demands", "title_page": " Sarkar questions banks' demands ", "title_rss": "NULL", "source_domain": "telegraphindia.com", "text": "Agartala, Aug. 31: Tripura chief minister Manik Sarkar has said if bank employees only protest to demand more salary, allowances and pensions without any political consideration, the future would spell doom for them.\nSarkar, chief guest at the two-day conference of the National Confederation of Bank Employees here today, listened patiently to the speech delivered by the employees' all-India general secretary M.V. Murali and the charter of demands of the confederation.\n\"All banks are under-staffed. Even basic services, including timely payment of MGNREGA wages cannot be provided. Farmers across the country are committing suicide because of indebtedness to moneylenders. The agricultural sector is in a state of crisis. Given this you cannot confine your charter of demands only to your salaries, allowances and pensions,\" Sarkar said.\nHe said unless bank employees and their leadership went for a course correction they would be \"isolated from the mainstream society\".\nDenouncing the \"anti-people policies\" of the Centre, Sarkar said the NDA government was not fulfilling its pre-election promises and working only in the interest of corporate houses. \"The price level of essential commodities is rising. Public sector undertakings are being sold and the country is being divided on the basis of religion and caste. In this condition, bank employees cannot remain self-centred. They must decide upon a course of action suited to the welfare of people,\" said Sarkar.\nHe pointed out that the Prime Minister himself was announcing plans to disinvest public sector undertakings and employees of PSUs were under attack. \"Your charter of demands enunciated in this conference is silent on the eroding strength of bank employees and lack of recruitment in central services despite large vacancies. Unless these problems are addressed how can you expect to deliver better service and ensure welfare of your own professional class?\" asked Sarkar.\nThe leadership of the confederation, including Murli, Northeast circle president Pradip Kumar Vaishya and Assam state unit secretary Debasish Chakraborty were on the dais as the chief minister gave his speech.\nAt the end of the conference last night, the 30-member Tripura state committee was elected, led by Sushovan Dutta-Mazumder as secretary and Swapan Modak as president.", "url": "https://www.telegraphindia.com/states/north-east/sarkar-questions-banks-demands/cid/1394367", "label": 1}