{"authors": [], "date_download": "2019-03-27 14:41:00", "date_modify": "2019-03-27 14:41:00", "date_publish": "2015-08-20 00:00:00", "description": "Contractual workers of Hindustan Construction Company stage a protest against the non-payment of their wages for the past five months at the site of Bogibeel bridge in Dibrugarh district on Wednesday.", "filename": "states_north-east_workers-protest_cid_1393711_1553697660.html", "image_url": "https://www.telegraphindia.com/assets/images/default_social_image.png?v=0", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/telegraphindia.com/states_north-east_workers-protest_cid_1393711_1553697660.html", "title": "Workers protest", "title_page": " Workers protest ", "title_rss": "NULL", "source_domain": "telegraphindia.com", "text": "Contractual workers of Hindustan Construction Company stage a protest against the non-payment of their wages for the past five months at the site of Bogibeel bridge in Dibrugarh district on Wednesday.\n'We have not received wages from the company for the past five months,'' said one of the protesters.\nConstruction work was stopped for the day because of the protest by 5,000 labourers.\n'The company has not provided any basic amenities for us but has exploited us many times,'' alleged Sonjay Das, a worker under the company.\nAn official of the company promised the protesters that their dues would be cleared withing four days.\nHindustan Construction Company heads a three-company joint venture for girder (or superstructure) work. It has completed laying 10 spans of girder across the country.\nThe firm, which constructed the Bandra-Worli Sea Link in Mumbai, has a 51 per cent share in the joint venture worth Rs 987 crore.\nFormer Prime Minister Atal Bihari Vajpayee had inaugurated the construction of Bogibeel bridge on April 21, 2002, at Chowkidinghee playground in Dibrugarh, 17km from the construction site.\nThe Bogibeel bridge, the longest rail-cum-road bridge in the country, which will be built over the Brahmaputra, is expected to be ready by June 2017. Text by Avik Chakraborty, picture by UB Photos", "url": "https://www.telegraphindia.com/states/north-east/workers-protest/cid/1393711", "label": 1}