{"authors": [], "date_download": "2019-03-27 14:29:07", "date_modify": "2019-03-27 14:29:07", "date_publish": "2015-08-24 21:26:21", "description": "Jaipur/Lucknow/Bhopal, Aug 24 Thousands of Jain community members took to the streets on Monday in various parts of the country to protest against a Rajasthan High Court (HC) ruling earlier this month declaring 'Santhara' or a fast-unto-death religious practice followed by the community for years, as \"unconstitutional\"", "filename": "states_jain-community-protests-ban-on-religious-fast-to-death-87040_1553696947.html", "image_url": "http://www.economylead.com/wp-content/uploads/2014/04/el-fav.png", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/economylead.com/states_jain-community-protests-ban-on-religious-fast-to-death-87040_1553696947.html", "title": "Jain community protests ban on religious fast to death", "title_page": "Jain community protests ban on religious fast to death | EconomyLead", "title_rss": "NULL", "source_domain": "economylead.com", "text": "Jaipur/Lucknow/Bhopal, Aug 24 Thousands of Jain community members took to the streets on Monday in various parts of the country to protest against a Rajasthan High Court (HC) ruling earlier this month declaring ‘Santhara’ or a fast-unto-death religious practice followed by the community for years, as “unconstitutional”.\nProtests, primarily “maun” (silent) rallies were reported from Jaipur and other cities of Rajasthan, Bhopal and Indore in Madhya Pradesh, and Jhansi, Ghaziabad, Mathura, Lucknow, Agra, Meerut, and Firozabad in Uttar Pradesh with community members terming the verdict an interference in their religious beliefs and an attempt to clamp down on an age-old practice.\nA division bench of the Rajasthan High Court on August 10 had declared Santhara unconstitutional while disposing off a public interest litigation (PIL) filed in 2006 by Nikhil Soni, contending the Santhara was akin to Sati and should be banned in the same way.\nSoni said the court has observed that Santhara violates the constitution’s article 21 and directed the state to stop the process. It had ruled if someone practices it, then an FIR should be filed against them under the Indian Penal Code’s section 309 (punishment for attempting suicide) and police should undertake an investigation into it.\nAnyone provoking or supporting them should also be booked under section 306 (abetment of suicide), Soni told IANS.\nIn Jaipur, Jains took out a march while keeping their shops and businesses closed and not sending their children to schools and colleges. Schools owned or run by the community remained closed.\n“We want to educate people on Santhara so we took out this march,” said Vijay Jain, a shopkeeper.\n“There is a need to understand that Santhara and suicide are not the same,” he added.\nSimilar marches were observed in other parts of the state including Kota, Banswara and Ajmer among others.\nHundreds of Jains marched in Agra, Meerut, Baghpat, Lucknow, and Ghaziabad as well as Jain dominated areas of Firozabad and Tundla in Uttar Pradesh. While the protestors wore black bands, many people downed the shutters of their business establishments in solidarity.\nIn Mainpuri, the bastion of Samajwadi Party (SP) chief Mulayam Singh Yadav, people belonging to the Jain community took out processions and gathered at the Mandi Ramdas to express their displeasure at the court ruling. They said Santhara cannot be equated to suicide and that it was a matter of faith, something which cannot be checked or challenged by any court.\n“A person is driven to suicide by depression, frustration or anger while Santhara is the highest practice of giving up one’s body on one’s own volition,” said Prasoon Jain, who runs a photography studio in Mainpuri.\nA demonstration was also held in Khekhda area of Baghpat in western UP and in Etmadpur and Chipitola areas in Agra, where protesters who included a fair number of women and children also gave a memorandum to the sub-divisional magistrate.\nIn Gorakhpur city of eastern Uttar Pradesh, a ‘Dharm Bachao Andolan’ (Save Religion Movement) march was taken out where protesters said they will not tolerate interference in their religious beliefs.\nJain community leaders said on an average every year, 300 people gave up their life by this practice of Santhara and the number was around 100 in Rajasthan alone.\nProtests and demonstrations were also reported in many parts of Madhya Pradesh including capital Bhopal, commercial capital Indore, Jabalpur, Morena, Gwalior and Ujjain.\n(IANS)", "url": "http://www.economylead.com/states/jain-community-protests-ban-on-religious-fast-to-death-87040", "label": 1}