{"authors": [], "date_download": "2019-03-27 14:18:28", "date_modify": "2019-03-27 14:18:28", "date_publish": "2015-10-02 00:00:00", "description": "The Tripura government has protested against a possible land-swap deal in Muhurichar in Belonia subdivision of South Tripura to Bangladesh.", "filename": "states_north-east_tripura-protests-muhurichar-swap_cid_1526517_1553696308.html", "image_url": "https://www.telegraphindia.com/assets/images/default_social_image.png?v=28", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/telegraphindia.com/states_north-east_tripura-protests-muhurichar-swap_cid_1526517_1553696308.html", "title": "Tripura protests Muhurichar swap", "title_page": " Tripura protests Muhurichar swap ", "title_rss": "NULL", "source_domain": "telegraphindia.com", "text": "Agartala, Oct. 1: The Tripura government has protested against a possible land-swap deal in Muhurichar in Belonia subdivision of South Tripura to Bangladesh.\nThe bilateral meeting between representatives of the external affairs departments of India and Bangladesh in Shillong on September 24 proved inconclusive.\n\"We have made our stand clear in letters to Union external affairs minister Sushma Swaraj and home minister Rajnath Singh. We have demanded protection of Tripura's interest on the swap of Muhuri-char in Belonia subdivision,\" said revenue minister Badal Chowdhury.\nHe said the problem would not have been created had the joint survey of India and Bangladesh in 2014 was mindful of protecting Tripura's interests. The protocol signed by former Indian Prime Minister Manmohan Singh and his Bangladesh counterpart Sheikh Hasina in 2011 should have been followed in toto.\nAs part of the land-swap deal, India has handed over 110 disputed enclaves, getting 51 in return but the handing over of Muhurichar is stalled because of protests from Tripura.\n\"We came to know at the last moment that the zero line of the newly demarcated border after the land-swap deal would impinge on the SDM office and the crematorium of Belonia town,\" said Chowdhury. He said the dispute over the border had started after a sar had surfaced on the river Muhuri flowing from Tripura into Bangladesh in 1965.\n\"According to the protocol signed by Singh and Hasina, the India-Bangladesh border on the Muhurichar should start from border pillar no. 2159/48 S upto the middle of the river but a joint survey team from India and Bangladesh last year demarcated the new border without taking into account the vital interests of Tripura,\" he said.\nThis survey pushed the motor stand area of Belonia town, SDM office and the crematorium into Bangladesh.\nChowdhury said on July 23 and 24, in a meeting between Bangladesh and India, a representative from Tripura had raised the question of Muhurichar demanding modification of the deal in its present form. Subsequently, the Centre assured Tripura that the state's interests of the state would be protected.\n\"Muhurichar has 36.665 acres of which 15.65 acres are owned by Indian farmers and the rest are government land. The land-swap deal in its present form is unacceptable,\" Chowdhury said.", "url": "https://www.telegraphindia.com/states/north-east/tripura-protests-muhurichar-swap/cid/1526517", "label": 1}