{"authors": [], "date_download": "2019-03-27 14:41:01", "date_modify": "2019-03-27 14:41:01", "date_publish": "2015-03-24 00:00:00", "description": "Civic authorities will shift the Sundarpada Haat (market) to make the surroundings of Biju Patnaik International Airport cleaner - a step to reduce the bird-hit incidents.", "filename": "states_odisha_market-shift-plan-to-keep-birds-at-bay_cid_1463717_1553697661.html", "image_url": "https://www.telegraphindia.com/assets/images/default_social_image.png?v=0", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/telegraphindia.com/states_odisha_market-shift-plan-to-keep-birds-at-bay_cid_1463717_1553697661.html", "title": "Market shift plan to keep birds at bay", "title_page": " Market shift plan to keep birds at bay ", "title_rss": "NULL", "source_domain": "telegraphindia.com", "text": "The Sundarpada market near Biju Patnaik airport\nBhubaneswar, March 23: Civic authorities will shift the Sundarpada Haat (market) to make the surroundings of Biju Patnaik International Airport cleaner - a step to reduce the bird-hit incidents.\nThe decision to shift the market was taken at the meeting of the Airport Environment Management Committee here on March 20, with chief secretary Gokul Chandra Pati issuing directions to the civic authorities in this regard.\nThe chief secretary also expressed his displeasure at the delay in declaring roads near the airport's flight path as a no-cracker zone.\nAirport director Sharad Kumar said: \"The issue of shifting of the market had cropped up during discussions on several occasions in the past. But this time, the state government has agreed upon the plan with the chief secretary directing both the Bhubaneswar Municipal Corporation and the Bhubaneswar Development Authority to do the needful.\"\nA senior corporation official admitted that though the Sundarpada Haat had originally been planned to be confined within a complex in the area, the sellers are now occupying the roadside land and polluting the atmosphere by dumping waste carelessly.\nAn expert committee, employed by the Airports Authority of India (AAI) to study the pattern of birds and their movement in and around the airport, had also suggested relocation of the market.\nThe expert committee had also stated that birds used a large number of trees in and around the airport for nesting. These trees could not be pruned due to resistance from the residents of Gandamunda, OUAT farm, Badambari and Baramunda located around the airport.\nThe environment management committee has also asked the civic authorities to place more dustbins around the airport, especially near the slums.\nExperts have stated that food waste left in the open around the slums had the potential of drawing the scavenger birds. The corporation authorities had been asked to place the dustbins by April 1, so that the waste could be properly collected and disposed of.\nThe chief secretary also asked police to declare a no-cracker zone near the airport as bursting of crackers during landing and takeoff could lead to problems.\nAdditional commissioner of police Anil Patra, however, said instructions in this regard were yet to reach his department. \"Once we get the instructions, we will do the needful,\" he said.", "url": "https://www.telegraphindia.com/states/odisha/market-shift-plan-to-keep-birds-at-bay/cid/1463717", "label": 1}