{"authors": [], "date_download": "2019-03-27 14:18:18", "date_modify": "2019-03-27 14:18:18", "date_publish": "2016-09-18 00:00:00", "description": "Bar Council dismisses five TN lawyers", "filename": "states_tamil-nadu_2016_sep_18_Bar-Council-dismisses-five-TN-lawyers-1521295_1553696298.html", "image_url": "http://images.newindianexpress.com/uploads/user/imagelibrary/logo/nie_logo_600X390.jpg", "language": null, "localpath": "/home/raj/news-please-repo//data/2019/03/27/newindianexpress.com/states_tamil-nadu_2016_sep_18_Bar-Council-dismisses-five-TN-lawyers-1521295_1553696298.html", "title": "Bar Council dismisses five TN lawyers", "title_page": "Bar Council dismisses five TN lawyers- The New Indian Express", "title_rss": "NULL", "source_domain": "newindianexpress.com", "text": "Express News Service By\nCHENNAI/BENGALURU : Five Madurai-based lawyers, who were facing disciplinary proceedings before the Bar Council of Karnataka, were permanently barred from practice anywhere in the country. Besides them, eight other lawyers were suspended for three years.\nAn order to this effect was passed by the Bar Council of Karnataka, which conducted the disciplinary proceedings against 13 advocates, on September 16.\nThe five who were dismissed are AK Ramasamy, Dharmaraj, Arumugam, Nedunchezhyan and Sankaranarayanan. The first two are the office-bearers of the Madurai Bar Association.\nThe charge against the 13 lawyers was that they had organised agitations and participated in the rallies and processions to register their protest against the orders of the Madras High Court making wearing helmets compulsory for two-wheeler riders. They had also allegedly abused certain judges and accused them of indulging in corrupt activities.\nThe Bar Council of India directly issued the suspension orders to the 13 lawyers.\nOriginally, the disciplinary committee of the Bar Council of Tamil Nadu and Puducherry was entrusted with the enquiry. However, following differences of opinion between the members of the committee and allegations of bias, the probe was later transferred to the disciplinary panel attached to the Bar Council of Karnataka, which had conducted the probe for over 10 months.\nSince the order passed by the Karnataka Bar Council is quasi-judicial in nature, the aggrieved persons can only move the Bar Council of India, the parent statutory body governing the legal profession, D Selvam, chairman of TN Bar Council told Express on Saturday.", "url": "http://www.newindianexpress.com/states/tamil-nadu/2016/sep/18/Bar-Council-dismisses-five-TN-lawyers-1521295.html", "label": 1}