{"authors": [], "date_download": "2019-03-27 14:18:17", "date_modify": "2019-03-27 14:18:17", "date_publish": "2016-08-26 00:00:00", "description": "Mekedatu drinking water project returns to haunt TN farmers", "filename": "states_tamil-nadu_2016_aug_26_Mekedatu-drinking-water-project-returns-to-haunt-TN-farmers-1513016_1553696297.html", "image_url": "http://images.newindianexpress.com/uploads/user/imagelibrary/logo/nie_logo_600X390.jpg", "language": null, "localpath": "/home/raj/news-please-repo//data/2019/03/27/newindianexpress.com/states_tamil-nadu_2016_aug_26_Mekedatu-drinking-water-project-returns-to-haunt-TN-farmers-1513016_1553696297.html", "title": "Mekedatu drinking water project returns to haunt TN farmers", "title_page": "Mekedatu drinking water project returns to haunt TN farmers- The New Indian Express", "title_rss": "NULL", "source_domain": "newindianexpress.com", "text": "Express News Service By\nBENGALURU/CHENNAI: Overruling the objections raised by Tamil Nadu, the neighbouring Karnataka is all set to go ahead with the Mekedatu drinking water project in the Cauvery river basin, with the State cabinet expected to approve the detailed project report (DPR) at its next meeting. Tamil Nadu has moved the Supreme Court, opposing it. But, Karnataka is confident of convincing the neighbour that it is a drinking water project and not for irrigation, said its Water Resources Minister MB Patil in Bengaluru on Thursday.\n“The DPR will be submitted to the Supreme Court and the Central Water Commission, once Cabinet clears it. The project will not harm Tamil Nadu’s interests. The DPR will address all apprehensions and objections raised by Tamil Nadu,” Patil explained. The comments came on the day when a farmers’ delegation from Tamil Nadu called on Chief Minister Siddaramaiah, requesting him to immediately release about 20 tmcft water to save the crop planted in about nine lakh acres in Tamil Nadu this samba season. The meeting did not bear fruit, as the Chief Minister cited prevailing draught conditions to convey his inability to release water from the Cauvery reservoirs. Karnataka was not releasing water for its own farmers, as the available storage has been reserved to meet the drinking water needs of Bengaluru and other cities, Siddharamaiah told the team of 20 farmers’ associations from Tamil Nadu, led by former Rajya Sabha MP and the leader of DMK’s farmers’ wing, KP Ramalingam.\nThough the Chief Minister assured that the request would be considered if the situation improved in coming days, it has not assuaged the concerns of the farmers in Tamil Nadu who are eager to undertake samba (long term) cultivation, as both kuruvai (short term) and thalady (between kuruvai and samba) were not taken up to full potential in the last five years.\n“He said the farmers in Karnataka would take to the streets if their government decided to discharge water for Tamil Nadu,” Ramalingam told Express.", "url": "http://www.newindianexpress.com/states/tamil-nadu/2016/aug/26/Mekedatu-drinking-water-project-returns-to-haunt-TN-farmers-1513016.html", "label": 1}