{"authors": [], "date_download": "2019-03-27 14:28:59", "date_modify": "2019-03-27 14:28:59", "date_publish": "2016-11-27 00:00:00", "description": "When Bengal chief minister Mamata Banerjee stages a demonstration in Patna next week to demand rollback of demonetisation, Nitish Kumar will not be there but Lalu Prasad just might.", "filename": "states_bihar_lalu-buzz-at-mamata-dharna_cid_1349775_1553696939.html", "image_url": "https://www.telegraphindia.com/assets/images/default_social_image.png?v=57", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/telegraphindia.com/states_bihar_lalu-buzz-at-mamata-dharna_cid_1349775_1553696939.html", "title": "Lalu buzz at Mamata dharna", "title_page": " Lalu buzz at Mamata dharna ", "title_rss": "NULL", "source_domain": "telegraphindia.com", "text": "Note Support: Mamata Banerjee and Lalu Prasad\nPatna, Nov. 26: When Bengal chief minister Mamata Banerjee stages a demonstration in Patna next week to demand rollback of demonetisation, Nitish Kumar will not be there but Lalu Prasad just might.\nMamata, who is also the Trinamul Congress boss, has been vehement in her criticism of Prime Minister Narendra Modi's demonetisation decision. She is at the forefront of the agitation against the ban on large currencies and has planned protests in different parts of the country to force a rollback.\nShe will stage a protest at Jantar Mantar in New Delhi on November 28, hope to replicate it in Lucknow on November 29 and then in Patna on November 30. Nitish will not be by her side, but the RJD boss might participate after Trinamul Congress vice-president Mukul Roy met him in Patna yesterday.\nThe Bihar and Bengal chief ministers, who have previously attacked the Centre together over a variety of issues and have attended each other's swearing-in ceremonies, seem to have fallen apart over Modi's move to scrap the old Rs 500 and 1,000 currency notes. The scrapped notes constitute 86 per cent of the total currency in circulation.\nWhile Mamata is strongly against the move, Nitish has been vocal about his support for demonetisation. He has praised this decision of Modi at various public and private engagements and called it being in the national interest.\nAsked about Mamata's dharna this coming Wednesday on the sidelines of the Prohibition Day celebrations today, Nitish said: \"Everybody has freedom to do what they want or wish.\"\nThe Bihar chief minister also chose to keep quiet on questions regarding his participation in Mamata's protest, which was announced by Trinamul's Mukul Roy in Patna yesterday.\nHe professed ignorance about Roy's visit to Patna with a tersely crisp \" humko nahi pata hai (I don't know).\"\nNitish had yesterday also shrugged off Mamata's allegation that he was supporting demonetisation because of some political compulsions by retorting \"What compulsion do I have? Is expressing one's viewpoint a compulsion? I always speak and do what I feel is right. I supported Pranab Mukherjee's candidature for the President's post while I was a part of the NDA.\"\nMukul met Lalu at his 10 Circular Road residence last evening to garner support for Mamata's agitation plans against demonetisation. RJD sources said though their chief has remained non-committal, he or a few of his family members might participate in the November 30 demonstration.\n\"Lalu is uneasy after Nitish showed strong support and admiration for Modi over scrapping of the notes, especially at a time when he (Lalu) and even former JDU president Sharad Yadav were denouncing the Prime Minister for causing immense hardship to the common public,\" a senior RJD leader, who was earlier in the JDU, told The Telegraph on the condition of anonymity. \"This unease may lead him to Mamata as he knows that a strong and united opposition will be to his advantage. He has a lot at stake.\"\nMamata's foray into the Hindi heartland and her efforts to unite over a dozen parties comes at a time when Nitish has been working hard, by way of prohibition, call for greater alliances and expansion efforts in Uttar Pradesh, at a national role and the JDU's projection of him as an anti-BJP front leader.", "url": "https://www.telegraphindia.com/states/bihar/lalu-buzz-at-mamata-dharna/cid/1349775", "label": 1}