{"authors": ["Ismail Raja"], "date_download": "2019-03-27 14:18:20", "date_modify": "2019-03-27 14:18:20", "date_publish": "2018-04-06 19:12:11", "description": null, "filename": "state__1553696300.html", "image_url": "http://www.bhatkallys.com/wp-content/uploads/2016/05/bhatkallys-default.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/bhatkallys.com/state__1553696300.html", "title": "Cauvery Management Board: Vatal calls for Karnataka bandh on April 12", "title_page": "Cauvery Management Board: Vatal calls for Karnataka bandh on April 12 - Bhatkallys.com", "title_rss": "NULL", "source_domain": "bhatkallys.com", "text": "Bengaluru: Kannada activist Vatal Nagaraj has called for a Karnataka bandh on April 12 to protest against any attempt to form a Cauvery Management Board (CMB).\nThis comes in the backdrop of Tamil Nadu observing a bandh on Thursday demanding that the Union government form the board at the earliest.\nThe Centre had sought a clarification from the Supreme Court over the word “scheme” in its February order over the issue.\n“It is a pity that neither of the mainstream political parties in the State is talking about the issue. It is critical that Karnataka registers its protest against the formation of the board,” said Vatal Nagaraj.\nHe added that he had convened a meeting on Saturday with other Kannada organisations seeking support for the bandh. When asked whether a bandh was feasible during an ongoing election, he said it was scheduled before the calendar of events for submission of nominations begins on April 17 and hence should pose no issues with Election Commission.\nMeanwhile on Thursday morning, Vatal Nagaraj and several Kannada activists, including Sa. Ra. Govindu, president of Karnataka Film Chamber of Commerce, held a protest at the Karnataka-Tamil Nadu border at Attibele, blocking traffic between the two States.\nSource: News Karnataka", "url": "http://www.bhatkallys.com/state/cauvery-management-board-vatal-calls-for-karnataka-bandh-on-april-12/", "label": 1}