{"authors": [], "date_download": "2019-03-27 14:35:31", "date_modify": "2019-03-27 14:35:31", "date_publish": "2015-11-22 23:52:51", "description": null, "filename": "supplements_conflict-zones-amp-pressing-times-105867_1553697331.html", "image_url": "https://www.thestatesman.com/wp-content/themes/statesmancms/images/favicon.ico", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/thestatesman.com/supplements_conflict-zones-amp-pressing-times-105867_1553697331.html", "title": "Conflict zones & pressing times", "title_page": "Conflict zones & pressing times - The Statesman", "title_rss": "NULL", "source_domain": "thestatesman.com", "text": "Reporting from a conflict zone has its share of anxieties. Mediapersons find themselves sandwiched between state and non-state actors and while the security forces complain that the media gives undue importance to the quotes of militant leaders and cedes space to regular releases from these outfits, the militant groups often call up media houses to question and intimidate when their releases are not carried verbatim. Similarly, security forces expect their releases to be given the importance “they deserve”.\nIn this game of oneupmanship, the role of editors and their discretion and editorial wisdom are given a wide berth. In fact, when you are reporting from a conflict zone, you are told by the interested actors how and where to place their views. Everyone wants prime space even if they don’t deserve it. How do editors negotiate that slippery slope without being seen as antagonistic to the cause of any single group? This is a tough call and there really is no standard operating procedure that one can follow except to rely on one&’s experience and the broad parameters of media ethics.\nThe editors of Nagaland find themselves in a predicament that is not new to their profession but which is jarring mainly because of the tone and tenor of the discourse. On 24 October, the Assam Rifles wrote to Nagaland newspaper editors asking them to refrain from publishing any news from the banned Myanmar-based NSCN (Khaplang) group. The Colonel General Staff for Assam Rifles, who wrote the letter, categorically stated that by carrying news from an outlawed outfit that carries on an agenda of violence against the Indian state, the Nagaland media was (a) intentionally or unintentionally supporting unlawful association; (b) they had violated the Unlawful Activities (Prevention) Act of 1967; and (c) by publishing statements by banned organisations, they were, ipso facto, complicit in the organisation&’s illegal activities. These are serious allegations with dangerous portents. The colonel&’s order immediately co-opts the media as an agency of the state, thereby placing on it the responsibility of containing terror by not publishing missives from an outlawed militant outfit.\nBut this is clearly a faulty understanding of the role of the media. Its primary role is to report events as they unfold. When the NSCN(K) threatens to launch frontal attacks on the armed forces or their installations, or on rival militant outfits, a report in the media about such threats cannot be considered as a case of the media taking sides with the outfit and by default going against the state of which the armed forces are a visible image of state power.\nIt is also a question of interpretation and perception. For the Naga people, all rival factions carrying the same National Socialist Council of Nagalim acronym are considered “national workers” who have been pursuing the objective of a sovereign Nagaland for nearly five decades. While the factions may have their internal differences (and these differences are often created by the Indian state for its vested interests), for the people of Nagaland it makes no difference. Each faction has its acceptability among different groups.\nThe media in Nagaland reflects the views, concerns and aspirations of the people there. It cannot be expected to take a statist position. The media reports what the state and non-state actors say; it has to report their acts of omission and commission (especially their acts of brutality) because the public needs to know and to form their opinion based on these reports. After all, every act, whether that of militants or state actors, impinges on the civilian population and in that sense it is political.\nAs far as the NSCN(K) is concerned, the outfit had a ceasefire agreement with the Centre until March this year when SS Khaplang arbitrarily abrogated the truce and signed a pact with the Myanmarese junta instead. This could not have been a positive development for India considering that the Modi government had in August this year signed a framework agreement with the NSCN(IM) and that government interlocutor RN Ravi has been insistent on bringing all stakeholders (armed outfits, civil society groups, academics, individuals, et al) within the ambit of the agreement.\nThe divorce with the NSCN(K) can only create roadblocks. But the Khaplang outfit has also earned the Centre&’s displeasure after it launched a series of attacks on armed forces after revocation of the ceasefire; the most glaring being the one in June in Manipur, where 18 soldiers lost their lives. The Centre henceforth declared the outfit “outlawed” and recently gave it a “terrorist” tag. These are actions taken by the state — and they are inevitable, considering the outfit&’s intransigence — but for the Naga people Khaplang represents their kinsmen in Myanmar who, by the senseless drawing of boundary lines by a colonial power, divided people of the same race and clans outside of their common hearths and homes; divided their social spaces; their kinship ties and their longing for a reunion that they hope will materialise one day. It is against this dichotomous backdrop that the newspapers of Nagaland operate. And one can imagine that it is not a happy situation.\nOn 16 November, which is observed as National Press Day, the editors of three newspapers in Nagaland — The Morung Express, Nagaland Page and Eastern Mirror — carried blank editorials to register their protest against the Assam Rifles’ diktat. They have also refuted point by point the allegations levelled by the Assam Rifles and have circulated their responses on social media.\nMessages of solidarity have been pouring in from the media fraternity throughout the country. But mere messages of support may not be adequate to safeguard press freedom in the North-east. Institutions like the Press Council of India have to take a proactive stance to defend the rights of mediapersons reporting from conflict zones. The PCI cannot just be a watchdog censuring the media for its acts of omission and commission. It is there to regulate, educate, build and strengthen media institutions and their practitioners so that they do not operate in a climate of insecurity and defensiveness but remain transparent and committed to their vocation. Thankfully this time the PCI has come up with a sharp statement against forces that seek to throttle press freedom.\nMeanwhile, following the hue and cry from different quarters and from media establishments from across the country on its controversial missive, the Assam Rifles has clarified, albeit belatedly, that the intent of the letter was not to issue a “gag order” on the press but to prevent contact of NSCN (K) with the public for conveying their “Extortion Demands” or “Extortion Threats”.\nThis clarification is a feeble attempt to correct perceptions and does not reflect the tone and tenor of the first Assam Rifles letter to media houses. The force appears to gone overboard by taking on the Fourth Estate in its frustrated attempts to keep the NSCN(K) under check. But these attempts to check press freedom by different actors and institutions, including, at times, the judiciary are unwarranted. The media in India needs to take pause and stand together at this critical juncture to defend their sacred space.\nThe author is Editor, The Shillong Times, and member, National Security Advisory Board. She can be contacted at [email protected]", "url": "https://www.thestatesman.com/supplements/conflict-zones-amp-pressing-times-105867.html", "label": 1}