{"authors": [], "date_download": "2019-03-27 14:34:57", "date_modify": "2019-03-27 14:34:57", "date_publish": "2018-06-23 00:00:00", "description": "The DMK working chief led the party worker's rally to the office of Governor Purohit in Chennai.", "filename": "tamil-nadu_dmks-mk-stalin-detained-in-trichy-for-protesting-against-tamil-nadu-governor-banwarilal-purohit-2119285_1553697297.html", "image_url": "https://english.cdn.zeenews.com/sites/default/files/2018/06/23/698106-stalin.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/zeenews.india.com/tamil-nadu_dmks-mk-stalin-detained-in-trichy-for-protesting-against-tamil-nadu-governor-banwarilal-purohit-2119285_1553697297.html", "title": "DMK's MK Stalin detained in Trichy for protesting against Tamil Nadu Governor Banwarilal Purohit", "title_page": "DMK's MK Stalin detained in Trichy for protesting against Tamil Nadu Governor Banwarilal Purohit | Tamil Nadu News", "title_rss": "NULL", "source_domain": "zeenews.india.com", "text": "CHENNAI: DMK working president MK Stalin was detained, while he was protesting against Tamil Nadu Governor Banwarilal Purohit on Saturday. The DMK working chief led the party worker's rally to the office of Governor Purohit in Chennai.\nStalin was protesting against the arrest of DMK party cadres at Namakkal while accusing the Governor of acting against the principles of federalism. \"The protest is against Governor's interference in a federal structure,\" Stalin said.\nChennai: DMK working Pres MK Stalin detained while protesting against TN Guv Banwarilal Purohit. 192 DMK cadres were detained in Trichy yesterday while they were holding black-flag protest against Governor. Stalin says, 'Protest is against Guv's interference in federal structure' pic.twitter.com/91WuDUk7jg — ANI (@ANI) June 23, 2018\nOn Friday, nearly 192 DMK cadres were detained in Trichy while they were holding a black-flag protest against the Governor.\n\"DMK has a history of showing black flags to many leaders, including Indira Gandhi, but never were cadres arrested. We want the Governor to resign,\" he added.\nStalin has been demanding the Purohit's resignation for the last three months. In April this year, the DMK working president wanted Tamil Nadu Governor to step down from his post.\n(With inputs from agency)", "url": "https://zeenews.india.com/tamil-nadu/dmks-mk-stalin-detained-in-trichy-for-protesting-against-tamil-nadu-governor-banwarilal-purohit-2119285.html", "label": 1}