{"authors": [], "date_download": "2019-03-27 14:34:52", "date_modify": "2019-03-27 14:34:52", "date_publish": "2017-02-27 00:00:00", "description": "O Panneerselvam, former Tamil Nadu chief minister, is on a day-long hunger strike outside Chennai's Rajaratnam stadium, to demand a CBI inquiry into what he calls the mystery behind the death of J Jayalalithaa, who died on December 5 last year. About 4,000 supporters surrounded him, while other leaders of his faction of the AIADMK are leading more such protests in other districts of the state.", "filename": "tamil-nadu-news_investigate-jayalalithaas-mystery-death-says-o-panneerselvam-on-hunger-strike-1667530_1553697292.html", "image_url": "https://i.ndtvimg.com/i/2017-02/o-panneerselvam_650x400_61487310846.jpg", "language": null, "localpath": "/home/raj/news-please-repo//data/2019/03/27/ndtv.com/tamil-nadu-news_investigate-jayalalithaas-mystery-death-says-o-panneerselvam-on-hunger-strike-1667530_1553697292.html", "title": "Investigate Jayalalithaa's 'Mystery' Death, Says O Panneerselvam, On Hunger Strike", "title_page": "Investigate Jayalalithaa's 'Mystery' Death, Says O Panneerselvam, On Hunger Strike", "title_rss": "NULL", "source_domain": "ndtv.com", "text": "O Panneerselvam is on day-long hunger strike demanding CBI inquiry into J Jayalalithaa death (File)\nO Panneerselvam, former Tamil Nadu chief minister, is on a day-long hunger strike outside Chennai's Rajaratnam stadium, to demand a CBI inquiry into what he calls the mystery behind the death of J Jayalalithaa, who died on December 5 last year. About 4,000 supporters surrounded him, while other leaders of his faction of the AIADMK are leading more such protests in other districts of the state.Mr Panneerselvam or OPS as he is called, says there are many gaps and unanswered questions in reports released by the state government and doctors of Chennai's Apollo hospital and Delhi's AIIMS, who treated former chief minister Ms Jayalalithaa during her 75-day stay in hospital.The hungerstrike comes just before crucial local body polls to be held in May, fueling speculation that Mr Panneerselvam could field rebel candidates of his own against those of the AIADMK led by VK Sasikala. Both factions claim to Ms Jayalalithaa's legacy and Mr Panneerselvam's protest is being seen as an attempt to rally Jayalalithaa loyalists and supporters within and outside the AIADMK ahead of the civic elections.The OPS camp has demanded to know who gave doctors consent to take Ms Jayalalithaa, who was also the powerful chief of the AIADMK, off life support. \"Who gave consent for natural cessation of life in the case of Jayalalithaa. They should reveal details of consent given for various procedures she underwent. They should release documents to prove that they are Amma's family,\" said former minister Manoj Pandian, one of the few party leaders who have backed Mr Panneerselvam against Ms Sasikala, Ms Jayalalitaa's closest companion of many years, who is now the party's general secretary.The report from AIIMS was seen to gave a clean chit to Apollo Hospital and Ms Sasikala, who was with Ms Jayalaithaa all through her hospitalisation and before. The report said there was no indication that Ms Jayalalithaa was in trauma, ruled out wrong medication ahead of hospitalisation and confirmed that doctors advised the chief minister's family on withdrawing ventilator support only after they assessed she would not recover.Team OPS says they are the \"real AIADMK,\" and have challenged Ms Sasikala's elevation to the post of party chief. The Election Commission is expected to rule on their petition on Friday.In his rebellion against Ms Sasikala last month, public opinion was distinctly tilted towards Mr Panneerselvam, but he could get the support of only 11 AIADMK legislators and 12 members of parliament. The rest backed E Palanisamy, handpicked by Ms Sasikala to be the state's chief minister after her plan to take the post was crushed by the Supreme Court sending her to jail in a corruption case. Team OPS alleges that MLAs were forced to back Ms Sasikala's proxy. \"Police officers who probed allegations of kidnap of MLAs at the resort outside Chennai have been transferred or kept waiting for appointment. How will authorities probe the issue ?\" said Dr V Maitreyan, Rajya Sabha MP, who led protests in Kancheepuram.\nGet the latest election news, live updates and election schedule for Lok Sabha Elections 2019 on ndtv.com/elections. Like us on Facebook or follow us on Twitter and Instagram for updates from each of the 543 parliamentary seats for the 2019 Indian general elections.", "url": "https://www.ndtv.com/tamil-nadu-news/investigate-jayalalithaas-mystery-death-says-o-panneerselvam-on-hunger-strike-1667530", "label": 1}