{"authors": [], "date_download": "2019-03-27 14:35:02", "date_modify": "2019-03-27 14:35:02", "date_publish": "2018-06-20 16:15:06", "description": "Actor Kamal Haasan on Wednesday slammed the Tamil Nadu government for arresting people protesting against the eight-lane green corridor between Chennai and Salem.", "filename": "tamil-nadu-news_kamal-haasan-in-delhi-kamal-haasan-slams-tamil-nadu-government-on-chennai-salem-expressway-arrests-1870519_1553697302.html", "image_url": "https://c.ndtvimg.com/kamal-haasan-pti_625x300_1529491209773.jpg", "language": null, "localpath": "/home/raj/news-please-repo//data/2019/03/27/ndtv.com/tamil-nadu-news_kamal-haasan-in-delhi-kamal-haasan-slams-tamil-nadu-government-on-chennai-salem-expressway-arrests-1870519_1553697302.html", "title": "Kamal Haasan Hits Out At Tamil Nadu Government On Expressway Arrests", "title_page": "Kamal Haasan In Delhi: Kamal Haasan Slams Tamil Nadu Government On Chennai-Salem Expressway Arrests", "title_rss": "NULL", "source_domain": "ndtv.com", "text": "Kamal Haasan slammed the Tamil Nadu government for arresting people protesting the Chennai-Salem corridor\nActor Kamal Haasan on Wednesday slammed the Tamil Nadu government for arresting people protesting against the eight-lane green corridor between Chennai and Salem.\"To treat anyone talking about environment as a crime is not acceptable. This concern should be there among all,\" he told reporters when asked about his views on the raging controversy over the proposed expressway connecting the two cities.The Tamil Nadu police has been accused of indiscriminate and arbitrary arrests of people and activists protesting against the project on the ground that thousands of hectares of land of agriculturists and others would be acquired, leaving them in the lurch.\nGet the latest election news, live updates and election schedule for Lok Sabha Elections 2019 on ndtv.com/elections. Like us on Facebook or follow us on Twitter and Instagram for updates from each of the 543 parliamentary seats for the 2019 Indian general elections.", "url": "https://www.ndtv.com/tamil-nadu-news/kamal-haasan-in-delhi-kamal-haasan-slams-tamil-nadu-government-on-chennai-salem-expressway-arrests-1870519", "label": 1}