{"authors": [], "date_download": "2019-03-27 14:35:20", "date_modify": "2019-03-27 14:35:20", "date_publish": "2018-04-05 17:05:26", "description": "While protesters blocked roads and disrupted railway services across the state, police stepped up efforts to ensure that essential services were not hit.", "filename": "tamil-nadu_cauvery-issue-dm_911f2d7fd42c2d937818b2c37237dc36_story-qhdbPunklzOUGsbZ5TOcNI_1553697320.html", "image_url": "https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2018/04/05/Pictures/protest-for-cauvery-management-board_d963e230-38c4-11e8-8aa5-05fdb8d0ae52.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/hindustantimes.com/tamil-nadu_cauvery-issue-dm_911f2d7fd42c2d937818b2c37237dc36_story-qhdbPunklzOUGsbZ5TOcNI_1553697320.html", "title": "Cauvery issue: DMK-backed bandh evokes mixed response in Tamil Nadu", "title_page": "Cauvery issue: DMK-backed bandh evokes mixed response in Tamil Nadu | tamil nadu | Hindustan Times", "title_rss": "NULL", "source_domain": "hindustantimes.com", "text": "A shutdown call by the DMK and allied political parties to protest the Centre’s failure to set up the Cauvery Management Board (CMB) in keeping with a Supreme Court deadline evoked a mixed response in Tamil Nadu on Thursday.\nWhile protesters blocked roads and disrupted railway services across the state, police stepped up efforts to ensure that essential services were not hit. Hundreds were taken into custody as the day wore on.\nBus services between cities in Karnataka and Tamil Nadu were suspended as a precautionary measure, given the sensitivity of the Cauvery issue. The bandh failed to affect transport services in Chennai, with the city authorities pressing 3,000 buses into service and ensuring that suburban train services ran as usual. Nevertheless, transport unions came out in support of the shutdown call issued by the opposition parties.\nMembers of the Tamil Nadu Farmers Association stage a 'rail roko' protest during a bandh called by opposition parties in the state on Tuesday. ( PTI photo )\nDMK working president MK Stalin led the protest from the front by sitting on dharna at the EVR statue on Anna Salai. Leaders from various parties – including Tamil Nadu Congress Committee president Thirunavukarasar, Viduthalai Chiruthaigal Katchi chief Thol Thirumavalavan and Dravida Kazhagam leader KVeeramani – accompanied him in the agitation, even as party cadres blocked the busy road.\nThe scene was similar on Beach Road, where protesters lay across it in batches to prevent traffic from moving. As soon as police removed one batch, a fresh one would take its place. Buses were employed to whisk DMK supporters to Rajarathnam Stadium in Egmore. The road was secured only after all the agitating leaders were eventually detained.\nThe situation was worse in southern Tamil Nadu, where buses kept off the streets and commercial establishments remained shut since morning. Even roadside tea shops joined in the protest here.\nDMK activists held a rail roko agitation at the Lalgudi railway station in Tiruchirapalli. Similar protests were witnessed at many railway stations across the state.\nThe Supreme Court, in its February 16 verdict, directed the Centre to set up the CMB within six weeks (by March 29). The Centre, however, sought three more months allegedly in view of the upcoming Karnataka assembly elections.\nFirst Published: Apr 05, 2018 17:05 IST", "url": "https://www.hindustantimes.com/tamil-nadu/cauvery-issue-dmk-backed-bandh-evokes-mixed-response-in-tamil-nadu/story-qhdbPunklzOUGsbZ5TOcNI.html", "label": 1}