{"authors": [], "date_download": "2019-03-27 14:40:27", "date_modify": "2019-03-27 14:40:27", "date_publish": "2017-06-26 00:00:00", "description": "A combination of coercive and non-coercive means is being used to silence criticism", "filename": "todays-paper_tp-opinion_res_10bba1ac0155c0d7bf396c902f8ee716_article19146563_1553697627.html", "image_url": "https://www.thehindu.com/todays-paper/tp-opinion/article19146562.ece/ALTERNATES/LANDSCAPE_615/Th26-Zoya-StfliGE51VRKBQ3jpgjpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/thehindu.com/todays-paper_tp-opinion_res_10bba1ac0155c0d7bf396c902f8ee716_article19146563_1553697627.html", "title": "Restricting protests, stifling dissent", "title_page": "\nRestricting protests, stifling dissent - OPINION - The Hindu\n", "title_rss": "NULL", "source_domain": "thehindu.com", "text": "Opposition by major political parties against the Bharatiya Janata Party’s plans to establish its total dominance of the electoral landscape is still quite feeble. But public protests have surfaced to challenge its social and political agenda and the attempt to impose an exclusionary Hindu identity. More importantly, the economy is in distress. There is hardly any job creation for the 12 million people who enter the workforce annually. This would surely be a source of disquiet for the middle classes who form the core support base of Prime Minister Narendra Modi. Even supporters have begun to complain that despite the government loudly trumpeting its achievements, key policies have simply not delivered acche din .\nIn the air\nDiscontent is in the air, it is palpable in the growing protests and the appearance of non-sectarian mass movements in different parts of the country. Farmer protests have broken out in several States; Dalits are a disenchanted lot and have taken to active protests, from Una to Saharanpur, despite the systematic attempt to woo them; the ongoing student protests in universities highlight the continuing resistance against assaults on the autonomy to think and the right to engage with ideas the ruling dispensation disapproves of. Even though these protests are not pervasive and do not pose a serious challenge to the BJP’s winning spree in elections, they have nonetheless invited the wrath of the government.\nAt a broader level, dissent has been curbed through a combination of coercive and non-coercive means. These include reducing the remit of Right to Information (RTI), curbs on foreign-funded NGOs, criminalisation of dissent through sedition provisions of the penal code, and the hounding of human rights activists and civil society groups. One can add to this list the recent CBI raids on NDTV which many people have rightly read as a message to the media in general to fall in line, if they haven’t already done so. This is similar to the way in which the Jawaharlal Nehru University and the Film and Television Institute of India were targeted earlier with the express purpose of eradicating important sites of dissent. Each of these institutions is perceived as a threat to the ideological agenda of the regime, raising inconvenient questions that the regime feels needed to be silenced.\nRecent experience shows a concerted effort by the government to dampen anti-regime protests either by remaining in denial and dismissing protests, or more often by using police powers to discourage people from protesting. Three protests in the past few months exemplify this trend. Farmers in Madhya Pradesh began protests over low prices for their crops on June 1. Mandsaur became the nerve centre of the protest, resulting in five deaths in police firing. After that, demonstrations and rallies were not allowed under Section 144 of the Criminal Procedure Code, and these restrictions remained in force for several days.\nLikewise, in Saharanpur, the police and administration imposed Section 144 to restrict assembly after a man was killed in a clash between the Dalit and the Thakur communities. Here too, Opposition leaders were denied entry and the police prevented people from reaching protest sites or using them for organising protests.\nIn the third case, the police arrested a handful of Lucknow University students earlier this month for blocking the convoy of Uttar Pradesh Chief Minister Adityanath and showing black flags to him when he was on his way to attend a programme in the university. Students arrested for breaching security of the Chief Minister were later denied bail. The State government justified its harsh actions by branding everyone who protested as ‘anti-nationals’ or ‘Naxalites’ when actually such branding can be termed as a diversion from the social and economic disentitlements occurring in reality.\nCurbs on protest are not new, but there is a sense in which these negative trends have accentuated or sharpened over the past three years, marking an unprecedented attack on the politics of opposition. The previous government too made things difficult for protest movements. The ‘India Against Corruption’ movement is known to have had difficulties in getting permission for centrally located places to organise their anti-corruption protest. The midnight arrest of Baba Ramdev by the Delhi Police at Ramlila Maidan in June 2011 when he was carrying out a protest against the United Progressive Alliance (UPA) government’s inaction on the black money issue is a clear case of government overreach.\nThe Supreme Court had pulled up the UPA government and Delhi Police for the crackdown. It said the right to protest or join a protest is an essential part of free speech, and upheld the right to assemble. Additionally, it argued that it is an obligation of the state to make this effective and not restrict it by imposing restrictions on assembly. Not surprisingly, Arun Jaitley, then Leader of the Opposition in the Rajya Sabha, welcomed the landmark order, but criticised the charge of “contributory negligence” (an obligation on the protesters to obey every lawful order which in this case is Section 144) against Baba Ramdev, which he argued amounts to a surrender of the right to protest. In other words, if protesters are within their right to protest, they are equally within their right not to accept an illegal order denying them the right to protest.\nTimes have changed\nBut the same lofty principle doesn’t seem to apply to protests organised against the current dispensation where citizens are compelled to abdicate the right to protest because the state arbitrarily decides to throw the ‘anti-nationalist’ label at anyone who questions the government and protesters are regularly accused of disturbing peace to stop them from reaching protest sites.\nThe police in Haryana recently booked 15 Dalit protesters on sedition charges in Karnal; they had demanded the release of four Dalits arrested for a murder committed during a clash between castes at a village in Ambala three months ago. These men had met the Haryana Chief Minister on April 24 to demand a fair probe into inter-caste clashes. In effect, by charging them with sedition the police action has declared that it is now illegal to criticise the government or gather people for a protest.\nAt this point, when uncritical nationalist fever is running high in the country, such arbitrariness will make it more difficult to exercise the right to protest which is an integral part of constitutional guarantees.\nSo, where does this leave the issue of democracy? This is precisely the space in which dissent and democracy make their connection. Freedom of expression and its concomitant, the concept of dissent, are essential for democracy. It is a concept that contains within it the democratic right to object, oppose, protest and even resist. In the end, keeping dissent alive is to practise what Edward Said called “speaking truth to power” in his penultimate 1993 Reith Lectures. Or as he put it, “No one can speak up all the time on all the issues. But, I believe, there is a special duty to address the constituted and authorised powers of one’s own society, which are accountable to its citizenry, particularly when those powers are exercised in a manifestly disproportionate and immoral war, or in a deliberate programme of discrimination, repression, and collective cruelty.”\nZoya Hasan is professor emerita, Jawaharlal Nehru University and distinguished professor, Council for Social Development, New Delhi", "url": "https://www.thehindu.com/todays-paper/tp-opinion/restricting-protests-stifling-dissent/article19146563.ece", "label": 1}