{"authors": [], "date_download": "2019-03-27 14:34:47", "date_modify": "2019-03-27 14:34:47", "date_publish": null, "description": "Find Press Tust Of India Latest News, Videos & Pictures on Press Tust Of India and see latest updates, news, information from NDTV.COM. Explore more on Press Tust Of India.", "filename": "topic_press-tust-of-india_1553697287.html", "image_url": "https://cdn.ndtv.com/static/images/logo_ndtv-57x57.png", "language": null, "localpath": "/home/raj/news-please-repo//data/2019/03/27/ndtv.com/topic_press-tust-of-india_1553697287.html", "title": "Press Tust Of India", "title_page": "Press Tust Of India: Latest News, Photos, Videos on Press Tust Of India - NDTV.COM", "title_rss": "NULL", "source_domain": "ndtv.com", "text": "GST Council Cuts Rate On Under Construction Flats To 5% GST Council meet: The Council also cut GST rates on affordable housing to 1 per cent from the current 8 per cent.\nTop BJP Leaders To Attend OBC Convention Beginning From Today Top BJP leaders from across the country, including Union Home minister Rajnath Singh and party president Amit Shah, would be descending on the city in the next couple of days to attend a two-day convention of its OBC Morcha, aimed at securing a foothold among the sizeable Other Backward Classes (OBC) in the general election.\nRs 400 Crore For Delhi Metro In Government's Interim Budget The Delhi Metro has been given a grant of Rs 414.70 crore in the Union Budget 2019-20 as against Rs 50 crore in the last fiscal.\nGifts Received By PM Modi To Be Auctioned For ''Clean Ganga'' Project The government will be auctioning about 1,900 gifts received by Prime Minister Narendra Modi and the funds raised will be used for the project to clean river Ganga, according to a statement.\nCertain Entities Adopting Unfair Business Practices: Sun Pharma In November 2018, a whistleblower approached Sebi with a document alleging various irregularities by the company, its promoter and others.\nRajkummar Rao And Mouni Roy's Made in China Release Date Shifted To Avoid Major Box Office Clashes Made in China will now hit the screens on August 30\nUrjit Patel Resignation \"Disturbing\", Says Bank Staff Association The government is bent on weakening the RBI and making it pliable to meet its own political needs, said All India Bank Employees' Association General Secretary CH Venkatachalam.\nHCL Tech To Buy Select IBM Products In 12,700 Crore-Rupees All-Cash Deal The deal entails seven products in areas including security, marketing and collaboration solutions, and represents a total addressable market of more than $50 billion, HCL Tech said.\nRailway Employees Call For 'Work-To-Rule' Protest From December 11 Such an action is considered less disruptive than a strike or lockout, and obeying the rules is less susceptible to disciplinary action.\nMan Found Dead With Bleeding Injuries, Allegedly Attacked By Elephant A 45-year-old man was found lying dead with bleeding injuries near Masinagudi bridge, about 30 km from Ooty today, allegedly after being attacked by an elephant.\nRupee Extends Gains, Up 6 Paise Against US Dollar In Early Trade Rupee Vs US Dollar: Rupee strengthens by 6 paise to 73.42 against the US dollar in early trade on Wednesday on increased selling of the American currency by exporters and banks.\nFour Rohingyas Arrested For Illegally Procuring Aadhaar Card In Hyderabad Four Rohingyas including a woman were today arrested for allegedly illegally procuring Aadhaar and Voter ID cards by making false representation of being Indian nationals, police said.\nFarmers Who Don't Burn Crops In Haryana To Be Awarded Government to launch a massive campaign in Haryana to create awareness among farmers about proper management of crops residue.\nRajasthan Police Warns Against \"Rackets In Garb Of Cow Protection\" The Rajasthan police on Tuesday said the extortion rackets being run in the garb of cow vigilantism are on its radar.", "url": "https://www.ndtv.com/topic/press-tust-of-india", "label": 1}