{"authors": [], "date_download": "2019-03-27 14:34:53", "date_modify": "2019-03-27 14:34:53", "date_publish": null, "description": null, "filename": "updates_Cauvery_River_water_issue_%E2%80%93_Agitators_set_fire_to_over_40_buses_1553697293.html", "image_url": "http://www.andhranews.net/favicon.ico", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/andhranews.net/updates_Cauvery_River_water_issue_%E2%80%93_Agitators_set_fire_to_over_40_buses_1553697293.html", "title": "Cauvery River water issue - Agitators set fire to over 40 buses", "title_page": "Cauvery River water issue – Agitators set fire to over 40 buses - AndhraNews.net", "title_rss": "NULL", "source_domain": "andhranews.net", "text": "Monday, September 12, 2016\nBengaluru\nOver 40 buses were set a fire by agitators\nSection 144 imposed\nOver 15,000 police personnel deployed.\nThe pro-Kannada activists in protest against the Supreme Court’s judgement on Karnataka’s plea in Cauvery River water issue set a fire over 40 buses belonging to Tamil Nadu.\nThe police were forced to lathi charge on the pro-Kannada organizations who were protesting attacks on Kanndigas and on their vehicles in Bengaluru.\nThe apex court today on Monday directed Karnataka government to release a reduced amount of 12,000 cusecs of Cauvery River water per day to Tamil Nadu till September 20. In protest against the judgement, Karnataka registered vehicles were vandalized by protesters in Tamil Nadu.\nIn the back drop of these agitations, the Karnataka government imposed Sec.144 in Bengaluru.\nBuses and metro services were put to halt. All educational institutions, commercial and government offices including banks, cine theatres were shut down. The government has deployed Rapid Action Force to bring the situation under control. The agitators have damaged hotels belonging to Tamil Nadu people and they burnt the cine posters of Kabali acted by Rajani Kanth.\nComment on this story", "url": "http://www.andhranews.net/updates/Cauvery_River_water_issue_%E2%80%93_Agitators_set_fire_to_over_40_buses", "label": 1}