{"authors": [], "date_download": "2019-03-27 14:29:02", "date_modify": "2019-03-27 14:29:02", "date_publish": "2017-07-11 19:34:48", "description": "Various issues of farmers, including loan waiver, were raised at the protest, which was led by RLD national general secretary Jayant Chowdhury.", "filename": "uttar-pradesh_rld-protest-against-uttar-pradesh-government-throws-traffic-out-of-gear-2023037_1553696942.html", "image_url": "https://english.cdn.zeenews.com/sites/default/files/default_images/placeholder_image_8.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/zeenews.india.com/uttar-pradesh_rld-protest-against-uttar-pradesh-government-throws-traffic-out-of-gear-2023037_1553696942.html", "title": "RLD protest against Uttar Pradesh government throws traffic out of gear", "title_page": "RLD protest against Uttar Pradesh government throws traffic out of gear | Uttar Pradesh News", "title_rss": "NULL", "source_domain": "zeenews.india.com", "text": "Lucknow: Alleging that the Yogi Adityanath government in Uttar Pradesh was \"anti-farmers\", the Rashtriya Lok Dal (RLD) staged a protest outside its office here on Tuesday, throwing traffic out of gear.\nVarious issues of farmers, including loan waiver, were raised at the protest, which was led by RLD national general secretary Jayant Chowdhury.\nChowdhury said the objective of the stir was to highlight the problems of the farmers and the apathy of both the state and central governments towards them.\nDue to the protest at the RLD office, which is located at a short distance from the state Assembly, the traffic in the area was thrown out of gear as barricades were put up by the police to prevent the protesters from reaching the Vidhan Sabha.\nThe workers of the Ajit Singh-led party also clashed with the police when they were stopped at the barricades.\nState RLD chief Masood Ahmad alleged that the police resorted to lathicharging to disperse the \"peaceful\" protesters.\nHe demanded that a 'Kisan Commission' be constituted in the state to look into the issue of payments due to the sugarcane growers and other grievances of the farmers.", "url": "https://zeenews.india.com/uttar-pradesh/rld-protest-against-uttar-pradesh-government-throws-traffic-out-of-gear-2023037.html", "label": 1}