{"authors": [], "date_download": "2019-03-27 14:35:07", "date_modify": "2019-03-27 14:35:07", "date_publish": "2017-06-09 08:49:08", "description": "As farmers protests take centre stage across the country, Swaraj Party convenor explains the ecological, economic and existential crisis behind this unrest.", "filename": "views_interview_why-farmers-are-suddenly-in-rage-yogendra-yadav-explains_1553697307.html", "image_url": "http://governancenow.com/temp/yogendrayadav.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/governancenow.com/views_interview_why-farmers-are-suddenly-in-rage-yogendra-yadav-explains_1553697307.html", "title": "Why farmers are suddenly in rage: Yogendra Yadav explains", "title_page": "Why farmers are suddenly in rage: Yogendra Yadav explains -Governance Now", "title_rss": "NULL", "source_domain": "governancenow.com", "text": "As farmers protests take centre stage across the country, Swaraj Party convenor explains the ecological, economic and existential crisis behind this unrest.\nWe have recently seen farmers from Tamil Nadu protesting in the national capital. Then Maharashtra farmers protested, deciding not to send their produce to cities. The agitation has now reached Madhya Pradesh, leading to killings. Why there is sudden farmers’ unrest in the country?\nI think we tend to miss the real point behind these episodes of farmers unrest. Unfortunately, every time we tend to pay attention to the specifics of that episode. When farmers from Tamil Nadu come, the media gets excited about the skulls they are carrying or whatever unusual method of protest they adopt. When something happens in Mandsaur, everyone is interested in whether there is Congress hand behind it or not, the police fired or not. We get involved with it as if we are dealing with a law and order problem or murder mystery. What we forget is the structural reasons behind it. Therefore, the starting point of a meaningful conversation should be to say that these episodes happen to be accidental, almost random reflections of something deeper, something structural. It is not that these episodes happen in places which are the worst affected. It is not that Tamil Nadu farmers are necessarily the worst affected farmers. I believe their condition is better than Bundelkhand farmers. It is not those parts of Madhya Pradesh (MP) where this has happened is agriculturally the most backward area of the country. MP is success story in the official discourse on the Indian agriculture. And it is not that we are dealing with the worst year. It was a normal monsoon leading to a good harvest and therefore if there was one year in which we should not have seen these incidents, it was this year. All this goes on to demonstrate we are dealing with something deep. There is pent up anxiety. There is a structural crisis which happens to be manifested in some episodes.\nAs you said we are dealing with something ‘deep’, what exactly it is?\nIndian agriculture faces a crisis. It is not a seasonal or region specific problem, and it is not a year or a crop specific phenomena. There are crop specific difficulties like failure of Bt Cotton. In some crops it gets manifested more, for example the collapse of chilli prices in Telangana and Andhra Pradesh. Some regions are more affected by drought. But the structural crisis I am talking about is a three-fold crisis. One is ecological crisis, second economic crisis and third existential crisis. The ecological crisis is that what we considered panacea for Indian agriculture has turned out to be a nightmare. Punjab is a living example of that. The Green Revolution turned out to be short lived. Much of its success stories were dependent on excessive use of resources which the country could not afford. In any case it was ecologically unsustainable. So, in those areas where we practiced successful farming, which was considered as a model for the rest of the country to emulate, we see ground water crisis and salinity in soil, and almost insatiable demand for fertilisers and pesticides which the farmer cannot meet. Therefore, that kind of agriculture is simply unsustainable. We have reached a dead end. The economic crisis is that the productivity of Indian farming is low compared to international standards while production is adequate in food grains. Our capacity to fulfill demands other than main food crops is still in question. More than that, farming is an unviable occupation, a loss making proposition. In the best of years our farmers barely recover the cost and in bad year they do not even recover the cost, enter a debt trap and that leads to suicides. Farmer suicide is an end product of this economic crisis. Existential crisis is looking at farmers’ life in a larger context. Unfortunately, when we look at farmer we look at his cost but we should look at his domestic expenditure like education and health which have shot up to the roof. What existential crisis does is that it threatens the self-respect of farmer as a person, challenges their dignified existence and in cases leads to suicide. Unless we connect the current crisis in Mandsaur and Maharashtra to this underlined crisis we do not even begin to understand what is wrong with the Indian farming. Unfortunately, very rarely does this crisis get expressed in movements and protest. This happens to be one of the rare instances where farmers have actually expressed about MSPs (minimum support prices), incomes and loans. In many cases it takes other forms like Patidar agitation in Gujarat, Jat reservation agitation in Haryana, the Maratha massive mobilisation in Maharashtra, these were nothing but expression of farmers’ impoverishment. Instead of saying I am farmer, I am poor, improve my economy, they say I am Maratha give reservation, which is an unsustainable demand. So, it gets misdirected. It is one of those rare occasions where there is cause-effect relationship.\nIf there is an agrarian crisis then why the latest GDP shows the growth of 4.9 percent in the agriculture sector. Isn’t it contradictory?\nUnfortunately, the entire policy on agriculture has been focused on the production rather than the producer. This comes from the anxiety of 1960s when we had famine and food grain shortage leading to import, almost a compromise to our national sovereignty. At that time, the principle anxiety of the policymakers was do we have enough stocks of food grain in the country. Now, that momentary anxiety has been turned into a permanent policy prescription. The problem now is we have too much stock. This has led to several distortions to an excessive focus on wheat and rice. Therefore, all the incentives and MSP mechanisms are focused on food grain to the neglect of everything else. This has led to overproduction of the staple food and serious undermining of coarse grains like bajra, jowar, vegetables and others. It has a serious negative policy consequence. The moment agriculture secretary says we have so many million tonnes of food grain production this year, he thinks his job is over. No one bothers to say what the farmer has got out of it. This year is a case in point, good monsoon, bumper crop, mandis flooded with grains and agriculture produce. The only thing is prices crash and farmers don’t get anything. This is the story of Tur dal where government goes out of its way saying we are raising MSP from Rs 4,500 to Rs 5,000 plus, farmers celebrate it, respond by producing more Tur and finally they discover they had to sell it for Rs 3,000. It is lower than their cost of production. This is the case with soyabean and wheat as well as with non MSP commodities where government encouraged farmers to grow a certain crop. Like chilli production in Telangana and Andhra Pradesh. Due to active promotion by the government the acreage went up to twice from about 32,000 hectares to 66,000 hectares. The result was chili being sold at Rs 12,000 per quintal and then the prices came down to Rs 2,500 per quintal. What is the farmer going to do in such a situation? No MSP, there is no protection so where does the farmer go? The government washes off its hands saying its market forces.\nWhat happened to the Arvind Subramanian report on incentivising pulses and other committee reports on MSP?\nIt is a terrible story. Last year, Tur dal was being sold in open market for Rs 120 and above for some time. The government of India imported from Zimbabwe and other places for something like Rs 80-90 per kg, almost Rs 8,000-9,000 per quintal. When it comes to offering the MSP, they offer only Rs 5,550. When it comes to actually offering the price you are unable to do so. Then all those recommendations collapse. In many ways, the distress of the farmer is linked to this.\nSo what happens when a farmer goes and sells his crop in the mandi?\nOur economic theory tells us there is a price fixed by the government when you go and sell it. In reality, it doesn’t happen. In MP, if you have to sell, you need to provide Aadhaar card, which I see no justification. Then you have to register and if you sell more than 50 quintals of wheat then your BPL ration card will be taken away from you. Because then you would be treated as a big farmer. You are not entitled to any of the benefits. Then what incentives are you left with? Do you want to sell more than 50 quintals? So they sell 49 quintals to the government and rest is sold in private market. Not just this, the government says whatever you sell in mandis, we will give you direct payment in your bank. It sounds like a good idea, direct payments and no cuts. The only fine point is that the moment your money is transferred, the bank has the right to settle its loan against the amount. This is a banking fraud. It is just like settling your home loan with your saving account. This is a routine and that’s why farmers are annoyed with what they face.\nIs MSP the only issue because government data shows that only six percent of farmers are beneficiaries of MSP? What about the remaining lot?\nReal income assurance is the solution to it. It is a multi-dimensional thing. We call it RUPYA – Remunerative Price Yield Assurance. It is an idea that we are propagating. It has to be a combination of three things – first is price, where you assure decent prices for the produce and a price deficit mechanism. In case you get less price than what the government offers, the government obviously cannot procure everything in the country. So the gap has to be made up by the government. The deficit price mechanism has to be in place.\nInput subsidies should be given to the farmers rather than to the companies. Fertiliser subsidy should come straight to the farmer. At the moment we have a very strange system which incentivises mad use of fertilisers because companies are given subsidy. The more you consume the greater subsidy to the companies. Farmer should decide whether they want to use any fertliser or not.\nMore importantly, crop loss compensation and insurance. It should be three-tier system. A certain minimum coverage should be universal. The moment patwari says you have sown one acre of wheat or paddy, you should be deemed to be insured, and 100 percent premium paid by the government. Over and above there should be scheme where farmer can survive for three or four months if the crop fails. Second is where you pay the farmer equivalent of the yield. There the government pays 80 percent premium and the farmer pays 20 percent premium. There should also be a normal insurance, where farmer pays 80 percent premium and the government pitches in with 20 percent premium.\nThe current compensation method should be abolished. The Prime Minister Fasal Bima Yojna for all its big claim still covers 23 percent farmers of this country, mostly, because of the compulsory insurance of the loany farmers. Along with this if agriculture is taxed, we don’t think it’s a bad idea. It should be taxed.\nDo you think incidents in Maharashtra and Madhya Pradesh are the domino effect of loan waiver in Uttar Pradesh?\nUP loan waiver is an occasion. It is the trigger but it is not the reason. Farmers’ anxiety about loan has been accumulating for some time. Their capacity to pay back loan simply does not exist. While SBI chief is worried about industries capacity to pay, I haven’t seen anyone senior in the government getting up and saying farmers have no capacity to pay. This has been a big issue. So in Uttar Pradesh, here is a ruling party offering farmers some relief, then people in other state facing same difficult question why can’t they get the same benefit? It makes it possible for them to raise the demand. It does not give rise to the demand, the demand already exists. It has made possible for them to articulate it.\nThe Reserve Bank of India (RBI) had apprehensions on loan waiver in UP. Is waiving off loan the only solution?\nWhat happened when lakhs and crores of NPAs (Non- Performing Assets) were being written off? Why RBI governor Urjit Patel can’t speak about it? Is it for UP issue, he has got a political hinge to talk about? Has he been encouraged to talk about it so that the government can hide behind him? The entire loan of the farmers is Rs 12 lakh crore (figures provided by the government in Rajya Sabha). Half of that loan is equal to NPAs of five major companies.\nI do think that loan waiver is the solution. I agree repeated loan waives are not going to help the economy. That does not help banking or credit market. But if you really want solutions to farmers’ income, then one loan waiver has to be part of the package. Right now, it is necessary condition. If tomorrow we find solutions and increase farmers’ income, much of their newly acquired income will go back to loan payments. They would be left where they are. This has to be wiped out. We have to link it with income assurance otherwise we will be in the same situation.\nDo you see farmers’ movement gaining momentum in the future?\nTragic incidents in Madhya Pradesh and movement in Maharashtra may finally end up serving a bigger cause, namely drawing attention to the lack of political will. How long it would survive, all depends on the political circumstances. Farmer should demand their due namely assured income rather than freebies.", "url": "http://www.governancenow.com/views/interview/why-farmers-are-suddenly-in-rage-yogendra-yadav-explains", "label": 1}