{"authors": ["Outlook Web Bureau"], "date_download": "2019-03-27 14:40:56", "date_modify": "2019-03-27 14:40:56", "date_publish": "2018-12-19 00:00:00", "description": "Manipur Journalist Kishorechandra Wangkhem, who was detained under the National Security Act last month, has been sentenced to one year in jail under the law.", "filename": "website_story_india-news-ma_8cc85839fa3eec930627d71ea1f6b77c_321997_1553697656.html", "image_url": "https://www.outlookindia.com/public/upload_share/website/Manipur_Journalist_321997.jpg", "language": null, "localpath": "/home/raj/news-please-repo//data/2019/03/27/outlookindia.com/website_story_india-news-ma_8cc85839fa3eec930627d71ea1f6b77c_321997_1553697656.html", "title": "Manipur Journalist Sentenced To One Year In Jail For Targeting PM Modi On Social Media", "title_page": "Manipur Journalist Sentenced To One Year In Jail For Targeting PM Modi On Social Media", "title_rss": "NULL", "source_domain": "outlookindia.com", "text": "Manipur Journalist Kishorechandra Wangkhem, who was detained under the National Security Act last month, has been sentenced to one year in jail under the law for targeting PM Modi in a social media post.\nWangkhem’s lawyer told news website Scroll that his family will challenge his sentencing on Wednesday.\nWangkhem was detained on November 27. About a week before his detention, he was arrested by the Manipur Police for posting a video critical of Chief Minister N Biren Singh and Prime Minister Narendra Modi on Facebook, Scroll reported.\nIn the video, the Chief Minister lashed out at the CM, calling him a \"puppet of Modi and Hindutva\" for organising a function to mark the birth anniversary of Rani Lakshmibai.\nWangkhem was arrested under sections 294 and 500 of the IPC in addition to section 124 A, which deals with sedition. On November 25, a local court released him on bail on the ground that his words were “mere expression of opinion against the public conduct of a public figure in a street language”, TheWire reported.\nHowever, he was re-arrested by the police and detained under the NSA. He has since been lodged at the central jail in Sajiwa.\nOn December 17, members of the Manipur Students Association, Delhi and Manipur Muslim Students Union staged a protest outside the Manipur Bhavan in Delhi opposing the detention of Kishorechandra, TheWire reported.\nThe Indian Journalists Union and the Press Council of India condemned Kishorechandra’s detention and demanded his release, the report said.", "url": "https://www.outlookindia.com/website/story/india-news-manipur-journalist-sentenced-to-one-year-jail-for-targeting-pm-modi-in-social-media-post/321997", "label": 1}