{"authors": ["Outlook Web Bureau"], "date_download": "2019-03-27 14:35:13", "date_modify": "2019-03-27 14:35:13", "date_publish": "2017-03-02 00:00:00", "description": "The decision comes after fourth months of widespread protests against the multinational cola giants in Tamil Nadu.", "filename": "website_story_madras-high-c_093f91ad8a21427c4e02738073820b24_298109_1553697313.html", "image_url": "https://www.outlookindia.com/public/upload_share/website/jpg.jpg", "language": null, "localpath": "/home/raj/news-please-repo//data/2019/03/27/outlookindia.com/website_story_madras-high-c_093f91ad8a21427c4e02738073820b24_298109_1553697313.html", "title": "Allia Bhatt Receives Death Threat", "title_page": "Allia Bhatt Receives Death Threat", "title_rss": "NULL", "source_domain": "outlookindia.com", "text": "The Madras High Court has rejected the petition to discontinue the supply of Tamirabirani river water to industries set up by the co-packers of Pepsi and Coca Cola at the Industrial Growth Centre established by SIPCOT at Gangaikondan in Tirunelveli district, reported The Hindu.\nThe decision comes after fourth months of widespread protests against the multinational cola giants in Tamil Nadu.\nThe petition filed against the supply of the water argues that the companies use river water for commercial gain, affecting farmers. Co packers of Pepsico and Cola have refuted the claims saying that they use only the surplus water from the river.\nA division bench of justices A. Selvam and P. Kalaiyarasan questioned the PIL petitioners why they did not file a case against other industries which were being supplied with more water from the river. “Why are you not attacking other industries? Why have you adopted a pick and choose method?”, asked Jutsice A. Selvam.\nA call by the Traders Federation in Tamil Nadu to ban sales of Coca Cola and Pepsi soft drinks came into effect with its President A M Vikrama Raja declaring drinks as 'toxic' for consumption.\nRaja had earlier proposed a ban on sale of these brands at the height of pro-jallikattu protests in the state in January, where it was widely claimed that many international groups may have been behind the ban on the bull taming sport.\nRaja had then said that the youth and students who were part of that movement had extended their support to the cause of banning these soft drinks.\nHe claimed there was a 70 per cent dip in the sales of these cola brands ever since there was \"awareness\" among students during the pro-jallikattu protests \"when many of them decided to stop endorsing such international brands.\"\nRaja had earlier said that the traders were opposed to the cola giants not because they were part of an MNC conglomerate but because of their \"toxic nature.\"\nReacting to the call to boycott products of Coca-Cola and PepsiCo India, the Indian Beverage Association said it was \"deeply disappointed\".\n\"This is against the proven fundamentals of robust economic growth, and against the clarion call of Make in India,\" it said.\nIBA noted \"the products manufactured by Coca-Cola and Pepsi are of global standards and one of the safest available.\" It said that Coca-Cola and PepsiCo play a \"critical\" role in improving the livelihood of over two lakh retailers, who earn more than \"Rs 400\" crore in income by selling products of the two companies.\nThe two companies together provide direct employment to \"2,000 families in Tamil Nadu\" and more than \"15,000 families indirectly,\" through their extensive supply chain, it added.", "url": "https://www.outlookindia.com/website/story/madras-high-court-junks-petition-to-discontinue-water-supply-to-coca-cola-pepsi-/298109", "label": 1}