{"authors": [], "date_download": "2019-03-27 14:40:39", "date_modify": "2019-03-27 14:40:39", "date_publish": "2019-01-30 18:06:00", "description": null, "filename": "wire-updates_national_2019_01_30_cal6-as-bill-martyrs_1553697639.html", "image_url": "https://www.theweek.in/etc/designs/week/img/logo-main.png", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/theweek.in/wire-updates_national_2019_01_30_cal6-as-bill-martyrs_1553697639.html", "title": "Families of slain Assam Movement agitators to return mementos", "title_page": "Families of slain Assam Movement agitators to return mementos", "title_rss": "NULL", "source_domain": "theweek.in", "text": "\\R Guwahati, Jan 30 (PTI) In protest over the citizenship bill, the families of those who died fighting for the cause of the Assam Movement decided on Wednesday to return the mementos conferred by the state government.\nThe Swahid Parial Samannayrakhi Parishad (SPSP), an organisation of the families of Assam Agitation, gathered at the 'Saheed Niyas' here -- the headquarters of the All Assam Students' Union (AASU) that had spearheaded the movement -- to stage a protest against the contentious bill.\nHolding the mementos given by the Assam government to 855 people posthumously, their families decided to return the plaques in protest against the Centre's move to implement the Citizenship (Amendment) Bill, 2019.\nThe bill seeks to provide citizenship after six years of residence in India to non-Muslims who had fled religious persecution in Bangladesh, Pakistan and Afghanistan and entered India before December 31, 2014, even if they do not possess any document.\n\"The citizenship bill has been passed in the Lok Sabha. It's a matter of utter shame for all of us. If the bill becomes an act, the sacrifices made by over 800 martyrs of Assam Agitation would become meaningless,\" SPSP president Rajen Deka told reporters.\n\"Their sacrifices will bear no meaning if Hindu Bangladeshis entering Assam after 1971 are given citizenship in India. These mementos were once the prized possessions for us, but now these are meaningless,\" Deka rued.\nThe families of those who died for the cause of the Assam Movement will return the memento to the respective district deputy commissioners, Deka added, without mentioning on which date they will be returned.\nThe families were honoured with Rs 5 lakh and a memento each by the BJP-led Sarbananda Sonowal government on December 10, 2016, at a programme here.\nThe Assam Movement movement started in 1979 against illegal immigrants in the state. The six-year agitation concluded with the signing of the Assam Accord in 1985, which stated that all those who came from Bangladesh after March 24, 1971, have to be deported irrespective of their religion.\nFearing threat to the existence of the indigenous people, their language, culture and heritage, protests broke out across the Northeast after Prime Minister Narendra Modi had announced in Silchar, Assam, on January 4 that the citizenship bill would be passed as soon as possible in the Parliament.\n\"The sacrifices made by the sons and daughters of this land will become meaningless if the Citizenship (Amendment) Bill is passed (and) giving citizenship to Bangladeshis, against whose illegal presence in Assam they had given up their life 40 years ago,\" said a family member.\n\"These mementos given by the Assam government were once the treasured possessions for us as they were in recognition of our children, parents' and spouses' sacrifice. But now, after the citizenship bill, these are meaningless for us,\" a person said pointing at the plaque.\n\"We will return these mementos to the Assam government through the Kamrup (Metropolitan) district deputy commissioner here,\" another member added. PTI ESB SNS\nHMB", "url": "https://www.theweek.in/wire-updates/national/2019/01/30/cal6-as-bill-martyrs.html", "label": 1}