{"authors": [], "date_download": "2019-03-27 14:35:06", "date_modify": "2019-03-27 14:35:06", "date_publish": "2016-09-13 12:13:17", "description": "Violent protests have broken out in the southern technology hub of Bangalore over a Supreme Court order to divert water from reservoirs to a neighbouring sta...", "filename": "wires_afp_article-3785573_Protests-water-supplies-hit-Indias-tech-hub-Bangalore_1553697306.html", "image_url": "https://i.dailymail.co.uk/i/pix/2016/09/13/article-doc-g31lb-5FjJ8CPdHAc2bfe4e30d72ef1c7a-184_636x382.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/dailymail.co.uk/wires_afp_article-3785573_Protests-water-supplies-hit-Indias-tech-hub-Bangalore_1553697306.html", "title": "Protests over water supplies hit India's tech hub of Bangalore", "title_page": "Protests over water supplies hit India's tech hub of Bangalore | Daily Mail Online", "title_rss": "NULL", "source_domain": "dailymail.co.uk", "text": "Protests over water supplies hit India's tech hub of Bangalore\nViolent protests have broken out in the southern technology hub of Bangalore over a Supreme Court order to divert water from reservoirs to a neighbouring state.\nThe protests have forced shops, businesses and schools to close in Bangalore, capital of Karnataka state, which has been ordered to release water into a river to ease a shortage in neighbouring Tamil Nadu.\nVehicles with Tamil Nadu registration plates have been attacked and protesters have blocked roads by burning tyres and effigies of politicians.\nProtesters shout slogans and burn an effigy of Tamil Nadu chief minister J Jayalalithaa in Bangalore on September 12, 2016\nKarnataka Home Minister G. Parameshwar said police reinforcements had been deployed, particularly in areas inhabited by ethnic Tamils who could be a target.\n\"We have intensified security and stepped up vigil in Bangalore to ensure peace and maintain law and order,\" Parameshwar told reporters.\n\"I appeal to the people, especially the protesters, not to attack anyone or damage public property, including buses, cars and transport vehicles.\"\nThe move followed a state-wide strike on Friday that forced hundreds of offices to close in Bangalore, home to many of India's top technology companies.\nIndia suffers severe water shortages that cause frequent tensions between states.", "url": "https://www.dailymail.co.uk/wires/afp/article-3785573/Protests-water-supplies-hit-Indias-tech-hub-Bangalore.html", "label": 1}