{"authors": [], "date_download": "2019-03-27 14:35:38", "date_modify": "2019-03-27 14:35:38", "date_publish": "2017-06-10 19:25:54", "description": "Angry Congress activists protested the killing of six farmers by police in Mandsaur district", "filename": "world_asia_india_agriculture-minister-pelted-with-eggs-in-odisha-1_1553697338.html", "image_url": "https://images.gulfnews.com/polopoly-images/2017/6/10/1.2041585_1489420233.jpg", "language": "en", "localpath": "/home/raj/news-please-repo//data/2019/03/27/gulfnews.com/world_asia_india_agriculture-minister-pelted-with-eggs-in-odisha-1_1553697338.html", "title": "Agriculture minister pelted with eggs in Odisha", "title_page": "Agriculture minister pelted with eggs in Odisha", "title_rss": "NULL", "source_domain": "gulfnews.com", "text": "Bhubaneswar/Bhopal: Union Agriculture Minister Radha Mohan Singh, who has remained silent over the deadly protest by Madhya Pradesh farmers, was on Saturday greeted with eggs in Odisha by Congress activists angry over the killing of six protesters in the neighbouring state.\nThe Youth Congress activists also waived black flags as soon as the minister’s motorcade left a state guest house in Khurdha district for an official function in Jatani, near Bhubaneswar.\nHowever, the egg missiles missed the intended target but a couple of them broke in front of Singh’s official vehicle, witnesses said.\nAt least five Congress workers were arrested, a police official said. Odisha Youth Congress chief Loknath Maharathy was among the arrested.\nCalling him anti-farmer, Maharathy said Radha Mohan Singh had no moral right to be the Agriculture Minister “after the brutal killing of farmers in Madhya Pradesh ruled by the BJP”.\nCongress leader Pradip Majhi said the “egg attack was carried out to sensitise [the central government], so that the problems of the farmers of Odisha and other parts of the country are addressed”.\nThe angry Congress activists were demonstrating in protest against the death of six farmers in police firing in Mandsaur district, the epicentre of the farmers’ agitation in Madhya Pradesh, which remained calm but tense as authorities allowed a 12-hour relaxation in the curfew from 8am to 8pm on Saturday.\nThe local markets in the Mandsaur city opened as people came out in droves to stock up on daily essentials, District Magistrate O.P. Srivastava said, adding no untoward incident had taken place anywhere in the troubled region.\n“If the situation continues to be normal, [the] curfew will be lifted [from Sunday],” Srivastava said.\nBut the wholesale agriculture market — Mandsaur Krishi Upaj Mandi on the outskirts of Mandsaur city — was yesterday deserted as farmers, who began protesting from June 1 to demand debt relief and price hike in their produce, stayed away from selling their produce for the 10th day.\nAccording to estimates, this has led to losses of several millions of rupees to the agriculture sector in the state. The market on a normal day sees some 5,000 farmers from across Madhya Pradesh and parts of neighbouring Rajasthan selling their produce in an estimated daily turnover of Rs50 million (Dh2.85 million).\nMandsaur and its adjoining Neemuch district were the epicentre of the peasant stir even as protests spread to other parts of the state after police opened fire on farmers on June 6.\nAmid the spiralling protests by Madhya Pradesh farmers, Chief Minister Shivraj Singh Chouhan on Saturday began his indefinite fast here “until peace is restored” in the state.\nThe Chief Minister has decided to run his office from the BHEL Dussehra Maidan, where he is sitting on fast. He said it would serve as an open forum where farmers and people would be able to approach him directly.\nThe opposition slammed Chouhan’s decision to go on fast.\nMadhya Pradesh Congress chief Arun Yadav said the act was “a farce”.\n“He has never considered visiting the families of the dead farmers in Mandsaur and also the houses of the 25 persons who died in a blast at a fireworks factory.”\nIn Delhi, CPI-M General Secretary Sitaram Yechury accused the BJP-led central government of turning farming into a “loss-making profession” and meeting farmers’ genuine grievances with “bullets”.\n“The essential point is this: We are not remunerating farmers adequately for their labour and produce. The BJP instead, is meeting their genuine grievances with bullets,” Yechury wrote in a Facebook post on Saturday, referring to the protests in Madhya Pradesh in which six farmers were shot dead by police.", "url": "https://gulfnews.com/world/asia/india/agriculture-minister-pelted-with-eggs-in-odisha-1.2041562", "label": 1}