{"authors": [], "date_download": "2019-03-27 14:40:53", "date_modify": "2019-03-27 14:40:53", "date_publish": "2015-09-01 19:02:19", "description": "Rioters have set fire to the homes of seven lawmakers during a rampage to protest new legislation defining who can claim to be from the northeastern Indian state of Manipur.", "filename": "World_News_Rioters-rampage-against-residence-law-in-India-state-20150901_1553697653.html", "image_url": "http://cdn.24.co.za/files/Cms/General/d/674/7f26d12154364d78bd185955eca0552c.jpg", "language": null, "localpath": "/home/raj/news-please-repo//data/2019/03/27/news24.com/World_News_Rioters-rampage-against-residence-law-in-India-state-20150901_1553697653.html", "title": "Rioters rampage against residence law in India state", "title_page": "\r\n\tRioters rampage against residence law in India state  | News24\r\n", "title_rss": "NULL", "source_domain": "news24.com", "text": "Gauhati - Rioters set fire to the homes of seven lawmakers during a rampage to protest new legislation defining who can claim to be from the northeastern Indian state of Manipur, police said on Tuesday.\nOne person died while trapped in a burning house on Monday night, and two died when police fired to disperse the arsonists. On Tuesday, hundreds of people angry about the deaths circled the town's police station and protested. The police, outnumbered, opened fire again. Two people were killed and another three were hospitalised with critical injuries.\nPolice imposed a curfew on Tuesday night and deployed paramilitary forces amid heavy tension in Churachandpur town, 70km southwest of the state capital of Imphal.\nLawmaker N Biren Singh said the law demanding people provide proof that their families lived in Manipur before 1951 is aimed at keeping \"outsiders\", including migrants, from settling in the state bordering Myanmar. But Singh said authorities had no plans to begin checking documents soon.\n\"Those who are protesting may be harbouring fears the authorities might now start looking at relevant documents to see if anyone has settled down in the state after 1951,\" Singh said.\nThe protesters said that setting such a limit excludes many who arrived legitimately after that date, or who don't have proper documents.\nIndia's remote northeastern region comprises a patchwork of ethnic and tribal communities who are distributed unevenly across seven states and spilling over into neighbouring Myanmar. Tensions have erupted in recent years as those in India worry about refugees from Myanmar taking jobs and land.", "url": "https://www.news24.com/World/News/Rioters-rampage-against-residence-law-in-India-state-20150901", "label": 1}