{"authors": [], "date_download": "2019-03-27 14:25:39", "date_modify": "2019-03-27 14:25:39", "date_publish": "2015-07-25 00:00:00", "description": "A recent announcement in Delhi to go ahead with a scheme to link 30 rivers across the country, including the Brahmaputra and the Ganga in the Himalayas, set off a new round of grave concerns from its next door neighbor Bangladesh.", "filename": "world_Off_the_Wire_2015-07_25_content_36145047_1553696739.html", "image_url": "http://china.org.cn/world/Off_the_Wire/2015-07/25/content_36145047.htm", "language": null, "localpath": "/home/raj/news-please-repo//data/2019/03/27/china.org.cn/world_Off_the_Wire_2015-07_25_content_36145047_1553696739.html", "title": "Roundup: Bangladesh expresses concern about India's river-linking plan", "title_page": " Roundup: Bangladesh expresses concern about India's river-linking plan - China.org.cn", "title_rss": "NULL", "source_domain": "china.org.cn", "text": "You are here: Home\n视频播放位置 下载安装Flash播放器\nA recent announcement in Delhi to go ahead with a scheme to link 30 rivers across the country, including the Brahmaputra and the Ganga in the Himalayas, set off a new round of grave concerns from its next door neighbor Bangladesh.\nNew Delhi's renewed thrust on the project has left not merely environmentalists, but also the Bangladeshi government, its opposition and the Indian opposition worried.\nThe announcement seems to have overlooked Indian Prime Minister Narendra Modi's very recent reiterated commitment and a joint communique signed by the two prime ministers of Bangladesh and India in 2010.\nFrustrated at the announcement, Bangladeshi Prime Minister Sheikh Hasina's government, in a letter recently, reportedly expressed grave concern saying any diversion of the waters of the Himalayan rivers would go against India's commitments to Bangladesh.\nDhaka also requested New Delhi not to implement any project to interlink rivers as it would harm Bangladesh.\nNew Delhi on July 13 announced its plan to go ahead to interlink four trans-boundary rivers.\nSanwar Lal Jat, Indian minister of water resources, said his ministry would soon be taking up the planning of a very important link, Manas-Sankosh-Teesta-Ganga (Brahmaputra in Bangladesh), in consultation with the governments of Assam, West Bengal and Bihar.\n\"This link project will not only provide large irrigation and water supply benefits to Assam, West Bengal and Bihar, but will also make available large quantities of water for subsequent transfer to southern states,\" he was quoted in an official statement as saying.\nHe said state governments in West Bengal, Assam and Bihar will soon be approached for their consent.\nIndian states like Assam, Odisha and Sikkim in the northeast and Kerala in the south had earlier raised protests against the project which the BJP-led NDA government (1999-2004) of Atal Bihari Vajpayee had muted.\nThe proposed project fell off the radar after the United Progressive Alliance (UPA) came to power in India.\nCongress leader Rahul Gandhi had earlier said the idea of the interlinking of rivers was dangerous and that he was opposed to the notion as it would have \"severe\" environmental implications.\nIn Bangladesh, the government and also the opposition parties including ex-Prime Minister Khaleda Zia's Bangladesh Nationalist Party (BNP) have expressed concerns over the proposed India project.\n\"Though it is a personal issue for India, Bangladesh's rivers will be affected by the project,\" said BNP spokesperson Asaduzzaman Ripon Wednesday.\nThe BNP's International Affairs Secretary Ripon also said that if it is not stopped, the river-linking project will diminish the water flow of some rivers in Bangladesh.\nMany leading environmentalists and water experts echoed the same sentiments.\nThey have already warned the plan could result in an ecological disaster by causing water-logs, hampering transportation of silt, affecting fisheries, submerging forests and reducing water flow in transboundary rivers in downstream Bangladesh.\nBangladesh water expert Ainun Nishat said India should involve the other basin countries before interlinking trans-boundary rivers' basin countries.\nA Water Resources Ministry official said that though Bangladesh and India share 54 common rivers, upstream India is yet to communicate the matter with downstream Bangladesh.\nThe official speaking anonymously said India should first take the matter up with the Bangladeshi government.\nHe said the decision to interlink the Himalayan rivers as reported in the media was contradictory to India's past and present commitments to Bangladesh.\nIn the Joint Declaration issued on June 7 marking the Indian prime minister's visit to Bangladesh, officials said Narendra Modi reiterated the earlier commitment that India would not take any unilateral decision on the Himalayan component of their River Interlinking Project which may affect Bangladesh.\nThe same declaration stated: \"Prime Minister Hasina requested Prime Minister Modi for immediate conclusion of the Interim Agreement on Sharing of the Water of Teesta as agreed upon by both the governments in January 2011. Prime Minister Modi said that deliberations are underway involving all stakeholders with regard to conclusion of the Interim Agreements on sharing of waters of Teesta and Feni, as soon as possible. The two Prime Ministers noted that discussions on various aspects relating to the sharing of waters of the Manu, Muhuri, Khowai,Gumti, Dharla and Dudhkumar rivers were taking place at a \"technical level.\" Endi", "url": "http://china.org.cn/world/Off_the_Wire/2015-07/25/content_36145047.htm", "label": 1}